[{"username": "-neti-neti-", "url": "https://www.reddit.com/r/ThePPShow/comments/17nx9p1/is_it_significant_that_rc_didnt_purchase_any_gme/", "time": 1699136663.0, "subreddit": "r/ThePPShow", "title": "Is it significant that RC didn’t purchase any GME shares this last round along with Alain and LC? He has every other time except for this time (during the same period he became CEO). My understanding is insiders can’t purchase shares ahead of a merger. So this is good, right?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m dumb. But to me this seems more than Cohencidence. Has this been discussed before? Apologies if so.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "-neti-neti-", "url": "https://www.reddit.com/r/ThePPShow/comments/17kqhyr/i_just_called_fudelity_curious_if_this_is_pat_for/", "time": 1698773544.0, "subreddit": "r/ThePPShow", "title": "I just called FUDelity - curious if this is Pat for the course for everyone else?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sorry in advance if there are a lot of posts like this. </p>\n\n<p>I just got off the phone with FUDelity. I had a minute so figured I’d give them a holler regarding by BBBYQ shares, especially considering the developments occurring today.</p>\n\n<p>The dude I was talking to didn’t seem aware/knowledgeable regarding BBBYQ at all. He put me on hold for 3 minutes to “speak with a colleague” and when he came back on he said only “the shares were deemed worthless and the bankruptcy proceedings have concluded”. He had no other details and this is all he could say.</p>\n\n<p>I’m not concerned but just curious is this what everyone else has experienced with Fidelity? If he seemed like he was more competent I would’ve asked more questions but he really didn’t.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]