[{"username": "20204thewin", "url": "https://www.reddit.com/r/ThePPShow/comments/17tdm90/order_your_pulte_home_from_a_beautiful_online/", "time": 1699767598.0, "subreddit": "r/ThePPShow", "title": "Order your pulte home from a beautiful online catalog", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://youtube.com/shorts/X0xMTsArEIc?si=9Td2VZc88S829vC7\">https://youtube.com/shorts/X0xMTsArEIc?si=9Td2VZc88S829vC7</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "20204thewin", "url": "https://www.reddit.com/r/ThePPShow/comments/17isin5/pulte_homes/", "time": 1698543874.0, "subreddit": "r/ThePPShow", "title": "Pulte Homes", "text": "<!-- SC_OFF --><div class=\"md\"><p>Pulte homes have super sick floor plans. Especially once you walk through them. They thought of all the shit you need at a certain stage of life. Fuck me, rereading this it just clicked. They&#39;re gonna address a buyer persona across all stages of life. Holy shit. Customers for life. You&#39;re a baby, have some baby shit. You&#39;re a kid, have some gamer shit. You&#39;re an adult, have some house shit. And they&#39;ll deliver on their brand. And people will pay for it. Like you used to pay for Craftsman tools cause they backed their shit. And toys-r-us cause when you&#39;re a parent and you&#39;re in that &quot;I fucked up and didn&#39;t order the toy soon enough&quot; stage they&#39;ll come in with clutch service and deliver. Backed by something with Icahn. I&#39;m in boys. Let&#39;s get this fucker delivered already and point me to where I can buy shares. Anyways, on Pulte homes, they got a first floor guest room, mother-in-law room, office, super private bathroom, lofts, kids rooms with joined bathrooms, upstairs laundry, big garages, open space living areas, built in covered patios, they&#39;re fucking amazing. When this shit rips I&#39;m buying one (edit: in several states). No, I don&#39;t work for Pulte. But if you&#39;re a parent, riding this fucker out, their floor plans just make sense. Godspeed to you all. Oh and I think this is why they&#39;ll call it Teddy, and this is what they&#39;ll build their brand on.</p>\n\n<p><em>“It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat.”</em> </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "20204thewin", "url": "https://www.reddit.com/r/ThePPShow/comments/17cmtqe/what_does_expired_meanb/", "time": 1697839472.0, "subreddit": "r/ThePPShow", "title": "What does expired mean?b", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qt71nv7bkfvb1.png?width=625&amp;format=png&amp;auto=webp&amp;s=6895d575d202277378cfb223f5d30ddb01edc4a1\">https://preview.redd.it/qt71nv7bkfvb1.png?width=625&amp;format=png&amp;auto=webp&amp;s=6895d575d202277378cfb223f5d30ddb01edc4a1</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/jo-nxerQTsWiqAulBJY4P2ts_L8pD0b0qlygEJACDZE.jpg\"/></div>"}]