[{"username": "2ndComingOfJuiceWrld", "url": "https://www.reddit.com/r/ThePPShow/comments/155ni0m/sell_sell_sell/", "time": 1689944678, "subreddit": "r/ThePPShow", "title": "Sell sell sell", "text": "Sell sell sell sell sell \n\nRip shareholders lol have fun losing everything 🤣🤣🤣", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "2ndComingOfJuiceWrld", "url": "https://www.reddit.com/r/ThePPShow/comments/154szdm/quick_ta_lesson/", "time": 1689864466, "subreddit": "r/ThePPShow", "title": "Quick TA lesson", "text": "There seems to be this misunderstanding in general about what TA is and how it works, as well as whether it applies to manipulated stocks. \n\nTA is not a crystal ball that tells you the entirety of future price action, at least not to a high degree if accuracy. I respect u-copy, but he tries to use TA in a way it’s not meant for, like using a hammer on a screw. \n\nTA is only accurate to a high degree on short term time frames. Yes, cycles exist, but there’s two problems with trading on cycles alone. \n\n1. Cycles break. \n\n2. As we’ve seen, cycles can vary on exact time frame. The difference of 2-3 weeks can be enormous in terms of price action, especially with a highly manipulated stock like BBBYQ.\n\nSo how is TA actually supposed to be used? The answer is either for people who purely day trade, or like deep value said, as ONE of multiple tools in investing, such as for specific entries and exits within a cycle. If you identify a cycle and understand the fundamentals, then TA is used in the short term to show when the cycle beginning and end are confirmed or denied. \n\nAlso, TA only requires the use of volume and price movement. Think of volume like the amount of gas going into the engine, and think of price action like the direction of the steering wheel. Price shows movement and volume confirms it. The problem is that the amount of volume needed to “confirm” a breakout or prove that its a fakeout is arbitrary. Thats where indicators come in: they’re quantitative measures that help to prove whether a movement can be confirmed or ignored. My issue with u-copy is that he attempts to use them alone, ignoring volume, which is the incorrect way to use those tools, making uninformed people believe that TA is irrelevant here. I promise you that legit day traders are making a killing on this. \n\nI dont know how to add pictures on reddit, im new to this place, but imagine the bull flag that u-copy kept showing. “Bull flags” are actually just ranges. Again, if i knew how to add pictures, i would include an example of a “bull flag” that ends up breaking to the downside. Flags, in reality, are just ranges. Support and resistance lines are legitimate, but you CANNOT predict which way price will break with a HIGH degree of accuracy. Remember, as time frame increases, the accuracy of TA begins to exponentially decay. \n\nSo how do you interpret ranges? Legitimate day traders do not buy WITHIN the range. They wait for a breakout. If price breaks through the upper bound on significant volume, then a buy order is placed. Price is ridden up until volume and price show a rejection. \n\nGaps are also legitimate. We will likely hit .34 or lower by end of day before going back up.", "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "2ndComingOfJuiceWrld", "url": "https://v.redd.it/nzddc8xob6cb1", "time": 1689446462, "subreddit": "r/ThePPShow", "title": "Roger Roach 🫡🪦🕊🪳", "text": "", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": ""},
{"username": "2ndComingOfJuiceWrld", "url": "https://v.redd.it/ah1xpktig2cb1", "time": 1689399675, "subreddit": "r/ThePPShow", "title": "Imagine you’re one of Sue Gove’s grandchildren and you see this shit 🤣🤣🤣", "text": "", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": ""},
{"username": "2ndComingOfJuiceWrld", "url": "https://v.redd.it/ilopx4zpekab1", "time": 1688745276, "subreddit": "r/ThePPShow", "title": "RIP Juice (part 2) 999 🪦 🕊 next one at 999$ a share 🫡 LOW TIDE WILL EXPOSE THOSE SWIMMING NAKED 🍉📈 🩳 ", "text": "", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": ""},
{"username": "2ndComingOfJuiceWrld", "url": "https://v.redd.it/n6rgz3jv9hab1", "time": 1688707359, "subreddit": "r/ThePPShow", "title": "AJ got me jacked 📈🍉", "text": "", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": ""},
{"username": "2ndComingOfJuiceWrld", "url": "https://v.redd.it/ve6ptlqn7u9b1", "time": 1688428165, "subreddit": "r/ThePPShow", "title": "Shitty AJ edit to celebrate the 4th 🦅🇺🇸🍉", "text": "", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": ""},
{"username": "2ndComingOfJuiceWrld", "url": "https://v.redd.it/6tv8t69z3t9b1", "time": 1688414776, "subreddit": "r/ThePPShow", "title": "Wut doing pp 😳😳😳", "text": "", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": ""},
{"username": "2ndComingOfJuiceWrld", "url": "https://v.redd.it/c2utzwnmao9b1", "time": 1688356491, "subreddit": "r/ThePPShow", "title": "She don’t even know my name 😭🥺💔", "text": "", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": ""}]