[{"username": "2themoon4", "url": "https://www.reddit.com/r/ThePPShow/comments/17z1xjh/please_do_not_talk_to_reporters_or_media/", "time": 1700414321.0, "subreddit": "r/ThePPShow", "title": "Please do not talk to reporters or media", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just as RC is doing, we need to stay silent. Period. Real G’s move in silence.\nNo matter how nice the reports seem, they will do their best to twist your words. \nIf anyone is going to talk to a journalist in needs to be someone like Jake or Sal.\nJudge us by our actions, not our words…</p>\n</div><!-- SC_ON -->", "flair": {"text": "MSM FUD ", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "2themoon4", "url": "https://www.reddit.com/r/ThePPShow/comments/17yhih2/a_mans_honor_his_word_is_the_only_thing_that/", "time": 1700345508.0, "subreddit": "r/ThePPShow", "title": "A man’s honor, his word, is the only thing that cannot be taken by him from someone else", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve always been a man of my word. If I say I’m going to do something, I will do it. No matter what it costs me. \nAnd I always hold people to their word as well. If you break that, then you lose all trust. Period. </p>\n\n<p>Yesterday our friend Kais won that bike and “beat the other community”… \nFirst of all I really wish you guys would’ve let that play out organically. Leave Larry alone, he actually trying to do good for the community. Stop interfering and bringing in your bullshit drama. All this trolling is getting out of hand and ridiculous. And tbh it’s coming from a lot of people from this community doing it. Grow the fuck up.</p>\n\n<p>During the space calls when Kais was asking for votes early in the day he was saying he was going to give the bike to his son. Then later in the day when the race got close he changed and said he’d donate the bike if he won when he was asking for people to like the post, which is why I liked his post. After he won he changed back to giving the bike to his son…</p>\n\n<p>I expect him to follow through. Don’t break your word Kais.</p>\n\n<p>A man’s honor, his word, is the only thing that cannot be taken away from him by someone else</p>\n\n<p>Have a good weekend. Stay focused</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "2themoon4", "url": "https://www.reddit.com/r/ThePPShow/comments/16yxya2/pp_and_pulte_november_meeting/", "time": 1696354000.0, "subreddit": "r/ThePPShow", "title": "PP and Pulte November meeting", "text": "<!-- SC_OFF --><div class=\"md\"><p>Can we get more information on this PP? You said last night during your stream you were in discussions with Pulte to raise the number of people to go up to 100? Can you explain how and why you two came to that conclusion?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "2themoon4", "url": "https://www.reddit.com/r/ThePPShow/comments/16y4hv1/talked_to_tda_about_bbbyq_and_toyrf/", "time": 1696271813.0, "subreddit": "r/ThePPShow", "title": "Talked to TDA about BBBYQ and TOYRF", "text": "<!-- SC_OFF --><div class=\"md\"><p>As far as BBBYQ the rep told me that they are awaiting news from the company regarding to stock. He stated that yes last week the stock was canceled and delisted making them worth nothing. He stated that we are basically waiting for news about how to proceed. And he himself stated that if there would be some sort of equity swap for a buyout or anything of that nature it would come from the company but they have not heard anything. He stated that since this is a ch.11 bankruptcy this stock will trade again just don’t know how until they are instructed by the company. \nI also asked about TOYRF volatility and he seemed pretty surprised about it. Stated that there has been absolutely no news and is unsure as why we’re seeing this volume and volatility. \nTits getting slightly jacked again boys</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "2themoon4", "url": "https://www.kirkland.com/-/media/publications/alert/2023/01/securities-exchange-commission-part-i-and-ii.pdf?rev=89d977b811e340d5a033884780bea2fa", "time": 1696190267.0, "subreddit": "r/ThePPShow", "title": "Articles on Ch11 emergence by K&amp;E", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m digging in on this article written by KIRKLAND AND ELLIS about how a company should go into and emerge from ch 11. I just came across it and I feel like it has some very valuable information that we could use. I am trying my best to interpret it and how it could relate to what we have going on. Especially that last few paragraphs of article 2. Please dig and and get this to the big wrinkle brains. I tried posting this the other day but was taken down by mods for some reason. I don’t think I’ve seen this posted. If it has feel free to take this post down</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "2themoon4", "url": "https://www.kirkland.com/-/media/publications/article/2022/12/financial_12-22.pdf", "time": 1696024863.0, "subreddit": "r/ThePPShow", "title": "Relisting with A national securities exchange", "text": "<!-- SC_OFF --><div class=\"md\"><p>Third page, second to last paragraph named Relisting with a National Securities Exchange and Registration with the SEC. \nThis information seems very relevant and we need eyes on it</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "2themoon4", "url": "https://www.reddit.com/r/ThePPShow/comments/16swew9/tda_is_not_allowing_inbound_transfers_from_ast/", "time": 1695754322.0, "subreddit": "r/ThePPShow", "title": "TDA is not allowing inbound transfers from AST", "text": "<!-- SC_OFF --><div class=\"md\"><p>I heard Alex on the spaces saying that Charles Schwab not allowing in or outbound drs transfers. \nI just spoke with TDA over the phone and verified with them they they are not allowing inbound transfers from AST. He stated this it is a business decision to not allow in bound transfers. \nThey are still allowing outbound transfers to AST.\nThey will not allow bbbyq purchases over the phone.\nDo what you will with that information…\nFuck you kenny \nThank Youuuuu</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]