[{"username": "__maddcribbage__", "url": "https://www.reddit.com/r/ThePPShow/comments/16x9uqw/on_the_search_for_antifud_regarding_the_butterfly/", "time": 1696187462.0, "subreddit": "r/ThePPShow", "title": "On the search for antiFUD regarding the Butterfly 8K", "text": "<!-- SC_OFF --><div class=\"md\"><p>hi pps, does anyone have an explanation for the &quot;cautionary note&quot; from the recent 8k that supports the bull thesis? i find the note&#39;s language alarming. i am assuming the big brains went over it on spaces at some point but im not on twatter. anyone got the antifud plug?</p>\n\n<p>Here is the 8k: <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/886158/000119312523247428/d579010d8k.htm\">https://www.sec.gov/ix?doc=/Archives/edgar/data/886158/000119312523247428/d579010d8k.htm</a></p>\n\n<p>Here is the passage in question:</p>\n\n<blockquote>\n<p>Cautionary Note to Holders of the Company’s Common Stock and Series A Convertible Preferred Stock</p>\n\n<p>As a result of the Confirmed Plan becoming effective, all of the Company’s equity interests, consisting of outstanding shares of common stock and Series A Convertible Preferred Stock of the Company and related rights to receive or purchase shares of common stock, were cancelled on the Effective Date without consideration and have no value.</p>\n\n<p>No shares of the Company’s common stock or Series A Convertible Preferred Stock will be reserved for future issuance in respect of claims and interests filed and allowed under the Confirmed Plan or pursuant to the exercise of any rights, options or other obligations of the Company to issue its common stock and/or Series A Convertible Preferred Stock.</p>\n\n<p>The Company intends to file a Form 15 with the SEC deregistering the Company’s common stock pursuant to Rule 12g-4(a)(1) under the Securities Exchange Act of 1934 (“Exchange Act”). Upon filing the Form 15, the Company intends to immediately cease filing any further periodic or current reports under the Exchange Act.</p>\n</blockquote>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "__maddcribbage__", "url": "https://www.reddit.com/r/ThePPShow/comments/16kj2kp/please_refrain_from_fearmongering_as_a_means_to/", "time": 1694900847.0, "subreddit": "r/ThePPShow", "title": "Please refrain from fearmongering as a means to promote DRS.", "text": "<!-- SC_OFF --><div class=\"md\"><p>None of this is financial advice. I wipe my ass on the carpet and go outside twice a year.</p>\n\n<p>Seemingly overnight this sub went from having a reasonable take on DRS to conflating fearmongering with support for direct registration. This is some wack af, soft PP energy that I am here to temper.</p>\n\n<p>In general, I am sure we can all agree that raising awareness of DRS is a good thing. However, DRSing is a personal choice that is not available to everyone invested in this stock. I am seeing a lot of posts leveraging <strong>fear</strong> in order to promote DRS, rather than educating folks on the benefits of DRSing, explaining the pracitical implications of holding DRS&#39;d shares with AST in the event of a squeeze, or even just explaining how to DRS at all in the first place. <strong>If you are one of these commenters, how do you think your fearmongering is affecting the emotional state of those unable to DRS?</strong></p>\n\n<p>A common sentiment expressed here since we moved to the expert market has been, &quot;Wow! I was so stressed with my shares being held in a brokerage, but now that I am 100% DRS&#39;d I am at ease.&quot; If this is you, you are doing the memestock equivalent of yelling FIRE in a crowded theatre.</p>\n\n<p><strong>The implications floating around that shares will be liquidated, cancelled, forced to close, etc is speculative FUD! The implications floating around that DRSing actually protects your investment on a practical level anymore than broker-held shares for the upcoming exit from Chapter 11 is speculative hopium!</strong></p>\n\n<p>Very few of these fearmongering DRS posts/comments mention fineprint asterisks like: broker&#39;s legal obligations to NBBO; how DRS&#39;d shares held in Plan are no more secure from short sellers than non-DRS&#39;d shares; how AST only offers open market orders for selling; etc.</p>\n\n<p>Here are some practical implications I am seeing left out of the conversation recently. DRS (+ Book holding)  offers investment security for those interested in holding the stock <em>through</em> the upcoming short squeeze, while making it more difficult for an investor to maximize returns if they would rather sell <em>into</em> that squeeze.  Holding in brokerages offers minimal investment security in a black swan event, while allowing investors to maximize gains through limit orders during a squeeze.</p>\n\n<p>While I fucking love the tinfoil like the degen I am, I prefer to keep that tinfoil positive. Since expert market, the tinfoil got negative af. I gotta keep it real when I start seeing folks making anxious decisions born from FUD, rather than measured understanding.</p>\n\n<p>DRS&#39;d or not, WAGMI.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]