[{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/17ydzft/simmer_expectations_but_prepare_for_blast_off/", "time": 1700335856.0, "subreddit": "r/ThePPShow", "title": "Simmer expectations BUT prepare for Blast Off….", "text": "<!-- SC_OFF --><div class=\"md\"><p>I think we all understand the magnitude of this play and that it has been meticulously crafted by some very smart dudes. We all have faith and trust this community, including the “white hats” (RC, Pulte, etc). If nothing happens this week, does it discredit our thesis? Fuck No. </p>\n\n<p>One thing I learned from another [redacted] community that also had hype dates and tinfoil was timing and patience. Some would get discouraged if hype dates never panned out the way <em>we</em> anticipated. Understand that tinfoil may not always be used to communicate with us degens, but rather, other white knights involved in the play, or for a miriad of other reasons.</p>\n\n<p>So although predicting dates is fun, it is just one part of the bigger plan. I love tinfoil more than anyone but I understand that anything can happen especially since it’s out of our control at this point. So whether something happens this week or a month from now, nothing will change for me. My convictions remain strong and my faith in this community and our favs (RC, Pulte, Icahn, Larry, etc) will never waver. I know that we are on the right side and I’m convinced this world will ultimately be changed for the better.</p>\n\n<p>As I recall Kais’ wife asked Pulte in NY if Kais will be a millionaire. Pulte responded “Yes, but you must be patient”. Patience is what stuck out to me. So, let’s be patient but remain as hopeful as ever. Touch some grass and detach from technology for a bit. The timing of this is extremely critical. Let’s also not forget the fact that the DOJ is most likely involved. Again, this can’t just happen willy nilly. Rome wasn’t built in a day.</p>\n\n<p>If we blast off next week you all know we’ll be fucking here for it and my nips will be painfully jacked and battle-hardened. During that time, we will see the results of our DD, amazing community, hopeful determination and faith driven persistence. We will also come to realize the mission that has been bestowed upon us: To make this work a better place. </p>\n\n<p>So buck the fuck up, remain zen, remain humble and touch grass. Understand that we are part of something so much bigger and truly special. </p>\n\n<p>To fucking Uranus fellas 🚀 We already won in more ways than one. Love you all</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/17sotsk/hmmm_are_they_using_the_theppshow_as_a_vehicle_to/", "time": 1699684911.0, "subreddit": "r/ThePPShow", "title": "Hmmm.... are they using the thePPshow as a vehicle to make a public announcement?", "text": "<!-- SC_OFF --><div class=\"md\"><p>The fact that they have been dropping dockets at the time of thePPshow can&#39;t be just cohincidence. Please correct me if I&#39;m wrong, but aren&#39;t they allowed to make a public announcement and not even need to file anything with the SEC until 4 days post announcement? In otherwords, can the lawyers file an approval of the amended plan on Kroll and technically use the thePPshow as the vehicle to make it public? </p>\n\n<p>I mean, it can&#39;t out of the realm of possibilities.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/17ofgh6/watch_the_fud_regarding_price_targets_now/", "time": 1699201353.0, "subreddit": "r/ThePPShow", "title": "Watch the FUD regarding price targets now…", "text": "<!-- SC_OFF --><div class=\"md\"><p>I suspect that the hedgies and shills are beginning to understand the situation, or at least are beginning to question their own narrative. Naturally, their goal is to continually move the goal post and either try to stop or drastically reduce the bleeding.</p>\n\n<p>I anticipate the shills to pivot from “YoU Get NoTHiNg!” to “YoU NeED to sELL NoW!” At a low price target since they “care” about us being “rugged” by regulators/MM/SHF/brokers, which is also an indirect way of shills admitting to fraud of their masters, but shills have no other choice.</p>\n\n<p>We see $12.77 in some brokerages for BBBY popping up over the weekend. This is not financial advice, but my lowest personal price target is dramatically above the $12.77 by a magnitude of 100x. I won’t even <em>consider</em> to start selling some of my shares until it’s between $500-$2k / share.</p>\n\n<p>Keep in mind that if this play involves multiple bankrupt &amp; private companies under the umbrella of something much larger to directly compete with Amazon, if Amazon  had no stock splits (based on multiple source estimates), Amazon would be a minimum of $2,785/share currently. </p>\n\n<p>So, based on the information we’re reading in dockets &amp; the tinfoil, I don’t think it’s a stretch to assume that the inherent value of ($TEDDY/$BUTTQ/$Gmerica) will instantly be more valuable than Amazon. So don’t cut yourself short by selling for ant prices. </p>\n\n<p>I believe the natural value of this new company could be at minimum $2k a share even without a squeeze.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/17knqvy/bbby_hearing_court_zoom_info_for_those_who_want/", "time": 1698766295.0, "subreddit": "r/ThePPShow", "title": "BBBY Hearing - Court Zoom Info for Those Who Want to Listen", "text": "<!-- SC_OFF --><div class=\"md\"><p>Here you go:</p>\n\n<p>Webinar ID: 160 541 1227</p>\n\n<p>Passcode: 331254</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/17fh27z/hello_bello_interesting_connections_i_spy_with_my/", "time": 1698165415.0, "subreddit": "r/ThePPShow", "title": "Hello Bello... interesting connections. I spy with my little eye a butterfly.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello Bello is a a baby and family brand that is founded by Kristen Bell. It&#39;s interesting that Hello Bello is voluntarily going into CH11 Bankruptcy and they seem to be in a similar position as other bankrupt companies (RITEAID, BBBY, etc.)</p>\n\n<p><a href=\"https://preview.redd.it/hxrwpyf2e6wb1.png?width=809&amp;format=png&amp;auto=webp&amp;s=69ef33f22f62e6f8b7799772e3637e176b55c232\">https://preview.redd.it/hxrwpyf2e6wb1.png?width=809&amp;format=png&amp;auto=webp&amp;s=69ef33f22f62e6f8b7799772e3637e176b55c232</a></p>\n\n<p>It&#39;s interesting to note from the above of some key points:</p>\n\n<p>1) Hello Bello went into CH11 Bankruptcy <strong>voluntarily</strong></p>\n\n<p>2) Hello Bello struggled with <strong>shipping costs</strong> (think RC and Chewy logistics)</p>\n\n<p>3) An M&amp;A is expected to be <strong>completed in a few months</strong> (again another accelerated bankruptcy)</p>\n\n<p>What&#39;s interesting is that the plan is facilitated by Hildred Capital Management. When I went to Hildred Capital Management&#39;s website, I noticed something very interesting under their portfolio:</p>\n\n<p><a href=\"https://preview.redd.it/a9nwcmf3f6wb1.png?width=1441&amp;format=png&amp;auto=webp&amp;s=343b05e6ea8922d1f91622ba6ead6dfeaf465093\">https://preview.redd.it/a9nwcmf3f6wb1.png?width=1441&amp;format=png&amp;auto=webp&amp;s=343b05e6ea8922d1f91622ba6ead6dfeaf465093</a></p>\n\n<p>Of course there is a butterfly, because why not. So what&#39;s even more interesting is that Butterfly Network is involved with healthcare, specifically ultrasound &amp; diagnostic technology. Their software is called Butterfly iQ+ (interesting, Q). Butterfly also advertises to Veterinarians as well:</p>\n\n<p><a href=\"https://preview.redd.it/d4ozzd5bg6wb1.png?width=1731&amp;format=png&amp;auto=webp&amp;s=63ef46f5e92e77d145ad155557048834a0501026\">https://preview.redd.it/d4ozzd5bg6wb1.png?width=1731&amp;format=png&amp;auto=webp&amp;s=63ef46f5e92e77d145ad155557048834a0501026</a></p>\n\n<p>Butterfly network is under Hildred Capital Management, which is a private equity investment firm focused on companies across the <strong>healthcare space</strong>. (Massive tinfoil here, but I&#39;m going to see if there is a healthcare connection with RC or Icahn. I remember RC and Icahn were (or possibly currently) interested in RiteAid).</p>\n\n<p><a href=\"https://preview.redd.it/rvefcc8pf6wb1.png?width=1449&amp;format=png&amp;auto=webp&amp;s=1435f9e84b39e01e0ba6b875ef4971e081abd490\">https://preview.redd.it/rvefcc8pf6wb1.png?width=1449&amp;format=png&amp;auto=webp&amp;s=1435f9e84b39e01e0ba6b875ef4971e081abd490</a></p>\n\n<p>After going through the websites briefly, I see a connection with children and pets/animals. </p>\n\n<p>Now this play may not at all be connected, again just massive tinfoil.... but there is something telling me that something massive is happening in the background. Who knows what BK companies are jumping into this new system / exchange. Especially with Overstock jumping off the Nasdaq to the NYSE seems like a start. </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/L0AbjNBDGXWgooT6jwY4fFmJsks_h-YYsfKGmTUVvHU.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/rrfso064p8vb1.jpg", "time": 1697756295.0, "subreddit": "r/ThePPShow", "title": "Now RiteAid does make a lot more sense…", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rrfso064p8vb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/pzb36dok0lub1.jpg", "time": 1697469584.0, "subreddit": "r/ThePPShow", "title": "Geoffrey’s birthday is tomorrow on 10/17?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Could be something, probably nothing.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/pzb36dok0lub1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/y7gcfq8hoftb1.jpg", "time": 1696969142.0, "subreddit": "r/ThePPShow", "title": "Pulte, M&amp;A?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/y7gcfq8hoftb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/4qo8lgfcmftb1.jpg", "time": 1696968454.0, "subreddit": "r/ThePPShow", "title": "We're not wrong... just early", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/4qo8lgfcmftb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.youtube.com/watch?v=hBOB-EtPXPE", "time": 1696657118.0, "subreddit": "r/ThePPShow", "title": "The Art of Stonk War BBBY - (YouTube Link)", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/hBOB-EtPXPE/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGHIgSCgoMA8=&rs=AOn4CLB1puEiyjUakKkxkI-kFFbqQMXezg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/170vy3e/patrick_byrne_the_forgotten_piece_in_this_saga_a/", "time": 1696546060.0, "subreddit": "r/ThePPShow", "title": "Patrick Byrne, the forgotten piece in this saga.... a timeline.", "text": "<!-- SC_OFF --><div class=\"md\"><p>You&#39;re <strong>Patrick Byrne, born in</strong> <strong><em>1962.</em></strong></p>\n\n<p>In <strong><em>1965</em></strong> Warren Buffett <strong>purchased Berkshire Hathaway.</strong></p>\n\n<p>Your father, John J. Byrne, was the former <strong>chariman</strong> of <strong>Berkshire Hathaway&#39;s</strong> insurance subsidary GEICO.</p>\n\n<p><strong>Warren Buffet</strong> was so impressed by your father&#39;s professional abilities they became a <strong>colleague and friends</strong>.</p>\n\n<p>By 1988 you achieved a certificate from <strong>Beijing</strong> Normal University <strong>(think China)</strong>, Bachelors degree in <strong>Chinese studies</strong> (think China) from Dartmouth, a masters degree in Moral Philosophy from Cambridge, and doctorate degree in <strong>Philosophy</strong> from Standford. You also know how to speak <strong>Mandarin</strong> (think China).</p>\n\n<p>Shortly after, you created the <strong>Main Street Revolution</strong> marketplace for small American entrepreneurs, a pet adoption service that has <strong>connected people with 75,000 pets in less than 2 years</strong>, and <strong>Farmers Market</strong> which now makes <strong>fresh, locally grown produce</strong> available to <strong>45% of the U.S. population.</strong></p>\n\n<p>Your company, Overstock.com, was named <strong>No. 9 Best Company to Work for in the Country</strong>, and you have the <strong>highest</strong> employee approval rating at <strong>92%</strong>.</p>\n\n<p>In 2005, you and your company Overstock took a hedge fund &#39;Copper River Partners&#39; to court and they were ordered to pay $5 million to settle a long running lawsuit due to illegal short selling (organized bear raids), effectively engineered short attacks.</p>\n\n<p>In 2006, you served as the Chairman of EdChoice, an <strong>organization leading the national push for school choice</strong>.</p>\n\n<p>In 2008, your stance became a point of high controversy until the <strong>crash of &#39;08</strong>, occasioned by many of the things of which you had warned. Your website <strong>DeepCapture.com</strong> subsequently received much recognition, such as Weblogs Award <strong>&quot;Best Business Blog&quot; (2008)</strong>, <strong>Business Pundit&#39;s &quot;Best Business Investigative Journalism&quot; (2009)</strong>, and Xmark&#39;s <strong>&quot;Top Site on Corruption in the USA&quot; (2010)</strong></p>\n\n<p>In 2011, you were given the <strong>National Entrepreneur of the Year award</strong> and amended suit against <strong>Goldman Sachs</strong> to include charges of racketeering <strong>(RICO)</strong>.</p>\n\n<p>In 2012, when no firm of $1 million in revenue yet accepted cryptocurrencies as a payment method, your <strong>pro-freedom views</strong> led him to have Overstock.com, then with <strong>$1.4 billion in revenue</strong>, become the <strong>first major online retailer to accept Bitcoin</strong>. Having gained familiarity with <strong>blockchain technology</strong> at the heart of digital currencies such as Bitcoin, you found <strong>Medici Ventures</strong>, a subsidiary of Overstock, created to build <strong>solutions leveraging and servicing blockchain technologies</strong>. Medici project companies include: <strong>tZero</strong>, <strong>focused on the development of financial technology (fintech) based on cryptographically-secured, decentralized ledgers</strong>. Since its inception, <strong>tZero</strong> has <strong><em>pioneered</em></strong> the effort to bring <strong>greater efficiency and transparency to capital markets through the integration of blockchain technology</strong>.</p>\n\n<p>In 2014, your company (Overstock.com) was named one of the <strong>Most Trustworthy Companies in America</strong> by Forbes/MSCI ESG Research.</p>\n\n<p>Additionally in 2014, you began a vigorous citizen-journalist campaign focusing on <strong>regulatory capture, hedge fund mischief, settlement system failures, systemic risk</strong>, and the possibility of <strong>economic warfare against the U.S. by organized crime and foreign governments (think RICO</strong>).</p>\n\n<p>In 2016, you assisted the <strong>Justice Department (DOJ)</strong> in uncovering documents related to both the Russia investigation and the Hillary Clinton email scandal.</p>\n\n<p>In 2018, you launch <strong>tZero</strong> through Overstock’s <strong>blockchain</strong> subsidiary, Medici Ventures.</p>\n\n<p>In 2019, you step down as Overstock’s CEO as you don’t want Overstock’s business, especially the blockchain effort, to be affected by your involvement with assisting the DOJ re: Russia and Clinton.</p>\n\n<p>On the same day you stepped down as CEO, Overstock’s board announced that it had appointed Jonathan E. Johnson III, <strong>head of Medici Venture’s blockchain branch</strong>, as the company’s interim CEO, and Kamelia Aryafar, Overstock’s chief <strong>algorithms officer</strong>, as Byrne’s replacement on the board.</p>\n\n<p>In 2023, you repond to none other than, <strong>TendieLovinShares!</strong>  Then you respond to a user who asks the question, &quot;How much of what is happening according to <strong>plan</strong>?&quot;👇 </p>\n\n<p><a href=\"https://preview.redd.it/71qitob6pgsb1.jpg?width=602&amp;format=pjpg&amp;auto=webp&amp;s=86fa54b7f8ef6b96d5855be595ae098357988d51\">https://preview.redd.it/71qitob6pgsb1.jpg?width=602&amp;format=pjpg&amp;auto=webp&amp;s=86fa54b7f8ef6b96d5855be595ae098357988d51</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/BAGhRWBu-Z5onWsSm32CO9edEhm_6lALbrlsQQbKDQ8.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/juxiobpc0fsb1.jpg", "time": 1696525169.0, "subreddit": "r/ThePPShow", "title": "Interesting on AST….", "text": "<!-- SC_OFF --><div class=\"md\"><p>I know my account login details are correct as they are saved via a password manager and I also get a number pin emailed to me for confirmation. Never received this message before. Maybe, just maybe the shares have been moved…</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/juxiobpc0fsb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/16sw74b/this_show_and_community_is_more_than_just_about_a/", "time": 1695753840.0, "subreddit": "r/ThePPShow", "title": "This show and community is more than just about a stock... and I'm happy to be a part of it.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The show featuring <a href=\"/u/realpulte\">u/realpulte</a> yesterday was truly incredible. It offered a blend of topical discussions, emotional moments, as well as funny and insightful ones. Truly, this show serves as a beacon of hope for many of us and a genuine community space. ThePPShow is a show &quot;by the people and for the people,&quot; a voice representing our collective thoughts. PP deserves a significant amount of credit for his remarkable hosting abilities, including the facilitation of discussions with his guests.</p>\n\n<p>What makes this show exceptional is PP&#39;s unique ability to listen to opposing opinions without diving into arguments; he provides everyone with an opportunity to express their views and treats every guest with the utmost importance, fostering meaningful discussions. Even if some ideas, including mine, are considered &quot;silly,&quot; having a platform to voice them is invaluable because, no matter how unconventional an opinion may seem, there will always be a viewer or listener who can connect with it in a positive and meaningful way.</p>\n\n<p>We all hail from diverse backgrounds and possess entirely unique life experiences. Still, what unites this community is our love and respect for one another and our shared commitment to transparency, truth, and ultimately, making a positive impact on the world. Even though many of us have never met in person, I genuinely feel that we are one big family.</p>\n\n<p>To me, ThePPShow is far more than just a show about a particular stock. This community shares meaningful bonds that will endure beyond any investment strategy. I am honored to be a part of this community, and I firmly believe that I stumbled upon it for a reason. Each of us has a higher purpose that we may not fully realize or understand, yet.</p>\n\n<p>For those of us who have been a part of this community for some time, we truly regard it as one big family. Hats off to all of you for the show yesterday. PP, Kais, Michael, Plur, Travis, ABC, Controlled Chaos, RockSolid, Pulte). I have never been a part of an online community where people are willing to make such sacrifices for a shared cause. Every dollar donated to that show is well-deserved and comes from people who believe in the show and this community and simply want to be a part of it. Don&#39;t let any shill say otherwise. People have the freedom to do as they please with their money, and if they see value, they will certainly invest in it. Congratulations to ThePPShow and its guests. We are here thanks to many of you, and that is truly priceless.</p>\n\n<p>This is about more than just a stock. </p>\n\n<p>History is being made, and I am just happy to be a part of it.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/16p1l62/monday_pp_team_w_pulte_theory/", "time": 1695359107.0, "subreddit": "r/ThePPShow", "title": "Monday PP Team w/ Pulte Theory.....", "text": "<!-- SC_OFF --><div class=\"md\"><p>Another tinfoil theory. Monday:</p>\n\n<p>Pulte will have the PP gang all sign NDAs. Maybe team PP sees something to the effect of a supplemental plan including shareholders or M&amp;A.</p>\n\n<p>... and if this thing shoots past Pluto, maybe PP is that $150 billy dude Pulte was talking about.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/16mi42c/george_calhoun_situtation_is_fairly_interesting/", "time": 1695100294.0, "subreddit": "r/ThePPShow", "title": "George Calhoun situtation is fairly interesting. Calhoun is an out-of-state attorney who was asked to help in a legal case involving BBBY. His firm, Ifrahn, LLC, also has worked extensively with the DOJ. RICO? Illegel tokenized shares?. Hmmmmmmmmm.", "text": "<!-- SC_OFF --><div class=\"md\"><p>A quick brief of George Calhoun (from their website):  </p>\n\n<blockquote>\n<p>George’s practice primarily focuses on the litigation of *<strong>complex disputes\\</strong>* for clients in a broad array of disciplines, including <strong>contracts</strong>, <strong>cryptocurrency</strong>, <strong>securities</strong>, <strong>bankruptcy</strong>, <strong>fraud</strong>, <strong>RICO</strong> and other <strong>business claims</strong>. </p>\n</blockquote>\n\n<p>There&#39;s something very interesting about George Calhoun showing up in a docket just today. Here is the portion of the document:</p>\n\n<p><em>Processing img nkz5k8zk75pb1...</em></p>\n\n<p>I&#39;m retarded so don&#39;t hate me for using ChatGPT but it dumbed down this portion of the filing for others who may struggle with understanding leagalesse (like me):</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Imagine you have a group project for school, and one of your friends from another school wants to join your team temporarily to help out. You need special permission from your teacher for this to happen. In the legal world, this is somewhat similar. </p>\n</blockquote>\n\n<ol>\n<li><strong><em>Background</em></strong><em>:</em> <strong>There is a situation that needs to be dealt with in a court.</strong> Think of it like a problem that needs solving.</li>\n<li><strong><em>Application</em></strong><em>:</em> <strong>Somebody (like a lawyer) has asked the court for permission to do something special.</strong> This is like your friend asking the teacher if they can join your group.</li>\n<li><strong><em>Review</em></strong><em>:</em> The court looks at what the person asking for permission (the lawyer) has said and all the documents they provided, just like your teacher would review your friend&#39;s request.</li>\n<li><strong><em>Rules</em></strong><em>:</em> The court follows certain rules (like school rules) to decide if they should say yes or no. They mentioned some rules like &quot;Fed.R.Civ.Proc.78&quot; and &quot;D.N.J. L.Civ.R.101.1,&quot; which are like the school&#39;s guidelines.</li>\n<li><strong><em>Good Cause</em></strong><em>:</em> <strong>The person asking for permission needs to give a good reason.</strong> This is like your friend explaining why they want to join your group and how they can help.</li>\n<li><strong>Decision</strong>: After looking at everything, the court decides to say yes or no. <strong>In this case, they said yes.</strong></li>\n<li><strong><em>Permission Granted</em></strong><em>:</em> The court allows a person named <strong>George Calhoun, who is not from the same area (out-of-state attorney), to help in the case</strong>, but there are some conditions.</li>\n<li><strong>Conditions</strong>: <strong>George can help, but someone who is already a member of the court&#39;s lawyer group needs to officially say they&#39;re in charge and receive all the important papers</strong>. Think of it like your group project leader who receives all the emails and updates. This person will also have to tell <strong>George about everything that&#39;s going on</strong>.</li>\n<li><strong><em>Only Court Lawyers</em></strong><em>:</em> Only lawyers who are already part of this court&#39;s group can do certain things, like submitting papers, representing people in court, or handling payments related to this case.</li>\n</ol>\n\n<p><strong>TLDR:</strong> This document is about giving permission to a lawyer, George Calhoun, who is not from the area, to help in a legal case, but he needs a local lawyer to be in charge and keep him updated. Only lawyers who are part of this court can do certain tasks in this case.</p>\n\n<p>What&#39;s also interesting is the legal team this firm has as well as their experience. Think about FTX (tokenized shares / Bahamas), GME/BBBY and Teddy/Decentralization when reading their specialities: (Side note: FTX was going to help the Bahamas impliment cryptocurrency called &quot;Sand Dollar Central Bank Digital Currency&quot;). </p>\n\n<p><a href=\"https://preview.redd.it/8zumnkfw95pb1.png?width=1004&amp;format=png&amp;auto=webp&amp;s=cdbf20ca25dd2bc662d449e92e2de25678e0c4ec\">https://preview.redd.it/8zumnkfw95pb1.png?width=1004&amp;format=png&amp;auto=webp&amp;s=cdbf20ca25dd2bc662d449e92e2de25678e0c4ec</a></p>\n\n<p><a href=\"https://preview.redd.it/x4eku19v85pb1.png?width=4677&amp;format=png&amp;auto=webp&amp;s=8e67bd933f0a9e4f78bd895a80ca1a60e1af3afb\">https://preview.redd.it/x4eku19v85pb1.png?width=4677&amp;format=png&amp;auto=webp&amp;s=8e67bd933f0a9e4f78bd895a80ca1a60e1af3afb</a></p>\n\n<p>The purpose of this post is to provide some available information to wrinkle-brains.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/16m7bum/the_case_of_why_drs_may_not_really_matter/", "time": 1695071130.0, "subreddit": "r/ThePPShow", "title": "The case of why DRS may not *really* matter", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m as retarded as they come, but I think I have an opinion that may be worth sharing to clear up some concerns.</p>\n\n<p>First, in order for a brokerage to”force” close your shares is if they are completely insolvent. However, I’ll explain a scenario or two as to why it may be the absolute last resort.</p>\n\n<p>We have to first remember that in order for your brokerage to go belly up and “force” close customer positions is if those very financial institutions who have short positions themselves becomes insolvent. Which means, several financial institutions will have to go bankrupt FIRST.</p>\n\n<p>Let’s take one step back and look at the derivative market. Just imagine $10+ quadrillion in derivative exposure. Many of these financial institutions that have short positions on GME, BBBY, and many others are also indirectly tied to each other in the derivative market, especially the synthetic shares (naked shorting). So not only will the financial institutions who are directly shorting these companies need to go bankrupt first but also all the other institutions who are indirectly or directly tied to each other within the derivative market as well. Here you can see an explosive chain reaction.</p>\n\n<p>Now, if the FED decides to initiate bailouts like they did in 2008, then the Federal Reserve will indirectly feed the short squeeze (Pay Us) as they continue to bailout all these over-leveraged &amp; illiquid institutions. Remember not much will change in the FED’s policies until 2025 so they are stuck between a rock and hard place.</p>\n\n<p>The FED may have to choose between two options:</p>\n\n<p>1- Collapse the market &amp; people go to prison.</p>\n\n<p>2- Pump in stimulus and allow the market to die through inflation, thus delaying prison sentences (not for long).</p>\n\n<p>The politically advantageous thing to do will be to print money and inflate. Which means, you can set some pretty nice price targets.</p>\n\n<p>I understand the DRS argument and have some DRS’D myself, however, let’s get back to the DD. In reality, DRS is a tool for a long term investment and the thing to really pay attention to is the <em>politics</em> of the situation rather than the fundamentals. Regulators &amp; Congress typically respond politically while bailing out WallStreet to keep save their hide.</p>\n\n<p>Inflation will just simply delay prosecution and that’s more or less the option they will choose if they want to “keep” this god awful centralized system.</p>\n\n<p>These people are serious morons and had their hand in the cookie jar long enough. No matter the outcome it won’t be pretty for them. They will become more blatant with their crimes if they are money hungry or less likely, do the right thing and let this entire fraudulent financial system collapse. In either case, a decentralized system will be ready to pick up the pieces and start fresh.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/16m119e", "time": 1695056634.0, "subreddit": "r/ThePPShow", "title": "Wut barcoding? There could be a reason why we're on the Expert Market. Now that retail is locked out, ping-pong time. Maybe it's why George Calhoun is in Docket #2184. His work includes domestic &amp; international fraud, internal investigations, securities, bankruptcy &amp; debt recovery litigation. RICO?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/6gnL_I9dRppKIG0D3dPRC0QL8qm7bIOpxvTI1O73MMQ.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/16m0zyw", "time": 1695056552.0, "subreddit": "r/ThePPShow", "title": "Wut barcoding? There could be a reason why we're on the Expert Market. Now that retail is locked out, ping-pong time. Maybe it's why George Calhoun is in Docket #2184. His work includes domestic &amp; international fraud, internal investigations, securities, bankruptcy &amp; debt recovery litigation. RICO?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/RCG5Gys9s1RozP8zaW73Vg2FgdVb67TFsePSDihrcBo.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/5yvkoqthl1pb1.png", "time": 1695056175.0, "subreddit": "r/ThePPShow", "title": "Wut Barcoding? Maybe one reason why we're on the Expert Market. Since retail is essentially locked out, ping-pong time. Makes we wonder about George R. Calhoun (Docket #2184), his work includes domestic &amp; international fraud, internal investigations, securities &amp; other class action litigation. RICO?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/5yvkoqthl1pb1.png\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.youtube.com/watch?v=NREbyB6UUu0", "time": 1695010302.0, "subreddit": "r/ThePPShow", "title": "Understanding our thesis about TEDDY (Decentralized Market &amp; Blockchain), the corruption in the stock markets as well as the professional &amp; personal qualities that drive RC, Icahn, Larry and Pulte, take a listen this Patrick Byrne interview.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/NREbyB6UUu0/maxresdefault.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/w0d4u0bkcpob1", "time": 1694907181.0, "subreddit": "r/ThePPShow", "title": "Two clips of Patrick Byrne (Overstock) talking about Blockchain, Decentralization &amp; the transition from Centralized to Decentralized Exchanges. There are key words that will pop out if you consider the TEDDY thesis. For context, these were filmed 4-5 years ago so imagine where they are at now.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/CeEFa2GJOUdeI8K3GoLk8rp0KvkztpAUng7AWJyCT6I.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/mrs3c125tkob1", "time": 1694852394.0, "subreddit": "r/ThePPShow", "title": "Tribute Video on ThePPShow (Really hit the feels watching it with all of you. Thought I'd share the segment from the show. LFG!)", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Zsb-0oHQoCmMfEp8XYvQeZc9_7bX6LhyEX2BXOmJKQI.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/i8etnorg4kob1", "time": 1694843998.0, "subreddit": "r/ThePPShow", "title": "Teammates v2.0 (Dedication Video to All the Degens &amp; thePPshow)", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/EoHGSUJkG8FRCSOpoukkRJ-wOMBBfSogxSu6MgE7UNE.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/16jlj1t/international_brokerages_forcing_sale_of_bbby/", "time": 1694803943.0, "subreddit": "r/ThePPShow", "title": "International brokerages 'forcing' sale of BBBY shares &amp; waiving 14-day stay. Timing is VERY interesting.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a few posts on this sub and BBBY main sub of many international apes receiving messages from their brokerages about a &#39;force liquidation/sale&#39; of their shares. Most of these brokerages provided sale dates, anywhere between late September to early October. The fact that the 14-day stay period has been waived indicates to me that the supplemental *could* happen between now and within the next week or two, prior to these forced closures.</p>\n\n<p>I&#39;m completely retarded, but it appears to me that these international brokerages are trying to hide/dump their phantom shares most likely due to locates. They would rather payout pennies on the dollar to shareholders for their shares rather than being forced to pay out high returns or potentially get into legal trouble. I&#39;d be VERY curious if FTX has anything to do with this as well, especially with their tokenized securities of BBBY.</p>\n\n<p>If I were involved in this play, I&#39;d certainly let this baby rip before these brokerages could cut their losses in order to avoid prosecution.</p>\n\n<p>But then again, I&#39;m retarded. </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/r1yhxsbxb8ob1", "time": 1694701068.0, "subreddit": "r/ThePPShow", "title": "Teammates (A Video Dedicated to All You Degens &amp; ThePPShow)", "text": null, "preview": ""},
{"username": "_AlphaState_", "url": "https://i.redd.it/bl6so5qhounb1.jpg", "time": 1694535653.0, "subreddit": "r/ThePPShow", "title": "Poor Kenny doesn’t like “Dumb Money” (pulls out small violin)", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/bl6so5qhounb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/16g1xrd/a_nice_game_of_chess/", "time": 1694454449.0, "subreddit": "r/ThePPShow", "title": "A Nice Game of Chess", "text": "<!-- SC_OFF --><div class=\"md\"><p>What I&#39;m purposing is simply just a hypothesis and nothing more, so take this with a massive grain of salt. If we were to look at the BBBYQ dockets *objectively* it&#39;s abundantly clear that RC is interested in BBBY/Baby. RC&#39;s name is even listed under the interested parties as well as a creditor (both RC and RC Ventures) in a number of dockets. This is even a widely supported view by many on Twitter/X and reddit. BUT... here&#39;s the kicker. If I were a master chess player (I am not), but if I were, I&#39;d use RC&#39;s following with GME as the biggest head-fake when it comes to BBBY. I&#39;d make RC&#39;s interest in BBBY *appear* as the obvious player in this saga the entire time. I would allow the media/FUD to eat this up, allow the SEC &amp; regulators to be easily distracted by unfairly targeting RC, and if that wasn&#39;t too much, anyone involved on the other side of this acquisition (hedge funds, banks, lawyers, etc) will make the process painstakingly difficult for RC to acquire BBBY.  I&#39;d even go one step further to highlight what Pulte mentioned about RC. Pulte mentioned that RC is being targeted &amp; that &quot;we must protect this man [RC] at all cost&quot;.</p>\n\n<p>So, what if this was the plan all along? Make RC the &quot;front man&quot; in this saga, meanwhile there is another &quot;white hat&quot; or a group of &quot;white hats&quot; in the background waiting for the appropriate time to reveal their hand.....</p>\n\n<blockquote>\n<p>“The whole secret lies in confusing the enemy, so that he cannot fathom our real intent.&quot;<br/>\n- Sun Tzu (Art of War)</p>\n</blockquote>\n\n<p>In a way, one could even envision RC as the poster child who takes all the &#39;slings and arrows&#39; for the cause while allowing everyone (even us) to be convinced that RC is the main conductor in this play. Hell, even MSNBC, CNBC, shows like Jim Cramer, Documentaries, Investopedia, etc all paint RC as someone who is simply into &quot;meme&quot; stocks, attacking his credibility and downplaying his intelligence &amp; vision as a legitimate leader in the corporate world. </p>\n\n<p><a href=\"https://preview.redd.it/wy71mbscunnb1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=c3fad1001c7c70aa2e5729ead768d5ba340d3eeb\">https://preview.redd.it/wy71mbscunnb1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=c3fad1001c7c70aa2e5729ead768d5ba340d3eeb</a></p>\n\n<p>So.... Who is someone we believe to be involved but we hardly ever hear anything about him? Even searching on Google &#39;News&#39; we barely see any information about him and when we do, a majority of information typically pertains to his father. So, who is this man?</p>\n\n<p>Brett Icahn.</p>\n\n<p>Like many of you, I believe there are multiple people involved in this play AND I also believe that each person has a specific role to play.  RC very well may be orchestrating this play but if I were a grand chess master, I&#39;d convince everyone to believe RC is the obvious interested party (publicly) so that all the attention can be placed onto him (unfairly), when in reality, the conductor may be someone else entirely or someone we least expect.</p>\n\n<p>Anyway, just food for thought. I&#39;m super retarded.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/olSIfiAHjT0aKZK40_idaKpmpndxyfKOnZH8kVOq0u8.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/16dye1b", "time": 1694240805.0, "subreddit": "r/ThePPShow", "title": "RyanCohen1682 and Legoland #1682", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/iuzv8oUqNFvwhh9o5Wx2VhadZdbZCLaEXIFfJteN_KM.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/pifab3er4rmb1.png", "time": 1694056872.0, "subreddit": "r/ThePPShow", "title": "_CO_RY_ post: 98 degrees", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/pifab3er4rmb1.png\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/16bbxt8", "time": 1693979108.0, "subreddit": "r/ThePPShow", "title": "Is GME working with AMESTO for reverse merger (TEDDY, Gmerica)? What are your thoughts? (Will delete this if posted earlier)", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/WKcXat8p4UiqcrvUIikyJNXaAk-tK2atDQu5UrUzfUA.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/z9s5y0b7ujmb1", "time": 1693968993.0, "subreddit": "r/ThePPShow", "title": "Ryan Cohen: \"We're trying to do something that nobody in the retail space has never been done\" / \"We believe we're putting the right pieces in place\" / \"Some people want us to lay out a plan today\" / You will never find us telegraphing our strategy to the competition\" / \"Buckle Up\"", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/RljS5dy4OcICB59aP9WcyjO1i_eVUSAOLV3qUoRM0mU.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/16b7p0e/informative_video_about_ryan_cohen_chewy_after/", "time": 1693966191.0, "subreddit": "r/ThePPShow", "title": "Informative video about Ryan Cohen &amp; Chewy. After watching this video, it made me appreciate how hard work Ryan Cohen works and how much he actually cares.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Video: <a href=\"https://www.youtube.com/watch?v=Zg4I9Y79KTk\">https://www.youtube.com/watch?v=Zg4I9Y79KTk</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://youtu.be/Zg4I9Y79KTk?feature=shared", "time": 1693964778.0, "subreddit": "r/ThePPShow", "title": "How Did Chewy Beat Amazon? How Did Ryan Cohen Succeed? | The Chewy &amp; Ryan Cohen Origin Story.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/Zg4I9Y79KTk/maxresdefault.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://youtu.be/s665L2U1z84?feature=shared", "time": 1693963608.0, "subreddit": "r/ThePPShow", "title": "“The Biggest Short Squeeze Ever” | Volkswagen Short Squeeze of 2008. Great video summary. May help draw some parallels &amp; comparisons.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/s665L2U1z84/maxresdefault.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/7m1uakhutdmb1", "time": 1693895793.0, "subreddit": "r/ThePPShow", "title": "Volkswagen Squeeze (Live Chart) / Oct 26th 2008. Patience plus pressure forms Diamond Hands 💎 🙌 .", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not my vid. Video credit: CS Trades (YT)</p>\n</div><!-- SC_ON -->", "preview": ""},
{"username": "_AlphaState_", "url": "https://i.redd.it/ry6raobfxbmb1.jpg", "time": 1693872887.0, "subreddit": "r/ThePPShow", "title": "How to Read FUD (with colors for regards!). 'The Street's' article posted 17hrs ago of impending Sept 12th Confirmation Hearing.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ry6raobfxbmb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.youtube.com/watch?v=Gb59f0xqah0", "time": 1693707587.0, "subreddit": "r/ThePPShow", "title": "A good video explaining LOOPRING for those who are as regarded as me...", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/Gb59f0xqah0/maxresdefault.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.youtube.com/watch?v=nGo3IUt2GEI", "time": 1693707447.0, "subreddit": "r/ThePPShow", "title": "A good video explaining Loopring to those who are as regarded as me...", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/nGo3IUt2GEI/maxresdefault.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/nffyqam16xlb1", "time": 1693694082.0, "subreddit": "r/ThePPShow", "title": "Sal’s Unwavering Conviction X Space - OKB Response", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/dXVlOWVsaTE2eGxiMSFSJB1leoxtzLurccvH9cvUN1d49uy7Nb4I35a92fio.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=772f1ebe9a7a1603da7ef1fb4c759f907d244ac5\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/tqdidbf00elb1", "time": 1693462035.0, "subreddit": "r/ThePPShow", "title": "The Plan - “Liquidating Trust” Rule 1145 / OKB", "text": "<!-- SC_OFF --><div class=\"md\"><p>BULLISH AF</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/cnk4em5tYTAwZWxiMc82FxEwUdoo2nR6zQslRqgFvsrk3b3UAzjpwGmIO6Gq.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=93493456b9c395f4d7baaafe8cba0b23a5e0a6c1\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.youtube.com/watch?v=Tr7vYbHfNTE", "time": 1693258923.0, "subreddit": "r/ThePPShow", "title": "Is it possible IEP could be used as a Master Limited Partnership for TEDDY, Blockbuster, OSTK/BBBY, GME, Baby, etc. all could be limited partners. In MLPs, there are no Shareholders but rather Partners (ie, Teammates). It's very interesting IEP is already an MLP.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/Tr7vYbHfNTE/hqdefault.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/46fmt0u37bkb1.png", "time": 1692992248.0, "subreddit": "r/ThePPShow", "title": "October 17th - Carl &amp; Ryan. \"It's gonna be biblical\"", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/46fmt0u37bkb1.png\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/15ja8lf/the_waters_will_get_muddier/", "time": 1691278355.0, "subreddit": "r/ThePPShow", "title": "The waters will get muddier....", "text": "<!-- SC_OFF --><div class=\"md\"><p>Fellow Apes,<br/>\nIn case you have been living under a bridge, it&#39;s very clear that over the past month shit&#39;s been getting weird. Moments where shills are on a full attack reeeeee mode, moments where shills are completely absent &amp; the times where there is an introduction of more varied opinions which at times can sow confusion into the community. In a way, I believe I understand why Life_Relationship submitted that filing but I also see the down sides that many are suggesting as well. I understand both sides but since it is out of our hands, I&#39;m not going to stress over it since I have faith in the board and my convictions which led me here in the first place. This is our REAL DIAMOND HAND moment.  </p>\n\n<p>Furthermore, the shill activity seems to be A LOT more talented, disguising their true intentions behind sympathetic or &quot;I&#39;m an APE like you&quot; posts. Some shills are blending into this community and it&#39;s getting a bit more challenging to decipher what is true. Most of the time these shills will conflate a bit of a truth with a bit of lies, thus producing disinformation among the community.  </p>\n\n<p>I urge everyone to avoid reducing down to accusatory, anger or any type of emotional response to the situation and shills. The shills will take advantage of emotions. Make sure we control them and continue to reaffirm our faith in what we believe to be true, including our convictions. There is no room for doubt at this point. What would be the benefit? We&#39;ve all decided our fate and it&#39;s up for us to see it through.  </p>\n\n<p>We are &#39;Over the Target&#39; Frens. This is why shit&#39;s getting real.  </p>\n\n<p>I will leave you with a few Sun-Tzu quotes from the Art of War to help put some things into perspective:  </p>\n\n<ol>\n<li><p>&quot;In the midst of chaos, there is also opportunity.&quot;  </p></li>\n<li><p>&quot;Appear weak when you are strong, and strong when you are weak.&quot;  </p></li>\n<li><p>&quot;The supreme art of war is to subdue the enemy without fighting.&quot;  </p></li>\n<li><p>&quot;Opportunities multiply as they are seized.&quot;  </p></li>\n<li><p>&quot;Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.&quot;  </p></li>\n<li><p>&quot;Treat your men as you would your own beloved sons. And they will follow you into the deepest valley.&quot;   </p></li>\n<li><p>&quot;Engage people with what they expect; it is what they are able to discern  and confirms their projections. It settles them into predictable  patterns of response, occupying their minds while you wait for the  extraordinary moment — that which they cannot anticipate.&quot;  </p></li>\n<li><p>&quot;Thus the expert in battle moves the enemy, and is not moved by him.&quot;  </p></li>\n<li><p>&quot;Be extremely subtle even to the point of formlessness. Be extremely  mysterious even to the point of soundlessness. Thereby you can be the  director of the opponent&#39;s fate.&quot;   </p></li>\n<li><p>&quot;The whole secret lies in confusing the enemy, so that he cannot fathom our real intent.&quot;   </p></li>\n<li><p>&quot;Attack him where he is unprepared, appear where you are not expected.”   </p></li>\n<li><p>&quot;Mystify, mislead, and surprise the enemy.&quot;  </p></li>\n<li><p>&quot;Begin by seizing something which your opponent holds dear; then he will be amenable to your will.&quot;  </p></li>\n<li><p>&quot;You have to believe in yourself.&quot;  </p></li>\n</ol>\n\n<p>STAY STRONG. STAY VIGILANTE. TRUST YOURSELF. UNITE.   </p>\n\n<p>It&#39;s time to party.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/2opordzr4tfb1.jpg", "time": 1691030176.0, "subreddit": "r/ThePPShow", "title": "What if RC \"sold\" his shares &amp; pooled it into DIP financing? ChatGPT provided an interesting response. Ryan Cohen, \"This could get interesting.\"", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2opordzr4tfb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15fvy9j", "time": 1690942261.0, "subreddit": "r/ThePPShow", "title": "Carl Icahn and Warren Buffett Quotes", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Iq_2vXdelQaD1sO_dBZKA4DlrVgYNqRxq1NN-WGp8zA.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/15frld4/between_a_rock_and_a_hard_place/", "time": 1690930577.0, "subreddit": "r/ThePPShow", "title": "Between a Rock and a Hard Place", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sorry to go bigger picture but I believe there will be two outcomes to this play:</p>\n\n<p>Exposition: We all know the regulators (SEC, FINRA, etc) are beyond corrupt and play musical chairs within the industry they are meant to protect us from: the markets &amp; banking industry. It’s clear these institutions are in place to try and convince us this is a legitimate financial system. However, they’ve know for a very long time that this system is beyond corrupt, criminal and completely counterfeit. </p>\n\n<p>So knowing that the USD and many other fiat currencies are literally fake, what keeps the gravy train going &amp; why is this important to understand for a MOASS event?</p>\n\n<p>Answer: Simple: Confidence or the belief that this market is “real”</p>\n\n<p>Here is my hypothesis of how this could play out-</p>\n\n<p>1) Prevent Mass Liquidation.  I see this as the least likely event and I’ll tell you why. Confidence, confidence, confidence. In order for these scum bags to continue pillaging society of its wealth, they NEED people to believe in the system. If they stop a liquidation event that is triggered as a natural result of illegal behavior then it becomes evidently clear that this entire financial system is a complete fraud as no one plays by the “rules”. Remember, this fucks created the “rules”. The people (including good members of Congress) will haul in the bankers and regulators for criminal activity if they prevent a legitimate consequence of their illegal behaviors. Also remember, 2008 wasn’t that long ago for people to memory-hole the entire situation.</p>\n\n<p>2) Mass Liquidation. I believe this is more likely. If it were between jail time OR losing money while retaining confidence in the system, I believe they will choose the later. Primarily because this will give these scum bags a glimmer of potential hope to continue this illegal charade but in a “digital form” <em>cough</em> CBDC, in which they can “patch the rules” to further benefit their self serving interests. In a way, they need a liquidation event to usher in their “fresh” digitally corrupt system.</p>\n\n<p>HOWEVER, IF our thesis is correct about TEDDY with some form of blockchain technology that competes directly with Amazon overnight, we effectively rug pulled the entire CBDC system, circumventing it without any bloodshed. Not only will we get PAID but we naturally participate in an economy that is completely separate from the US FED &amp; IMF. Most importantly, this new economy benefits everyone: shareholders, customers and businesses.</p>\n\n<p>Rather than companies being run by pieces of shit CEOs and crushed by naked short sellers, these companies will be built on service, security, customers, value and quality. </p>\n\n<p>Who wouldn’t want to be involved in this?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/15fmmmr/ive_held_this_belief_similar_to_what_aj_has_said/", "time": 1690919043.0, "subreddit": "r/ThePPShow", "title": "I’ve held this belief similar to what AJ has said on his channel…", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m convinced that this bankruptcy with delays, extensions and seemingly last minute turn-arounds are to fuck with the algos 100% (even BlackRock admits there is very little human interaction in trading). Today, BBBYQ was trading green but went red IMMEDIATELY upon the revelation of an extension in court.</p>\n\n<p>Imagine a deal has already been made months ago (but cannot be revealed publicly for various legitimate reasons), what advantage would that give the good guys in this play? Would timelines even be relevant? The good guys can literally make everything appear negative just by the BK process alone, when in reality, the end goal has already been decided upon. Why not use seemingly negative information to lure your enemies into a deeper bear trap knowing full well how this plan will ultimately pan out. Two birds with one stone: Resurrect these “dead” companies who already have brand-identity to compete with Amazon while fucking over the shorts at the same time. What a time to be alive!</p>\n\n<p>Apes, the time is on our side. The longer this draws out the worse it will get for the hedgefucks. Clearly we have the blue balls to prove it…</p>\n\n<p>If we have the balls to wait this out to zero, then we most certainly can wait this out to $1,000/share. We have conviction in our DD. We should be proud.</p>\n\n<p>Edit: (P)ower to the (P)layers / PP</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15fjigm", "time": 1690912054, "subreddit": "r/ThePPShow", "title": "Warren Icahn in one post", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/4zCGf72wynRJsAeDz065smWXHMYhDJL5F11ueXWhYa4.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15euoap", "time": 1690843724, "subreddit": "r/ThePPShow", "title": "Hm…. Super tinfoil. Could Elon Musk be part of it as well? GME wallet discontinued due to SEC? What if it was pulled in preparation for something else? Teddy….. some type of blockchain?", "text": "Ryan Cohen is Canadian and Musk tweeted about him loving Canada (but looks like “anal” obviously). Pulte is heavy into Twitter/X. Imagine the everything app “X” connects to what RC/CI/Brett/LC, etc are working on?\n\nAgain, super tinfoil", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/67AGtegxO-PAiXGpgbxviwzVMJ1mtzXXDtScn_G66HU.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15dlvcc", "time": 1690724351, "subreddit": "r/ThePPShow", "title": "Patty Wu’s LinkedIn post mentions a “buybuy BABY 2.0” with a Teddy Roosevelt quote.", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/mRwdN-zGC5WqH98u5SsZZIZBtJd3dPZgn1H40ZokAIU.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15d1zdr", "time": 1690662386, "subreddit": "r/ThePPShow", "title": "Driving thru Schaumburg, IL &amp; came across a fenced in BBBY. Ironically 1.5 miles away from Pulte Homes Chicago office &amp; PulteGroup building.", "text": "Off the same street too: E Golf Rd, Schaumburg, IL", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/tAhE4JFSwpP_wJAiFwfINChXLC5E7CcIpCtemv9_sRw.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15c9001", "time": 1690577925.0, "subreddit": "r/ThePPShow", "title": "Who is Philip Gross?", "text": "<!-- SC_OFF --><div class=\"md\"><p>The M&amp;A Advisor: THE M&amp;A ADVISOR&#39;S 14th ANNUAL TURNAROUND AWARDS (2019)</p>\n\n<p>Chapter 11 restructuring of M&amp;G Chemicals named winner of &quot;Cross-Border Restructuring of the Year&quot;\nChapter 11 reorganization of New England Motor Freight</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/ztKvz6fdLgNEZxm8ClDdt72nHWpZInu8f8NKctPBF30.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15c8ygs", "time": 1690577813, "subreddit": "r/ThePPShow", "title": "Who is Philip Gross?", "text": "THE M&A ADVISOR'S 14th ANNUAL\nTURNAROUND AWARDS (2019)\n\n\nChapter 11 restructuring of M&G Chemicals named winner of \"Cross-Border Restructuring of the Year\"\nChapter 11 reorganization of New England Motor Freight (NEMF)\nnamed winner of \"Restructuring of the Year ($25M to $50M)\"", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/7u9QrtUt9nmK6qIHY_Ibq7iz_BcU0PP9Amk4d_AcWyU.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15bonsf", "time": 1690523164.0, "subreddit": "r/ThePPShow", "title": "Update: BBBY &amp; Sue Gov claims tossed. RC has all but one “stick”. Any legalese experts?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Made a mistake on my original post. Looks like RC’s motion to dismiss was granted “IN PART”, however BBBY and Sue Gov claims has been dropped.</p>\n\n<p>Link (Bloomberg, sorry not archived): <a href=\"https://news.bloomberglaw.com/securities-law/bed-bath-beyond-meme-stock-claims-tossed-cohen-claims-stick\">https://news.bloomberglaw.com/securities-law/bed-bath-beyond-meme-stock-claims-tossed-cohen-claims-stick</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/tLnJYxXTcXFevSfjQvYlSFP3eUSdRjIu8HAuy_Dg82k.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/62x771mh8neb1.jpg", "time": 1690522888, "subreddit": "r/ThePPShow", "title": "BBBY &amp; Sue Gov claims tossed. RC has all but one “stick”. Any legalese experts?", "text": "Article (sorry not archived): https://news.bloomberglaw.com/securities-law/bed-bath-beyond-meme-stock-claims-tossed-cohen-claims-stick", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/62x771mh8neb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://v.redd.it/649yxk0eekeb1", "time": 1690488688.0, "subreddit": "r/ThePPShow", "title": "“Only the Young”.  A closer look", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m not body language expert but I’m convinced Pulte knows (at least a little bit) of what may be coming down the pipe given his facial expressions. He did a great job of not revealing much and only provided us with enough information to stay vigilant &amp; positive. Bill doesn’t need to own shares in BBBY especially if he (maybe) is involved with discussions of some type of M&amp;A. Again all tinfoil but I certainly did appreciate Bill &amp; Kevin sharing their thoughts. Much love everyone!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/bTlxb3p0cGRla2ViMUGaUIWU2MqaGEvBW-AYawWq4AUrdJJgJQ6RagLfhQZM.png?width=140&amp;height=78&amp;crop=140:78,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=8a15ccbd78146532ebb69bf620b895212e1b40b4\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/w0b3ln0l9ceb1.jpg", "time": 1690390081, "subreddit": "r/ThePPShow", "title": "Shorts get wrecked..", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/w0b3ln0l9ceb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/15aa9wv", "time": 1690388492, "subreddit": "r/ThePPShow", "title": "A quick screen grab….", "text": "Tweet:\n\nhttps://twitter.com/gme_bbby_teddy/status/1683904766357667844?s=46", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/nSGpUIAwcIA0gOmXIoo0phnSLY6wZGrZfCF0Tly5KxM.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/157x4o4/the_bbbyq_family/", "time": 1690164137.0, "subreddit": "r/ThePPShow", "title": "The BBBYQ Family", "text": "<!-- SC_OFF --><div class=\"md\"><p>To our BBBYQ Family:</p>\n\n<p>Although we may all have disagreements with other basket stonks, the mission is one and the same: to expose and ultimately change the financial system for our future and generations to come. The second part of our mission is to hopefully capitalize on this moment in time, not only to improve our lives but also to help those around us.</p>\n\n<p>I&#39;d like to believe that the main difference between BBBYQ and the other stonks (AMC, GME, etc.) is that we are fairly open-minded, willing to change our opinions based on information and discussion, and ready to hear opposing viewpoints and ideas. We support one another, including apes in other stonks, and we provide a healthy mix of amazing DD, tinfoil + hopium to keep us motivated while moving forward.</p>\n\n<p>Whatever happens in this journey, we have accepted two fates: Zero or Hero (Food Stamps or Lambos).... and we’re perfectly fine with either outcome. This is a QUALITY that is extremely rare in our society, and it&#39;s unfortunate to see so many people struggle to find meaning in their lives or choose to miss out on an amazing opportunity due to fear, uncertainty, or doubt. But honestly, who can blame them? This isn&#39;t for just anyone. Instead, this moment has been prepared for super-special regards like yourself :)</p>\n\n<p>Each and every one of you should keep your heads held high, as you have an incredible sense of conviction, perseverance, patience, and unwavering commitment to this mission. But to get here, many of us had to develop these skills. These skills may have been developed from difficulties, trauma, or regrets that many of us have experienced at some point in our lives. Rather than turning difficult experiences into negativity or guilt, each of you has found a way to internalize these hardships and transform them into a learning experience, i.e., to improve yourselves. You should all be incredibly proud of this, and I cannot emphasize this point enough.</p>\n\n<p>Although I have never met many of you face-to-face, I honestly consider all of you family. To some, this community may be the only family they have. Cherish this community and this moment in time. Understand that everything happens for a reason, and we all have a purpose. This is not simply by chance or a roll of the dice.</p>\n\n<p>Everyone here has contributed (in one way or another) to the incredible growth, and the bond that we share has developed this community into something incredible. There are very few people I&#39;d risk my life or fight beside... and I&#39;m confident to say that I&#39;d be happy to fight alongside each and every one of you. You all have earned my trust, and I hope the feeling is mutual.</p>\n\n<p>To conclude, I encourage all of us never to forget where we came from. I believe each and every one of us has a calling to a higher purpose. Let&#39;s not lose sight of this, as it will keep us grounded and provide us with the ability to care and love others during difficult times.</p>\n\n<p>No matter what happens, I love you, and I can&#39;t thank you all enough. And no matter how this plays out, this is only the beginning of great things to come.</p>\n\n<p>With love,</p>\n\n<p>Fellow Regard</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/xintonjh9tdb1.jpg", "time": 1690160018, "subreddit": "r/ThePPShow", "title": "RC Cory on Twitter “It’s Bigger Than You Think”", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/xintonjh9tdb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/zta9teyp4kdb1.jpg", "time": 1690051256, "subreddit": "r/ThePPShow", "title": "Interesting timing. Imagine if good news comes from BBBYQ over the weekend or next week. Both AMC and BBYQ are in court and their CTBs are continually shooting up. AMC hit 1000%+ as BBBYQ increases.", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/zta9teyp4kdb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://i.redd.it/e8d62roldcdb1.jpg", "time": 1689955585.0, "subreddit": "r/ThePPShow", "title": "For those who remember this post &amp; what were currently experiencing.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/e8d62roldcdb1.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/gallery/152q3b8", "time": 1689660582, "subreddit": "r/ThePPShow", "title": "FedNow launching on Thursday. What timing…", "text": "According to a few sources FedNow is coming out this Thursday or Friday (21st) (depending on source).\n\nIt appears as though the Fed may be rushing this out in preparation for a potential black swan event. We can all possibly assume, given our current circumstance, that this may be true and now I’m starting to see the same list characters show up: \n\n1. We have the FedNow shills who pumps FedNow with glowing reviews Twitter, Facebook, etc. \n2. “Journalists” who yell while telling you FedNow/CBDCs are necessary and “good” for all of us!\n3. Bankers who push FedNow as the “next best thing” since naked shorting!\n4. The celebrity who tries to convince their normies that giving away your freedom is “democracy”.\n\nWhat’s incredible is that JP Morgan including  50 other firms have already signed up to join the program. How exciting…\n\nIf I were Teddy and I had a bank on the blockchain, I’d want to sure as hell time my takeover while the Fed is scrambling in absolute panic to set up a “new” digital system.\n\nWhy wait for them to start issuing out CBDCs when we can take all their money now?", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/FWmCXJQ3nz63C8OUl6bw8kKsUttw8kdsRmF1p6J-jDY.jpg\"/></div>"},
{"username": "_AlphaState_", "url": "https://www.reddit.com/r/ThePPShow/comments/1528764/in_response_to_peruvian_bulls_post_re_the_event/", "time": 1689614730.0, "subreddit": "r/ThePPShow", "title": "In response to Peruvian Bull's post re: the Event Horizon", "text": "<!-- SC_OFF --><div class=\"md\"><p>If I&#39;m understanding this correctly, as the Treasury will have no limit to borrow and the Fed essentially has no limit to printing, is this really setting up for a black swan event?</p>\n\n<p>The timing of this seems fairly telling.....</p>\n\n<p>When MOASS hits and there is no limit to borrowing or printing, the Fed will literally feed MOASS and it will suck up the money supply so hard that the Fed will have to choose between these two certainties (my opinion):</p>\n\n<ol>\n<li>To print, print and print in order to bailout the banks in order try and prevent collapsing which will only accelerate inflation, thus, destroying the USD (and eventually the banks).</li>\n<li>Fed refuses to print, keeps rates stagnant or raises rates to fight off inflation as the banks all go bankrupt.</li>\n</ol>\n\n<p>It&#39;s my belief that no matter how this is cut, this is the beginning of the end.</p>\n\n<p>At this point I believe this is where CBDC&#39;s could be ushered in for protection (or to transition the economy).... however, our theories of TEDDY could make it a direct competitor to the CBDC as a defacto parallel economy.</p>\n\n<p>A wise man on twitter once said:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/c3xgg0q5lkcb1.jpg?width=586&amp;format=pjpg&amp;auto=webp&amp;s=e6bc0bfe48d8f76c0cd1256f48ea9951183f00ad\">https://preview.redd.it/c3xgg0q5lkcb1.jpg?width=586&amp;format=pjpg&amp;auto=webp&amp;s=e6bc0bfe48d8f76c0cd1256f48ea9951183f00ad</a></p>\n\n<p>I&#39;m a dumb glassy smoothed ape so WTF do I know.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/WSYkAsE43Vx8PRp85NOF6e16u-QW0vl3Yc5-zYm38TE.jpg\"/></div>"}]