[{"username": "_Mando23", "url": "https://www.reddit.com/r/ThePPShow/comments/17kszem/advice_for_a_canadian_ape/", "time": 1698779961.0, "subreddit": "r/ThePPShow", "title": "Advice for a Canadian ape", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys and gals, hopefully this is the appropriate venue to ask this question. Does anyone know if the ticket does come back, and we are now a qualified stock, by RBC standards (I.e. nasdaq) will I be ok with my shares remaining in a tfsa. Perhaps <a href=\"/u/jake2b\">u/jake2b</a> could help a brother out. </p>\n\n<p>——————————\nOur 2023 records indicate that your account  was recently holding BED BATH &amp; BEYOND INC, which is considered a non-qualified investment by the Canada Revenue Agency (CRA) for registered plans, as defined in the Income Tax Act.</p>\n\n<p>What This Means to You</p>\n\n<p>Securities held in registered plans must meet certain qualifying criteria, otherwise the CRA may levy tax penalties.</p>\n\n<p>The above security was acquired as non-qualified, or became non-qualified in your registered plan, on August 28, 2023. Details on the fair market value of the investment will be provided in February 2024.</p>\n\n<p>Next Steps to Minimize Tax Consequences</p>\n\n<p>If you still hold in your registered plan, you can minimize any potential negative tax consequences if you:\n•\nSell the security</p>\n\n<p>•\nWithdraw and transfer the security in-kind to a non-registered account</p>\n\n<p>•\nIf the security is worthless, request to have it removed from your registered plan (if applicable), or</p>\n\n<p>•\nSwap (exchange) the security for cash in a non-registered account\nIf You Do Not Take Action</p>\n\n<p>RBC Direct Investing®, on behalf of The Royal Trust Company, may withdraw the security according to the terms of the Trust Agreement governing your registered plan.</p>\n\n<p>For more information on the tax implications of holding non qualified investments, and related tax filing requirements, please contact the CRA’s individual tax inquiries line at 1-800-959-8281 or a qualified tax professional.</p>\n\n<p>If you have already removed the security from your account, thank you. Please keep this email notification for your files.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_Mando23", "url": "https://i.redd.it/hdbq4ravkcbb1.jpg", "time": 1689086333.0, "subreddit": "r/ThePPShow", "title": "Just received this email “we’re back and better than ever” - what is going on. Someone explain.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/hdbq4ravkcbb1.jpg\"/></div>"},
{"username": "_Mando23", "url": "https://i.redd.it/334iedn1693b1.jpg", "time": 1685558242.0, "subreddit": "r/ThePPShow", "title": "A shirt for the Regards", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/334iedn1693b1.jpg\"/></div>"}]