[{"username": "_RipCity_", "url": "https://www.reddit.com/r/ThePPShow/comments/13kqiwi/jp_morgan_and_the_wall_street_journal/", "time": 1684391174.0, "subreddit": "r/ThePPShow", "title": "JP Morgan and The Wall Street Journal", "text": "<!-- SC_OFF --><div class=\"md\"><p>Short and sweet: JP Morgan has had control of the Wall Street Journal since the early 1900s. </p>\n\n<blockquote>\n<p>Wall Street control over important segments of the media was considerable. George Wheeler tells us: “around this time the Morgan firm was choosing the top executives for the old and troubled Harper &amp; Brothers publishing house… In the newspaper field, Piermont Morgan at this period was in effective control of the Newt Sun,… Boston News Bureau, Barron’s magazine, and the Wall Street Journal.” </p>\n</blockquote>\n\n<p>(The Creature From Jekyll Island - Selling War to the American People)</p>\n\n<p>I have a bridge to sell you if you think they ever gave that up. Think twice before you follow statements like “they report the facts.” They report what’s in their interest to.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "_RipCity_", "url": "https://www.reddit.com/r/ThePPShow/comments/12kh7vw/implications_of_ryan_cohens_recent_tweet/", "time": 1681373997.0, "subreddit": "r/ThePPShow", "title": "Implications of Ryan Cohen’s Recent Tweet", "text": "<!-- SC_OFF --><div class=\"md\"><p>RC clearly loves this shit. </p>\n\n<p>It’s now undeniable. </p>\n\n<p>It’s not even worth his time to interact the way he does because he is doing nothing but opening himself to lawsuits if he doesn’t. He’s already gotten the type of exposure you’d like to avoid in that case. Or maybe you think he would like to take from retail, much of which is likely lower-middle class, just because he could? </p>\n\n<p>Again, it is downright impossible for him to not see some of the tinfoil on social media - the way he gets tagged on Twitter - why would you feed into that with unnecessarily vague tweeting or giving an interview? (with an objectively awkward interviewer, sorry). </p>\n\n<p>To summarize, you either think he is a dickhead grifter &amp; stupid, or just stupid. </p>\n\n<p>But why do either of those things even matter? \nBecause he sees exactly what we see. \nIf someone wants to white night this then someone big, who has been working through unethical(at best) loopholes and shorting tactics, while the board stands (potentially) idle, will be paying for this squeeze. </p>\n\n<p>To be clear, it’s happening with or without us. He has the capital to make it happen. And knows the legal limitations of what he can say. </p>\n\n<p>RC is okay with that because, I presume, he believes himself capable of quickly taking the business and the capital generated in a more ethical, profitable direction while delighting customers and shareholders in the process. It’s not hippy-dippy, fairy dust or imaginative thinking… it’s, quite literally, what he espouses. All of the times he speaks. </p>\n\n<p>The evidence is obvious.</p>\n\n<p>We’re on the rocket</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]