[{"username": "AAAJade", "url": "https://buybuybaby.com/", "time": 1700222832.0, "subreddit": "r/ThePPShow", "title": "Website is live!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://buybuybaby.com/cdn/shop/files/BABY_Logo_NewTeal_1280x-100_4200x630.jpg?v=1693518687\"/></div>"},
{"username": "AAAJade", "url": "https://i.redd.it/tni4yf279lzb1.jpg", "time": 1699651721.0, "subreddit": "r/ThePPShow", "title": "For those who answered the call...", "text": "<!-- SC_OFF --><div class=\"md\"><p>Thank you for your service...and your spouses..children.. all who served with you too!\n I remember.\n 5×5; My arms and shoulders have room for you...\nIf you need a hug.. a safe place to be seen and heard.. im here;  I&#39;ll never forget you...I am you.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/tni4yf279lzb1.jpg\"/></div>"},
{"username": "AAAJade", "url": "https://i.redd.it/k1wp2zc4abzb1.jpg", "time": 1699530964.0, "subreddit": "r/ThePPShow", "title": "\"GAMESTOP BLOCKCHAIN,WALLET &amp; NFT\" all have approval for usage via USPTO and are LIVE!", "text": "<!-- SC_OFF --><div class=\"md\"><p>LINK will be in 1st comment, I do not know what the intended usage will be for these terms, however this is provactive.  It&#39;s a material change and I&#39;ll accept more of these till we are fully  operational post reorg.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/k1wp2zc4abzb1.jpg\"/></div>"},
{"username": "AAAJade", "url": "https://www.ft.com/content/dc02968b-b05d-4ad8-9a8d-ec9197068c07?s=09", "time": 1696427401.0, "subreddit": "r/ThePPShow", "title": "SALVATORE being quoted in the FT.com/ \"press\"! For BBBY/Q! 🐇🦋🏴‍☠️", "text": "<!-- SC_OFF --><div class=\"md\"><pre><code>Please use the sharing tools found via the share button at the top or side of articles. Copying articles to share with others is a breach of FT.com T&amp;Cs and Copyright Policy. Email licensing@ft.com to buy additional rights. Subscribers may share up to 10 or 20 articles per month using the gift article service. More information can be found at https://www.ft.com/tour.\nhttps://www.ft.com/content/dc02968b-b05d-4ad8-9a8d-ec9197068c07\n\nAlexandra Scaggs 4 HOURS AGO\n</code></pre>\n\n<p>9\nPrint this page\nReceive free Bed Bath &amp; Beyond Inc updates\nWe’ll send you a myFT Daily Digest email rounding up the latest Bed Bath &amp; Beyond Inc news every morning.</p>\n\n<p>It is with a heavy heart that I must announce that the Reddit traders are at it again.</p>\n\n<p>Last weekend, a new conspiracy theory took hold on social media — that Bed Bath &amp; Beyond’s plan to reorganise and exit bankruptcy would not, in fact, cancel out all of the value of the company’s shares. One overly lengthy post strongly hinted that some equity interests would maybe (?) be transferred into a new vehicle with an All-Star team of directors and other assets from the prior company:</p>\n\n<p>The full post (which at print time has 36.5k views on X, plus an incalculable number from reposts) concludes, “Buckle up my Unwavering Butterflies, it’s ice cream time.” Pathos abounds.</p>\n\n<p>It’s wearisome for a few reasons. The most important one is that, like most conspiracy theories, it’s a wild overextrapolation from a small truth. The author capitalises on one fact: there will be some value preserved in the restructuring of Bed Bath &amp; Beyond.</p>\n\n<p>But none of that value will be going to the retail investors who own its shares. It says so in the SEC filing! With our emphasis:</p>\n\n<p>Cautionary Note to Holders of the Company’s Common Stock and Series A Convertible Preferred Stock</p>\n\n<p>As a result of the Confirmed Plan becoming effective, all of the Company’s equity interests, consisting of outstanding shares of common stock and Series A Convertible Preferred Stock of the Company and related rights to receive or purchase shares of common stock, were cancelled on the Effective Date without consideration and have no value.</p>\n\n<p>No shares of the Company’s common stock or Series A Convertible Preferred Stock will be reserved for future issuance in respect of claims and interests filed and allowed under the Confirmed Plan or pursuant to the exercise of any rights, options or other obligations of the Company to issue its common stock and/or Series A Convertible Preferred Stock.</p>\n\n<p>The Company intends to file a Form 15 with the SEC deregistering the Company’s common stock pursuant to Rule 12g-4(a)(1) under the Securities Exchange Act of 1934 (“Exchange Act”). Upon filing the Form 15, the Company intends to immediately cease filing any further periodic or current reports under the Exchange Act.</p>\n\n<p>It doesn’t get much clearer than “no value” and “without consideration”.</p>\n\n<p>There is value somewhere in the company, of course. Shareholders should not be the least bit “optimistic” about this value, however, because the restructuring plan has explicitly zeroed them out.</p>\n\n<p>Promise, there’s no secret plan to help out the Little Guy: just look at the version of the restructuring plan that the bankruptcy court confirmed last month, and went into effect on Sept. 29:</p>\n\n<p>That Class 9 section above refers to you, Reddit degens. It brings us no pleasure to report this, but you’ll get nothing.</p>\n\n<p>In a turn of events that was only slightly less run-of-the-mill, shareholders didn’t vote on the restructuring plan. They also weren’t needed; the restructuring plan says they were “deemed to reject” the plan, because again: They get nothing.</p>\n\n<p>This is all the result of foundational stuff. The following won’t be news to our regular readers, whose time may be better spent trying to puzzle out the fulcrum security for Hawaiian Electric Industries — good luck! And also feel free to email me to talk your book, thanks! — but in case this post makes its way into the <a href=\"/r/WallStreetBets\">r/WallStreetBets</a> universe, we figured we might as well take a stab at explaining basic corporate capital structure.</p>\n\n<p>Debt — bank financing, secured loans, bonds, et cetera — include explicit promises to repay lenders. Equities do not. And in bankruptcy, there are usually a whole lot of claims/ownership interests and not a whole lot of cash or assets to compensate them, so choices have to be made about who gets paid in full and who doesn’t. There’s an order to whose claims get met first, though with plenty of negotiating and gamesmanship within and between the groups. One rule of thumb is that creditors come before equity holders. (Please do read Sujeet’s book about distressed investing! It’s very good!)</p>\n\n<p>And really, it’s that way by design. Equity gets the returns and price appreciation if a company does great, and face the greatest risk if it fails.</p>\n\n<p>For Bed Bath &amp; Beyond, the lawyers, executives, lenders and bondholders will all get paid, at least in part.</p>\n\n<p>Some of them will be offered equity in the new company instead of cash. But normal shareholders will not. By the time the corporate-value waterfall gets down to them, there’s nothing left.</p>\n\n<p>There isn’t a secret endgame to help the Apes; they are the game. And it has become far too easy for vague expressions of “solidarity” from a Pied Piper activist investor to convince normal people to shove good cash after bad, and ride a stock all the way to zero.</p>\n\n<p>Further reading:\n— PFOF and its discontents</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.ft.com/__assets/creatives/optimizely/MAR090/key_icon.svg\"/></div>"},
{"username": "AAAJade", "url": "https://deal.town/daily-mail/wells-fargo-executive-greg-beckett-jumped-to-his-death-from-banks-delaware-offices---as-family-say-hed-been-stressed-about-work-and-taking-meetings-as-late-as-11pm-P3PX76MJE", "time": 1696181489.0, "subreddit": "r/ThePPShow", "title": "Wells Fargo executive Greg Beckett jumped to his death from bank's Delaware offices - as family say he'd been stressed about work and taking meetings as late as 11pm - Daily Mail", "text": "<!-- SC_OFF --><div class=\"md\"><p>My condolences to his family and loved ones.</p>\n\n<p>Yet... this is ..the level of muckery the banks, MM and HFs have elevated the situation into.</p>\n\n<p>How deep does the WF financial malice run? ( not rhetorical)</p>\n\n<p>The pace is about to quicken✨️</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://imagedelivery.net/6fPUSNcQhoEe4ndYlFOD6w/d168aa3a-e76b-4552-2bd2-4a43eb026600/email600\"/></div>"},
{"username": "AAAJade", "url": "https://v.redd.it/uu57dpd849qb1", "time": 1695582243.0, "subreddit": "r/ThePPShow", "title": "FOR CHAT", "text": "<!-- SC_OFF --><div class=\"md\"><p>THIS is CHAT.</p>\n\n<p>Don&#39;t you forget..the SUPPORT crew is what gets those jets to AIR!</p>\n\n<p>THIS is how I imagine our CHAT...and how VITAL you all are to the mission!</p>\n\n<p>Have GREAT TIME!</p>\n\n<p>I won&#39;t be there for start, as I&#39;ll be unconscious having some medical taken care of...</p>\n\n<p>So think of me..n know ill hop on coms as soon as I can...</p>\n\n<p>5x5\n🪷✨️♾️\nAAAJADE</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/Yzk2eG9zYTg0OXFiMefwu_3ezslyLWKIYJh1ev2oGE4y6tTVUL01Hw_MoLyV.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=6c6007663fa66716ce20e793ecb3e54eb0a44e03\"/></div>"},
{"username": "AAAJade", "url": "https://www.reddit.com/r/ThePPShow/comments/16ors2e/softserve/", "time": 1695331334.0, "subreddit": "r/ThePPShow", "title": "Softserve", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is 🍦\nThis?⬇️\n<a href=\"https://www.softserveinc.com/en-us/industries/retail\">https://www.softserveinc.com/en-us/industries/retail</a> </p>\n\n<p>People also ask\nWhat does SoftServe company do?</p>\n\n<p>SoftServe provides services in the fields of big data, Internet of things, cloud computing, DevOps, e-commerce, computer security, experience design, and health care.\n<a href=\"https://en.m.wikipedia.org\">https://en.m.wikipedia.org</a> › wiki\nSoftServe\n - Wikipedia</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AAAJade", "url": "https://v.redd.it/vzec01xil5nb1", "time": 1694231994.0, "subreddit": "r/ThePPShow", "title": "Clarity Via Laughs", "text": "<!-- SC_OFF --><div class=\"md\"><p>Remember this classic? \nEnjoy the weekend!\nLFG💥🚀♾️</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/ank1eG8ydGlsNW5iMQk6ThGmV7BAHxIcnWQbEs_EXccQyKvw6wWdE9gNyUR3.png?width=140&amp;height=112&amp;crop=140:112,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=80ff56331dd2029bd1c3635cdbf960d2a3192b64\"/></div>"},
{"username": "AAAJade", "url": "https://www.reddit.com/r/ThePPShow/comments/15jbjog/tin_foil_connectionz_for_two_new_registered/", "time": 1691281912.0, "subreddit": "r/ThePPShow", "title": "TIN FOIL CONNECTIONZ for TWO NEW REGISTERED BUSINESSES with the name- BUYBUYBABY!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>TWO registrations of businesses with similar names to the established &quot;BUY BUY BABY&quot; brand from Bed, Bath &amp; Beyond were recently registered.  I am detailing a small amount of information from those two new entities.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>I have been asked to make this its OWN post and include a pre-requisite to reading THIS further:</em></strong></p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/15h21y1/have_we_seen_that_yet/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/ThePPShow/comments/15h21y1/have_we_seen_that_yet/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n\n<p>&#x200B;</p>\n\n<p>The value of this post is yet to be determined as much more data is required to weigh this specific information accordingly for any responsible evaluation. Determining who is behind these registrations, and the intentions of those registrations are not yet available. I am making NO assertation of whom could be involved, and I am curious to how and when these details will be revealed to us, the public.</p>\n\n<p>To begin, what is a Registered Agent/RA? According to a quick interwebs, via Google:</p>\n\n<p><em>&quot;A registered agent is an individual or a company that will be the LLC&#39;s or corporation&#39;s official point of contact in the state to receive service of process, other legal documents, and official communications from the state, and forward these documents and communications to the LLC or corporation for which it is acting as a Registered Agent.&quot; -</em> Specifically, from the Wolters Kluwer webpage describing a RA.</p>\n\n<p>WHY would a Registered Agent be needed?</p>\n\n<p><em>&quot; A registered agent</em> <strong><em>receives service of process and other legal documents for the entity</em></strong>*. &quot;- (cited from WIki as notated above) *</p>\n\n<p>As a small business owner, a Registered Agent/RA is a business-to-business service that provides my businesses with a legal &quot;receiver&quot; for all legal compliance paperwork. I am registered as a business in another state, thus I must have a &quot;REGISTERED AGENT&quot; in the state my business, is filed in, for &quot;Official&quot; purposes (Taxation, Legal, and Regulatory Compliance, mostly).</p>\n\n<p>This way, I cannot claim in court, if ever taken, that I &quot;did not get served any notice because I live and work in another state then where my business is registered&quot; because, I could doge a process server at my home, office, etc., or I could claim to my insurers that I never received my policy renewal notice, or there are MUTLIPLE retail locations for this entity of mine and ONE must be the &quot;Official&quot; location to receive all LEGAL paperwork etc.</p>\n\n<p>A business to be legal for operating in a state other than where is physically headquartered must have a legal Registered Agent/RA, who is basically there to receive all Legal, Federal, State and County compliance paperwork. PLEASE- This non italicized portion is my OWN definition, and it is not perfect, nor does it account for all the reasons RAs are utilized yet it MAY explain why it is being seen. BOTH these businesses above, are being registered in DELAWARE (this state is known for the positive corporate Tax and privacy standings) yet they may be operating in multiple additional states if they are indeed related to multiple locations in various states as a retail entity.</p>\n\n<p><strong><em>The TWO companies in this &#39;Tin Foil&quot; have registered as business with legal, verifiable Registered agents are:</em></strong></p>\n\n<p><strong>1-BuyBuyBaby GLOBAL</strong></p>\n\n<p><strong>2-BuyBuyBaby INC</strong></p>\n\n<p>First Up, we have...</p>\n\n<ol>\n<li><strong>BUYBUYBABY</strong> <strong><em>GLOBAL</em></strong></li>\n</ol>\n\n<p>a) <a href=\"https://www.reddit.com/r/ThePPShow/comments/15h21y1/have_we_seen_that_yet/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/ThePPShow/comments/15h21y1/have_we_seen_that_yet/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n\n<p>b)  THIS BBBG, has the Registered Agent of Corporate Creations Network/CCN.</p>\n\n<p><strong>SOURCE- IMAGE OF REGISTERED AGENT, see above LINK;</strong>  <em>&quot;have we seen that yet</em>&quot; <strong>thread, here in THIS SUB</strong></p>\n\n<p><strong>B1</strong>) <strong>CCN, the Registered Agent, is a COMPUTERSHARE company.</strong>  They were acquired by Computershare in 2020 for 142.9M.</p>\n\n<p><strong>SOURCE</strong> for acquisition: Crunchbase</p>\n\n<p><a href=\"https://www.crunchbase.com/acquisition/computershare-acquires-corporate-creations--163cb774\">www.crunchbase.com/acquisition/computershare-acquires-corporate-creations--163cb774</a></p>\n\n<p>...         ...         ...         ...         ...         ...</p>\n\n<p><strong>2 BUYBUYBABY</strong> <strong><em>INC</em></strong></p>\n\n<p><strong>A) Here is the image I have saved.  This is the data I applied to source and qualify for part of this content. (IMAGE DIDNT NOT CARRY INTO POSTING- ATTACHED BELOW IN FIRST COMMENT)</strong></p>\n\n<p><strong>B</strong>) THE TCTC, is a wholly owned subsidiary of Wolters Kluwer. </p>\n\n<p><strong>B1) CT</strong>, or the <strong>Corporation Trust Company</strong>, &quot; is a <a href=\"https://en.wikipedia.org/wiki/Wholly_owned_subsidiary\">wholly owned subsidiary</a> of <a href=\"https://en.wikipedia.org/wiki/Wolters_Kluwer\">Wolters Kluwer</a>, a multi-national information services company based in <a href=\"https://en.wikipedia.org/wiki/The_Netherlands\">the Netherlands</a> with operations in more than 35 countries. CT Corporation is the largest registered agent service firm in the world<a href=\"https://en.wikipedia.org/wiki/CT_Corporation#cite_note-2\">[2]</a> representing hundreds of thousands of business entities worldwide. It provides <a href=\"https://en.wikipedia.org/wiki/Software\">software</a> and services that legal professionals use. As a provider of registered agent services, the company is not responsible for the business or legal affairs of the customers it serves. &quot;<strong>SOURCE-</strong> <a href=\"https://en.wikipedia.org/wiki/CT_Corporation\">en.wikipedia.org/wiki/CT_Corporation</a></p>\n\n<p><strong>B2</strong>) Wolters Kluwer is a publicly traded company.  I do NOT know the ownership percentages.  This business is self-described as:</p>\n\n<p>​&quot;Wolters Kluwer is a global provider of professional information, software solutions, and services in health, tax &amp; accounting, ESG, finance, compliance, and legal.​&quot;</p>\n\n<p><strong>SOURCE</strong>    /<a href=\"http://www.wolterskluwer.com/en\">www.wolterskluwer.com/en</a></p>\n\n<p>c) Wolters Kluwer&#39;s Transfer Agent is <strong>AST.</strong></p>\n\n<p>&quot; For more information on Wolters Kluwer ADRs</p>\n\n<p>Individual investors</p>\n\n<p>Please contact <strong>AST</strong> Shareholder Services: U.S. Tel: +1 866 249 ****Int&#39;l Tel: +1 718 921 ****Email: ****** (removed to avoid any privacy issues)&quot;</p>\n\n<p><strong>SOURCE:</strong></p>\n\n<p><a href=\"https://www.wolterskluwer.com/en/investors/equity-and-debt-information/adrs\">www.wolterskluwer.com/en/investors/equity-and-debt-information/adrs</a></p>\n\n<p>CONCLUSION:</p>\n\n<p>Two companies have been recently registered in Delaware with BUY BUY BABY in the name differentiated by GLOBAL and INC.</p>\n\n<p>One&#39;s Registered Agent is owned by Computershare.</p>\n\n<p>The other&#39;s Registered Agent is owned by a publicly traded company that has AST as their Transfer Agent.</p>\n\n<p>EDIT- added words to explain where to find IMAGE that is being applied as &quot;SOURCE&quot; data for post.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AAAJade", "url": "https://twitter.com/moonclublfg/status/1676307438151303168?t=-jxJb-m5eLGDuLdil7cRgw&amp;s=34", "time": 1688523072.0, "subreddit": "r/ThePPShow", "title": "\"TEDDY\" leaked? Is this real?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "AAAJade", "url": "https://www.reddit.com/r/Superstonk/comments/14oszj7/a_small_explanation_why_the_bofa_expects/jqeu63v?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=2", "time": 1688370973.0, "subreddit": "r/ThePPShow", "title": "BBBYQ Stock: Short Sellers Face High Borrowing Fees and Positive Sentiment Threats - Meme Stock Maven", "text": "<!-- SC_OFF --><div class=\"md\"><p>BBBYQ Stock: Short Sellers Face High Borrowing Fees and Positive Sentiment Threats\nSeveral potential positive catalysts could pose a threat to Bed Bath &amp; Beyond’s short sellers during the retailer’s ongoing restructuring process.\nBERNARD ZAMBONIN15 MINUTES AGO\nBed Bath &amp; Beyond&#39;s bankruptcy - originally a boon for short sellers - has now created some risks, including high borrow fees and positive sentiment catalysts.\nThe company&#39;s restructuring involves a sale of assets, excluding physical stores.\nDebtor-in-possession lender Sixth Street Specialty Lending has expressed interest in a credit bid; a successful credit bid could potentially reduce Bed Bath’s debt burden.\n107175974-1673286185432-gettyimages-1246112080-BBB_BANKRUPTCY\nJohnny Milano | Bloomberg | Getty Images</p>\n\n<p>Mixed Feelings on the Bankruptcy Process\nIt&#39;s not surprising that many short sellers continue to bet against Bed Bath &amp; Beyond  (BBBY) - Get Free Report shares. Since filing for Chapter 11, the company has been going through its assets sales process, which involves significant risks.</p>\n\n<p>The largest buyer to date for BBBYQ’s assets has been Overstock (OSTK) - Get Free Report, which has acquired some of the home goods retailer’s key intellectual property.</p>\n\n<p>No sales have thus been made, however, for Bed Bath &amp; Beyond&#39;s physical stores, including store leases, inventory, warehousing, and logistics infrastructure. Bed Bath &amp; Beyond’s buy buy Baby chain – considered by some investors to be the company’s crown jewel – as well as its Harmon banners have also been heretofore excluded from any transactions but are now awaiting bidders.</p>\n\n<p>Debtor-in-possession (DIP) lender Sixth Street Speciality Lending expressed interest in conducting a credit bid on some of Bed Bath &amp; Beyond&#39;s assets during a recent, mid-June court hearing. As of January of this year, Bed Bath owed $550 million under its asset-backed loan with JP Morgan and $375 million to lender Sixth Street.</p>\n\n<p>During the Chapter 11 process, a secured creditor is allowed to use outstanding debt they are owed as a form of payment to acquire a bankrupt company&#39;s assets. This creates an alternative to using cash in the bidding process, though it is subject to approval by the bankruptcy court.</p>\n\n<p>The potential downside with this scenario is that, if Sixth Street makes a credit bid it may discourage competition from cash bidders. This, in turn, could result in an overall lower bid price.</p>\n\n<p>On the other hand, if the credit bid is accepted, the outstanding debt owed to that creditor is effectively reduced by the bid amount. This can alleviate some of the financial burdens on the bankrupt company, especially if outstanding debt is a significant portion of the company’s liabilities.</p>\n\n<p>So far, a recent filing shows the bankrupt company&#39;s total debts have slimmed to $1.7 billion from $1.9 billion. This $200 million liability drop helped drive up BBBYQ’s share price by 70% over just a few days.</p>\n\n<p>Borrowing Fees At All-Time Highs\nThose wishing to short Bed Bath &amp; Beyond shares - investors who are betting the company is not worth its current $203.55 million market cap and/or that its restructuring plan will collapse - are now paying through the nose to borrow shares. Borrow fees are sitting at a whopping 100% annualized.</p>\n\n<p>Driven by supply and demand, borrowing fees vary according to the availability of shares on loan and the number of short sellers interested in betting against a stock. As the chart below shows, since mid-June, the availability of BBBYQ shares has become quite scarce, resulting in borrowing fees peaking at almost 130% recently.</p>\n\n<p>5AA0BD6B-5633-406E-84EA-19B454BB89A5\nStocksera</p>\n\n<p>While they do imply a generally bearish sentiment, high borrow fees can also increase a stock’s chance of being squeezed.</p>\n\n<p>And Bed Bath &amp; Beyond&#39;s stock is no stranger to short squeezes. Over the past several years, BBBYQ (formerly trading as BBBY) underwent several short squeezes as positive catalysts drove shorts to buy back borrowed shares and close out their positions. Today, about 18.5% of BBBYQ’s float is held short.</p>\n\n<p>Momentum and Retail Investor&#39;s Appeal\nAccording to Simple Moving Average (SMA) analysis, Bed Bath &amp; Beyond shares’ trajectory evinces a short-term bullish and a long-term bearish trend.</p>\n\n<p>Price Feb 3, 2020-Jun 5, 2023 for BBBYQ BBBYQ SMA 50 SMA 150\nStockRover</p>\n\n<p>Relative Strength Index (RSI) analysis, meanwhile, shows shares of the home goods retailer are neither overbought nor oversold. A current RSI value near 50 suggests BBBYQ’s price momentum is only moderately positive.</p>\n\n<p>Indicators Feb 3, 2020-Jun 6, 2023 for BBBYQ RSI 14\nStockRover</p>\n\n<p>Turning to more anecdotal evidence, shares of Bed Bath &amp; Beyond remain quite popular among retail investors, many of whom follow the stock closely on social media forums.</p>\n\n<p>On the Stocktwits platform, for example, on the heels of its bankruptcy announcement in April, BBBYQ’s mentions reached over 8,000. And there’s still plenty of buzz surrounding the stock even two months after its bankruptcy announcement. Currently, there are an estimated 800 daily mentions for BBBYQ, which represents an increase of 185.6% over this year’s daily average.</p>\n\n<p>(Disclaimers: this is not investment advice. The author may be long one or more stocks mentioned in this report. The article may contain affiliate links, but these partnerships do not influence editorial content.)</p>\n\n<p>BED BATH &amp; BEYOND INC.\nBernard Zambonin\nBY BERNARD ZAMBONIN\nCo-producer of The Street&#39;s financial channels: Apple Maven, Amazon Maven and Wall Street Memes. Researcher and operations manager at DM Martins Research.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "AAAJade", "url": "https://i.redd.it/2r5ajiyuf06b1.jpg", "time": 1686760123, "subreddit": "r/ThePPShow", "title": "Look at ME...", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2r5ajiyuf06b1.jpg\"/></div>"},
{"username": "AAAJade", "url": "https://i.redd.it/2r5ajiyuf06b1.jpg", "time": 1686760123.0, "subreddit": "r/ThePPShow", "title": "Look at ME...", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2r5ajiyuf06b1.jpg\"/></div>"}]