[{"username": "Accomplished_Bowl_39", "url": "https://www.reddit.com/r/ThePPShow/comments/17nfbps/ryan_cohens_22_board_letter_is_my_conviction/", "time": 1699077991.0, "subreddit": "r/ThePPShow", "title": "Ryan Cohen's '22 Board letter is my conviction", "text": "<!-- SC_OFF --><div class=\"md\"><p>Im a long-time lurker and XX,XXX bobby @0,50~ that obv has no shares sitting anymore like anyone else here. I&#39;ve been following this 2-camp saga between PP&#39;s and Remasters (shills/anticamp) and it has been a fascinating thing to watch. Im not a for of against with anything- i make decisions for myself and then chill pill. So here are some words of encouragement for those that need my chill pill or be reminded of why it might have been a less-than-regarded choice to become bobby shareholder.</p>\n\n<p>Lets start of with a link to market insider that i so now and then read to understand the fundamental thinking pattern of Ryan Cohen with his initial involvement and why I personally believe such a paradigm shift away from that goal seems ulikely:</p>\n\n<p><a href=\"https://markets.businessinsider.com/news/stocks/gamestop-ryan-cohen-activist-letter-bed-bath-beyond-bbby-sale-2022-3\">https://markets.businessinsider.com/news/stocks/gamestop-ryan-cohen-activist-letter-bed-bath-beyond-bbby-sale-2022-3</a></p>\n\n<p>Quote: &quot;Moreover, he [Ryan Cohen] recommended BBBY&#39;s bosses explore a sale of the entire company to a private buyer, as that could allow shareholders to pocket a significant premium, and the retailer would likely have more cash, fewer costs, and greater flexibility as a private company.&quot;</p>\n\n<p>And now for the original letter: Point 3\n&quot;Evaluate a Full Sale to a Well-Capitalized Acquirer – The final path we want to raise for consideration is a full sale of Bed Bath, in its current form, to one of the many well-capitalized financial sponsors with track records in the retail and consumer sectors and the ability to pay a meaningful premium. The past 10 years have shown that Bed Bath faces a difficult existence in the public market. The market is not giving the Company nearly enough credit for BABY’s value. A sale that can lock in a substantial premium for shareholders and provide Bed Bath the flexibility of the private market could be an ideal outcome for customers, employees and investors.\nWe believe Bed Bath presently satisfies financial sponsors’ interest in specialty retailers with recognizable brands, niche assets and sub-banners, and margin expansion opportunities. A private market participant with a long-term vision could unlock meaningful value by running the core business for cash and initiating a public offering for BABY at the optimal time. After stripping out the sizable costs of being a public company and setting a more focused strategy, we suspect Bed Bath’s core business — excluding BABY — could generate attractive earnings.&quot; </p>\n\n<p>Now ofcourse the debate remains whether original shareholders will see any of these actions that I believe like anyone else will reek benefit for shareholders in Butterfly/bobby, but this is where my conviction lays with RC and the original game plan he had. That ofcourse is the gamble in this play and faith I excepted. You can call me a conspirator or whatever, but all this post aimed for was to show you why I personally decided to become bobby shareholder, at a for me, attractive valuation (cost basis). Stay strong and zen apes, and enjoy life, love y&#39;all</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]