[{"username": "Advanced_Concert3670", "url": "https://www.reddit.com/r/ThePPShow/comments/15km9s9/for_german_exchange_apes_detailed_instructions/", "time": 1691418450.0, "subreddit": "r/ThePPShow", "title": "FOR GERMAN EXCHANGE APES: Detailed instructions how to transfer shares from broker to IBKR.", "text": "<!-- SC_OFF --><div class=\"md\"><p>As promised, this post is about transferring shares from your current broker to IBKR. The post will explain carefully each step to take so the transfer of the shares will go smoothly. I transferred my shares not long ago, they landed on IBKR on Thursday 3.8. and now I am in process of converting them to BBBYQ. I have got two different representatives today at IBKR end to confirm that transferring shares to their platform is still possible.</p>\n\n<p>First thing you need to do is open an IBKR account. To open an account you need to go thru various steps so make sure you have a credit card invoice (or similar ) close by and I think you also need to verify your address with location services on your phone. When opening the account, please follow the instruction below to ensure OTC-trading. OTC-trading permission is crucial in order to receive the right to trade BBBYQ. </p>\n\n<p>--------------------------------------------</p>\n\n<p>Settings on IBKR under Financial profile to trade OTC stocks:</p>\n\n<p>Income and worth:</p>\n\n<p>-Annual net income 50-100k</p>\n\n<p>-Net worth 200-400k</p>\n\n<p>-Liquid net worth: 200-400k</p>\n\n<p>&#x200B;</p>\n\n<p>Source of wealth (might be irrelevant)</p>\n\n<p>-70% income from emplyoment</p>\n\n<p>-20% property</p>\n\n<p>-10% market trading profits</p>\n\n<p>&#x200B;</p>\n\n<p>Investment objectives &amp; intended purpose of trading (tick three options):</p>\n\n<p>-Growth</p>\n\n<p>-Hedging</p>\n\n<p>-Profits from active trading and speculation</p>\n\n<p>&#x200B;</p>\n\n<p>Investment experience:</p>\n\n<p>-Options experience: over 10 years</p>\n\n<p>-Trades per year 11-25</p>\n\n<p>-Options knowledge extensive knowledge</p>\n\n<p>Stocks knowledge same as above</p>\n\n<p>&#x200B;</p>\n\n<p>Bonds experience (might be irrelevant) same as above</p>\n\n<p>&#x200B;</p>\n\n<p>Then you submit your request and it should be approved in two days. After that you can opt in trading otc as follow: settings-&gt; trading permissions -&gt; stocks add/edit - tick otc stocks.</p>\n\n<p>&#x200B;</p>\n\n<p>Detailed instructions of enabling the OTC-trading for them who are completely new on IBKR:</p>\n\n<ol>\n<li>Tick welcome ’your name’ from the top right corner -&gt; settings.</li>\n<li>Find on the left hand side trading permissions, click that.</li>\n<li>You see stocks on top left corner under ”trade worldwide”. Click add/edit and find all North America and tick United States <strong>(penny stocks)</strong></li>\n</ol>\n\n<p>--------------------------------------------</p>\n\n<p>UPDATE: USE CASH ACCOUNT, NOT MARGIN. It will work.</p>\n\n<p>After the IBKR account is set up you should begin by transferring funds to your account. I have read the funds take some time to settle so I would transfer rather more than less, 50 euros will do great. After the money has arrived on your account, I would transfer 50% of it to USD (IF YOU ARE WILLING TO DRS). This is because some of the expenses are paid in your base currency (most likely euros) and some of the expenses are paid in USD (DRS is paid in dollars). Having sufficient amount of money on both currencies ensures the whole transferring process is flawless from shares arriving to your account, being converted to BBBYQ and maybe DRSing them. The money should arrive in a couple of hours after deposit and the possible conversion of the funds should be handled immediately as long as the exchange is open. As said, some users have reported that the funds have to settle first, I dunno if this is true. If its true, the settling of the funds might take two days.</p>\n\n<p>After transferring funds to your account (don’t have to wait for them to arrive) you should carefully follow the instructions that can be found below. Just find your broker, replace GME with BBY and you are good to go. BBY’s ISIN: US0758961009</p>\n\n<p><a href=\"https://www.drsgme.org/register-from-broker\">https://www.drsgme.org/register-from-broker</a></p>\n\n<p>&#x200B;</p>\n\n<p>After requesting transfer of positions on IBKR end, sending the email to your current (German) broker with the signed letter and screenshot of your interactive broker site, all you have to do is wait. For me it took exactly a week for the shares to arrive at IBKR.</p>\n\n<p>While you are waiting for the shares to arrive to IBKR, you can ask from your current broker to get a list of your purchase history of BBY. The info you need is acquisition date and total cost. You might be able to find it this by yourself going thru your purchases. You need this info in order to change your cost basis on IBKR end as most likely it is well above the one on IBKR. This is due to the fact that IBKR uses the current price of conversion time to determine the cost basis of your shares. After the shares have arrived on IBKR platform you can change the cost basis as follows:Performance &amp; reports -&gt; Tax documents -&gt; Position transfer (on the right hand side below the blue box)</p>\n\n<p>After changing the cost basis you should send a message where you request a conversion of your BBY shares to BBBYQ. Do this by clicking “Help” on the top right corner -&gt; Secure message center. Message as follows:</p>\n\n<p>--------------------------------------------</p>\n\n<p><em>Subject: Perform Sector Transfer</em></p>\n\n<p><em>Body: Dear Support Team, please proceed with sector transfer for account UXXXXXXXXXXX to convert XXXX(number of stocks) stocks of BBY ISIN: US0758961009 to BBBYQ ISIN US0758961009. I agree to charge my account with the fee for transfer.</em></p>\n\n<p>--------------------------------------------</p>\n\n<p>The perform transfer has a processing fee is USD 10, however, it will be charged in your base currency (EUR most likely). The conversion of the shares should not take longer than two days, depending on how quickly they react to your message.</p>\n\n<p>FOR PEOPLE WHO WANT TO DRS:</p>\n\n<p>After they have been converted to BBBYQ if you are willing to DRS I think you have to let the shares settle which could take two days. I am not 100% sure about the settling time, this is a guess. Find detailed instructions how to DRS from the link below:</p>\n\n<p><a href=\"https://www.drsgme.org/drs/direct-register-shares-from-interactive-brokers\">https://www.drsgme.org/drs/direct-register-shares-from-interactive-brokers</a></p>\n\n<p>NOTE: DRS costs 5 dollars for each batch to be DRSed. This is why its important to have money in USD as well if you are willing to DRS.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Advanced_Concert3670", "url": "https://www.reddit.com/r/ThePPShow/comments/15kdgss/for_the_german_exchange_users/", "time": 1691393039.0, "subreddit": "r/ThePPShow", "title": "For the German exchange users", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Advanced_Concert3670", "url": "https://www.reddit.com/r/ThePPShow/comments/15kdgss/for_the_german_exchange_users/", "time": 1691393039, "subreddit": "r/ThePPShow", "title": "For the German exchange users", "text": "I wanted to let you know that transferring shares from the German exchange is possible to IBKR. Furthermore the conversion from BBY to BBBYQ can be done with out any issues. Will make a detailed post about this process later, hopefully tonight. There is hope ❤️ \n\nIf you consider doing this, start by opening an IBKR account. Post with detailed instructions will be available later.", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]