[{"username": "Aggravating-Water778", "url": "https://i.redd.it/o639tz9n4kyb1.jpg", "time": 1699202236.0, "subreddit": "r/ThePPShow", "title": "Requested to make this a separate post instead of a comment to give more 👀's - explanation of transaction ID on statements regarging Reorganization of Common Stock (REORCM):", "text": "<!-- SC_OFF --><div class=\"md\"><p>This isn&#39;t specific to Fidelity, it is however specific to the EXCHANGES - direct from NASDAQ - Reorganization of Common Stock: Any transaction involving the issuance of stock or cash, or the cancellation of stock tendered by a shareholder, SUCH AS IN THE CASE OF A MERGER, ACQUISITION OR TENDER OFFER! I think this says it all folks... IN WRITING, DIRECT FROM THE SOURCE(S), exchange and brokerage... I welcome any shills or shorts to challenge this exact verbiage and proof... 🩳 r f&#39;d!!! 🌙 SOON!!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/o639tz9n4kyb1.jpg\"/></div>"},
{"username": "Aggravating-Water778", "url": "https://www.reddit.com/r/ThePPShow/comments/17buyk6/finra_rule_11530_delivery_of_securities_called/", "time": 1697752851.0, "subreddit": "r/ThePPShow", "title": "FINRA Rule 11530: Delivery of Securities Called for Redemption or Which Are Deemed Worthless", "text": "<!-- SC_OFF --><div class=\"md\"><pre><code> I&#39;m not sure why this isn&#39;t getting more eyes and attention but I think it is a very bullish indicator.  I&#39;ve brought it up on X and PP but not as a direct post since I requested Jake and OKBets to look into it to potentially give it more views,  but I know those guys are busy with their own investigations and DD, so I thought I&#39;d go ahead and post to get this out there for comment and fresh eyes.  See link here:\n</code></pre>\n\n<p><a href=\"https://www.finra.org/rules-guidance/rulebooks/finra-rules/11530\">https://www.finra.org/rules-guidance/rulebooks/finra-rules/11530</a></p>\n\n<p>Per FINRA 11530,  a certificate of stock or a bond shall cease to be a good delivery upon publication of notice of call for redemption, except when an entire issue is called for redemption and except against transactions in &quot;called stock&quot; or &quot;called bonds&quot; dealt in specifically as such - but in order for FINRA to act on this rule and call for the redemption of shares,  the specific term &quot;worthless&quot; has to be used. </p>\n\n<p>(b) Securities Deemed Worthless</p>\n\n<p>(1) In contracts for securities where a public announcement or publication of general circulation discloses that the securities have been deemed worthless, deliveries shall consist of (A) the worthless securities or (B) a Letter of Indemnity which shall grant the purchaser any rights and privileges which might accrue to the holders of the physical securities.</p>\n\n<p>A stock REDEMPTION is a transaction in which a corporation acquires its own stock from a shareholder in exchange for cash or other property. The redeeming corporation generally does not recognize gain or loss, unless it distributes appreciated property.</p>\n\n<p>Comments and other interpretations of this rule are welcomed as I&#39;m not a lawyer, but I did sleep in a Holiday Inn last night...</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]