[{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/17ino9l/why_phil_and_shorts_may_not_be_fully_closed_in/", "time": 1698528742.0, "subreddit": "r/ThePPShow", "title": "Why Phil and shorts may not be fully closed. \"In This Never-Ending Lehman Short, $170,000 Is Still on the Table\"", "text": null, "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/17e1ddx/time_for_a_lineup_change/", "time": 1698003545.0, "subreddit": "r/ThePPShow", "title": "Time for a line-up change", "text": "<!-- SC_OFF --><div class=\"md\"><p>I think if we switch things up, it will throw off our opponents and help us win. Suggest the following.  </p>\n\n<ol>\n<li>PP switches with Kais and takes over stalking/hacking/identity theft duties. Dress PP like an Orthodox Jew, send him down to the Shul and covertly give RC words of encouragement.</li>\n<li>U-Copy starts running the show; should turn into complete chaos with more stammering than Neely Das on meth.</li>\n<li>Kais takes over TA and starts drawing giant green dildos on the chart with swastikas as the testicles.</li>\n</ol>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/17cktvq/panic_at_virtu/", "time": 1697834230.0, "subreddit": "r/ThePPShow", "title": "Panic at Virtu", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gah30cnl4fvb1.png?width=635&amp;format=png&amp;auto=webp&amp;s=1473d5fd3bae5ce8eed8a0b03656f0eb1f864db2\">Dougie can&#39;t understand why HODLers are still Zen</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/h9k24DSgPmL9tWOFu36h7MImMtKofaPPJjsTAZvSAeY.jpg\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/16ljrld/lets_get_ready_to_rumble/", "time": 1695005264.0, "subreddit": "r/ThePPShow", "title": "Let's get ready to rumble", "text": "<!-- SC_OFF --><div class=\"md\"><p>Greetings, it&#39;s your local grumpy prick Negative AJ here, just throwing my two cents in the ring. I came on PPs show last winter when it was just PP and ABC and was probably the first to suggest that what is playing out right now would happen, my thesis being that RC was targeting these companies like GME and BBBY to turn around not because he loves videogames or home goods, but because these are over-shorted stocks that would hold great potential for upward pressure if they could survive and endure, maybe being attached to an entirely new operation/ticker. While most of the kooks on this sub were talking about legit turnaround plans like reducing store count, bringing in new product lines, and going on shopping excursions to show your support, supporting Sue Gove like the AMC nuts support Adam Aron, etc, I myself believed that none of this was going to help, and that an efficient liquidation would take place in which we reduced our costs/debt as much as possible before the big change happened. Lo and behold, here we are.</p>\n\n<p>&#x200B;</p>\n\n<p>On the show back then, I said that IF the shorts were forced to close at some point, they may turn off the buy button, and that if I were the shorts, I would let the stock run a bit so low buyers might exit, crush it back down again, let it run again, crush it back down, etc, creating a sense of hopelessness and doom, so when it does run higher, people will be thanking the heavens to have their opportunity to exit with a small profit. Put yourself in the shorts place; they have good algos, they probably have shares to buy back, so it&#39;s a matter of how long you can hold before you crack. Remember how GME ran, with many ups and downs, over several days, before the button was turned off. Hopefully shorts will really be forced to close fast and hard; would be nice to wake up to a buyout at 80/share.</p>\n\n<p>&#x200B;</p>\n\n<p>Don&#39;t get greedy; this whole play is most likely being overseen by the government, as much as you would like to hope, there are specific reasons they are allowing this thing to go on, RC has his own connections and we seem to have some big money on our side, government will NOT allow a bunch of kooks to crash the global financial system, it&#39;s just not going to happen, so get over it.</p>\n\n<p>&#x200B;</p>\n\n<p>IMO we were on our way to run to 60-80 before we got kneecapped, that&#39;s my target price, but since we dropped lower, there are many people who own shares in the pennies and I don&#39;t see Sundevil holding until he&#39;s a billionaire, but who knows? We have done a good job of holding and waiting out the pressure, we can tell from the shilling all over the Internet.</p>\n\n<p>&#x200B;</p>\n\n<p>I still believe AMC is connected somehow and will need to be dealt with, eventually. Those execs suck and they need a hostile takeover. Still hoping RC or another friendly buys a stake and starts putting pressure on.</p>\n\n<p>&#x200B;</p>\n\n<p>Good luck to all.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/15odnmi/my_ta_shows_that_kastin_etlin_and_gove_will_look/", "time": 1691771709.0, "subreddit": "r/ThePPShow", "title": "My TA shows that Kastin, Etlin and Gove will look at my LinkedIn profile sometime within next week", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/15odnmi/my_ta_shows_that_kastin_etlin_and_gove_will_look/", "time": 1691771709, "subreddit": "r/ThePPShow", "title": "My TA shows that Kastin, Etlin and Gove will look at my LinkedIn profile sometime within next week", "text": "&#x200B;\n\nhttps://i.redd.it/aka26oeudihb1.gif", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/SxXt5loM08Ng-OyG1zWS5CkkJIoho6bWGvnw13zOb54.jpg\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/15ms44e/colin_anten_revealed_coming_at_you_live_from_the/", "time": 1691616455, "subreddit": "r/ThePPShow", "title": "Colin Anten revealed, coming at you live from the courtroom", "text": "Anybody recognize this legal genius?\n\n[https://app.heygen.com/videos/6d7ccf4e31a84cb4973ba3937044a6ed](https://app.heygen.com/videos/6d7ccf4e31a84cb4973ba3937044a6ed)\n\n&#x200B;\n\n&#x200B;", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/15ms44e/colin_anten_revealed_coming_at_you_live_from_the/", "time": 1691616455.0, "subreddit": "r/ThePPShow", "title": "Colin Anten revealed, coming at you live from the courtroom", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/15i6q9v/if_only_the_shills_were_smart_enough_to_shut_up/", "time": 1691171203.0, "subreddit": "r/ThePPShow", "title": "If only the shills were smart enough to shut up", "text": "<!-- SC_OFF --><div class=\"md\"><p>My thesis has always been that the stock itself is the prize; in fact, all of these short basket stocks are probably over-shorted beyond belief, and when the team goes around saving each one, they can then consolidate them into one lean company. Sales, debt, NOLs, assets, distribution centers, none of these really matter; the team will cut a ton of fat, get costs way down, and keep what they want. Even if we have to spend a few billion wiping out the debt, there is probably tens of billions stuck in the short positions. Apes keep buying the stock while it becomes harder and harder for shorts to reset their swaps/positions and kick the can. Even with some dilution, if these stocks are shorted like we think they are, there is no escape as long as the stocks themselves keep trading and simply get moved onto the newer, better entity.</p>\n\n<p>The fact that so many shills spend so much time endlessly replying to us, yelling at us to explain what assets are left, how we&#39;re soon going to zero, I&#39;ve never seen so many humans spend so much time on something that doesn&#39;t concern them, and it&#39;s quite bullish. Maybe if they just shut up, then some people would lose interest and decide not to buy in that day. My only concern is how long it will take to see some progress, and how much rebound we will get in the share price.</p>\n\n<p>Come on, team, let&#39;s hurry it up! We aren&#39;t billionaires like you guys, we&#39;ve done our part, help us out.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/157y7ua/hoping_for_this_headline_when_i_wake_up_tomorrow/", "time": 1690167259.0, "subreddit": "r/ThePPShow", "title": "Hoping for this headline when I wake up tomorrow morning: \"Ryan Cohen Takes 10% Stake In AMC And Lists Demands For Change.\"", "text": "<!-- SC_OFF --><div class=\"md\"><p>Another over shorted company with crap execs in the short basket ripe for a turnaround. Let&#39;s manifest it . Sleep tight.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/151m31t/the_power_of_retail_manifesting_success/", "time": 1689552527, "subreddit": "r/ThePPShow", "title": "The Power of Retail: Manifesting Success", "text": "So we already know, for a fact, that the price is fake. The real price of our shares has been estimated to be between anywhere from 60/share to 5k/share. We all know that the only reason the objective truth of our valuation isn't being acknowledged is crime and manipulation. So, how do we force the price to change? I believe we can do this through the sheer force of will. In the dating world this is called \"Manifesting.\" Apes can do this through the legal system and banking system through a series of steps.\n\n&#x200B;\n\n1. As a group, contact our brokerages and under the threat of legal action, demand our share price be revalued to the true amount.\n\n&#x200B;\n\n2. If brokers do not capitulate, approach our respective banks and explain to them that the price is wrong due to crime, that a drastic rise in share price is inevitable and imminent, and that the value of our shares should be adjusted accordingly to our beliefs. Once the banks are on our side, we should have access to the true valuation of our wealth. We have now successfully stepped outside of the corrupt system and changed the world.\n\n&#x200B;\n\nPart of breaking the corrupt system is ignoring the constraints they place upon us. If we simply act like the millionaires that we already are, and act like the \"tomorrow\" that we talk about is already here, then we will instantly have access to our wealth and we can begin Lambo purchases en masse.\n\n&#x200B;\n\nI'm glad to be a part of this group. Any disagreements will be marked as shill/FUD.", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/151m31t/the_power_of_retail_manifesting_success/", "time": 1689552527.0, "subreddit": "r/ThePPShow", "title": "The Power of Retail: Manifesting Success", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/14n7tpw/can_we_keep_this_sub_for_more_indepthfactbased/", "time": 1688148905.0, "subreddit": "r/ThePPShow", "title": "Can we keep this sub for more in-depth/fact-based stuff?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/14n7tpw/can_we_keep_this_sub_for_more_indepthfactbased/", "time": 1688148905, "subreddit": "r/ThePPShow", "title": "Can we keep this sub for more in-depth/fact-based stuff?", "text": "We're being taken over by the weirdo basement-dweller main sub meme posters, it's just the same worthless fluff being cross-posted, mods can you try to weed it out a bit? It's the usual \"tomorrow, goalposts, what lambo you buying, 1 trillion/share, etc\" crap that has taken over all meme stock subs. Thanks.", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AJ_LA1313", "url": "https://www.reddit.com/r/ThePPShow/comments/13s5j88/jpm_seems_desperate_for_cash/", "time": 1685083254.0, "subreddit": "r/ThePPShow", "title": "JPM seems desperate for cash", "text": "<!-- SC_OFF --><div class=\"md\"><p>I recently saw some incentives to open checking and savings accounts with Chase bank. I opened an account to get a $500 bonus and deposited 2k with the intent to leave it there for a few months and get the bonus. I had problems setting things up online, so I gave them a call, verified a bunch of info, only for them to say that I need to visit them at a branch and verify my identity. I don&#39;t have one in my city, so I told them just to close the account and return my money. They told me they can&#39;t return my money until they verify my identity, even though I asked them to return it to the same account it came from. There are some other folks online reporting the same situation. Sounds like a nice way to bait people into sending money over, then holding onto it and using it for collateral in a time of need.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🔴 Negative Nancy 🔴", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]