[{"username": "alias__grace", "url": "https://www.reddit.com/r/ThePPShow/comments/14n89vx/the_sixth_street_bid_lets_discuss/", "time": 1688149969.0, "subreddit": "r/ThePPShow", "title": "The Sixth Street bid… let’s discuss", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "alias__grace", "url": "https://www.reddit.com/r/ThePPShow/comments/14n89vx/the_sixth_street_bid_lets_discuss/", "time": 1688149969, "subreddit": "r/ThePPShow", "title": "The Sixth Street bid… let’s discuss", "text": "Hey Bobby’s, I don’t have enough karma to post in the main sub but I know there are a lot of smart regards over here, so figured I would give this place a go.\n\nI wanted to open a thread to discuss the Sixth Street bid. From what we know it was a bid for $500M in debt relief for what I believe was for the entire company. Please correct me if I’m wrong. \n\nWhat I would like to get your opinions/thoughts on is the following:\n\n- What do you think (or know) they intend to do with BoBBY if their bid was accepted? Were they continuing as a going concern? Sell for parts? \n- Were they taking on all debt/liabilities in this deal? \n- Why is their bid not being serious considered but instead we’ve been accepting much lower bids for the IP? \n\nLike most things with this play over the last 6-12 months, there are a lot of question marks and/or just odd decisions being made by the BOD/BoBBY legal team. Leads me to believe they might have something interesting cooking, but I can’t help but also sometimes worry that the reality could be much different. \n\nI haven’t seen this question seriously discussed so please share your thoughts. \n\n\n(Also feel free to x-post in the main sub if you have the karma to do so and if you think a wider discussion would be more helpful!)", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]