[{"username": "Allforbbby", "url": "https://i.redd.it/ak272buhlc0c1.jpg", "time": 1699982743.0, "subreddit": "r/ThePPShow", "title": "Repost for understanding - https://www.reddit.com/r/ThePPShow/s/RA3M2FnQ7l", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.reddit.com/r/ThePPShow/s/RA3M2FnQ7l\">https://www.reddit.com/r/ThePPShow/s/RA3M2FnQ7l</a></p>\n\n<p>In light of the recent documents noting the resurgence of the Nefarious UCC and UBG</p>\n\n<p>I’ve reposted the above to aid understanding of what happened a few months back.</p>\n\n<p>Well done boys - last hurdle for that one - now onto the home straight…</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ak272buhlc0c1.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://v.redd.it/s8l5oyopskmb1", "time": 1694081493.0, "subreddit": "r/ThePPShow", "title": "Ooh! Ape abilities", "text": null, "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/F1JaEst2VW5yfuqIcq02eMajzfFlZjzo-F6X9_r2Npo.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/1684ue9/hargreaves_lands_down_uk/", "time": 1693667164.0, "subreddit": "r/ThePPShow", "title": "Hargreaves lands down - uk", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi all</p>\n\n<p>Just wanted to check with others with HL in the uk.</p>\n\n<p>Are your shares still showing in your  account?</p>\n\n<p>The bbbyq symbol on mine has turned back to bbby with no monetary value?</p>\n\n<p>Just wanted to see if this has happened to others before I kick up a storm with HL on Monday.</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/15b1khc/do_we_need_to_start_saying_dummy_and_not_pacifier/", "time": 1690463560.0, "subreddit": "r/ThePPShow", "title": "Do we need to start saying DUMMY and not pacifier?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Great job on the stream last night. I find it difficult to join up, as would love to come on, but the time difference is a killer for me!</p>\n\n<p>Something really stood out for me during the interview with <a href=\"/u/realpulte\">u/realpulte</a> last night - he used the word dummy when talking about Baby and the RC investment potential - I don&#39;t have the time stamp.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rca8oh4x2ieb1.png?width=186&amp;format=png&amp;auto=webp&amp;s=0a957034b4654424e8366709dfd8c54067c28cbb\">Don&#39;t take RC for a dummy</a></p>\n\n<p>This triggered a thought, which has long been at the back of my mind and something I&#39;ve previously discussed with <a href=\"/u/real_eyezz\">u/real_eyezz</a>.  - NFA as always.</p>\n\n<p>Settle in, grab your cheeky whisky and keep reading [this is a bit of a long one] - </p>\n\n<p>Where is a more secure place to launch an IPO - with lower entry requirements and &quot;free&quot; from market manipulation [to the extent we see in North American markets] - The London Stock Exchange.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/g9fv7eha3ieb1.png?width=290&amp;format=png&amp;auto=webp&amp;s=9a983b6820c3204978a643c24eea0af5e78f54d5\">Time for the Blockchain?</a></p>\n\n<p>Before we go into this a little further - see here <a href=\"https://www.cnbc.com/2019/05/02/london-stock-exchange-ceo-on-blockchain-and-cryptocurrency.html\">https://www.cnbc.com/2019/05/02/london-stock-exchange-ceo-on-blockchain-and-cryptocurrency.html</a> - The Blockchain conversation has been going on for a number of years in relation to the LSE.</p>\n\n<p>Let&#39;s take a few examples to start here [below is helped by various research articles]:</p>\n\n<p>An Alabama-based oil and gas company that raised nearly $800m in equity and completed 11 acquisitions with a value of $1.8bn in 3 years. A San Francisco-founded payments technology company that has provided a profitable exit for its market leading VC investors, while also making strategic acquisitions. A New York-based life sciences company which raised $50m and less than two years later successfully dual listed on Nasdaq. Each one of them has successfully raised funds from blue-chip investors during the COVID pandemic.</p>\n\n<p>They have one thing in common. They are all listed on London’s public markets.</p>\n\n<p>For growth-hungry North American CEOs seeking to use the capital markets to build billion-dollar-plus businesses, a London IPO could well be your optimal route.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nbmcc63p4ieb1.png?width=275&amp;format=png&amp;auto=webp&amp;s=8688f5641396e11643fbe200b0aa333c7fc3b770\">Looking at all the options?</a></p>\n\n<p>First, let’s deal with four big and common misperceptions.</p>\n\n<p><strong>The US perception:</strong></p>\n\n<p>You need to be a unicorn to IPO.</p>\n\n<p><strong>The UK reality:</strong></p>\n\n<p>Simply not the case.</p>\n\n<p>On AIM you can IPO at a significantly smaller size compared to the US markets. In recent years, the average market capitalization of an AIM company at IPO has been $120m, compared to nearly $1bn on Nasdaq[1].</p>\n\n<p>And AIM provides rich soil from which smaller companies can grow in scale and value. London can even provide a platform for a US company to raise capital and execute a US listing when it has achieved greater scale. (Just read the growth stories below).</p>\n\n<p><strong>The US perception:</strong></p>\n\n<p>It’s too expensive to become and remain a public company.</p>\n\n<p><strong>The UK reality:</strong></p>\n\n<p>Nobody is saying that the process is cheap but the comparison between London and the US exchanges will get your CFO excited. The costs of executing and maintaining a stock market listing is typically much lower in London. Underwriting fees, for example, will typically be 3-5% in London compared to 6-7% in the US[2].</p>\n\n<p>And the ongoing cost and time of quarterly reporting? London mandates half-yearly reporting, therefore reducing the reporting burden on companies and allowing them to focus on longer-term objectives.</p>\n\n<p>Now let’s also get your General Counsel excited. The litigation risk is lower in London. Take a look at 2019 – in just one year 8.9% of all US exchange listed companies were sued. Securities litigation against UK listed companies is simply far less frequent with just three class actions since 2010[3].</p>\n\n<p><strong>The US perception:</strong></p>\n\n<p>IPO under-pricing has become the norm.</p>\n\n<p><strong>The UK reality:</strong></p>\n\n<p>Lack of certainty about valuation is much less of a factor in the UK. That’s because the UK has superior price discovery mechanisms throughout the IPO process, enabling management teams and their advisers to get feedback from investors from the start and to better understand the likely valuation outcome.  </p>\n\n<p>A big IPO “pop” is not a feature of a London IPO. Since the start of 2017, for IPOs larger than $10m in size, there has not been a single UK IPO which “popped” more than 50% on the first day of trading, by contrast, in the US, there have been 174.</p>\n\n<p><strong>The US perception:</strong></p>\n\n<p>Liquidity and access to capital only lies in the US markets.</p>\n\n<p><strong>The UK reality:</strong></p>\n\n<p>London offers North American growth companies the opportunity to efficiently raise repeat long-term capital from international and UK domestic institutional investors. List in London, and you are accessing capital from across the world.</p>\n\n<p>London has more international companies than any other major exchange. It raised 30% of all the world’s cross-border IPO capital in 2019. It stands head and shoulders as Europe’s largest exchange. In H1 2020, there have been 342 follow-on transactions on London Stock Exchange, raising about $28bn[4]. That represents three times more transactions and three times more in IPO and follow-on proceeds than the next most active European exchange.</p>\n\n<p>This depth and scale of capacity means that companies can finance ambitious growth strategies with long-term, repeat capital raisings. It also means that pre-IPO investors can sell down their stakes both at IPO and in the aftermarket even for growth companies. London-listed US-based companies such as Boku, Polarean Imaging, Diversified Gas &amp; Oil, Renalytix and MaxCyte all raised follow-on capital during the current COVID-19 crisis.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rcetzu564ieb1.png?width=209&amp;format=png&amp;auto=webp&amp;s=37a44f508ba62e44e3bf480aa1b107425bc5b6fd\">Covid -19 also provided opportunity against the tide</a></p>\n\n<p><strong>Three growth stories</strong></p>\n\n<p>So there is ample evidence of the high levels of investor and analyst receptivity in London relative to North America towards companies with valuations between $50m to $1bn.</p>\n\n<p>This environment has enabled a number of exceptional North American businesses to scale rapidly.</p>\n\n<p><strong>AIM: a gateway for North American companies back to the US capital markets</strong></p>\n\n<p>For some North American businesses, London has provided the capital to grow and gain critical mass before achieving a dual listing on a US exchange. There are good recent examples.</p>\n\n<p>Take RenalytixAI, a developer of artificial intelligence (AI) enabled clinical diagnostic solutions for kidney disease headquartered in New York City. From its inception, the strategy was to develop RenalytixAI as an independent company and take it to the public markets. While its business model was focused initially on commercialization with large US healthcare systems, much of the cornerstone financing came from UK institutional investors. Its IPO took place in November 2018 on AIM raising $29m with a market capitalization of $81m.</p>\n\n<p>For RenalytixAI, AIM was an attractive option for numerous reasons. It provided a broad institutional shareholder base and the capacity to raise sufficient capital for its product development, with all the corporate governance and reporting disciplines of the public markets. Unlike the capital structures of VC-backed companies, the shareholding structure was clean and simple.</p>\n\n<p>The company was able to return to the market to raise a further $17m in July 2019, bringing in other significant institutional investors and providing plenty of runway to execute without having to be concerned about external political or market factors.</p>\n\n<p>In 2020 RenalytixAI announced its plans for a dual listing on Nasdaq and raised $85.1m in July 2020 and now has a market capitalization exceeding $500m.</p>\n\n<p>So, can you see where we are going here?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7dm4114f4ieb1.png?width=329&amp;format=png&amp;auto=webp&amp;s=22bfaa8efd37dc75031aac24b3cd26adb2bd788a\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/7dm4114f4ieb1.png?width=329&amp;format=png&amp;auto=webp&amp;s=22bfaa8efd37dc75031aac24b3cd26adb2bd788a\"></a></p>\n\n<p><strong>Achieving a sell-down for Silicon Valley VC investors and also securing follow-on finance for strategic acquisitions</strong></p>\n\n<p>An IPO for a VC-backed tech firm with a sub-$1bn valuation is a rarity in the US. It’s hard not being a unicorn.</p>\n\n<p>But San Francisco-founded Boku, a world leading independent direct carrier billing network, has shown how a US-based company can go public in London and deliver an exit for its VC investors while also scaling up through acquisitions.</p>\n\n<p>Founded in 2008, it had previously raised $87m in six funding rounds with VCs including Andreessen Horowitz, Benchmark, Index, Khosla and NEA. </p>\n\n<p>While the management team of Boku saw an IPO as the most effective way of balancing the interests of many stakeholders, the company was not large enough to list on Nasdaq. A London listing provided the way forward and raised the profile and coverage of Boku - the future of payments.</p>\n\n<p><a href=\"https://preview.redd.it/8969pfwk4ieb1.png?width=482&amp;format=png&amp;auto=webp&amp;s=0f039340e8de034797a9adabe3a746fb561ea8b7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/8969pfwk4ieb1.png?width=482&amp;format=png&amp;auto=webp&amp;s=0f039340e8de034797a9adabe3a746fb561ea8b7\"></a></p>\n\n<p>Its IPO on AIM over three years ago was unusual by US standards; approximately two-thirds of the $59m deal size was a sell-down by VC investors, enabling partial cash exit at the point of IPO. Another accelerated sell-down occurred ten months later and the VCs have continued to monetize their stakes so that none remain significant shareholders. All this for a company with less than $25m of annual revenue, negative EBITDA and a market capitalization below $175m at the time of IPO. </p>\n\n<p>Boku has also been able to issue new shares to fund two strategic acquisitions.</p>\n\n<p><strong>Raising capital for an acquisition-led growth strategy</strong></p>\n\n<p>Since its IPO, Alabama-based Diversified Oil &amp; Gas (DGOC) has executed 11 acquisitions for a total value of $1.8bn and five follow-on primary equity capital transactions raising a total of around $785m. In 2020, the company has stepped up from AIM onto London’s Main Market. Its market capitalization has soared from $86m at IPO to just over $1bn.</p>\n\n<p>Why did this conventional natural gas and crude oil producer in the US Appalachian basin list in London? For one, its focus on conventional oil and gas was out of favor with US investors, whose gaze was fixed on shale. Besides, DGOC was sub-scale for the US markets. In London, though, the company has been able to tap into high-quality institutional pools of money to enable it to grow at scale and pace. </p>\n\n<p>Many North American founders, management teams and VC investors have preconceptions about what makes an IPO feasible, particularly when it comes to the size of the business. The successful IPOs in London of North American companies shatter these preconceptions. In London, you don’t have to be a unicorn to IPO. There is deep liquidity in London and access to high-quality institutional capital at an earlier and smaller size range than in the US – and usually at a lower cost. A London listing can be the springboard for your growth ambitions and, as these success stories show, that’s no misconception. </p>\n\n<p>Let&#39;s just remind ourselves what was registered on 12 May in the UK [Ok, and other places, but...] - TEDDY in the UK - <a href=\"https://trademarks.ipo.gov.uk/ipo-tmcase/page/Results/1/UK00003910897\">https://trademarks.ipo.gov.uk/ipo-tmcase/page/Results/1/UK00003910897</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/eeesvnym5ieb1.png?width=1661&amp;format=png&amp;auto=webp&amp;s=9a0779348a2f807bf3eb6fc04a7cc19b1fecb75a\">Interested in a cup of tea RC?</a></p>\n\n<p>So, last but not least....</p>\n\n<p>As a final point, the &#39;founder&#39; <a href=\"/u/realpulte\">u/realpulte</a> hinted towards  - could it be this man, Len Bavatnik - <a href=\"https://en.wikipedia.org/wiki/Len_Blavatnik\">https://en.wikipedia.org/wiki/Len_Blavatnik</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/526ezy018ieb1.png?width=267&amp;format=png&amp;auto=webp&amp;s=ff99da68daa26ec092f7017f847c6fee2574c73e\">Can I come on the PP Show?</a></p>\n\n<p>Sir Leonard Valentinovich Blavatnik is a Ukrainian-born American-British business magnate and philanthropist. As of March 2022, Forbes listed his wealth at $35.4 billion, making him somewhere between the 20th- and 33rd-richest person in the world. In 2017, Blavatnik received a knighthood for services to philanthropy.  </p>\n\n<p>In 2010, <strong>Blavatnik sued JP Morgan after losing $100 million</strong> by allegedly following Morgan&#39;s advice three years earlier to buy mortgage securities with AAA credit ratings. In 2013, the New York State Supreme Court ordered JPMorgan Chase to pay Blavatnik $50 million in damages.</p>\n\n<p>At the time, Blavatnik told <em>The New York Times</em>: &quot;The small guy can&#39;t get anywhere with suits like this. I am a wealthy man. I will spend whatever it takes.&quot;</p>\n\n<p>He is willing to take bets and a well known philanthropist,  just lie our very own <a href=\"/u/realpulte\">u/realpulte</a> - see here - <a href=\"https://www.philanthropy.com/article/billionaire-len-blavatnik-pours-money-into-education-medical-research-and-history/\">https://www.philanthropy.com/article/billionaire-len-blavatnik-pours-money-into-education-medical-research-and-history/</a></p>\n\n<p>Also an investor and founder of <a href=\"https://icahn.mssm.edu/research/womens-health\">https://icahn.mssm.edu/research/womens-health</a> with none other than our main man Carl!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/a8kbz5da8ieb1.png?width=228&amp;format=png&amp;auto=webp&amp;s=9949edd380cd8efe01675ff75dba19c3cf9ce2de\">Hey Len, what we doing about this BABY thing.. RC keeps texting me?</a></p>\n\n<p>But.... wait, one final thing...</p>\n\n<p>Big Lenny owns <strong>Access Industries, Inc.</strong> - which is an American privately held <a href=\"https://en.wikipedia.org/wiki/Multinational_corporation\">multinational</a> <a href=\"https://en.wikipedia.org/wiki/Corporate_group\">industrial group</a>.<a href=\"https://en.wikipedia.org/wiki/Access_Industries#cite_note-Bloomberg_about_Access-1\">[1]</a> It was founded in 1986 by businessman <a href=\"https://en.wikipedia.org/wiki/Leonard_Blavatnik\">Leonard &quot;Len&quot; Blavatnik</a>, who is also its chairman. Access&#39;s industrial focus is in four areas: natural resources and chemicals, media and telecommunications,<a href=\"https://en.wikipedia.org/wiki/Access_Industries#cite_note-Bloomberg_about_Access-1\">[1]</a> venture capital<a href=\"https://en.wikipedia.org/wiki/Access_Industries#cite_note-Fortune_Access_in_2017-2\">[2]</a> and real estate.<a href=\"https://en.wikipedia.org/wiki/Access_Industries#cite_note-Bloomberg_about_Access-1\">[1]</a> The group invests in the <a href=\"https://en.wikipedia.org/wiki/United_States\">United States</a>, <a href=\"https://en.wikipedia.org/wiki/Europe\">Europe</a>,<a href=\"https://en.wikipedia.org/wiki/Access_Industries#cite_note-Oxford_in_2011-3\">[3]</a> <a href=\"https://en.wikipedia.org/wiki/Israel\">Israel</a>,<a href=\"https://en.wikipedia.org/wiki/Access_Industries#cite_note-Haaretz_in_Underway_2013-4\">[4]</a> and <a href=\"https://en.wikipedia.org/wiki/Latin_America\">Latin America</a>.<a href=\"https://en.wikipedia.org/wiki/Access_Industries#cite_note-Oxford_in_2011-3\">[3]</a> It is headquartered in <a href=\"https://en.wikipedia.org/wiki/New_York_City\">New York</a>, with additional offices in <a href=\"https://en.wikipedia.org/wiki/London\">London</a> and <a href=\"https://en.wikipedia.org/wiki/Moscow\">Moscow</a>.<a href=\"https://en.wikipedia.org/wiki/Access_Industries#cite_note-Bloomberg_about_Access-1\">[1]</a> [see  wiki]</p>\n\n<p>Blavatnik sponsors a <a href=\"https://en.wikipedia.org/wiki/Colel_Chabad\">Colel Chabad</a> 20,000-square-foot (1,900 m2) food bank and warehouse in <a href=\"https://en.wikipedia.org/wiki/Kiryat_Malakhi\">Kiryat Malakhi</a>, Israel, which sends monthly food shipments to 5,000 poor families in 25 Israeli cities, and before Jewish holidays to 30,000 families in 73 Israeli cities, towns and villages. </p>\n\n<p>And where did that <strong>Israeli connection</strong> come about before... was that ABC who mentioned this... and the <strong>Israeli connection</strong> to Dream on Me... LFG</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/m0541k6p7ieb1.png?width=223&amp;format=png&amp;auto=webp&amp;s=b39b48186ede8ee1ed7d93554256d375dbb3b681\">Lights out!</a></p>\n\n<p>And a little tinfoil - didn&#39;t our beloved papa have a lovely papa of his onw named TED - maybe that is the reason that TEDDY exists and this legacy will live forever - LFG</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/x4dijbipbieb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=a225d781e5a7edda79ccd5ab19727a8af6ea869e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/x4dijbipbieb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=a225d781e5a7edda79ccd5ab19727a8af6ea869e\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/VWZkrdlznDdCEh0d6QPJ9fR7z0NIu0CgOc2TfFuf9Co.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/14mzj97/why_did_greasy_glenn_actually_take_the_podium/", "time": 1688129415.0, "subreddit": "r/ThePPShow", "title": "Why did Greasy Glenn actually take the podium... maybe he'll need some big blue 20% off coupons in a week?", "text": "<!-- SC_OFF --><div class=\"md\"><p>The following has been discussed in the comments today, at request, I&#39;ve made into a post for further decadent dissemination.</p>\n\n<p><a href=\"https://preview.redd.it/0ctamvejh59b1.png?width=275&amp;format=png&amp;auto=webp&amp;s=0e7dcc29afd9334dee7d278b9f31ccf13b0ac3fc\">Are we all sitting comfortably?</a></p>\n\n<p>Helpful update [although, not new information] from greasy Glenn&#39;s new filing [1136 kroll]:</p>\n\n<p>Debtor-in-Possession Loan Facility 40.0 $ ABL Facility - Prepetition 27.8 LC Balance - Prepetition 100.4 FILO Term Loan Facility - Prepetition 547.1 Capital Lease Obligation 61.5 Total Secured Debt 776.8 $ 3.749% Senior Notes Due 2024 - Prepetition 215.4 4.915% Senior Notes Due 2034 - Prepetition 209.7 5.165% Senior Notes Due 2044 - Prepetition 604.8 Total Unsecured Debt 1,029.9 </p>\n\n<p><strong>$ Total Funded Debt 1,806.7 - Not new, just confirming.</strong></p>\n\n<p><strong>Why are the UBG still trying to get the motion passed? - Doc 1136</strong> <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DocketInfo\"><strong>https://restructuring.ra.kroll.com/bbby/Home-DocketInfo</strong></a></p>\n\n<p>If a bondholder demands payment at maturity [which is what the UBG/AHB is trying to do here], the company can <strong>choose</strong> to make the payment or surrender equity in the company.</p>\n\n<p>If the company does not have enough funds to make the promised payment to the bondholders, the bond converts automatically into equity—a transaction not requiring bankruptcy—and the firm also issues new debt with a longer maturity in exchange for the old debt.</p>\n\n<p>What I think the underlying argument here is that the UBG <strong>don&#39;t want equity</strong>, they want paying immediately... as we are in ch 11 there is along way to go and automatic payment would only kick in on BK. This is why the DIP being granted was argued, basically UBG were saying that ch11 was not required and the business should have stood on its own and thus folded [we all know the end route there]. If Glenn had won, they would have had cancel the dip &#39;package&#39; and pretty much straight to ch7.</p>\n\n<p>Back to the first point, if the company survives as &#39;<strong>A GOING CONCERN</strong>&#39; bondholders don&#39;t get paid outside of the normal remit and the company could choose to re-issue the bonds and simply offer equity to repay bondholders.</p>\n\n<p>Now, we are in the last run here, taking this and the long arranged &#39;DIP&#39; package... I would pretty confident [NFA] that <strong>we are going to see a new company spawn from the ashes</strong> [as all the IP has been sold as well!].... the UBG are aware of this [vaguely] and don&#39;t want equity in the new company... if it Jake the snake, his hedge with CDS and similar will only work with BBY and the bonds. He and others needed BK.</p>\n\n<p>Instead, they can now be offered some lovely new shares [DRS/registered/poss NFT] in our lovely <strong>TEDDY</strong> - NFA as always.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hcidrfnyh59b1.png?width=194&amp;format=png&amp;auto=webp&amp;s=672cebff3dd6a661089b5f6084a1887bdb6dee7f\">Kissy Kissy Jakey Boy</a></p>\n\n<p>The argument here is that  the UBG could be offered equity rather than cash. Which, if the new company moves to a new CUSIP/reissue, they definitely don’t want. </p>\n\n<p>Remember, a CUSIP change not means shorts are &quot;terminated&quot; (not closed) - I think it is important not to confuse shares that are short and the bonds in this instance [it is easy to get them intertwined in thought].</p>\n\n<p><strong>A new CUSIP will see the short shares, if not closed, just stored on the balance sheet and accumulating interest to be paid/for payment.</strong></p>\n\n<p>In this instance, if the theory that the UBG are holding the bonds in a BK/CDS play - the last thing they want is a new CUSIP, because in this situation they are co-dependent. The CDS relies in a specific CUSIP against the bond.</p>\n\n<p>The paper by JF analyzes the effectiveness of hedging a defaultable bond, that may not be at par, with a credit default swap (CDS) by quantifying the variance of the hedging errors and determining the optimal hedge ratio. <strong>Meaning that there is a point where he bond will not benefit the CDS if it drastically changes in value, or fails to get paid - this is the point that the UBG do not want equity replacement - the CDS fails.</strong></p>\n\n<p>The static hedging framework uses bond recovery and time to default, which are correlated, to calculate the variance of the hedging errors and the optimal hedge ratio for the bond-CDS trade. The results show that there are irreducible risks when hedging a defaultable bond with a CDS; these irreducible risks increase with the magnitude of the premium/discount of the bond and decrease as the correlation between default time and recovery increase. <strong>Meaning that the default time has passed [which, if Greasy Glenn had got his motion passed wouldn&#39;t have happened - the UBG need BK for this to work].</strong> The results also show that the optimal hedging ratio was closer to the bond price than the par value of the bond.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qmi66qgyi59b1.png?width=376&amp;format=png&amp;auto=webp&amp;s=f8dcdb3a0b253244ffbdf31f665315f19671eb23\">Looking straight down the barrel Jakey?</a></p>\n\n<p>The re-issued equity would likely be in a new company - new cusip means the CDS does not work. The attempted CDS fails on the short side [stuck on balance sheet] and fails on the bond side [due to re-issue with new terms/dates etc or via equity].</p>\n\n<p>I would suggest that JF was hoping to make about $500 million via the CDS [which is the approximate amount he offered for BABY last year] - it was another failsafe for the CDS and the overall &#39;scheme&#39; - the company would have failed and he would have walked away with this &#39;amount&#39; whatever the outcome - multiple profitable exits.</p>\n\n<p>Ch11 and the Judge not allowing the motion has now theoretically &#39;trapped&#39; him from all angles - in theory, the only way out for him to retain a positive outcome is to take on BABY as a going concern.</p>\n\n<p>But, as we know, the main &#39;agitator&#39; is only holding $140million in the bonds [from the court hearing]. Which means he would/they would have to beat the offer coming from 6th street for the &#39;going concern&#39; - this would ultimately leave him well out of pocket - and achieve the exact opposite of the desired outcome - BK. He would have to give them the money needed to stabilise and absolutely avoid BK [BK at this point , imo, is completely off the table].</p>\n\n<p>If he is left with the equivalent to his par bond value - this could possibly be less than what he purchased them for - or, worse - that value of shares in the equity company.</p>\n\n<p><strong>See my post here:</strong> <a href=\"https://www.reddit.com/r/ThePPShow/comments/148ayls/is_this_jake_freemans_last_grasp_for_freedom/\">https://www.reddit.com/r/ThePPShow/comments/148ayls/is_this_jake_freemans_last_grasp_for_freedom/</a></p>\n\n<p>As it stands bondholders are powerless unless they are part of a bid, or the investment forms part of a bid, remember ch11 prevents hostile takeover</p>\n\n<p>Also see: <a href=\"https://www.reddit.com/r/ThePPShow/comments/12osy7i/is_the_answer_in_the_bond_exchange/\">https://www.reddit.com/r/ThePPShow/comments/12osy7i/is_the_answer_in_the_bond_exchange/</a> - I think the reason for the constant extension to this process has now become apparent - he simply kept saying &#39;no&#39; - and we all know what happens next</p>\n\n<p><strong>Which, is why I still stand by my thesis</strong> <a href=\"https://www.reddit.com/r/ThePPShow/comments/137ljut/are_we_going_to_get_taken_private/\">https://www.reddit.com/r/ThePPShow/comments/137ljut/are_we_going_to_get_taken_private/</a> -</p>\n\n<p><strong>Final prediction</strong></p>\n\n<p><strong>We get taken private via auction as outlined above. The point in RC letter is followed.</strong></p>\n\n<p>Price per share is the equivalent to $6/7. Shareholders receive $2 per share and a 20/1 stock convert of BBBY(q) to GME [or, if the IPO of BBBY is planned behind the scenes $2 per share and a 15/1 stock convert of BBBY(q) to BABY - placing BABY with an initial IPO of around $15/20].</p>\n\n<p>We have 7 days 168 hours until this is finally concluded... start the countdown....again...</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/vvk7gg9mi59b1.png?width=297&amp;format=png&amp;auto=webp&amp;s=143f1e2358712c696ff9b90d035b80a689bc37e4\">T minus 7 days and... you get the idea</a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ekHYMZpiybhkDapW0RYEAJT-_8F4Av0kWAiQP6Mz0aE.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/14labyz/is_yesterday_tomorrow_today_is_it_finally_tomorrow/", "time": 1687960869.0, "subreddit": "r/ThePPShow", "title": "Is yesterday, tomorrow, today? ... Is it finally tomorrow?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Fellow Regards, Apes, Apettes and Hodlers... we are finally here!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/uexc5hg1mr8b1.png?width=190&amp;format=png&amp;auto=webp&amp;s=5673b3266ca54886a7d1bc7dbb0020c6b518fd4d\">DFV must be among us</a></p>\n\n<p>This is it, the final hurdle before the finish line... is BBBYQ going to finish in blazing first place or whimper over the line... we are about to find out... But, first a few final points...</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nvz55zjcdr8b1.png?width=301&amp;format=png&amp;auto=webp&amp;s=297db9c7b9a25cd15f2dae638927b5964295d2fb\">The finish line is in touching distance</a></p>\n\n<p><strong>What is happening with the unsecured bondholder group?</strong></p>\n\n<p>We&#39;ve all seen it, we&#39;ve all been following since greasy little Glenn&#39;s head popped up in the Zoom call about 10 days ago. His ambulance chasing, enchilada smothered, little bearded face just gurning out from behind the camera.</p>\n\n<p>But, what do they want? - They want disclosure and plenty of it. As all parties have eloquently argued to our beloved Judge Papalia - &#39;It is a bit late in the day for all of this, you have had more than enough opportunity to bring this argument and request&#39;.</p>\n\n<p>The key here, is why are they even bothering? This is literally the $2 billion dollar question. </p>\n\n<p>In Chapter 11 cases Investors holding bonds in bankrupt companies [<em>more on this later</em>] can at least have the comfort in knowing that as unsecured creditors they are second in line for payment. Secured creditors, those with claims backed by collateral, such as equipment or real estate, are paid first. Stockholders come last. And that is only if there is any money left after the creditors have been paid.  Chapter 11 allows the corporation to reorganize. Its bonds might continue to trade, but holders will not receive principal and interest payments. As a result, a default could occur, and the value of the bonds might decline significantly. Or the court may approve an exchange of the old bonds for new ones, which could have a lower value. </p>\n\n<p>The key to the requirement for the disclosure is the Unsecured Bondholder Group [UBG] questioning the need for the DIP financing if the monthly sales were in fact very cash flow positive.  UBG are focussing on the statement/projections by Holly Etlin which requested the need for the initial DIP. </p>\n\n<p>See here for the list of documents requested by the UBG -  <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DocketInfo\">https://restructuring.ra.kroll.com/bbby/Home-DocketInfo</a> - Doc 1115</p>\n\n<p>However, what UBG fail to simply state is that <strong>&#39;projections are simply  that...projections&#39;</strong>. We&#39;ve all seen Shark Tank or Dragon&#39;s Den - projections can be made the other way and greatly exaggerated. Projections are projections - <strong>Holly Etlin is not a pre-cog</strong>.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/dx21eeqxfr8b1.png?width=350&amp;format=png&amp;auto=webp&amp;s=132511e7fd3d9116d779f7793dbadd267930501e\">This is not how Holly Etlin will appear in court today</a></p>\n\n<p>This simply does not outline what the UBG are trying to achieve - is the goal to bypass the DIP and send BBBY to Chapter 7? If this is the goal, then our main man Judge Papalia will straight through this. The goal of Bankruptcy proceedings is not to bankrupt a company it is to [chapter 11] save the company and ensure, where possible, that creditors get paid. This is the last [very poor] attempt and crippling our beloved BBBY by the UBG  and sending it spiralling down the Chapter 7 liquidation/bankruptcy route... all together now, on 3 - 1,2,3 - as loud as you can .... &quot;BANKRUPTCY IS NOT GOING TO HAPPEN&quot;.</p>\n\n<p>While we are mentioning Judge Papalia:</p>\n\n<p><em>For virtually his entire career, Judge Papalia focused his practice on representing various parties-in-interest in bankruptcy and foreclosure-related litigation and proceedings before federal, state, and bankruptcy courts. He served for many years as a Court-appointed Mediator for the Bankruptcy Court for the District of New Jersey and was Vice-Chair of the District V-A Ethics Committee from 2013 to 2014. He also served as Chair of the Debtor-Creditor Committee of the Essex County Bar Association. Judge Papalia authored or co-authored numerous articles on bankruptcy and creditors’ rights issues and has often spoken on those topics. While in private practice, Judge Papalia was regularly recognized by his peers in various publications listing top-rated lawyers by areas of practice and geographic location.</em>  </p>\n\n<p>This man is top drawer, a master of due process and vastly experienced. I wouldn&#39;t let his mannerism of a man who sneakily watches &#39;Too hot to handle&#39; with a sneaky whisky after his wife has gone to bed - only to fall off the chair fumbling for the remote when he hears her coming down the stairs *Vincent*. This man has overseen a great deal of ch11 cases, and as he directed at greasy Glenn yesterday &#39;Sir, you do know you&#39;ve already been given more than you actually deserve, right?&#39; - he has a steely side and he is nobody&#39;s fool.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fv4kxccbir8b1.png?width=274&amp;format=png&amp;auto=webp&amp;s=1eff79c0a51243bc14ac6849f8d3ad77c5038080\">&#39;Vincent - What&#39;s going on down there...&#39;</a></p>\n\n<p>What we have to remember here is that Judge Papalia is fully aware of the details of the DIP agreement and the future details [ie: who is behind the financing and the way it will  play out for the company in the near future]. He is well aware of the positive aspect of this and is simply allowing due process. The &#39;cut off&#39; approach of Sussberg on behalf of BBBY &#39;Your Honor, I want a full trial..&#39; really cut this meandering attempt at bringing failure and ragging this matter through the fields by Greasy Glenn and Jerky Jake to a head.. very quickly. The move was bullish and exactly what was needed.</p>\n\n<p>To note - the other cheap play on law by the UBG to only note greasy Glenn as having to adhere to &#39;reading the books under NDA&#39; was also soon cut off and made to encompass the representation as a whole.</p>\n\n<p>The one question the Judge needs to ask [even in light of the failure to meet Threshold for this matter] is &#39;what exactly are you [UBG] trying to achieve by playing all of this out?&#39;</p>\n\n<p>And here we are.. the day of the &quot;Trial&quot; - we all hope it is broadcast [at least in part, before the confidential information] - <a href=\"https://www.njb.uscourts.gov/bbb#zoom\">https://www.njb.uscourts.gov/bbb#zoom</a> </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qbsbrt56lr8b1.png?width=375&amp;format=png&amp;auto=webp&amp;s=c7acd8e5b6ed388be1833e192f4f8cbe82b29965\">The real - &#39;Big SHO&#39; - it&#39;s time for Judge Papalia to lay the Smackdown on the UBG</a></p>\n\n<p>At time of writing, 10am ET has just passed on the clock and there is no filing on KROLL amending the auction time for the BABY assets... save for one last &#39;let&#39;s take it all Private and ignore these proceedings shaped rabbit&#39; being pulled out of the hat.. this is it folks!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fii8hdmolr8b1.png?width=275&amp;format=png&amp;auto=webp&amp;s=94763e8744006ff6bf81914a3409d34dc46c7de3\">This is it - Time to bring it on home RC</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/tGmK4SvuxUVAz4t1hPkspY6w1Uz5A3a9tUkp8TCOVrY.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/14h2yhw/my_boss_doubled_my_pay_and_made_me_employee_of/", "time": 1687537691.0, "subreddit": "r/ThePPShow", "title": "My boss doubled my pay and made me employee of the month ⭐️", "text": "<!-- SC_OFF --><div class=\"md\"><p>We all  know the big man&#39;s tweets are cryptic and take a little decoding.</p>\n\n<p>Let&#39;s take a brief look at this one....</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/t3xt06vqns7b1.png?width=284&amp;format=png&amp;auto=webp&amp;s=175b48cd5cf0dc8c56655b556b8a1924b83be585\">I think I need to change my uniform...</a></p>\n\n<p>&#39;My boss doubled my pay...&#39; - can we suggest somebody is working overtime here? Maybe undertaking two jobs?</p>\n\n<p>Then the response...2 x 0 = 0 - This is from a well known star trek episode &#39;trouble with tribbles&#39;</p>\n\n<p><a href=\"https://getyarn.io/yarn-clip/1d5bfecb-338c-400f-b4d6-5c9f18f062c1\">https://getyarn.io/yarn-clip/1d5bfecb-338c-400f-b4d6-5c9f18f062c1</a> [twice nothing is nothing]</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8uxg1u4rls7b1.png?width=299&amp;format=png&amp;auto=webp&amp;s=ac08a94c386dc4ae927ab6ba4a4e729bda2d4f26\">More tribbles, more troubles!</a></p>\n\n<p>The original episode has had several produced follow-ups. The first, &quot;<a href=\"https://en.wikipedia.org/wiki/More_Tribbles,_More_Troubles\">More Tribbles, More Troubles</a>&quot; - &#39;Mo Money Mo problems&#39; - calling <a href=\"/u/biggysmallzzz\">u/biggysmallzzz</a> to pump up the volume on this one!</p>\n\n<p>However, this is where the tinfoil really kicks in....</p>\n\n<p>&quot;...and made me employee of the month&quot;</p>\n\n<p><strong><em>Employee of the Month</em></strong> is a 2006 American <a href=\"https://en.wikipedia.org/wiki/Comedy_film\">comedy film</a> directed by <a href=\"https://en.wikipedia.org/wiki/Greg_Coolidge\">Greg Coolidge</a>, who co-wrote it with Don Calame and Chris Conroy, and starring <a href=\"https://en.wikipedia.org/wiki/Dane_Cook\">Dane Cook</a>, <a href=\"https://en.wikipedia.org/wiki/Jessica_Simpson\">Jessica Simpson</a> and <a href=\"https://en.wikipedia.org/wiki/Dax_Shepard\">Dax Shepard</a>. The film&#39;s plot revolves around two &quot;super store&quot; employees who compete for the affection of their newest co-worker. The film was shot primarily at the <a href=\"https://en.wikipedia.org/wiki/Costco\">Costco</a> store in <a href=\"https://en.wikipedia.org/wiki/Albuquerque\">Albuquerque</a>, <a href=\"https://en.wikipedia.org/wiki/New_Mexico\">New Mexico</a>.<a href=\"https://en.wikipedia.org/wiki/Employee_of_the_Month_(2006_film\">[3]</a>#cite_note-3) The film was released on October 6, 2006 and grossed $38 million. </p>\n\n<p>[<strong>Side note</strong>: If you haven&#39;t seen this film, watch it, it made me laugh!]</p>\n\n<p>But wait, what are those store uniforms in the film....</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/585kaljyms7b1.png?width=299&amp;format=png&amp;auto=webp&amp;s=b5feb5c96b9f20ca2ef9a82933a2895726c88e0b\">Lovely uniforms</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/eur6pt3zms7b1.png?width=261&amp;format=png&amp;auto=webp&amp;s=da7a0efe2c5f85d5b74e70effced5d0b2b0ae14a\">That blue looks familiar...</a></p>\n\n<p>Wait a minute.....</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/kteawqn5ns7b1.png?width=443&amp;format=png&amp;auto=webp&amp;s=6063ce905f0ce60a0fd2fe55b785974fb6e21320\">This is not from the film....</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/h04cy746ns7b1.png?width=275&amp;format=png&amp;auto=webp&amp;s=a19ef639ef50c62f12bd648be66997e87d0cdca0\">.... RC is this your new uniform?</a></p>\n\n<p>&#x200B;</p>\n\n<p>Then lets finish with the star.... is this an intergalactic space - moon - reference?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/n5uz9i0gns7b1.png?width=227&amp;format=png&amp;auto=webp&amp;s=1d56393ca1a6f01567340ab6f10cc50a144aeaab\">Preparing to take off?</a></p>\n\n<p>It&#39;s all open to interpretation, but is this the rollercoaster tweet coming around again..[I hope so]?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rtt2jtnnns7b1.png?width=216&amp;format=png&amp;auto=webp&amp;s=0afe5bca06aee6eb21845d978ab4d239d888d97b\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/rtt2jtnnns7b1.png?width=216&amp;format=png&amp;auto=webp&amp;s=0afe5bca06aee6eb21845d978ab4d239d888d97b\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/JFHp_-FzhBwDOCdB8bMljneI2gd7YOnVQvESjBw3vZQ.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/14gzoex/lets_work_with_17_billion_debt_at_the_last_count/", "time": 1687529645.0, "subreddit": "r/ThePPShow", "title": "Let's work with 1.7 billion debt at the last count....", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is now end game.. we are just days away from the final auction for BABY. The crown jewel. The glimmering saviour, The glowing mecca to all of us... and possibly RC.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rk6t46frvr7b1.png?width=199&amp;format=png&amp;auto=webp&amp;s=22c8ef9eb46ae6a63fe17d8777bd0c00c090db07\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/rk6t46frvr7b1.png?width=199&amp;format=png&amp;auto=webp&amp;s=22c8ef9eb46ae6a63fe17d8777bd0c00c090db07\"></a></p>\n\n<p>So, when and that&#39;s when ..  not if... we see the conclusion in this play... how much could the share price possibly rise to?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/idmpm1n2wr7b1.png?width=300&amp;format=png&amp;auto=webp&amp;s=050a8141c71bde6e7de891aff07f0060c094169e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/idmpm1n2wr7b1.png?width=300&amp;format=png&amp;auto=webp&amp;s=050a8141c71bde6e7de891aff07f0060c094169e\"></a></p>\n\n<p>&#x200B;</p>\n\n<p>Ok, lets work with 1.7 billion debt.... [this is only rough maths] from the filings. </p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/node/17341/html\">https://bedbathandbeyond.gcs-web.com/node/17341/html</a></p>\n\n<p><strong>BABY goes for 2  billion</strong> [with leases etc] - that leaves 300million</p>\n\n<p>400m  shares outstanding - 0.75<br/>\n700m shares outstanding - 0.43</p>\n\n<p><strong>BABY goes for 2.5  billion</strong> [with leases etc] - that leaves 800million</p>\n\n<p>400m  shares outstanding - 2<br/>\n700m shares outstanding - 1.14</p>\n\n<p><strong>BABY goes for 3 billion</strong>  [with leases etc] - that leaves 1.3 billion</p>\n\n<p>400m shares outstanding - 3.25<br/>\n700m shares outstanding - 1.86</p>\n\n<p>You cannot guarantee/highlight specifics in this circumstance, there are too many variables:</p>\n\n<p>- Where does the money go?<br/>\n- If the purchaser own some/most of the bond debt, how will this be released back to the company through cancellation and the Nols must be factored in - That&#39;s a possible extra 2 billion in &#39;credit&#39;  put on the balance sheet - 2 billion - 400 m shares outstanding +$5 - 700m shares outstanding +$2.86 - if we are not taken private , the natural share price should return to somewhere around the $7 mark<br/>\n- Will it remain under the BBBY banner or be subject to an M and A?<br/>\n- What will happen when the announcement is made? One thing is for sure, bankruptcy as a complete notion is &#39;off the table&#39;. The shorts are now waiting for an announcement of a private deal or simply just purchase.<br/>\n- If there is a need for a &#39;force closure&#39;, in the words of my man <a href=\"/u/biggysmalzzz\">u/biggysmalzzz</a> - watch out as we will have &#39;GME 2.0&#39; on our hands [there is no need to highlight arguments re: Finra/U3/MMTLP etc]</p>\n\n<p>- Who is the final owner? - again   - if its RC and/or Icahn or similar, the share price will receive a natural lift. Then the boosters may just start.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/dyemyvk00s7b1.png?width=225&amp;format=png&amp;auto=webp&amp;s=77c9fe4d7dc0c2e65f94e4308142e3eeefcba3cf\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/dyemyvk00s7b1.png?width=225&amp;format=png&amp;auto=webp&amp;s=77c9fe4d7dc0c2e65f94e4308142e3eeefcba3cf\"></a></p>\n\n<p><strong>Just to note</strong> - I want the SQUEEZE as much as anyone - just trying to remain realistic...and then be pleasantly surprised if it happens.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/c0r99gnswr7b1.png?width=960&amp;format=png&amp;auto=webp&amp;s=d20e8a78e10417dbbe28ada6dd273595cda98888\">The final chapter</a></p>\n\n<p>My original thesis stands: <a href=\"https://www.reddit.com/r/ThePPShow/comments/137ljut/are_we_going_to_get_taken_private/\">https://www.reddit.com/r/ThePPShow/comments/137ljut/are_we_going_to_get_taken_private/</a></p>\n\n<p><strong>Final prediction</strong></p>\n\n<p><strong>We get taken private via auction as outlined above. The point in RC letter is followed.</strong></p>\n\n<p>Price per share is the equivalent to $6/7. Shareholders receive $2 per share and a 20/1 stock convert of BBBY(q) to acquiring company [or, if the IPO of BBBY is planned behind the scenes $2 per share and a 15/1 stock convert of BBBY(q) to BABY - placing BABY with an initial IPO of around $15/20].</p>\n\n<p>We have 4.5 days - 108 hours until this is finally concluded... start the countdown.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/mya956mxwr7b1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=1e1b4b1f83dfe081f4a4101692d3cd46e4579a90\">Time is ticking - 6480 minutes....</a></p>\n\n<p>NFA as always</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/p3lr0wGNo2e-DF37k5Sf6WfyCw5Sm1UVCQvdGJM3pDI.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://i.redd.it/kut9sfs6er7b1.jpg", "time": 1687522296, "subreddit": "r/ThePPShow", "title": "Brief post - can someone confirm the remaining debt?", "text": "I know, this is a brief post… but, I am trying to out a purchase price to share price table together for a rough guide in relation to the sale of baby.\n\nCan someone help and confirm the remaining debt (after overstock and leases etc)?", "flair": {"text": "🚫 Banned for Melon Porn 🍉", "text_color": "dark", "back_color": "#dadada"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/kut9sfs6er7b1.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://i.redd.it/kut9sfs6er7b1.jpg", "time": 1687522296.0, "subreddit": "r/ThePPShow", "title": "Brief post - can someone confirm the remaining debt?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/kut9sfs6er7b1.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/148ayls/is_this_jake_freemans_last_grasp_for_freedom/", "time": 1686647609.0, "subreddit": "r/ThePPShow", "title": "Is this Jake Freeman's last grasp for freedom?", "text": "<!-- SC_OFF --><div class=\"md\"><p>As we are all waiting for confirmation that the stalking horse deadline has now passed [or to not receive another notice of extension!], I took time to  consider the information in doc 704 - <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DocketInfo\">https://restructuring.ra.kroll.com/bbby/Home-DocketInfo</a></p>\n\n<p>Credit to <a href=\"/u/real_eyezz\">u/real_eyezz</a> for sparking interest and a little further digging here and applying some grey matter.... </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/bbk4wlh55r5b1.png?width=225&amp;format=png&amp;auto=webp&amp;s=69a0f048797a3b8333f804902a47fbcbb4e47821\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/bbk4wlh55r5b1.png?width=225&amp;format=png&amp;auto=webp&amp;s=69a0f048797a3b8333f804902a47fbcbb4e47821\"></a></p>\n\n<p>There is caselaw precedent in relation to deadlines and involvement of claimants, put simply - the deadline for bids is approaching and hasn&#39;t been extended. The request for [and I use this word in the context of the request] &#39;transparency&#39; has been made, as it is alluded that <strong>whatever is &#39;going on behind the scenes&#39;</strong> is being carried out in manner to run down the clock and not allow for any activity on the part of a specific party.</p>\n\n<p>See precedent in:</p>\n\n<p><strong>J. Caiazzo Plumbing and Heating Corp. v. United States Fidelity and Guaranty Company, 2004 WL 2848548 (S.D.N.Y. December 9, 2004</strong>), the claimant asserted that the surety should be estopped from arguing that the <strong>statute of limitations</strong> had run because the surety acknowledged the claimant’s claim and represented that they were investigating the claim and then waited for the statute of limitations to expire before denying the claim. The court noted that a claimant can prove estoppel by showing that the surety [in this case it would be BBBY] initiated settlement negotiations in order to “lull the claimant into inactivity” until the statute of limitations expired. In addressing the estoppel argument raised by the claimant, the Court observed that New York courts have consistently rejected estoppel claims against a surety when the surety acknowledged receipt of the claim, reserved its rights on numerous occasions, the amount of the claim was always in dispute, and no settlement was ever offered by the surety. The Caiazzo Court noted that the surety never waived its rights under the bond because each letter it sent to the claimant explicitly reserved those rights [In the case of BBBY - enter docket 707 - record of delivery and process]. Further, the surety advised the claimant that it was in the process of determining its position with regard to the claim, but never offered a settlement or otherwise claimed to be in the process of resolving the claim. As a result, the Court held that there could be no estoppel or waiver. <strong>The difference here is that this case was not going through ch11 proceedings - in ch11 proceedings - the issue of disclosure and transparency is at the decision of the Judge. Applying directly to BBBY - the Judge would not have allowed for confidentiality if it was not in the interest of all parties with sound reasoning.</strong> </p>\n\n<p>Bond holders are part of the process and not primary to the process. Bond holders will get paid out in line with any purchase agreement, they do not ‘access confidential information&#39; or, have the right to unless there is an absurd judgement made [not based on facts] - they are  simply in the line of creditors and if the &#39;confidential &#39;  information is not made available at this point - they would be entitled to appeal, but only if the company goes through ch 7 and/or fails to exist and /or bondholders do not get paid out if the entity no longer fails to operate.</p>\n\n<p>Enter docket 707 - confirmation of the date and location that all/any of the available Information has been sent to.</p>\n\n<p>This is confirmation of where certain materials were sent by Kroll. So, nobody can say they have been missed out.</p>\n\n<p>The request by ‘the group of bond holders’ to have complete access to all material information is completely at the discretion of the Judge now.</p>\n\n<p>The correct answer is ‘no’ as bond holders are a lien on ch 11 payout. This is exactly why bbby entered ch11 to allow for avoidance of interference. The only parties to have complete access to the information are those that enter a &#39;qualified&#39; bid. further, the &#39;Qualified Bid&#39; needs to be for a specific part of the business and then the party will be given access to those materials. The material information of a rival bid is not accessible to others at this stage - &#39;Stalking Horse&#39; provisions.</p>\n\n<p>Whoever this group are, they are hugely concerned to make a request like this.</p>\n\n<p>The only thing which I would pick up is the term ‘<strong>glacial pace</strong>’. If the unsecured bond group (is actually RC (titanic tweet)) then the board really is fcked/compromised and this request is for transparency. The flip side, and my view, is that this group is the group including Jake Freeman (and SHF). The SHF now have to sit back and let ch11 run its course (previous release regarding 30 day notice of transfer of shares of over 4.5% holders).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lrg6267g2r5b1.png?width=293&amp;format=png&amp;auto=webp&amp;s=d9d406553f02a04c6504e4e6a8a2fd2fc78b16b7\">RC wants this [BABY] and only this</a></p>\n\n<p>If it is the latter (SHF) I would say that they are completely on the ropes and are now out of ammo, exposed in court and racking up the interest on the shares… also those that originally lent the shares may be asking for them back to close out.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/40pfrks62r5b1.png?width=297&amp;format=png&amp;auto=webp&amp;s=18197e48a6d2694e190bbbd8108e53f7a6046c85\">Naughty boy Jake... Tut tut</a></p>\n\n<p>This is now for the Judge to hold strong, correctly apply the law and see ch11 process through to its correct conclusion.</p>\n\n<p>If no further &#39;Stalking Horse&#39; extension is filed [or another minimal one] then the timeline moves along and it is time for any other bidder to enter the contest and bid. It can be hoped that any rival bid would simply run the overall price up, but, if the Stalking Horse bid floor is high, then any rival bid would not come close [this is a benefit of the stalking horse process, to set the floor].</p>\n\n<p>As it stands bondholders are powerless unless they are part of a bid, or the investment forms part of a bid, remember ch11 prevents hostile takeover.</p>\n\n<p>There is also a spotlight on this with the recent news with the sec and GG, I would suggest the Judge is aware of this… in fact, this could be his landmark case to ‘bring all of this into the light’ ( <a href=\"https://www.reddit.com/u/realpulte/\">u/realpulte</a> )</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5x7mni4x4r5b1.png?width=275&amp;format=png&amp;auto=webp&amp;s=b1c9a09b700a64ab46da878238cfd85083a473a6\">UNLUCKY JAKE</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Sy-hpQ0FnlGRTd7BuqviKKisZPwAQtU5qKEY51XGSyc.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/1453m6i/has_the_stalking_horse_finally_stopped_stalking/", "time": 1686312882.0, "subreddit": "r/ThePPShow", "title": "Has the Stalking Horse finally stopped stalking?", "text": "<!-- SC_OFF --><div class=\"md\"><p>It is Friday 9th of June, the stalking horse loometh.... and we all  hope the horse has finished stalking.</p>\n\n<p>The stalking horse date has been extended to Sunday 11th of June at 5pm, which, we hope, means only one thing... an announcement is neigh [see what I did there?]</p>\n\n<p>With little else to do but wait for the deadline to tick past, I took note of the latest Kroll filings detailing retained legal counsel. There is a good introductory post here: <a href=\"https://www.reddit.com/r/ThePPShow/comments/13cs65x/pachulski_stang_ziehl_jones_llp_the_law_firm_for/\">https://www.reddit.com/r/ThePPShow/comments/13cs65x/pachulski_stang_ziehl_jones_llp_the_law_firm_for/</a></p>\n\n<p>It is fair to say that at his point that the timing of the retained counsel filing falls in line with a pending announcement. Why retain counsel if there is not an announcement to be made yet?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9ffx8jykhz4b1.png?width=273&amp;format=png&amp;auto=webp&amp;s=719f184b6e335b691bcd91563d19e2185c83cf41\">TWA</a></p>\n\n<p>Remember:  PSZ&amp;J will coordinate closely with Alvarez &amp; Marsal North America, LLC</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/67irdhzlhz4b1.png?width=318&amp;format=png&amp;auto=webp&amp;s=df41147c6dd768c767ee37ca2869609785cff154\">Not TWA</a></p>\n\n<p>So, what&#39;s the connection..as has been noted previously.. the glaring connection and icahn&#39;t help but make it is TWA.</p>\n\n<p>A man by the name of Carl Icahn swooped in and took control of TWA in 1985. In 1988, Icahn took TWA private, receiving $469 million in the deal - equivalent to $1.01 billion in 2020. The agreement also meant that TWA would take on $540 million in debt - $1.17 billion in today&#39;s dollars.</p>\n\n<p>In 1991, Icahn sold TWA’s coveted London routes to American Airlines for $445 million. Some believed that the loss of these valuable assets accelerated TWA&#39;s demise. In 1992, TWA filed for bankruptcy. A year later, in 1993, it emerged with 55% of the company under creditor ownership.  Icahn was himself a creditor and was owed $190 million. With TWA desperate to finish business with Icahn, an eight-year agreement was made that gave him the ability to buy select tickets at 55% of the cost. Reselling the tickets on the internet, American Airlines (the future owner of TWA) estimated that $100 million per year was being lost because of the deal with Icahn.  Finally, in January 2001, it was announced that TWA was bankrupt for the third time and would be sold to American Airlines.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9y4aamjnhz4b1.png?width=284&amp;format=png&amp;auto=webp&amp;s=369ffc2bc694aa5c89dc520ffe976af6630e8acc\">The APPLE doesn&#39;t fall far from the tree</a></p>\n\n<p>Then lets look at &#39;how the apple doesn&#39;t fall far from the tree&#39; - remember <strong>how Icahn engaged Apple</strong>?</p>\n\n<p>&quot;Shares are criminally undervalued and you have all this cash. You should be buying back shares.&quot;</p>\n\n<p>And lest we forget ebay and paypal?</p>\n\n<p>&quot;Carl Icahn took a big stake in eBay <a href=\"http://recode.net/2014/02/26/icahn-ebay-battle-heats-up/\"><strong>so he could agitate for PayPal’s spinoff</strong></a>. Now that he’s <a href=\"http://recode.net/2014/09/30/ebay-to-spin-off-paypal-with-new-ceos-for-two-publicly-traded-companies/\"><strong>got what he wanted</strong></a>, he has exited eBay altogether.</p>\n\n<p>The confrontational investor disclosed this week that he has sold his stake in eBay but retains nearly 4 percent ownership of PayPal as of the end of September. All eBay investors received an equal number of shares in PayPal when the payments division spun off into its own public company in July.</p>\n\n<p>The move makes sense. Icahn’s reason for pushing for the PayPal spinoff was that he felt the faster-growing payments unit was being undervalued as part of the eBay umbrella company. Indeed, PayPal is now valued at $45 billion compared to $34 billion for eBay. It is growing much faster than eBay and now has more revenue, too&quot;.</p>\n\n<p>As we have read, all  of these plays [and hopefully BBBYQ] fall into his basic investing philosophy:</p>\n\n<p>&quot;My investment philosophy, generally, with exceptions, is to buy something when no one wants it.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>The next 72 hours</strong></p>\n\n<p>The stalking horse deadline has been extended <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DocketInfo\">https://restructuring.ra.kroll.com/bbby/Home-DocketInfo</a> doc 665.</p>\n\n<p>I, like many of us, did not a further extension. Especially in light of the comments by Bed Bath counsel at the last hearing, requesting for a slight extension [a week was granted]. However, there is definitely a different feel to the timeframe granted on this new extension.</p>\n\n<p>The extension only allows for one working/trading day, with the weekend in between. I would be <strong>very surprised</strong> if a further deadline extension was granted. The short time frame of the latest extension highlights that the stalking horse procedure is at the last &#39;fur-long&#39;.</p>\n\n<p>We also need to remember that Bed Bath does not have to use the whole extension. The assumption could be that the work has been completed, and the extension is just to allow for a well timed announcement. We all know that if the stalking horse is linked to RC and/or Icahn, the stock lift will be immediate. The way this stock/short interest and other catalysts, a move over $2/5 would likely not be able to be controlled and then we have lift off [nfa]</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/zyv96iophz4b1.png?width=268&amp;format=png&amp;auto=webp&amp;s=0bd08acf1f9f827d2eae076422911208ebde20ca\">To the moon!</a></p>\n\n<p><strong>Reasons to be cheerful over the weekend</strong></p>\n\n<p>- Carol Flaton appointed to the BOD overseeing chapter 11 process [previous connection Icahn via HP proxy battle</p>\n\n<p>- Ryan Cohen listed as an interested party on the court docket</p>\n\n<p>- RC  Ventures named in the mailing list of the court docket</p>\n\n<p>- DIP finance noted in the mailing list in the court docket during chapter 11 is overseen by Sixth streetwhich has connections with IEP</p>\n\n<p>- Icahn being shorted by Hindenberg</p>\n\n<p>- Appointment of Kastin and Eitlin [links to IEP]</p>\n\n<p>- Cheng, Cohen et al - mysteriously exiting their position from Dragonfly</p>\n\n<p>- IEP/GM/Dragonfly having a boatload of capital available for an &#39;unnamed&#39; future acquisition</p>\n\n<p>- Brett Icahn exiting his Newell position at a huge loss</p>\n\n<p>- TEDDY holding trademark announcements</p>\n\n<p>- The $1.6 billion discount/NOLS created by BBBY entering chapter 11 - along wiht lease sale/termination benefits</p>\n\n<p>- Recent MSM pieces naming potential bidders and an &#39;un-named&#39; potential acquirer</p>\n\n<p>- The IEP q10 with confidential treatment [rarely seen]</p>\n\n<p>- Matt Furlong, after a successful spell, ending his tenure with GME and RC taking the helm [in charge of the war-chest] and RC tweeting &#39;not for long&#39; [which, if you say this using your best Carl Icahn impression, sounds exactly like &#39;Matt Furlong&#39;]  - enjoy practicing that one!</p>\n\n<p>- The oddly timed airing of the &#39;Meme King&#39; hit piece on RC</p>\n\n<p>- GME tweeting the stalking horse, exactly at the end of the deadline on 8th June</p>\n\n<p><strong>Important to note</strong></p>\n\n<p>I think it is important to note that the longevity and initial future interest in this play, needs to be strongly attributed to <a href=\"/u/biggysmallzzz\">u/biggysmallzzz</a> and his god tier DD  [library here <a href=\"https://www.reddit.com/user/BiggySmallzzz/submitted/\">https://www.reddit.com/user/BiggySmallzzz/submitted/</a> ] and especially <a href=\"https://www.reddit.com/r/BBBY/comments/ycxkll/bbby_debt_tender_exchange_offer_analysis_part_2/\">https://www.reddit.com/r/BBBY/comments/ycxkll/bbby_debt_tender_exchange_offer_analysis_part_2/</a></p>\n\n<p>The thing is, he was right.. even though it is yet to transpire. The small window was open and RC did try to &#39;buy all the stocks&#39;, coupled wiht the early year run to $6/7 was the window of opportunity in Biggie&#39;s DD. What couldn&#39;t be accounted for was the &#39;behind the scenes&#39; activity which was blocking the deal at every opportunity.</p>\n\n<p>As this will be my last DD before the &#39;Stalking Horse&#39; announcement... I take this opportunity to salute you and my other main man <a href=\"/u/real_eyezz\">u/real_eyezz</a> , and all the remaining OG [and regards new].  The light at the end of the tunnel is fast approaching.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/2iqhluorhz4b1.png?width=300&amp;format=png&amp;auto=webp&amp;s=f94e6fc2a5be4049e66fbad2a0dbf351577cbd6b\">The promised land</a></p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>There are far too many &#39;cohen-cidences&#39; and occurrences to ignore at this point. The final much shortened extension to the stalking horse process [coupled with the GME tweet] being the last few pieces to fall to the board in this puzzle.</p>\n\n<p>Once an announcement is made [if it includes RC or Icahn] it&#39;s finally time to start the boosters.</p>\n\n<p>I stand by my thesis and outcome here: <a href=\"https://www.reddit.com/r/ThePPShow/comments/137ljut/are_we_going_to_get_taken_private/\">https://www.reddit.com/r/ThePPShow/comments/137ljut/are_we_going_to_get_taken_private/</a></p>\n\n<p><strong>We get taken private via auction/or at the initial staking horse phase. The final point in RC Ventures letter is followed.</strong></p>\n\n<p>Price per share is the equivalent to $6/7 [although an annoucnement could possibly trigger MOASS]. Shareholders receive $2 per share and a 20/1 stock convert of BBBY(q) to GME [or, if the IPO of BBBY is planned behind the scenes $2 per share and a 15/1 stock convert of BBBY(q) to BABY - placing BABY with an initial IPO of around $15/20].</p>\n\n<p><strong>TLDR</strong></p>\n\n<p>- Icahn has a well established history of interacting and taking over companies via behaviours already commented on with Bed Bath</p>\n\n<p>- There are many things linking Icahn to this play</p>\n\n<p>- There are many, many things highlighting RC&#39;s continuing involvement</p>\n\n<p>- The original DD put forward by <a href=\"/u/biggiesmallzzz\">u/biggiesmallzzz</a> would more than likely have played out, if not for behind the scenes negative actions</p>\n\n<p>- Shout out to the OG</p>\n\n<p>- Announcement can come before the end of the current stalking horse deadline</p>\n\n<p>-  If RC/Icahn are involved/named in the stalking horse process/bid  - buckle up</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/so16vkcthz4b1.png?width=299&amp;format=png&amp;auto=webp&amp;s=363bee8f7a5c1bdebf49a7e922498474cb95f939\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/so16vkcthz4b1.png?width=299&amp;format=png&amp;auto=webp&amp;s=363bee8f7a5c1bdebf49a7e922498474cb95f939\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/bxxyMKwr3C9PStLOgyphZsN7S-2L9hSDuCZOpA9P-yI.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/gallery/140k42v", "time": 1685900111.0, "subreddit": "r/ThePPShow", "title": "Is the deal finally signed and sealed?", "text": "<!-- SC_OFF --><div class=\"md\"><p>We’ve got another 4 days until the stalking horse deadline…</p>\n\n<p>Now we have the latest RC tweet… could the gastro reference be linked to a ‘silent but deadly’ or ‘stalking…silently’</p>\n\n<p>Then the wording, if you note the lyrics in the pictures form the song by glen washington… multiple references to baby and then… it’s signed and sealed. </p>\n\n<p>Personal opinion, I think this tweet following the 2 buyer article last week is the final hurdle and we are now days away from an announcement…</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/IDe06xAl8j3hbTp88GyuGK-71x_HobbcUjumm4bZU0I.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/13lye48/doc_391_absence_of_evidence_isnt_evidence_of/", "time": 1684509260.0, "subreddit": "r/ThePPShow", "title": "Doc 391 - Absence of evidence isn't evidence of absence", "text": "<!-- SC_OFF --><div class=\"md\"><p>Doc391 – Can be accessed here: <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DocketInfo\">https://restructuring.ra.kroll.com/bbby/Home-DocketInfo</a> - Doc 391</p>\n\n<p><strong>Exhibit B</strong>  <strong>- Due to the confidential nature of the Debtors’ records, the Interested Parties Service List has been redacted. The Interested Parties Service List will be made available to the Court, the U.S. Trustee, and any Official Committee upon request.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/77smtnv90t0b1.png?width=1564&amp;format=png&amp;auto=webp&amp;s=cc09fbd589f95baee4842bf768ba3c22e897584c\">\\&quot;The Reduced List\\&quot;</a></p>\n\n<p>Let’s look back at the “interested parties” v “interested party” discussion in relation to Doc 179-1. At this point the service list was <strong>un-redacted</strong> – 18 parties listed as an “interested party”. </p>\n\n<p>There is a good reference post here: <a href=\"https://www.reddit.com/r/BBBY/comments/136u9xt/what_is_this_interested_party_list_what/\">https://www.reddit.com/r/BBBY/comments/136u9xt/what_is_this_interested_party_list_what/</a></p>\n\n<p>2046 Ares Management Interested Party 1/19/2023</p>\n\n<p>2047 Sycamore Partners Interested Party 1/19/2023 </p>\n\n<p>2048 Cerberus Capital Management Interested Party 1/19/2023 </p>\n\n<p><strong>2049 Ryan Cohen Interested Party 1/19/2023</strong> </p>\n\n<p>2050 Putman Investments Interested Party 1/19/2023 </p>\n\n<p>2051 Sleep Country Canada Interested Party 1/19/2023 </p>\n\n<p>2052 Authentic Brands Interested Party 1/19/2023 </p>\n\n<p>2053 CSC Generation, Inc. Interested Party 1/19/2023 </p>\n\n<p>2054 Interweave Interested Party 1/19/2023 </p>\n\n<p>2055 Michaels Stores, Inc. Interested Party 1/19/2023 </p>\n\n<p>2056 Blue Torch Capital Interested Party 1/19/2023 </p>\n\n<p>2057 Centerbridge Partners Interested Party 1/19/2023 </p>\n\n<p>2058 Citi Interested Party 1/19/2023 </p>\n\n<p>2059 JPM Interested Party 1/19/2023 </p>\n\n<p>2060 MidCap Financial Interested Party 1/19/2023 </p>\n\n<p>2061 Silver Point Capital Interested Party 1/19/2023 </p>\n\n<p>2062 SB360 Capital Partners Interested Party 1/19/2023</p>\n\n<p>2482 Hudson Bay Capital Interested Party 3/5/2023 </p>\n\n<p>2483 Angelo Gordon Interested Party 3/5/2023</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/k4mvcmit0t0b1.png?width=396&amp;format=png&amp;auto=webp&amp;s=1b819536f37b24118323d82ec3971e81123da9c0\">Who could it be?</a></p>\n\n<p><strong>Why is this now redacted?</strong></p>\n\n<p>The information disclosed by the issuer will only trigger Regulation FD if the information is both non-public and material.  Non-public information is information that “has not been disseminated in a manner making it available to investors generally.” Information is material if:<br/>\n (i) “there is a substantial likelihood that a reasonable shareholder would consider [the information] important” when making an investment decision, and<br/>\n (ii) the information “would have been viewed by the reasonable investor as having significantly altered the ‘total mix’ of information made available.” </p>\n\n<p>In relation to the potential filing of a 10-K/Q, Court filings by the debtor and statements made in court by a debtor raise more difficult issues under Regulation FD. A debtor is required by OUST to make periodic financial filings with the bankruptcy court. These filings include “Monthly Operating Reports,” which provide a variety of balance sheet information regarding the debtor. Since these filings are made on a monthly basis, they provide financial information between the quarterly filings of the debtor’s Form 10-Q statements. In addition, for a variety of reasons, a debtor may be required to disclose important information in other court filings or in statements made to the bankruptcy court during court hearings. These statements could include, for instance, information relating to the overall financial health of the debtor’s business or recent trends in its operations, financial performance, restructuring efforts, or cash position. </p>\n\n<p><strong>If there is a substantial likelihood that a reasonable shareholder would consider the information important when making an investment decision, then the information will be redacted and made confidential.</strong></p>\n\n<p>This is where conjecture, and mildly stating the obvious begins, the list is redacted from the original as the list is now shorter. The original 18 names has been reduced to detail the remaining parties who are still in play as an “interested party”. </p>\n\n<p>Let’s reduce the list:</p>\n\n<p>2046 Ares Management Interested Party 1/19/2023<br/>\n <a href=\"https://www.morningstar.com/news/marketwatch/20230425244/bed-bath-beyond-bankruptcy-these-companies-could-benefit-from-the-retailers-demise\">https://www.morningstar.com/news/marketwatch/20230425244/bed-bath-beyond-bankruptcy-these-companies-could-benefit-from-the-retailers-demise</a></p>\n\n<p><em>Set against this backdrop, brand-management firm WHP Global would seem to be a top-tier acquirer and Toys &#39;R&#39; Us and Babies &#39;R&#39; Us would be a &quot;synergistic pairing&quot; with Bed Bath &amp; Beyond&#39;s Buybuy Baby subsidiary, Spieckerman said.</em></p>\n\n<p><em>WHP Global already owns the Toys &#39;R&#39; Us and Babies &#39;R&#39; Us brands. &quot;WHP would also offer a compelling opportunity to gobble up Bed Bath &amp; Beyond whole rather than it being sold off for parts,&quot; she added. &quot;Bed Bath &amp; Beyond would present a nice category-expansion play that would diversify WHP&#39;s holdings and give it a foothold in the home category.&quot;</em></p>\n\n<p><em>The brand-management giant recently received a $375 million equity investment from the private-equity group of Ares Management Corporation (ARES). The transaction, which values WHP Global at $1.6 billion, provides capital for future brand acquisitions.</em></p>\n\n<p>2047 Sycamore Partners Interested Party 1/19/2023<br/>\n <a href=\"https://www.yahoo.com/lifestyle/authentic-brands-reportedly-discussion-purchase-162504712.html\">https://www.yahoo.com/lifestyle/authentic-brands-reportedly-discussion-purchase-162504712.html</a></p>\n\n<p><em>Bed Bath &amp; Beyond is entertaining potential buyers for its home goods store chain and its Buybuy Baby arm, according to a report in CNBC. The beleaguered retailer is also reportedly speaking with lenders to secure financing to sustain it during a potential bankruptcy filing. Potential buyers reportedly include</em> <strong><em>Sycamore Partners,</em></strong> <em>the owner Staples, Belk and Talbots, and Authentic Brands Group, the owner of Forever 21, Barneys New York, J.C. Penney and Reebok.</em></p>\n\n<p>2048 Cerberus Capital Management Interested Party 1/19/2023<br/>\n <a href=\"https://www.reuters.com/business/retail-consumer/bed-bath-beyonds-baby-products-chain-attracts-buyer-interest-wsj-2022-04-22/\">https://www.reuters.com/business/retail-consumer/bed-bath-beyonds-baby-products-chain-attracts-buyer-interest-wsj-2022-04-22/</a></p>\n\n<p><em>Bed Bath &amp; Beyond Inc is fielding interest from potential buyers for its Buybuy Baby business following activist pressure to sell the unit, the Wall Street Journal reported on Friday, citing people familiar with the matter. The suitors include private equity firm Cerberus Capital Management LP and Tailwind Acquisition Corp, a blank-check firm chaired by Casper Sleep Inc&#39;s former chief executive Philip Krim, the report said.</em></p>\n\n<p><strong>2049 Ryan Cohen Interested Party 1/19/2023</strong> </p>\n\n<p>2052 Authentic Brands Interested Party 1/19/2023<br/>\n <a href=\"https://www.yahoo.com/lifestyle/authentic-brands-reportedly-discussion-purchase-162504712.html\">https://www.yahoo.com/lifestyle/authentic-brands-reportedly-discussion-purchase-162504712.html</a></p>\n\n<p><em>Bed Bath &amp; Beyond is entertaining potential buyers for its home goods store chain and its Buybuy Baby arm, according to a report in CNBC. The beleaguered retailer is also reportedly speaking with lenders to secure financing to sustain it during a potential bankruptcy filing. Potential buyers reportedly include Sycamore Partners, the owner Staples, Belk and Talbots, and Authentic Brands Group, the owner of Forever 21, Barneys New York, J.C. Penney and Reebok.</em></p>\n\n<p>2482 Hudson Bay Capital Interested Party 3/5/2023 </p>\n\n<p>2483 Angelo Gordon Interested Party 3/5/2023</p>\n\n<p>Interestingly, AG were bought out by TPG 4 days ago for $2.7billion – this is interesting, although the company has bought out, it does have [via TPG] $2.6 billion cash on bank.<br/>\n <a href=\"https://fortworthbusiness.com/business/fort-worths-tpg-acquires-investment-firm-angelo-gordon/#:%7E:text=New%20York%2Dbased%20Angelo%20Gordon,credit%20and%20real%20estate%20investment\">https://fortworthbusiness.com/business/fort-worths-tpg-acquires-investment-firm-angelo-gordon/#:~:text=New%20York%2Dbased%20Angelo%20Gordon,credit%20and%20real%20estate%20investment</a>.</p>\n\n<p>That leaves us with a possible 7 interested parties [conjecture based on the above – again credit to <a href=\"https://www.reddit.com/r/BBBY/comments/136u9xt/what_is_this_interested_party_list_what/\">https://www.reddit.com/r/BBBY/comments/136u9xt/what_is_this_interested_party_list_what/</a> for the initial DD on the original list].</p>\n\n<p><strong>Exhibit C</strong></p>\n\n<p>CONSEQUENCES OF FAILING TO TIMELY MAKE AN OBJECTION ANY PARTY OR ENTITY WHO FAILS TO TIMELY MAKE AN OBJECTION TO THE SALE OR A SALE TRANSACTION, AS APPLICABLE, ON OR BEFORE THE SALE OBJECTION DEADLINE IN ACCORDANCE WITH THE BIDDING PROCEDURES ORDER SHALL BE FOREVER BARRED FROM ASSERTING ANY OBJECTION TO THE SALE, INCLUDING WITH RESPECT TO THE TRANSFER OF THE APPLICABLE DEBTORS’ ASSETS FREE AND CLEAR OF ALL LIENS, CLAIMS, ENCUMBRANCES, AND OTHER INTERESTS, EXCEPT AS MAY BE SET FORTH IN THE APPLICABLE PURCHASE AGREEMENT OR THE PLAN, AS APPLICABLE.</p>\n\n<p>There is use of capitals here as seen in some of the pre Chapter 11 filings. This is important to note, the directions is simply saying that after the matter is concluded ‘that is that’ – no  comebacks, no future objections or complaints.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9zbwdl1p0t0b1.png?width=274&amp;format=png&amp;auto=webp&amp;s=42c183955834d06198bae974d089b930ee67e840\">Sold to Ryan Cohen</a></p>\n\n<p><strong>TLDR</strong></p>\n\n<p>- Doc 391 has detailed a list of ‘interested parties’ this document has been ‘redacted’</p>\n\n<p>- The previous list of interested parties on Doc 179-1 was un-redacted</p>\n\n<p>- <strong>There is redacted documents/information, if there is a substantial likelihood that a reasonable shareholder would consider the information important when making an investment decision, then the information will be redacted and made confidential.</strong></p>\n\n<p>- The original list has been reduced to only detail those left in play and planning on/final stages of submitting a bid</p>\n\n<p>- The extended court deadlines have been directed to accommodate this process</p>\n\n<p>- Interestingly, interested party – Angelo Gordon has recently been acquired by TPG – giving them $2.7 billion on bank. TPG have history of leveraged buyout activity, and have also been linked to cloud based software developer New Relic. The timing of the AG takeover by TPG also corresponds with the extended court timetable</p>\n\n<p><strong>Conclusion</strong></p>\n\n<p><strong>RC is detailed on the final list. The court is aware of the ‘meme stocker’ [jokes] and the impact his name being on the final list of ‘interested parties’ will have on the stock price [MOASS]. RC will come forward as the stalking horse bidder.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/l5duidph0t0b1.png?width=300&amp;format=png&amp;auto=webp&amp;s=45a1875f50d5c7674a94a5684c979a2b43af81e4\">I WANT MY BABY</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/cRSkFWcMlZxGVYffxeny9oE1_7dVkgLtf7VXSFIHF-M.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/13i725v/if_the_final_hearing_has_actually_been_moved_to/", "time": 1684154259.0, "subreddit": "r/ThePPShow", "title": "If the final hearing has (actually) been moved to May 31 - this might be why.....", "text": "<!-- SC_OFF --><div class=\"md\"><p>As per the timeline below. The Stalking Horse bid is made first by the deadline [if there is one made].</p>\n\n<ul>\n<li>Stalking Horse Deadline:  May 22, 2023, at 5:00 p.m. (prevailing Eastern Time)</li>\n<li>Bid Deadline:  May 28, 2023, at 12:00 p.m. (prevailing Eastern Time) - In 24 days</li>\n<li>Auction (if applicable): An Auction may be held on June 2, 2023, at 10:00 a.m. (prevailing Eastern Time) via live auction</li>\n<li>Notice of Successful Bidder:  As soon as reasonably practicable after the conclusion of the Auction (if necessary)</li>\n<li>Sale Objection Deadline: June 5, 2023, at 4:00 p.m. (prevailing Eastern Time)</li>\n<li><p>Sale Hearing: June 7, 2023, at 10:00 a.m. (prevailing Eastern Time), or as soon thereafter as the Court’s calendar permits </p>\n\n<p>The <strong>timetable</strong> will then operate like this:</p></li>\n<li><p>If one or more Qualified Bids (other than the Stalking Horse Bid - deadline 7 days away) are received by the Bid Deadline [13 days away], the Debtors will conduct the Auction, which shall take place on <strong>June 2, 2023 at 10:00 a.m.</strong>  If the Auction cannot be held at a physical location, the Auction will be entirely conducted via a virtual meeting. If the Debtors do not receive any Qualified Bids (other than the Stalking Horse Bid), the Debtors will not conduct the Auction and will designate the Stalking Horse Bid as the Successful Bid. If no timely Qualifying Bids other than the Stalking Horse Bid are submitted on or before the Bid Deadline, the Debtors shall not hold an Auction and shall request at the Sale Hearing that the Court approve the Stalking Horse Agreement and the transactions contemplated thereunder.</p></li>\n</ul>\n\n<p><strong>What makes a qualified bid?</strong></p>\n\n<p>A Bid that is deemed by the Selection Committee to include sufficient information regarding the Bidder’s ability to provide the necessary capabilities to create, implement, and purchase the asset/satisfy outline requirements so that such Bid can be effectively evaluated by the Selection Committee [Debtor]. Usually, when evaluating whether a Bid is a Qualified Bid, each member of the Selection Committee shall consider whether the Bid adequately addresses the evaluation factors, and apply such weighting and priority to the factors as such member of the Selection Committee deems appropriate in his or her professional judgment.  I am making the assumption that as the bids are submitted to the debtor [BBBY - that it is the board or just the <strong>&quot;Special Committee&quot;</strong> that evaluates any bid made].  <strong>The committee includes Carol Flaton, Pamela Corrie, Jonathan Foster, and Joshua Schechter.</strong>  </p>\n\n<p>There is a solid post on the special committee here: [ <a href=\"/u/stategery_22\">u/stategery_22</a> ]  <a href=\"https://www.reddit.com/r/ThePPShow/comments/137awal/is_there_something_to_this_ad_hocspecial/\">https://www.reddit.com/r/ThePPShow/comments/137awal/is_there_something_to_this_ad_hocspecial/</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Objection Deadlines.</strong> The deadline to file an objection with the Court to the consummation of the Sale (excluding objections relating solely to the conduct of the Auction or identity of the Successful(s) Bidder other than the Stalking Horse Bidder) is <strong>June 5, 2023, at 4:00p.m.</strong> (the “Sale Objection Deadline”). If the Auction is held, objections relating solely to the identity of the Successful Bidder(s) (other than the Stalking Horse Bidder) or adequate assurance of future performance provided by the Successful Bidder(s) other than the Stalking Horse Bidder must be filed with the Court. Any objections not resolved prior to the Sale Hearing shall be argued at the Sale Hearing or such other time as set by the Court <strong>[June 7]</strong>.</li>\n</ul>\n\n<p>The important note from this is <strong><em>excluding objections relating solely to the conduct of the Auction or identity of the Successful(s) Bidder other than the Stalking Horse Bidder.</em></strong> </p>\n\n<p>Put simply, if there are no other <strong>qualified bids</strong> [These are bids which are agreed by the debtor, as detailed above], then there will be no objection. To object to the sale, you must have a qualified bid. A bidding party can object to the conduct of the auction, but they must have an initial qualified bid.</p>\n\n<p><strong>Why a new final hearing date?</strong></p>\n\n<p>This is pure speculation, but, from experience, if there are no fresh matters to discuss or a court timetable is not due to be fulfilled then an early final hearing date is set.</p>\n\n<p>The 28 May is the &#39;bid deadline&#39;, however, if there are no further qualified bids then the 2 June hearing will not be required/effective [as there is no auction]. The sale hearing can also be moved back, to allow for a consolidated final hearing [again, as there are no other qualified bids/objections relating to the conduct of the auction].</p>\n\n<p>If the 31 May date, is the consolidated final hearing, that&#39;s 16 calendar days - 384 hours - until the gavel is smashed for the last time on proceedings and the outcome will become final and public.</p>\n\n<p><strong>TLDR:</strong> As always NFA, you do you... but, based on the assumption that the moved final hearing date is possibly a consolidated final hearing date, only one qualified bid has been made [or others have been made but are not deemed qualified bids]. If you&#39;re hiding in your scuba suit in RC&#39;s pool [like me] then this is good news... we&#39;ve won! #onlytheyoung <a href=\"/u/realpulte\">u/realpulte</a> </p>\n\n<p><strong>A little tinfoil</strong> - May the 4th be with you:</p>\n\n<p>Pulte: Got our deal done. Another company under the belt. Details soon. In meantime, let’s help people <a href=\"https://twitter.com/pulte/status/1654176728774737924\">6:30 pm · 4 May 2023</a><br/>\n Then May 12th:</p>\n\n<p><a href=\"https://preview.redd.it/yeu0gbcopzza1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=ecac0edb15a61d55bd09e36e803e23b988c35716\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/yeu0gbcopzza1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=ecac0edb15a61d55bd09e36e803e23b988c35716\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/pcKsKDybz0CNOFqTatLFS2QfvuOirc9sKyDuJb7ubSg.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/137ljut/are_we_going_to_get_taken_private/", "time": 1683208838.0, "subreddit": "r/ThePPShow", "title": "Are we going to get taken Private?", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is where we are, in ch11 court proceedings...trading OTC.</p>\n\n<p>We are now within a set timeframe, governed by court deadlines:</p>\n\n<p>On April 25, 2023, the Bankruptcy Court entered an order approving the bidding procedures in connection with the sale of all or substantially all of the Debtors&#39; assets.</p>\n\n<ul>\n<li>Stalking Horse Deadline:  May 22, 2023, at 5:00 p.m. (prevailing Eastern Time)</li>\n<li>Bid Deadline:  May 28, 2023, at 12:00 p.m. (prevailing Eastern Time) - In 24 days</li>\n<li>Auction (if applicable): An Auction may be held on June 2, 2023, at 10:00 a.m. (prevailing Eastern Time) via live auction</li>\n<li>Notice of Successful Bidder:  As soon as reasonably practicable after the conclusion of the Auction (if necessary).</li>\n<li>Sale Objection Deadline: June 5, 2023, at 4:00 p.m. (prevailing Eastern Time)</li>\n<li>Sale Hearing: June 7, 2023, at 10:00 a.m. (prevailing Eastern Time), or as soon thereafter as the Court’s calendar permits </li>\n</ul>\n\n<p>That&#39;s 34 calendar days - 816 hours - until the gavel is smashed for the last time on proceedings and the outcome will become final and public.</p>\n\n<p>We have seen initial court documents with RC documented as an &#39;interested party&#39; - the definition of this is till debated. However, with the lack of other lawsuit participants et al documented on these sheets, I would come down on the side of an &#39;interested bidder&#39;. Also, the cohencidence of the &#39;RC buys all stocks&#39; tweet timing. We can all argue the toss on this minutae as much as we want, but we can&#39;t come to a concrete conclusion... I don&#39;t see Tritton on the list [interested part due to pay-out  compensation].</p>\n\n<p>We are still without an actual notice of delisting from NSDAW, although this assumed due to trading OTC currently.</p>\n\n<p>I remain with my original thesis that the plan is for the company to get bought out and taken private at a pre-agreed price per share. Which is why the low/falling share price and other factors - moving to OTC don&#39;t matter.</p>\n\n<p>If as speculated the deal was done in January and has been held up/forced through ch11 - and it is RC behind it, then I feel he would hold true to any initial offer made and accepted rather than spending a fortune on negotiations and reworking documents/face losing the deal completely.</p>\n\n<p>The price per share can only be speculated at, but assuming a market cap of 460,000,000 and a price of about $6/7 per share would offer around $3 billion - [maybe split as $1 billion for BBBY(q) and $2 billion for BABY] - which would fulfil the RC letter point of  -</p>\n\n<p><strong>&quot; In the event Bed Bath pursued a full or partial sale of BABY, it could position itself to pay off debt, put cash on the balance sheet and continue reducing its share count, thereby creating significant value for shareholders. Spinning off shares of BABY would be an even more efficient way to transfer value to shareholders. Notably, BABY’s high online penetration would likely ease operational hurdles. We assume Bed Bath and BABY could still have a shared services agreement to maintain an omnichannel experience for customers. &quot;</strong></p>\n\n<p>Again, the final price can only be speculated at, but we must assume that if it does go to auction then the final price will go up, same in relation to the stalking horse bid - it will set a high value platform to ensure purchasing success.</p>\n\n<p>The recent GME vote in relation Larry and RC and the GME board, would not matter in terms of conflict, if in fact, GME will absorb BABY directly into their functioning [see pinned post on <a href=\"/r/ThePPShow\">r/ThePPShow</a> regarding GME targeting new partnerships].</p>\n\n<p>Negatives approaching:</p>\n\n<p>If we remain on OTC and get taken private at a pre-agreed price per share then following S1 form and take private date there would be a date for shorts to close by. Please review MMTLP and the U3 hault from FINRA in relation to this, as this is exactly what happened with this stock.</p>\n\n<p>The winning bidder does not end up being RC et al [although I doubt it won&#39;t be at this point] - then I think it is game over and it is purely a sell of money making exercise for the purchaser  and very little consideration will be shown to shareholders.</p>\n\n<p><strong>Final prediction</strong></p>\n\n<p><strong>We get taken private via auction as outlined above. The point in RC letter is followed.</strong></p>\n\n<p>Price per share is the equivalent to $6/7. Shareholders receive $2 per share and a 20/1 stock convert of BBBY(q) to GME [or, if the IPO of BBBY is planned behind the scenes $2 per share and a 15/1 stock convert of BBBY(q) to BABY - placing BABY with an initial  IPO of around $15/20].</p>\n\n<p>We have 24 days - possibly 34 days - 816 hours until this is finally concluded... start the countdown.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/flw7nqxgmtxa1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=4315ceca76b6ab59be9583b23c39dfce205f4d2d\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/flw7nqxgmtxa1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=4315ceca76b6ab59be9583b23c39dfce205f4d2d\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Crr2AM-uyPmN93X7D-7NK2szrLbH_gu8-puhOIWQxMI.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/136pqv8/uk_hargreaves_lansdown_to_ibkr_urgent_help_needed/", "time": 1683126637.0, "subreddit": "r/ThePPShow", "title": "UK - Hargreaves Lansdown to IBKR - Urgent help needed", "text": "<!-- SC_OFF --><div class=\"md\"><p>UK Ape needing some assistance with transferring across to IBKR.</p>\n\n<p>Shares currently in a basic share /fund dealing account with HL. I&#39;ve opened the account with IBKR.</p>\n\n<p>I have just finished a ridiculously long call with IBKR, who have said that they are unable to initiate a share fund transfer of the BBBY over to IBKR, to allow OTC trading. I was advised that because it is trading &#39;on the pinks&#39; that a transfer could not be initiated until after the corporate action is finalised.</p>\n\n<p>&#x200B;</p>\n\n<p>Can someone help me out here, what am I doing wrong in the wording or facilitating the transfer?   Or, how has anyone with HL managed it?</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Allforbbby", "url": "https://i.redd.it/ci5ni59cd1xa1.jpg", "time": 1682848751.0, "subreddit": "r/ThePPShow", "title": "The briefest post", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hugely brief post, more of a thought over morning coffee….</p>\n\n<p>… what if Sue didn’t realise her interview was going to be filed with the SEC? </p>\n\n<p>The sec filing is not signed off by anyone in particular. Possibly done to show that she was complicit in lying and the shenanigans behind the scenes.</p>\n\n<p>Then ch11 filing a few days later?</p>\n\n<p>Further evidence of nefarious activity by the board to present to the court?</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ci5ni59cd1xa1.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/12zp1qn/its_all_possibly_preplannedbut_why_now/", "time": 1682526646.0, "subreddit": "r/ThePPShow", "title": "It's all possibly pre-planned...but, why now?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Here we are ladies, gentlemen, regards, OG and newbies alike. The following,  as always, is NFA and is purely my opinion.</p>\n\n<p>We are reaching the end of this saga... but how will it all end? This we are unsure of, but we do have dates to work to.</p>\n\n<p>Nasdaq informed the Company that trading in the Company&#39;s common stock would be suspended at the opening of business on May 3, 2023. That&#39;s next Wednesday, which leaves 7 normal days or 4 trading days until this happens. It is important to note, that this is suspension and not the actual delisting date, and alot can happen between now and then to stop this.   An announcement of an agreed takeover, application to extend or halt the suspension by BBBY or maybe a small squeeze [which would, for most, render the notion of suspension/delisting moot anyway].... or, maybe we could all take this BOBBY over?</p>\n\n<p>The most curious thing about all of this, is the timing. If BBBY knew this was the plan, then why now? Why not string it out further?</p>\n\n<p>I was ignored when I suggested that, like previous announcements, the RS may not actually happen or be rescheduled... well, it&#39;s been cancelled.</p>\n\n<p>I wrote to the BBBY board last week, on Thursday, key takeout from my letter is below:</p>\n\n<p><strong>Excerpt from letter</strong></p>\n\n<p>currently in the process of going through a DRS procedure in relation to the shares held by individual retail shareholders. Although not 100% accurate, it is believed that retail investors hold beneficial ownership of over 10% of the company shares. This would place the “collective retail investment” as a top five shareholder of Bed, Bath &amp; Beyond, Inc. (“Bed Bath” or the “Company”).</p>\n\n<p>Retail investors have spent the last 12 months meticulously evaluating and reviewing Bed Bath’s balance sheet, business practice and forward investment strategy. It has been noted that positive moves have been made to improve the business in the past year, however, there remains significant concerns which need to be addressed.</p>\n\n<p>The public letter (“the letter”) received by the board from ‘RC Ventures LLC’, dated 6 March 2023, detailed significant concerns in relation to Bed Bath and evidenced disappointing shareholder returns and underperformance across a relevant time horizon. The letter clearly outlines 4 steps which leadership should undertake to improve the performance of the company and increase shareholder value.</p>\n\n<p>It is accepted that Bed Bath has made positive improvements in relation to suggestions made in the letter. There have been clear moves made to ‘trim the fat’ from underperforming parts of the company and a more simple approach to business dealings undertaken. The pledge made to be ‘cash neutral’ by Q4 seems to have been acknowledged during the Q2 earnings call. However, it is felt that aside from required SEC filings, communication from the Company to shareholders and “collective retail investment” is simply not adequate. The current share price stands at $0.34, which is below the same price the Company was listed at late October 1992. </p>\n\n<p><strong>There needs to be more open and frequent communication from Bed Bath in relation to the falling share price and related short interest.</strong></p>\n\n<p>The suggestions are as follows:</p>\n\n<ol>\n<li><p><strong>Implement and commence a more open and informative shareholder communication strategy</strong> – From our perspective, there is little or no communication with shareholders in relation to forward strategy and declining share price. It is accepted that there is a requirement to undertake work in a diligent and confidential manner. What is not accepted is the lack of consultation with shareholders and in particular “collective retail investment”. Whilst it is not expected that management publish a detailed strategy ‘for all to see’, what is expected is direct communication with shareholders via press release in relation to the falling share price. As investors and key stakeholders, at a time when it is noted that short term bankruptcy seems to be ‘off the table’, positive affirmations of this thesis and recognition by the Company of the current ever declining share price should be clearly communicated.</p></li>\n<li><p><strong>Overall recognition and calculation of “collective retail investment”</strong> – There is currently an active thesis underway in relation to the direct registration of shares (DRS) by retail investors. This has been undertaken by transfer of registration of individual shares to ATST. As a publicly listed company, Bed Bath is able to directly request up to date information in relation to the number of shares which have been subject to DRS. It is kindly requested that the Company make this information public to shareholders, ideally on a frequently updated basis. It is suggested that this information can be communicated via regular press release or via an active counter widget on the investor relation section of the Company website.  </p></li>\n<li><p><strong>Positively undertaking Fiduciary duties in respect of Bed Bath and shareholders</strong> – In the “letter”, RC Ventures highlighted that a positive path for the Company to pursue would be to ‘<em>…pursue a full or partial sale of BABY, it could position itself to pay off debt,</em> <em>put cash on the balance sheet and continue reducing its share count, thereby creating significant value for shareholders.’</em> Or to <em>‘Evaluate a full sale to a well-capitalised acquirer - …the market is not giving the Company nearly enough credit for BABY’s value. A sale that can lock in a substantial premium for shareholders and provide Bed Bath the flexibility of the private market.’.</em> It has been widely debated that this would indeed be the most positive avenue for the Company to actively pursue. Actioning this suggestion would not only improve and ensure survival of the Company, but would also demonstrate actions being undertaken in the best interests of the company on behalf of shareholders.  </p>\n\n<ol>\n<li><strong>Acknowledgement, clarification and explanation of unexplained events during the last 12 months</strong> – It is noted that the last 12 months have been a time of great turbulence and unsurety for Bed Bath, this can also be said in relation to “collective retail investment”. A number of SEC filings have been made in a very short space of time, without further explanation to investors for the reasoning behind the filings. The purpose of filings are by definition self explanatory, however, reasoning and communication to shareholders in light of the ever declining share price is glaringly absent. It is kindly requested that an explanation is made to shareholders via press release, in which an explanation is provided for the recent filings.<br/>\nFollowing the exit of investor Ryan Cohen from his position in the Company during August 2022, a published ‘co-operation agreement’ (“agreement”) was issued. There is great uncertainty from analysis of the document as to the precise date when the agreement will actually cease to be active and in place. From analysis of the document, the date March 16th 2023 has been suggested as the earliest point of the document ceasing to be in place. Please could Bed Bath communicate this information in a clear way to shareholders via press release, it is kindly suggested that this be done in a timely manner.</li>\n</ol></li>\n</ol>\n\n<p>It is hoped that the current leadership acts with the utmost urgency to address the points raised in this letter and provide absolute clarity to shareholders.</p>\n\n<p>Finally, it is with this letter, that the board is notified of possible initial plans by “retail investment” to possibly form a together conglomerate, and potentially seek to initiate a hostile takeover of Bed Bath via majority share purchase, should the board not urgently seek to action the above request(s).</p>\n\n<p>3 days later the ch11 hearing has commenced. </p>\n\n<p>Make of this what you will, but, on the last point... before next Wednesday... could we all actually intervene and all of us takeover BOBBY?  </p>\n\n<p><a href=\"https://preview.redd.it/j75yta4z99wa1.jpg?width=636&amp;format=pjpg&amp;auto=webp&amp;s=d72796c96d454b7b1cc426426d2a326c71318c50\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/j75yta4z99wa1.jpg?width=636&amp;format=pjpg&amp;auto=webp&amp;s=d72796c96d454b7b1cc426426d2a326c71318c50\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/e4p81TrSz09CxDLdaotd3Ch-MnjPR5GWYQHrNHKyYmY.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/gallery/12vkjzd", "time": 1682200017, "subreddit": "r/ThePPShow", "title": "The right to amend or cancel", "text": "After reading back through the sec filings, it appears that… maybe, we will never have a vote?\n\nBbby can cancel, amend and/or reschedule the vote at any time. Just like the extensions and sudden conclusion/cancellation of the bond deal. I’m still very much of the opinion, that the answer and deal was concluded throughout the period the bond deal took place.\n\nJust an fyi, although we may have calculated the end date to the standstill/cooperation agreement (and it now being over). It is very unusual that after such a high profile RC initial connection and initial “exit” (with accompanying press release) there has been nothing via press release to confirm the end of this agreement and detail final related information regarding it.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Bs2k8GkIHBAGOy9pxBvT2oUpHU2ezihGMWM8XYR7kRA.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/gallery/12vkjzd", "time": 1682200017.0, "subreddit": "r/ThePPShow", "title": "The right to amend or cancel", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/gallery/12osy7i", "time": 1681687035.0, "subreddit": "r/ThePPShow", "title": "Is the answer in the bond exchange?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m not going for a lengthy post with this.</p>\n\n<p>At the present point, we have little but absolute speculation to draw on. That is the problem.</p>\n\n<p>I am firmly in the RC camp. My main concern with this thesis is the reading of the January Titanic tweet… the ship is going down and he only want Baby and no other part of the business.S</p>\n\n<p>I think the board has played hardball and at the last minute, tried to raise the price. Which has led to the recent RC tweet.</p>\n\n<p>This left me considering all that has happened over the last year.</p>\n\n<p>What if, the answer lies in the bond exchange? The exchange was extended multiple times, which, as speculated was to ensure certain parties holding large positions converted…or didn’t. </p>\n\n<p>The setup for this RS vote and the current predicament was settled during the bond exchange programme.</p>\n\n<p>Remember, they extended the bond exchange multiple times….and then cancelled it.</p>\n\n<p>The same flexibility is there with the RS, whichever way the vote turns out.</p>\n\n<p>This has been a huge smokescreen. My thought is that it has been strung out by the board for RC (and associates) to take all off BBBY and not just pluck the “crown jewel”</p>\n\n<p>Nfa</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/o3xu_0-8zrZXPA8X72lVur4hP1lemWxc-rvD2BhrgMk.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/12m3ync/to_create_a_baby_you_need_a_momma_as_well_as_a/", "time": 1681491826.0, "subreddit": "r/ThePPShow", "title": "To create a BABY you need a Momma as well as a Poppa", "text": "<!-- SC_OFF --><div class=\"md\"><p>This week we have had:</p>\n\n<p>- 4 press releases from the board</p>\n\n<p>- 5 SEC filings (with many, many pages)</p>\n\n<p>The latest landing today &#39; <strong>Shop Bed Bath &amp; Beyond® and buybuy BABY® for Mother&#39;s Day Planning and Gifts</strong> &#39;.... followed by a 1 to 1 interview with our own  Momma - Sue Gove.</p>\n\n<p>As we all know, even the most regarded, you need a momma and a poppa to make a baby [immaculate conception aside].</p>\n\n<p>Let&#39;s take a look at the PR and the products inside, specifically the 2 t-shirts linked at the end; with the slogans &#39;mom makes everything better&#39; and &#39;I love you mommy&#39;. <strong>Sue Gove is our Momma</strong>.</p>\n\n<p>Then the interview is dropped.</p>\n\n<p>&quot;Acquisition rumours...actually  , no... I haven&#39;t heard any of them..so..I guess I really can&#39;t comment&quot;</p>\n\n<p>Spoken like your mom trying to conceal a big family surprise event....badly.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/muku8iqgsvta1.png?width=320&amp;format=png&amp;auto=webp&amp;s=3585a1b488a417abbf95ced3dbfd60316a427262\">\\&quot;Acquisition rumours...actually  , no... I haven&#39;t heard any of them..so..I guess I really can&#39;t comment\\&quot;</a></p>\n\n<p>2 days before we have the sudden break of cover from our <strong>Poppa RC</strong>.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xbu2q6tcsvta1.png?width=1153&amp;format=png&amp;auto=webp&amp;s=cd5d4ffa885c168bf11ec0fb9f1a344c8446091e\">Has Poppa been on the phone to Momma again?</a></p>\n\n<p>And just before this, we had the s1 dropped: <a href=\"https://bedbathandbeyond.gcs-web.com/node/17211/html\">https://bedbathandbeyond.gcs-web.com/node/17211/html</a></p>\n\n<p>My thoughts on this are here: <a href=\"https://www.reddit.com/r/ThePPShow/comments/12j0kwi/so_i_think_its_happening_just_when/\">https://www.reddit.com/r/ThePPShow/comments/12j0kwi/so_i_think_its_happening_just_when/</a></p>\n\n<p>TLDR for the linked page - IMO setting up for a short squeeze over a 20 day period following announcement of a change of control. The right to waive the right to enter a fundamental transaction is held by the warrant holder… who will waive to enable BABY (new cusip) spin off.</p>\n\n<p>From Bed Bath FM being under radio silence to the sudden flurry of comms over the airwaves in 5 days.... something is happening and I think we are about to see momma Gove and poppa Cohen deliver their BABY. They better take a trip to BBBY and sign up to &#39;Welcome Rewards&#39; ASAP... those baby grows aren&#39;t going to purchase themselves.</p>\n\n<p><strong>Countdown until possible earnings</strong> - 8 business days</p>\n\n<p><strong>Countdown until RS</strong> - 17 business days</p>\n\n<p><strong>Countdown for Momma Gove to put her feet up on Mother&#39;s day</strong> - 20 business days</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/CLrBEdM8GgzoVN_GSnhnKfxQ7FvuPd4HgUxl8bQwIyQ.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/12m3sby/to_create_a_baby_you_need_a_momma_as_well_as_a/", "time": 1681491524, "subreddit": "r/ThePPShow", "title": "To create a BABY you need a Momma as well as a Papa (Cohen)", "text": "This week we have had:\n\n\\- 4 press releases from the board\n\n\\- 5 SEC filings (with many, many pages)\n\nThe latest landing today ' **Shop Bed Bath & Beyond® and buybuy BABY® for Mother's Day Planning and Gifts** '.... followed by a 1 to 1 interview with our own  Momma - Sue Gove.\n\nAs we all know, even the most regarded, you need a momma and a poppa to make a baby \\[immaculate conception aside\\].\n\nLet's take a look at the PR and the products inside, specifically the 2 t-shirts linked at the end; with the slogans 'mom makes everything better' and 'I love you mommy'. **Sue Gove is our Momma**.\n\nThen the interview is dropped. \n\n\"Acquisition rumours...actually  , no... I haven't heard any of them..so..I guess I really can't comment\"\n\nSpoken like your mom trying to conceal a big family surprise event....badly. \n\n&#x200B;\n\n[\\\\\"Acquisition rumours...actually  , no... I haven't heard any of them... so... I guess I really can't comment\\\\\"](https://preview.redd.it/99n38h5povta1.png?width=320&format=png&auto=webp&v=enabled&s=ff823984907029681c2535efab0d19c2a58accaf)\n\n2 days before we have the sudden break of cover from our **Poppa RC**.\n\n&#x200B;\n\n[Has Daddy been on the phone to Mommy again?](https://preview.redd.it/eu56nl1yovta1.png?width=1153&format=png&auto=webp&v=enabled&s=2d80e1d42b3680102d998ed93e8893eb3206b695)\n\nAnd just before this, we had the s1 dropped: [https://bedbathandbeyond.gcs-web.com/node/17211/html](https://bedbathandbeyond.gcs-web.com/node/17211/html)\n\nMy thoughts on this are here: [https://www.reddit.com/r/ThePPShow/comments/12j0kwi/so\\_i\\_think\\_its\\_happening\\_just\\_when/](https://www.reddit.com/r/ThePPShow/comments/12j0kwi/so_i_think_its_happening_just_when/)\n\n TLDR for the linked page - IMO setting up for a short squeeze over a 20 day period following announcement of a change of control. The right to waive the right to enter a fundamental transaction is held by the warrant holder… who will waive to enable BABY (new cusip) spin off.\n\nFrom Bed Bath FM being under radio silence to the sudden flurry of comms over the airwaves in 5 days.... something is happening and I think we are about to see momma Gove and poppa Cohen deliver their BABY. They better take a trip to BBBY and sign up to 'Welcome Rewards' ASAP... those baby grows aren't going to purchase themselves.\n\n**Countdown until possible earnings** \\- 8 business days\n\n**Countdown until RS** \\- 17 business days\n\n**Countdown for Momma Gove to put her feet up on Mother's day** \\- 20 business days", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/p1O7ZYW5ptvFg3bQMMVEe4g2XKuXwhNAzMAt3kcuz4c.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/gallery/12la47b", "time": 1681426418.0, "subreddit": "r/ThePPShow", "title": "Let’s all count 10 working days from the 12 April…. 26 April… what is happening or around the 26 April? Earnings?", "text": "<!-- SC_OFF --><div class=\"md\"><p>So, let’s all hope this gets exciting…</p>\n\n<p>Once a significant over 5% ownership is taken in a company, a form needs to be filed with SEC.</p>\n\n<p>The tweet from RC can be read (however you please, I am saying it’s about BBBY)… but, the forward looking statement is ‘this could get interesting’.</p>\n\n<p>This can be read from 2 timeline points:</p>\n\n<p>1)the day it was written\n2)the presumption it was tweeted retrospectively, after he concluded his initial call with BBBY in 2022</p>\n\n<p>If it is 2, then we better buckle up. The deal was signed, finished and we are waiting for an announcement. This would also fit in with the red balloon and Icahn, I mean china, I mean Chinese hello tweet. The timeline suggestion that the deal was held up and then finally signed.</p>\n\n<p>If it is 1, then we better buckle up. RC has seen the figures, reviewed the current position with the board and the choices being made. He’s bought ‘all the stocks’ (maybe after that initial tweet, but yesterday). It’s a hostile takeover, he wants BABY and…. He’s not leaving.</p>\n\n<p>So, the timing? This would bring us, roughly, to the day before, or the day of, the earnings call.</p>\n\n<p>If RC is undertaking a hostile takeover and isn’t in favour of what is happening… what better time to do it? Right before the earnings call?</p>\n\n<p>If he is not, and the announcement is pending… what better time to do it? A week before earnings. To raise the capital, by selling into the squeeze and reporting the profits into earnings.</p>\n\n<p>One way or the other, the proposed date of the RS is  9 May… that’s 18 working business days… who is going to start the countdown?</p>\n\n<p>Lift off or Take down?🦍🦧💎</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/QHUv2qdcGGNypmFx4_IIG9r6HZ07e-w9HQg38S-bsds.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/gallery/12k6tdz", "time": 1681348702.0, "subreddit": "r/ThePPShow", "title": "Remember the 9 March…. And now today April 13….", "text": "<!-- SC_OFF --><div class=\"md\"><p>Strange timing… following the s1…. I think its time….time for the intervention</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/1AGekQF5IvMeQf9EqjbMNq14lUaSwTu8Q6O8PPzyic4.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/gallery/12j0kwi", "time": 1681253095.0, "subreddit": "r/ThePPShow", "title": "So… I think it’s happening… just when?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Big filing - key pages in the pictures on this post</p>\n\n<p>Pg129 - Change of Control\n“Commencing on the date of the provision of notice to the Series A Convertible Preferred Stock holder of a change of control of the Company and ending on 20 trading days after the later of (i) the consummation of such change of control, (ii) the date of receipt of the notice of change of control, or (iii) the date of announcement of the change of control, the holder of Series A Convertible Preferred Stock may require the Company to convert all or a portion of such holder’s Series A Convertible Preferred Stock for consideration equal to the Change of Control Election Price, to be satisfied at the Company’s election (such election to pay in cash or by delivery of the Rights (as defined below), a “Consideration Election”), in either (I) rights (collectively, the “Rights”), convertible in whole, or in part, at any time, without the requirement to pay any additional consideration, at the option of the holder, into such Corporate Event Consideration (as defined below) applicable to such change of control equal in value to the Change of Control Election” </p>\n\n<ul>\n<li>I read this as the deal has been done and the announcement is pending - there will then be 20 days of extreme price volatility (squeeze).</li>\n</ul>\n\n<p>“ with the aggregate number of Successor Shares issuable upon exercise of the Rights with respect to the first Successor Share Value Increment determined based on 70% of the Closing Bid Price of the Successor Shares on the date the Rights are issued and on each of the nine (9) subsequent Trading Days, in each case, the aggregate number of additional Successor Shares issuable upon exercise of the Rights shall be determined based upon a Successor Share Value Increment at 70% of the Closing Bid Price of the Successor Shares in effect for such corresponding Trading Day (such ten (10) Trading Day period commencing on, and including, the date the Rights are issued, the “Rights Measuring Period” </p>\n\n<ul>\n<li>to me this looks like selling into the squeeze (like gme) to raise to the cash without dilution (remember just because briley has the warrants they aren’t necessarily diluting)</li>\n</ul>\n\n<p>Pg 130 - “ Until the applicable Change of Control Election Price is paid in full to the applicable Holder in cash or Corporate Event Consideration, the Series A Convertible Preferred Stock submitted by such holder for exchange or payment, as applicable, may be converted, in whole or in part, by such holder into Common Stock or in the event the Conversion Date is after the consummation of such change of control, stock or equity interests of the Successor Entity substantially equivalent to the Company’s shares of Common Stock”</p>\n\n<ul>\n<li>I read this as if BABY (corporate event/successor entity) is not spun off to the holder, then they will dilute </li>\n</ul>\n\n<p>Pg 133</p>\n\n<ul>\n<li>I read this as  converting to Similar in entity - new cusip warrants to the same fundamental value (new CUSIP BABY) and/or the holder can waive the right to enter the fundamental transaction (which of course they would, if the fundamental transaction was of course instigated by the holder).</li>\n</ul>\n\n<p>TLDR - IMO setting up for a short squeeze over a 20 day period following announcement of a change of control.</p>\n\n<p>The right to waive the right to enter a fundamental transaction is held by the warrant holder… who will waive to enable BABY (new cusip) spin off…</p>\n\n<p>…. Now has anybody seen that affable\nMissing Canadian billionaire anywhere?</p>\n</div><!-- SC_ON -->", "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/_Jt3PnwcrRovOG5rcQdTcmb5E1NGWTxCM4F6LyzxXKA.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://i.redd.it/3bae69s2ebra1.jpg", "time": 1680354980.0, "subreddit": "r/ThePPShow", "title": "And the story continues…", "text": null, "flair": {"text": "☄ Strikes down shills ☄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3bae69s2ebra1.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/gallery/127jus2", "time": 1668883520, "subreddit": "r/ThePPShow", "title": "Is this it… the final breakfast before the deal? 3 seats on the board?", "text": "I’m awful with photoshop but I’ve provided the goods…. Can we get these three missing billionaire juggernauts sitting together on the board please?", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/y0v8hlitwXNb10A_qxawd3WTXUFtsf2iiTpiwV9xVPg.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://i.redd.it/byn9vvjnp3ra1.jpg", "time": 1668883520, "subreddit": "r/ThePPShow", "title": "Doing the lords work and a seminal picture of where we are at….", "text": "", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/byn9vvjnp3ra1.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://i.redd.it/mi3k54zwjzqa1.jpg", "time": 1668883520, "subreddit": "r/ThePPShow", "title": "Empty chair or a baby chairman incoming? 🪑 👶", "text": "Incoming chairman? Strange timing?", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mi3k54zwjzqa1.jpg\"/></div>"},
{"username": "Allforbbby", "url": "https://www.reddit.com/r/ThePPShow/comments/11yk2tg/very_truly_yoursdisappearing_billionaires_and/", "time": 1668883520, "subreddit": "r/ThePPShow", "title": "Very truly yours....disappearing billionaires and many reasons to be cheerful!", "text": " Here we find ourselves in the end game for this long saga. I want to put a shout out to my fellow ape [u/Real\\_Eyezz](https://www.reddit.com/u/Real_Eyezz/) for being there for all the ear bending in relation to my theories and tin foil as this has unfolded.\n\n\\- **The price spike on 6 February** \\- I'd suggest this is a large position being bought of the lit market directly. I wonder whether this could have something to do with the third party transfer of RC's stake back when he sold\n\n\\- **The NDA** \\- It is not logical that an NDA would simply be broken by a casual noting of the HBC signatory. Especially without a press release to officially announce this information. If they are not acting as a proxy.. there is another/multiple parties involved here.\n\n\\- **Staff** \\- The executives hired to join the board and legal. Why would they be hired and the deal planned, simply to be an awful deal for shareholders?\n\n\\- **RC Ventures** \\- There is still one of the original RC board members on the board. Would they approve a 'death spiral' deal?\n\n\\- **Bankruptcy** \\- The share price is now lower than when BK was not off the table. Although not definitely avoided, it would be safe to say that BK has now gone for the short term with the deal.\n\n\\- **BABY** \\- This is the [u/biggysmallzzz](https://www.reddit.com/u/biggysmallzzz/) ... If it does all go wrong and Ch11 ends up being the end game - and all of this is for nothing - they still have BABY to seell to balance the books and the accompanying possible share price rise if this happens\n\n\\- **RC is mute** \\- Before BBBY he would tweet 3/4 times a week, now he barely tweets. We all assume the standstill is over - why radio silence?\n\n\\- **New CUSIP** \\- If the RS happens, the unclosed shorts get stored on the old CUSIP and the interest due on those positions will forever be due and need to be paid by the shorts as they cannot be closed.....\n\n[**Ryan Cohen**](https://twitter.com/ryancohen)[**@ryancohen**](https://twitter.com/ryancohen) **Low interest rates may prove to be like easy sex — tempting but possibly fatal - 12 October 2022**\n\n\\- **Dragonfly** \\- 3 very wealthy men have gone missing without a trace - Cohen, Blake and Cheng have disappeared from the board... and another rich bloke Brett Icahn - Are we to assume that's the end of their business dealings and they have decided on early retirement?\n\n\\- **Very Truly Yours** \\- Maybe something, maybe nothing, maybe commonplace language. Sue Gove signed off the last filing with very truly yours. Last seen by the late Gustavo on 31 August filing. Finally here, in the filing on February 7th \\[the day after the price spike\\] from the unsigned mystery buyer ... [https://www.sec.gov/Archives/edgar/data/886158/000119312523027117/d455173dex11.htm](https://www.sec.gov/Archives/edgar/data/886158/000119312523027117/d455173dex11.htm)\n\n&#x200B;\n\n[SWALK](https://preview.redd.it/qmnhru5dpapa1.png?width=636&format=png&auto=webp&v=enabled&s=e9878fa9a5962868e335c090795344791928dd74)\n\nhttps://preview.redd.it/7fj4qdgvrapa1.png?width=190&format=png&auto=webp&v=enabled&s=4aa5bd39c568f18ee6ac15889f898216ea8d8735", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Ta3xvAfcAzv8GOpck5y3AnQzVfbrVy5WDXJ77tK_87k.jpg\"/></div>"}]