[{"username": "anethum_graveolens", "url": "https://www.reddit.com/r/ThePPShow/comments/127eegk/b_riley_affiliates/", "time": 1643200545, "subreddit": "r/ThePPShow", "title": "B. Riley affiliates", "text": "Okay, so since I can't post over on the main sub I'll put it here. Just in case it causes problems (brigading?) I'm not going to provide links to the posts, I'll refer to them by title...\n\nThere are posts referring to the most recent filings and how they mention the investor is an affiliate of B. Riley Securities.\n\nI tried to illustrate this in a comment to a previous post, but people need to realise that there are two separate B. Riley entities involved in this and they are affiliates.\n\nThe ATM is handled by B. Riley Securities, Inc.\n\nThe Common Stock Purchase Agreement is with B. Riley Principal Capital II, LLC.\n\nB. Riley Principal Capital II, LLC is an affiliate of B. Riley Securities, Inc.\n\nThe first post titled \"Found two more juicy snippets ...\" by /u/Region-Formal refers to [this](https://www.sec.gov/Archives/edgar/data/886158/000119312523084725/d477204dex102.htm) which is EX-10.2 from [this](https://www.sec.gov/Archives/edgar/data/886158/000119312523084725/0001193125-23-084725-index.htm) filing. Specifically, this paragraph\n\n>WHEREAS, the Company acknowledges that the Investor is an Affiliate of the B. Riley group of entities, and its Affiliate, B. Riley Securities, Inc. (“BRS”), is acting as the Investor’s representative in connection with the transactions contemplated by the Transaction Documents.\n\nThe \"investor\" is defined earlier in the document here:\n\n>This COMMON STOCK PURCHASE AGREEMENT is made and entered into as of March 30, 2023 (this “Agreement”), by and between B. Riley Principal Capital II, LLC, a Delaware limited liability company (the “Investor”), and Bed Bath & Beyond Inc., a New York corporation (the “Company”).\n\nThe \"investor\" **is** B. Riley Principal Capital II, LLC.\n\nThere's a second post titled \"The \"Affiliate\" is the key to the deal\" by /u/throwmeaway1344 also refers to this affiliate, however, there is one interesting thing this post highlighted for me in [this](https://www.sec.gov/Archives/edgar/data/886158/000119312523084693/d468823d424b5.htm) 424B5 filing:\n\n>An affiliate of BRS is a holder of our common stock warrants.\n\nThe reason I find this interesting is that BRS were the underwriters for the preferred stock/warrant offering and as far as I'm aware BBBY have never mentioned any entity purchasing common stock warrants (can anyone confirm if BBBY has reported any common stock warrant purchases?). The common stock warrants were given to the investor(s) that purchased preferred shares and exercised preferred stock warrants.\n\nWhy does an affiliate of BRS have common stock warrants and how did they get them? Finally, I'm going to bring it up again, could these in some way contribute to the increased outstanding share count?", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "anethum_graveolens", "url": "https://www.reddit.com/r/ThePPShow/comments/1256ksl/number_of_investors_common_stock_warrants/", "time": 1643200545, "subreddit": "r/ThePPShow", "title": "Number of investors, common stock warrants, outstanding shares, dilution?", "text": "I've been wanting to post this for a while to hear what William/@halroach13/@pirateportfo have to say but haven't had time, so I'm going to try and throw this together quickly prior to the next stream.\n\nFirst, I believe there's at most 3 and most likely 1 investor involved in the recent offering. This is because in the 8-K filed [here](https://www.sec.gov/ix?doc=/Archives/edgar/data/0000886158/000119312523027117/d455173d8k.htm) BBBY stated:\n\n>The Offering was consummated on February 7, 2023 (the “Closing Date”). The Company received gross proceeds of approximately $225 million on the Closing Date and may receive up to an additional approximately $800 million of gross proceeds in subsequent closings over up to ten months\n\nI interpret this as all (or almost all) 23,685 shares of preferred stock were sold and the investors that purchased more than $75,000,000 worth have access to all (or almost all) of the 84,216 shares of preferred stock by exercising any preferred stock warrants.\n\nThis is calculated from 23,685 x $10,000 = $236.85m - fees = \\~$225m and 84,216 x $9,500 = \\~$800m.\n\nNow, if you read the 424B5 [here](https://www.sec.gov/Archives/edgar/data/886158/000119312523030356/d406368d424b5.htm) it states:\n\n>Prospective investors that purchase $75,000,000 or more of our Series A Convertible Preferred Stock and Common Stock Warrants will also receive a pro rata interest in our Series A Convertible Preferred Stock Warrants to purchase up to 84,216 shares of our Series A Convertible Preferred Stock, subject to adjustment as provided in the Series A Convertible Preferred Stock Warrants.\n\nThe \"pro rata\" inclusion suggests to me that if an investor were to purchase 1/3 of the 23,685 preferred shares (7,895 x $10,000 = $78.95m) they would then receive an interest in the preferred stock warrants for 1/3 of the 84,216 preferred shares (28,072 shares of preferred stock).\n\nOther evidence (such as referring to a single preferred stock warrant PW-001) suggests a single investor, however, it's convenient that the largest common denominator of 23,685 and 84,216 resulting in an equal investment of at least $75m is 3. Hence, at most 3 investors is likely.\n\nNext, in that 424B5 ([here](https://www.sec.gov/Archives/edgar/data/886158/000119312523030356/d406368d424b5.htm) again) it states:\n\n>We are offering 23,685 shares of our Series A Convertible Preferred Stock together with Common Stock Warrants. Each investor will receive Common Stock Warrants to purchase common stock in an amount equal to the sum of (i) 10.0% of the number of shares of common stock issuable upon conversion of our preferred stock purchased in this offering at the closing of this offering (and if applicable, the shares of common stock issuable upon exercise of our Series A Convertible Preferred Stock Warrants purchased in this offering on the date of the closing of this offering), and (ii) 50.0% of the aggregate number of shares of common stock issuable upon conversion of the preferred stock issued to such investor on the closing date of this offering at the Alternate Conversion Price (as defined below) as measured as of the date of pricing of this offering) in each case, without regard to any limitations on conversion set forth in the Certificate of Amendment (as defined herein). If the holder of a Common Stock Warrant also holds Series A Convertible Preferred Warrants, then the number of shares of common stock issuable upon the exercise of the Common Stock Warrant held by such investor shall automatically increase on each exercise date of the Series A Convertible Preferred Stock Warrant, on a share by share basis, by 50.0% of the aggregate number of share of common stock then issuable upon conversion of the Series A Convertible Preferred Stock issued to the holder in each exercise of the holder’s Series A Convertible Preferred Stock Warrant at the Alternate Conversion Price.\n\nIn other words, if you buy preferred shares you also get common stock warrants. If you have common stock warrants and preferred stock warrants then exercise any preferred stock warrants you get more common stock issuable when exercising common stock warrants.\n\nI'm not sure if anyone has discussed this but can these common stock warrants account for the increase in reported outstanding shares? I.e. no one has converted any preferred shares for common shares, they just hold common stock warrants. It may be possible to calculate how many shares, however, it depends on when the preferred stock warrant was exercised, what the previous day closing bid was, and the 10-day VWAP to figure it out...", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]