[{"username": "Annabelle-92", "url": "https://www.reddit.com/r/ThePPShow/comments/14nwcyx/i_rewrote_ajs_comments_from_last_nights_stream/", "time": 1688221367.0, "subreddit": "r/ThePPShow", "title": "I re-wrote AJ's comments from last nights stream. Seems to agree with Life?", "text": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>Reminder 1/8 : The sale schedule is outlined by the court dates. Our conclusion is near. Trust the process. Imminent ‘fundamental transaction’ will trigger forced closure of shorts (i.e. MOASS).  </p></li>\n<li><p>RC is building TEDDY. We’re watching its establishment in real-time. Trademarks suggest no need for existing branding. Sale of IP covers the DIP. Future partnerships with selected bidders possible.  </p></li>\n<li><p>Sixth Street = R.C. The Sixth Street FILO loan in August had purpose (i.e. LBO; otherwise no bank would finance ~$400M to a company facing bankruptcy).  </p></li>\n<li><p>8K for Sixth Street FILO loan filed same day cooperation agreement with RC was reiterated by Sue Gove (separate 8K; 08/31/22). Debt-4-equity TSO shock incoming. David Hillman spanking Glenn for RC.  </p></li>\n<li><p>6th Street (RC, creditor) and an e-commerce platform (Dragonfly w/ Volition funds) will conduct a full sale (- IP) at the &quot;BABY going concern auction (07/07)&quot; then reverse △-merge into TEDDY (tax-efficient).  </p></li>\n<li><p>$1 bil inventory. $5 bil revenue. Logistics/operations of a 50+ year international corp. NOLs/real-estate value. Excessive confidentiality/NDAs. Cryptic tweets. Carve-out stipulations in BK docs.  </p></li>\n<li><p>Insinuating “no buyers” is MORONIC 🤡, details of the full sale are hidden (NDA)! Infinite squeeze is an ASSET. 🩳 on the verge of EPIC destruction. BBBYQ holders will empty their pockets through the rubble!  </p></li>\n<li><p>8/8 : Resist the short-and-distort campaign. Eat the shills with your eggs for breakfast. Be confident. You made the right decision! NO LIQUIDITY. BUY. HOLD. WAIT. NFA.</p></li>\n</ol>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]