[{"username": "Any_Initiative3699", "url": "https://www.reddit.com/r/ThePPShow/comments/14cuzje/a_short_story_for_all_you_pps/", "time": 1687121904, "subreddit": "r/ThePPShow", "title": "A short story for all you pp’s", "text": "Once upon a time in the peculiar town of Citadel, there lived a man named Ken Griffins. Ken was known for his unusual and somewhat eccentric taste in food. While most people enjoyed the traditional combinations, Ken had a peculiar fondness for mayo-filled butthole’s and cock.\n\nThe townsfolk couldn't understand why Ken had such an odd culinary preference. Some thought he had simply lost his taste buds, while others believed he was playing an elaborate prank. However, Ken had a secret reason behind his unique cravings.\n\nYears ago, Ken was a struggling con-artist trying to make ends meet. He would spend countless hours in his office, Masterbating over his worker’s. However, inspiration often eluded him, leaving him frustrated and disheartened.\n\nOne day, as Ken stared at his rotten cock, he decided to take a break and went to the local diner for a meal. The only option available was mayo-laden butthole’s and a massive cock for dessert. Hungry and desperate, Ken decided to give it a try.\n\nTo his surprise, as he took a bite of the mayo-filled butthole and followed it up with a lick of the massive cock, something magical happened. The combination of creamy mayo and sweet cock sparked a burst of creativity within him. Life seemed brighter, erection’s flowed effortlessly, and his gayness took on a new life.\n\nFrom that day forward, Ken discovered that the strange combination of mayo-filled butthole’s and cock unlocked his depraved genius. Whenever he needed inspiration, he would devour a mayo-filled butthole and indulge in a massive cock, resulting in a quirky masterpiece of mess.\n\nWord of Ken's con’s success spread throughout the Citadel, and soon all his workers embraced his unorthodox food pairing. Mayo-filled butthole’s and massive cock’s became a symbol of hope and joy in the Citadel, and his people started experimenting with their own unusual food combinations.\n\nAs for Ken Griffins, he continued to delight in his mayo-filled butthole’s and massive cock feasts, becoming a beloved figure in the Citadel. His pleasures gained international recognition, with critics applauding his whimsical taste and unique food option.\n\nAnd so, in the town where absurdity reigned supreme, Ken Griffins thrived, not only as a con-artist but as a symbol of embracing the unconventional. Because sometimes, it's in the most unexpected pairings that true evil emerges, even if it involves a mayo-filled butthole and a massive cock.\n\nThe End", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Any_Initiative3699", "url": "https://i.redd.it/vlk931bbnt6b1.jpg", "time": 1687113731, "subreddit": "r/ThePPShow", "title": "A short bedtime story for all you pp’s", "text": "Once upon a time in the peculiar town of Citadel, there lived a man named Ken Griffins. Ken was known for his unusual and somewhat eccentric taste in food. While most people enjoyed the traditional combinations, Ken had a peculiar fondness for mayo-filled butthole’s and cock.\n\nThe townsfolk couldn't understand why Ken had such an odd culinary preference. Some thought he had simply lost his taste buds, while others believed he was playing an elaborate prank. However, Ken had a secret reason behind his unique cravings.\n\nYears ago, Ken was a struggling artist trying to make ends meet. He would spend countless hours in his studio, Masterbating over bumholes and vibrant cock. However, inspiration often eluded him, leaving him frustrated and disheartened.\n\nOne day, as Ken stared at his rotten cock, he decided to take a break and went to the local diner for a meal. The only option available was a mayo-laden butthole’s and a massive cock for dessert. Hungry and desperate, Ken decided to give it a try.\n\nTo his surprise, as he took a bite of the mayo-filled butthole and followed it up with a lick of the massive cock, something magical happened. The combination of creamy mayo and sweet cock sparked a burst of creativity within him. Colors seemed brighter, ideas flowed effortlessly, and his gayness took on a new life.\n\nFrom that day forward, Ken discovered that the strange combination of mayo-filled butthole’s and cock unlocked his creative genius. Whenever he needed inspiration, he would devour a mayo-filled butthole and indulge in a massive cock, resulting in a quirky masterpiece of mess.\n\nWord of Ken's artistic success spread throughout the Citadel, and soon all his workers embraced his unorthodox food pairing. Mayo-filled butthole’s and massive cock’s became a symbol of creativity and imagination in the Citadel, and his people started experimenting with their own unusual food combinations.\n\nAs for Ken Griffins, he continued to delight in his mayo-filled butthole’s and massive cock feasts, becoming a beloved figure in the Citadel. His art gained international recognition, with critics applauding his whimsical style and unique perspective.\n\nAnd so, in the town where absurdity reigned supreme, Ken Griffins thrived, not only as an actor but as a symbol of embracing the unconventional. Because sometimes, it's in the most unexpected pairings that true evil emerges, even when it involves mayo-filled buttholes and massive cock’s.\n\nThe End", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/vlk931bbnt6b1.jpg\"/></div>"},
{"username": "Any_Initiative3699", "url": "https://www.reddit.com/r/ThePPShow/comments/14b91px/a_hype_letter_to_all_you_bbbyq_holds/", "time": 1686952554.0, "subreddit": "r/ThePPShow", "title": "A hype letter to all you bbbyq hold’s", "text": "<!-- SC_OFF --><div class=\"md\"><p>Dear Fellow Apes,</p>\n\n<p>I&#39;m writing to you today to express my admiration for your unwavering strength and dedication in holding Bed, Bath, and Beyond stock through thick and thin. You are the true diamond-handed heroes of our movement!</p>\n\n<p>As I look at the chart, I cannot help but feel the excitement pumping through my veins. The price action has been a true marvel, with wild swings, steep climbs, and breathtaking drops. But through it all, you have stood tall, fearless in the face of doubt and uncertainty.</p>\n\n<p>You have not given in to the naysayers, the short-sellers, or the detractors. You have not flinched at the whims of the market makers or the manipulators. Instead, you have held your ground, steadfast and defiant, because you know the truth - that Bed, Bath, and Beyond is a diamond in the rough, a gem waiting to be polished.</p>\n\n<p>You have placed your faith in the company, in its leadership, and in its vision. You have done your homework, your analysis, and your due diligence, and you have come to the right conclusion - that this is a stock with enormous potential, a stock that can and will deliver meaningful returns.</p>\n\n<p>And so, my dear apes, I call upon you to keep holding, to keep buying, and to keep spreading the word about the beauty and the potential of Bed, Bath, and Beyond. Let us show the world what we are made of, let us demonstrate that we have the courage, the tenacity, and the wisdom to ride this all the way to the moon.</p>\n\n<p>Thank you for being a part of this awe-inspiring journey. Together, we will change the world.</p>\n\n<p>Sincerely,\nYour fellow ape.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Any_Initiative3699", "url": "https://i.redd.it/mmpcv85j1g6b1.jpg", "time": 1686949016.0, "subreddit": "r/ThePPShow", "title": "Fuck the shf’s", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just a little poem to erect your pp’s! LFG! 🦧🖍️💎👋👀🚀🛩️🦍💨</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mmpcv85j1g6b1.jpg\"/></div>"},
{"username": "Any_Initiative3699", "url": "https://www.reddit.com/gallery/141fd38", "time": 1685973337.0, "subreddit": "r/ThePPShow", "title": "69 days old today apes! 69 days of hodl bbby!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Eat your mayo Ken! You grifter!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/k-2i6hoIOZ5RlPLdTbKr-rZAJjQF7eYBFLoGow5tfsk.jpg\"/></div>"}]