[{"username": "arkansah", "url": "https://i.redd.it/y4d998hcui1c1.jpg", "time": 1700494286.0, "subreddit": "r/ThePPShow", "title": "Have you seen this before? Is this our boy Mayo. Spent hours looking for more info and couldn't find anything.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/y4d998hcui1c1.jpg\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/17zqkk9/has_this_been_posted_a_matt_furlong_has_a/", "time": 1700492854.0, "subreddit": "r/ThePPShow", "title": "Has this been posted? A Matt Furlong has a children's book. Bellas Wings", "text": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s about<br/>\n<em>In the initial book, Bella’s Wings, a caterpillar realizes the struggles of loneliness, feeling un-special and finding self-worth.</em> </p>\n\n<p><a href=\"https://fable.co/book/bellas-wings-by-maryah-furlong-9781512703405#author\">https://fable.co/book/bellas-wings-by-maryah-furlong-9781512703405#author</a></p>\n\n<p>Title: Bella&#39;s Wings</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/17trmtn/today_is_the_beginning_of_the_festival_of_lights/", "time": 1699817450.0, "subreddit": "r/ThePPShow", "title": "Today is the beginning of the Festival of Lights known as Divali", "text": "<!-- SC_OFF --><div class=\"md\"><p>Divaly is &quot;victory of light over darkness, good over evil, and knowledge over ignorance&quot;. The celebrations generally last five or six days.</p>\n\n<p>I only mention this because of previous tins that have recently come out such as:</p>\n\n<p>November 14, 2023.  (2023 =7). so we have 1 4 7.  Perhaps that evening.</p>\n\n<p>Or the tin on the PP Show suggesting  November 15th.  </p>\n\n<p>Of course we regards are already in the light about the conspiracies that the financial markets has perpetrated on the market.  We&#39;ve suffered through the ridicule of family and friends when their Questions seemingly lead further into a rabbit hole and not out of it.</p>\n\n<p>Maybe I&#39;m crazy, but I think between today and the 17th, there will be a lot of truths come to light.  Just in time to have an amazing Thanksgiving.  Too many coincidences.  Thanks Ryan</p>\n\n<p>A true regard</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/17okflw/did_you_know_option_writers_and_purchasers_can/", "time": 1699214826.0, "subreddit": "r/ThePPShow", "title": "Did you know Option writers and purchasers can file suit against the Underlying Company?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/17ev3i1/11_us_code_741_definitions_for_this_subchapter_7/", "time": 1698095090.0, "subreddit": "r/ThePPShow", "title": "11 U.S. Code § 741 - Definitions for this subchapter 7. For claims when the broker is liquidated", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is the link to to the page on the <a href=\"https://www.law.cornell.edu/uscode/text/11/chapter-7/subchapter-III\">Cornell Law School</a> Or for those that don&#39;t trust links.  11 U.S. Code Subchapter III - STOCKBROKER LIQUIDATION</p>\n\n<p>If you have shares still in broker accounts its is your <strong>Responsibility</strong> to ready this. </p>\n\n<p>Sub Chapter <strong>1</strong> <strong>Commission</strong> is the SEC</p>\n\n<p>Fahking legalese sucks.  I think the first definition of a  <strong>Customer</strong> I think is tricky, I think it&#39;s a ladder, with us at the bottom rung.  We&#39;re customers of brokers, brokers are customers of Banks?.....banks are customers of......</p>\n\n<p>(A) would be brokers</p>\n\n<p>(B) I think these are the APES because we are customers of the first.</p>\n\n<p>Section <strong>4</strong> is &quot;<strong>Customer Property</strong>&quot;</p>\n\n<p>In relations to stock brokers this would be any money they had to deposit with organizations high and other assets.</p>\n\n<p>In relation to Apes, It would be cash deposits, certificate for benefits.  Stock if DRS.  etc...</p>\n\n<p>Even  I  think this may be what Neely Das was claiming on his appeal. &quot; </p>\n\n<p><strong><em>(i)</em></strong><em>property that was unlawfully converted from and that is the lawful property of the estate;</em></p>\n\n<p>Section <strong>7</strong> is <strong>Securities Contract</strong></p>\n\n<p>a contract for the purchase, sale, or loan of a security,  But more importantly includes “repurchase agreement” which include swaps and loan shares.</p>\n\n<p>So 741 and 147</p>\n\n<p>If or when your broker goes bankrupt.  you will file a claim on them and they will be the debtor.  But they will claim on the Market Maker??  who will also go bankrupt and they will file a claim on the Bank...  not sure when it&#39;s stops</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/176d10r/there_is_only_one_way_a_case_gets_opened_back_up/", "time": 1697133142.0, "subreddit": "r/ThePPShow", "title": "There is only one way a case gets opened back up after Confirmation of Plan", "text": "<!-- SC_OFF --><div class=\"md\"><h2>Revocation of the Confirmation Order</h2>\n\n<p>Revocation of the confirmation order is an undoing or cancellation of the confirmation of a plan. A request for revocation of confirmation, if made at all, must be made by a party in interest within 180 days of confirmation. The court, after notice and hearing, may revoke a confirmation order &quot;if and only if the [confirmation] order was procured by fraud.&quot; 11 U.S.C. § 1144.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "arkansah", "url": "https://www.youtube.com/watch?v=cISYzA36-ZY", "time": 1697055465.0, "subreddit": "r/ThePPShow", "title": "With all of this M&amp;A talk, I wish we had Paul Allen on the dockets.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/cISYzA36-ZY/hqdefault.jpg\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/17438t4/i_just_wrote_a_huge_article_that_didnt_post_wtf_2/", "time": 1696886105.0, "subreddit": "r/ThePPShow", "title": "I just wrote a huge article that didn't post WTF?? 2 hundy k put writer opened bankruptcy case back up", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.repository.law.indiana.edu/cgi/viewcontent.cgi?referer=&amp;httpsredir=1&amp;article=3177&amp;context=facpub\">Article describes what&#39;s happening in the BBBY bankruptcy court</a></p>\n\n<p>The put writer of the 200k put options that expire 2025 became a creditor the moment the shares were cancelled.  remember when you buy a put, you want the stock to drop, when you sell a put it&#39;s a long positions.  Anyway,  the bad actors tried to cram  the bankruptcy through the court, however as a single-asset debtors ends up with a lot of right s in  this procedure.  He is able to join another class.  Such as the share holders the plan must be equitable and fair to all asset classes.  But since <strong>put write</strong>r cannot be compensated for his open position, the remaining assets must be divided equally  among all the classes.  Here is a kicker, that only applies to current, so they debtors won&#39;t get a part of the NOLs, but most importantly I think this demonstrates that we will get shares in the new company.  Another kicker, these debtor classes are often strewn together with creditors that aren&#39;t subject to the bankruptcy, usually nobody cares because there are no assets at all, but if they are found out, the class is invalid and they won&#39;t receive any distribution of assets.  Happy reading guys.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/171is2y/did_robinhood_entice_people_to_purchase_bbby/", "time": 1696614267.0, "subreddit": "r/ThePPShow", "title": "Did Robinhood entice people to purchase BBBY before the huge dip?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was visiting friends because I know they don&#39;t buy stock and I wanted to set them up with at least a few shares of a similar stock that should moass too.  I found out one of them had 3 shares of BBBY through RobinHood that they purchased after reading an article on the app.  The purchase was Nov 2 2021.  The stock ran briefly up to 22.5 till March 1st 2022 and then spiraled down.</p>\n\n<p>I&#39;m wondering if this may have been orchestrated.  Can you think of other examples like this on some of these apps?</p>\n\n<p>Is there any hope they can transfer those 3 shares now?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/16yyqhp/what_happened_to_the_speculators_that_wrote/", "time": 1696355866.0, "subreddit": "r/ThePPShow", "title": "What happened to the speculators that wrote 200,000 put options for 2025?", "text": "<!-- SC_OFF --><div class=\"md\"><p>January 2025 had a Hundreds of thousands put options purchase and sold.  The question is what happens to the put options after bankruptcy.  Well the persons that bought the options would make some money.,  the person who wrote would according to one website. Since it is the company that is going illquid and insolvent and not the person or institution who sold you those put options, you are guaranteed your profit and delivery. Pretty cool if you wrote the options.  You just made 595k+546k 1.141 million dollars and take delivery of of 210 million dollars that you could sell back into the market (let&#39;s say Monday or settle date) price was .18.  X 21 Million or another cool 1.68 million for a  total net trade of3.9 million roughly.</p>\n\n<p>However, here&#39;s the interesting part.  That written Put options are technically a long position What if the writer of the options doesn&#39;t want to get closed out?  He still 2 years for them to expire.  Well I couldn&#39;t find much information about it from then SEC, they only wrote about loans and bonds. However a  court case in <a href=\"https://law.asia/bombay-high-court-upholds-option/\">India</a> ruled that  person that sold the put option is technically a debtor. Yes it&#39;s India however these courts mostly operate under Maritime law.  And the put owner is technically being denied infinity profits. If the person wasn&#39;t one of the listed debtor, I believe they would have 14 days after the effective date to bring an action to the bankruptcy court.  That person or group will have a lot of power to wield over what happens if the effective plan has to be voided.  </p>\n\n<p>Does anyone know if that person or group was listed as a debtor?  They may have also filed a a suit under Chapter 11 Section V.  </p>\n\n<p>&#x200B;</p>\n\n<p>Can someone check my number on this option trade</p>\n\n<p>BBBYQ final price .08</p>\n\n<p>1 dollar strike</p>\n\n<p>Last price was .97</p>\n\n<p>Expires Jan 202</p>\n\n<p>open interest was  119,000. </p>\n\n<p>This would have given the options contract write the ability to purchase 11,900,000 share for just under .03</p>\n\n<p>.08-.03 .05 cents per share.or 595.000</p>\n\n<p>Another Trade for Options put</p>\n\n<p>Final price .08</p>\n\n<ol>\n<li>dollar Strike</li>\n</ol>\n\n<p>Finale sale price </p>\n\n<p>!,98</p>\n\n<p>OpenInterest </p>\n\n<p>~91,000</p>\n\n<p>Share the options writer could have purchase at the end 9,100,000</p>\n\n<p>for .08 -.02 = .06 or 546,000</p>\n\n<p>Here is the interesting aspect</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "arkansah", "url": "https://www.reddit.com/r/ThePPShow/comments/16w8bd3/hasnt_happened_yet_and_may_be_it_doesnt_happen/", "time": 1696084271.0, "subreddit": "r/ThePPShow", "title": "Hasn't happened yet And may be it doesn't happen, but Cohen removed the sell button", "text": "<!-- SC_OFF --><div class=\"md\"><p>Take moment to appreciate the timing of the cancellation of shares.  If RC is trying to make you whole as we think is his intent.  Cancelling the shares after hours takes away the sell button.  There is literally no market for you to sell BBBY.  Ponder that chess move.  I don&#39;t know how long Butterfly has to issue the new shares Maybe he can sit on them for a while let the hedges contemplate there error . And then issue you new share with a smaller price than the previous but with the value of MOASS.  The is really quickly becoming a Masterpiece</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]