[{"username": "AromaticStage8741", "url": "https://www.reddit.com/r/ThePPShow/comments/14ke6a8/just_the_beginning/", "time": 1687873440.0, "subreddit": "r/ThePPShow", "title": "Just The Beginning", "text": "<!-- SC_OFF --><div class=\"md\"><p>We are approaching $.5 and that&#39;s when people are finally going to be allowed to execute their calls. </p>\n\n<p>It is about to get violent soon. We will be seeing 2-300% days here soon. We have seen liquidity has dried up, CTB rising, in our squeeze cycle, all the DD, etc. We are in the end game and have already won.</p>\n\n<p>Let&#39;s finish the SHFs.</p>\n\n<p>NFA</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "AromaticStage8741", "url": "https://www.reddit.com/r/ThePPShow/comments/146g4wj/shorts_automatically_margined_called/", "time": 1686444456.0, "subreddit": "r/ThePPShow", "title": "Shorts Automatically Margined Called?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been following along since beginning of this year and it&#39;s been a journey. Currently have around 13k shares and 4k shares in calls.</p>\n\n<p>I have a question. Let&#39;s say the bid is equivalent to $5/share and is announced tomorrow. Monday at 930am the stock automatically shoots up to $5+.</p>\n\n<p>Now let&#39;s say a retail short held over the weekend at had shorted 100k shares at .2 or $20k in shorted shares as he believed that the bid was going to be very low. Maybe his total portfolio is worth $100k in total. Well Monday morning he is now -$400k in his portfolio and there was nothing he could do since at 930am when BBBY is tradable it went to $5. Does this automatically create a margin call and liquidate his portfolio? He doesn&#39;t have the money to close his short position. What happens? Do brokers just close his position to reduce risk and he&#39;s in debt to them? Do they just let him ride it even though he doesn&#39;t meet the margin requirements?</p>\n\n<p>Just wanted to see if this would be a possible scenario to help aid in shorts covering. I would imagine this would only impact retail traders and small SHFs at first.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]