[{"username": "Artistic_Tie_890", "url": "https://www.reddit.com/r/ThePPShow/comments/15hungj/german_brokers/", "time": 1691139342.0, "subreddit": "r/ThePPShow", "title": "German brokers", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Artistic_Tie_890", "url": "https://www.reddit.com/r/ThePPShow/comments/15hts7q/simple_take_on_1728question/", "time": 1691136255.0, "subreddit": "r/ThePPShow", "title": "Simple take on 1728-question:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Either RC is in, or he is not in. </p>\n\n<p>If RC is in: would he need a last minute docket, to get his will through? And if he would need that, why not get his lawyers to write it? Would retail have to fend for their interests, when NOLs already require us to be kept alive? Worlds best team of lawyers brought us to this point; was it all just for a fancy liquidation, or is there something more going on? If the process needed more transparency, more bids, if RC wanted in, in the prima facile way 1728 suggests, RC already had months to bid on all this shit. Would he really need random investors to get a foot in? </p>\n\n<p>My conclusion: if RC is in, shareholders are in good hands. If RC is not in, yes, then we need to fend for our interests. But if RC is not in, he thought BBBY hopeless, maybe corrupt - if he is not in, or one of his friends, we are likely fucked, regardless of 1728. But did BBBY leadership get Estin, Holly, etc, just to liquidate and fuck us over more expensively? If BBBY wanted to get fucked, why did they fight, nail, tooth and claw, to protecc against smelly Glenn? No, that’s not it. BBBY leaders are not corrupt. Same team that shat on Glenn, want exclusivity and were happy to be granted it by P the G. It comes back to RC. If he’s in, if Carl is in, this has been in the works for long time. Let them continue in silence under exclusivity agreements. If RC not in, then we have put up what we could, but let us then accept our situation. Only scenario where 1728 makes sense, is if RC not in (he wouldn’t need our help putting in random dockets) and we have to fight ourselves. </p>\n\n<p>I’ll take my chances, on RC being in and letting the process be undisturbed. If BBBY lawyers, that fucked Glenn, want exclusivity, give them that. I don’t think it’s wise to NOW separate from this team, to ostensibly “fight for RC” by allowing anyone to offer new ch11 plans. Fuck that. Look, at this point you are in one of two camps; team holly, or team not-holly. Who the fuck is in team not-holly? Oh, I know. Glenn and his greasy friends, for sure. I won’t take the risk. </p>\n\n<p>If RC in, we are already in good hands. If RC not in, then he isn’t, for a reason. These were the chances we took when we bought, let’s stick to that. Inventing a new way, “for RC” - no. My 50c.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Artistic_Tie_890", "url": "https://www.reddit.com/r/ThePPShow/comments/15b6vbk/psa_shillcon_6_hide_yo_kids_hide_yo_wife_edt/", "time": 1690476463.0, "subreddit": "r/ThePPShow", "title": "PSA: Shillcon 6 🚨🚨🚨 Hide yo kids hide yo wife edt.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Never seen this level shilling before. Other subs are full, literally every thread! In combo with cute little dip, wow. After 84 years, they expect me to fall for this? I’m disappointed and a bit offended tbh.</p>\n\n<p>If we get full disclosure on Aug 1, this weekend is final boss. But even at full Shillcon 6 alert, this is too easy. We’ve seen guys jumping out of windows. -50% dips in a matter of minutes. SEC throwing jeopardy sketches. Suits crying. Implied destruction of toxic swap positions by solar storms. Literal aliens. Corrupt mods throwing rune curses. </p>\n\n<p>But this: “tHey SeLl all StORes, lOok mA!” In combo with -10% dip? Wtf! \nI expected ALOT more for final weekend fud. Either this is not the final weekend, or hedgies are truly outplayed and out of options.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]