[{"username": "ArtInternational8589", "url": "https://www.reddit.com/r/ThePPShow/comments/180jov6/remember_to_be_kind_and_to_be_strong_our_dd/", "time": 1700580813.0, "subreddit": "r/ThePPShow", "title": "Remember to be kind and to be strong. Our DD writers aren't Yoda. They're people just like you and me.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Everybody needs to remember that everything we read will only ever be speculation. Just because it comes from a docket doesn&#39;t mean it is a cold, hard fact. It is a piece of the puzzle that we are trying to fit into an outcome that we can only speculate upon. </p>\n\n<p>We have a couple of DD writers here (not knocking them at all, they put in a lot of hard work and are a beacon of light within our community during the darkest of times) who are trying to complete a puzzle that is so complex, it holds the potential to break the crime that our american market is built around. Our guys have lives and families and are trying to navigate a world that is built around structural and institutional bias that are meant to divide the power between the working class and the wealthy. They don&#39;t have careers in complex law with decades of experience under their belts, allowing further access to insider information, and they certainly aren&#39;t part of bobby&#39;s chapter 11 case. Yet here they are still trying to complete a puzzle by piecing together the tiniest of pieces (most of which are from the past) in order to give us an idea of what this puzzle could look like when it&#39;s complete. </p>\n\n<p>Everyone is doing their best here to give us an idea of what could happen. Cut em some slack and take hype dates with a grain of salt. They can really break you mentally if you get your hopes up thinking tomorrow is really tomorrow. </p>\n\n<p>There are always three sides to a story: Your story, their story, and the real story. This is still the same play it&#39;s been when I entered over a year ago. Lambos or ramen (would never buy a lambo, I just look forward to the comfort of knowing my family and I will finally be financially free to live the lives we should be able to live). If you hold onto what made you believe in this play in the beginning, it should still be what you hold onto now only with further unwavering conviction. </p>\n\n<p>Hold strong everyone.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ArtInternational8589", "url": "https://www.reddit.com/r/ThePPShow/comments/17uay6w/thoughts_on_our_drsd_shares/", "time": 1699883108.0, "subreddit": "r/ThePPShow", "title": "Thoughts on our DRSd Shares?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been seeing a lot of posts regarding what&#39;s going on with brokerages and the ticker disappearing then reappearing. I haven&#39;t seen any recent speculation/theories as to where our DRSd shares have gone or where/how they&#39;re going to reappear. </p>\n\n<p>Our brokerages (most of them) say even though our shares were removed, they still have record of them in case/when new shares/cash/whatever is reissued/issued. I find it odd that AST doesn&#39;t even allow me to log into my account anymore because it doesn&#39;t exist after my bbby shares disappeared. </p>\n\n<p>Interested in anyone&#39;s and everyone&#39;s thoughts here.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ArtInternational8589", "url": "https://www.reddit.com/r/ThePPShow/comments/15zzj29/optout_yay_or_nay/", "time": 1692877203.0, "subreddit": "r/ThePPShow", "title": "Opt-Out. Yay or Nay?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Who opted out of being able to be a part of a class action lawsuit and why?</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ArtInternational8589", "url": "https://www.reddit.com/r/ThePPShow/comments/141yph4/to_drs_or_not_to_drs/", "time": 1686013929.0, "subreddit": "r/ThePPShow", "title": "To DRS or NOT to DRS", "text": "<!-- SC_OFF --><div class=\"md\"><p>What&#39;s everyone doing here? Seriously, give it to me straight. What are you guys doing/thinking and why?</p>\n\n<p>I have 13,115 shares in AST and 1650 in my Fidelity cash account. I am still unable to register my account online through AST due to their maintenance bullshit. I never received my account number from them (received it through a loophole by requesting a transfer of ownership through their automated phone system and that packet had my account number on it). So I do have an account and multiple reps have told me my shares are there, but I have also receieved conflicting information regarding the date when my shares hit AST and why I have yet to receive my new registration information. </p>\n\n<p>I&#39;m thinking Im going to transfer all of my shares back into fidelity account. The thought of having my shares in AST right now without being able to create an account online (due to maintenance that none of the reps have any information about)  in order to view them is rubbing me the wrong way. </p>\n\n<p>Thoughts?</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]