[{"username": "BBBYcansurpassHKD", "url": "https://www.reddit.com/r/ThePPShow/comments/17i69kd/building_on_what_anasthera_said_on_tonights_show/", "time": 1698468456.0, "subreddit": "r/ThePPShow", "title": "Building on What Anasthera said on Tonight's Show", "text": "<!-- SC_OFF --><div class=\"md\"><p>Anasthera gave some great wealth management advice on the show tonight. I want to add one caveat and one additional point. </p>\n\n<p>Basically the TLDR of Anasthera&#39;s advice is: once you are wealthy, get an estate attorney ASAP; an estate attorney is critical to protecting your assets. You can look for law firms in your area on chambers.com.</p>\n\n<p>This is great advice but I want to add: Utilizing personal/professional connections is essential to finding the best attorney for you. Cold calling firms from chambers.com is okay, but it is not going to open all doors or get you the best service. An example from personal experience - my family&#39;s estate attorney directly told me that he doesn’t have a website because he doesn’t like working with people from “off the street.” And let me tell you, a lot of attorneys feel this way because there are a lot of litigious idiots/scam artists/people who try to get out of paying their attorney bills/assholes out there and if you cold call any legal professional, they will be wary of you. </p>\n\n<p>So what can you do to have the best law firms welcome you with open arms? Get a referral. </p>\n\n<p>If you don&#39;t have any rich friends that can put you in touch with their attorney, then go to your bank and talk to a banker (not a bank-teller, a real banker.) All the bank&#39;s big clients have attorneys and banks also have their own attorneys to deal with finance law, so the banker should have a long list of local law firms and will likely have opinions about many of them. After they give you the name of a law firm, ask them if they know how the firm prefers to be contacted and, if needed, if the banker could give the firm a heads up that you will be contacting them. This way the law firm knows (1) to be expecting you, (2) that you have been &#39;screened&#39; by a professional they have worked with in the past.</p>\n\n<p>BUT HERE THE MOST IMPRORTANT PART:  When contacting legal or financial professionals via email, you must use specific, professional wording. In your first message:</p>\n\n<p>Don’t say, “I want to hire you.”  Instead say, “I would like to engage your services.”</p>\n\n<p>Don’t say, “How much do you charge?”  Instead say, “Could you provide me your fee schedule?”</p>\n\n<p>It is also good to mention if you are single, married, or in a domestic partnership so they can quickly grasp who all will be involved with the estate planning process. Below are two example email messages.</p>\n\n<p>___________________________________________________</p>\n\n<p>Subject: Estate Planning</p>\n\n<p>Hi [Ms. Attorney],</p>\n\n<p>I was referred to you by [First and Last Name of Banker] at [Bank]. </p>\n\n<p>I am interested in engaging your services to create an estate plan. I currently do not have a will or trust, but due to recent financial windfall, I need to put together an estate plan as soon as possible. If you have availability to meet with me in the coming week, could you send me a copy of your fee schedule?</p>\n\n<p>Thank you,</p>\n\n<p>[You]</p>\n\n<p>[Your Phone Number] | [Your Personal Email – not your work email]</p>\n\n<p>____________________________________________________</p>\n\n<p>Subject: Estate Planning</p>\n\n<p>“Hello [Mr. Attorney],</p>\n\n<p>One of your clients, [Jon Doe], recommended you to us for estate planning services. </p>\n\n<p>My wife and I have a basic will which needs to be revised. Additionally, we intend to create a more thorough estate plan including a trust.</p>\n\n<p>We would like to engage your services to help us with these matters. If you have the availability to work with us, could you please provide us a copy of your fee schedule and let us know how you would like to proceed?</p>\n\n<p>Thank you,</p>\n\n<p>[spouse &amp; spouse]</p>\n\n<p>[Your Phone Number(s)]</p>\n\n<p>[Your Personal Email(s) – not your work email]</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]