[{"username": "BeerPizzaGaming", "url": "https://www.reddit.com/r/ThePPShow/comments/16tyqrq/for_the_euro_homies_youre_gone_too_soon_youll_be/", "time": 1695854821.0, "subreddit": "r/ThePPShow", "title": "For the Euro homies.... you're gone too soon. You'll be poor, but not forgotten. :)", "text": "<!-- SC_OFF --><div class=\"md\"><p>Now that their positions have been forced closed let show them some love.</p>\n\n<p><a href=\"https://i.redd.it/s4k4y6rimvqb1.gif\">Pour one for the Euro-homies.</a></p>\n\n<p>All of our foreign teammates and anyone else whom has been force closed.  When this rips, be sure to raise hell and force changes in how your markets and brokers operate.  No reason you should have had to become bagholders if you wanted to hold onto those shares until the bitter end.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/ElXcI5b7NZHrdVwcJFLD-8S9QkI0Vh31Dv4SQ-V44T4.jpg\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.reddit.com/r/ThePPShow/comments/16pp20a/just_remember_many_of_the_leaders_in_financial/", "time": 1695425813.0, "subreddit": "r/ThePPShow", "title": "Just remember many of the leaders in financial institutions and hedgies whom are short came from the IVY league schools...", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>It&#39;s so bad they had to send out a school wide bulletin about this?  WTF<br/>\nI guess they DONT fuck at Yale.  LOL  </p>\n\n<p>Image from: <a href=\"https://www.reddit.com/r/Connecticut/comments/16pnop2/yalies_are_special/\">https://www.reddit.com/r/Connecticut/comments/16pnop2/yalies_are_special/</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cq58r5no5wpb1.jpg?width=1079&amp;format=pjpg&amp;auto=webp&amp;s=4bd52c9d43169bd2c72efe075f8f909e4057b537\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/cq58r5no5wpb1.jpg?width=1079&amp;format=pjpg&amp;auto=webp&amp;s=4bd52c9d43169bd2c72efe075f8f909e4057b537\" alt=\"https://preview.redd.it/cq58r5no5wpb1.jpg?width=1079&amp;format=pjpg&amp;auto=webp&amp;s=4bd52c9d43169bd2c72efe075f8f909e4057b537\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"nsfw\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.reddit.com/r/ThePPShow/comments/16lpcxi/you_all_just_need_to_chill/", "time": 1695024158.0, "subreddit": "r/ThePPShow", "title": "You all just need to chill", "text": "<!-- SC_OFF --><div class=\"md\"><p>I dont know how many of you have heard the term &quot;hurry up and wait,&quot; but that perfectly describes where we are now.<br/>\nThere is little to nothing which can be done from a DD standpoint.<br/>\nThere is little to nothing which can be done from a DRS standpoint.<br/>\nIMO many of the posts we are seeing are not productive.<br/>\nPersonally I would rather see some hype/ meme videos and images </p>\n\n<p>We are currently on the sidelines waiting for the final moves to be taken in this epic chess match.  We and the players have known this match has been over for a while and will soon be checkmate, but the other side is forcing the game to go on as long as possible hoping we and the guys on our side make a mistake they can squeeze out of to survive another day.  Those playing, whom we are backing, will not make that mistake.  We just have to let the final moves take place, watch the pieces move and fall and we will win.  At that point we can say CHECKMATE.<br/>\nStay Zen.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.reddit.com/r/ThePPShow/comments/16bq4x4/common_thesis_statements_i_do_not_buy_into_but/", "time": 1694020948.0, "subreddit": "r/ThePPShow", "title": "Common thesis statements I do not buy into, but the reason I am still in this.", "text": "<!-- SC_OFF --><div class=\"md\"><p>OK,  I want to start off by saying I am in this with thousands of shares and plan to be through at least this week barring new dockets/information which changes my mind.</p>\n\n<p>There is alot of good and bad information being posted both for and against BBBY.  In this post I want to clear up what I see as the BS which is in favor of BBBY and are NOT reasons I am still holding.  </p>\n\n<p><strong>Key people previously purchased/ were awarded shares (David Kastin and Sue Gove etc.);</strong> It is my understanding that as a condition of being employed as the CEO of BBBY Sue Gove had to hold/ own a certain amount of BBBY stock.  Further David Kastin receiving stock as part of his compensation package is not unusual either.  In these high level positions it is important for other shareholders to feel the executives are doing what is best for the company.  With such executives having so many shares one could presume they would end up in a much better financial position if they do what is best for the company.  This is why I put no wight/ bearing on the fact they were awarded and/ or purchased shares when they took their positions.  Had they purchased or sold shares since that time etc. that would be a different story.</p>\n\n<p><strong>Redactions and sealed dockets:</strong>  Both of these are par for the course in normal court proceedings.  I keep seeing/ hearing people mention this fact.  I believe in the past few weeks we have seen this play out to be a nothing burger and there is a potential for sealed and/ or unreleased dockets to surface with game changing information but I am not totally counting on this.</p>\n\n<p><strong>NDA&#39;s:</strong> Even mid level managers in a larger company will have to sign these, let alone potential acquirers when they are looking to potentially going to merge and/ or acquire a company.  Also please recognize there could be competitors both direct and indirect as well as unrelated non-competitors whom signed NDA&#39;s and made inquiries just to look at the books just to get a better idea of the retail sales environment in specific locations etc. with little to no intention to take any action or bid.</p>\n\n<p><strong>Litigation Costs:</strong> Lawyers and specialists are expensive.  That is all I am going to say about that.</p>\n\n<p><strong>Lawyer line item costs i.e. M &amp; A, NOL&#39;s, etc.;</strong> If they were not exploring any/ all M &amp; A as well as the NOL&#39;s to maximize the value of BBBY for all stakeholders they would not be doing their job.  The amount they receive for a part of or for the entire company does not reduce the amount of work which must go into this effort.  Going through this in CH 11 provided substantially more value than what would have been acquired through CH 7.</p>\n\n<p><strong>Deloitte contract term;</strong> There will be tax implications and needs not only in 2023 but also in 2024 as such I completely understand why they would sign and pay for a 2 year contract.  These are services which need to be performed and conducted until the final tax bill is paid and the company continues on or is dissolved in the courts.</p>\n\n<p><strong>DOM distribution center;</strong> This is NOT a large distribution center.  The DOM DC in NJ is 500 K sq ft, the average Amazon DC is 800 K sq ft and there are over 1100 of those in the US alone.  Further if you look at google maps you will see LG has one of their cross docks across the street (I believe LG has 7 to 12 of these in the US but may be wrong).  The LG facility is approximately 10X the size and from there (being a cross dock and not a DC) the product comes in, is sorted by the pallet and then immediately shipped out to the DC&#39;s of the likes of Walmart, Target and Best Buy&#39;s etc.</p>\n\n<p><strong>Toys R US involvement;</strong>  If Toy&#39;s R US were to be involved, it would be just as easy for RC to utilize Babies R US instead of Buy Buy Baby to facilitate a destination retailer for all things &quot;Baby.&quot;</p>\n\n<p><strong>Teddy as an Amazon Competitor;</strong> Amazon is huge and they have logistics down.  TEDDY will not be able to come in an beat them.  Likewise the retail side of Amazon is not very profitable, the majority of their profits come from AWS as well as advertising.  Lastly the way that most Brick and Mortar retailers are surviving is by carrying the premium/ high end items.  Vendors have incorporated &quot;MAP&quot; or &quot;minimum advertised pricing&quot; which does not allow a retailer to advertise products below a certain price else they automatically lose back end incentives and discounts etc.  This is why and when you see &quot;add to cart to see price.&quot;  This is done to keep the value added retailers (think mom and pop as well as some regional  retailers) afloat.</p>\n\n<p><strong>RC prior involvement;</strong>  I do not care what anyone says, the fact he was in this last August does not have any direct impact to today.  This whole thing still needs to make sense for him/ his group from a financial standpoint.  It is very likely the bidding came in for Buy Buy Baby far lower than he would have expected, but Buy Buy Baby at the time of the auction was just a shell of its former self.</p>\n\n<p><strong>Timing;</strong> From the time an order is placed with a supplier to the time it is received at a DC and then shipped to a store is up to 6 months (barring crazy unforeseen issues).  Further if 80% of your holiday merch has not arrived at your DC&#39;s by the end of October, due to capacity limitations and shortages in the railways and trucking transportation supply chain, that remaining cargo will not arrive in your stores until after the holidays.  In short, retailers have already started to receive some of their product assortment allocated for the holidays at their DC&#39;s right now and it is only the beginning of September.<br/>\n This means any/ everything which would have had to be shipped in for the holiday season would have had the order placed by July at the latest, but more likely in April/ May.</p>\n\n<p><strong>Block chain equity;</strong>  There is a stipulation about NOL&#39;s which do not allow the ownership of the equity to substantially change more than once within a testing period (I believe it is 2 years but might be 3).  This means whomever (hypothetically) acquires  or merges with BBBY(Q) to utilize the NOL&#39;s could not then change, merge and/ or sell the company to something/ someone else post bankruptcy and &quot;original equity&quot; would still need to have a greater than 50% stake regardless.  As such anything which does/ would occur with a block chain exchange would need to occur as part of the CH 11 process as I understand it.<br/>\nI will fully admit I am not well versed in this area, however, I only include the above as many have talked about BBBY emerging and then being merged/ acquired and then subsequent mergers/ acquisitions etc. with other companies with NOL&#39;s. </p>\n\n<p><strong>Conclusion and why I am still in this;</strong>  In the end all of this all has to make financial sense for anyone whom might want to merge/ acquire BBBY and &quot;save&quot; common shareholders.  RC/ CI etc are not going to &quot;save us&quot;/ shareholders in any company to be &quot;nice guys&quot; or &quot;good people.&quot;<br/>\nEven if there were 100K of us invested in this (which there are not) they would not be concerned with never gaining them as customers.  If each shareholder would have made $300 in annual purchases, with each purchase having 20% gross margins you would only be looking at $30 Million in revenue with $6 Million in &quot;profit.&quot;  Sounds like alot but when you are talking about revenue in the billions that would be an acceptable loss if the initial deal did not make sense as the maximum potentially &quot;lost sales&quot; from &quot;ditching&quot; existing household investors would be far less than overpaying for the company.  So you might be asking how does this make sense.... thats easy.   If they were in it before/ this whole time, that is money already spent so long as they know they have control then the realized $400M in NOL&#39;s is worth going through with a plan where current equity is saved, although to the extent we are &quot;saved&quot; may be minimal and not nearly what people think/ assume it will be.  If they were not initially in this, they could have gotten back in more recently as the cost of the bonds are literally pennies on the dollar.  For a few million potentially a substantial and controlling portion of the bonds could have been acquired for less than the potential realized value of the NOL&#39;s.  As such it just makes financial sense to maintain existing equity.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.reddit.com/r/ThePPShow/comments/166hzq8/did_you_opt_out/", "time": 1693504467.0, "subreddit": "r/ThePPShow", "title": "Did you opt out?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Although I do not think it will be relevant or matter in the end, I am curious to know if you guys opted out or not.<br/>\nAfter reading through the paperwork more than once I decided there was no downside to opting out and preserving choices/ my rights.  </p>\n\n<p>This poll is open for two days.<br/>\nFor many they have to let their brokers know by 4 pm EST today 08/31/2023 (if their deadline to respond has not already expired).<br/>\nOthers whom are direct listed have to respond by no later than 4 pm EST tomorrow 09/01/2023.</p>\n\n<p><a href=\"https://www.reddit.com/poll/166hzq8\">View Poll</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.timeanddate.com/countdown/launch?iso=20230912T0930&amp;p0=179&amp;msg=TEDDY&amp;font=serif", "time": 1693030027.0, "subreddit": "r/ThePPShow", "title": "T- Minus", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.timeanddate.com/scripts/cdog.php?countdownto=Time%20since&image=launch&title=Launch&date=12%20Sep%202023,%2009%3a30&font=cursive\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.timeanddate.com/countdown/launch?iso=20230912T0930&amp;p0=793&amp;msg=TEDDY&amp;font=cursive", "time": 1693029869.0, "subreddit": "r/ThePPShow", "title": "T- Minus", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.timeanddate.com/scripts/cdog.php?countdownto=Time%20since&image=launch&title=Launch&date=12%20Sep%202023,%2009%3a30&font=cursive\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://v.redd.it/nsdhluqdwakb1", "time": 1692988663.0, "subreddit": "r/ThePPShow", "title": "PP and crew impromptu stage performance in Germany", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "BeerPizzaGaming", "url": "https://www.youtube.com/watch?v=5qUrtz4tGQ0", "time": 1692961009.0, "subreddit": "r/ThePPShow", "title": "DIP DIP DIP; TLDR: What Hedgies are trying to say to DIP lenders, DIP buyers and DIPsh@! Household investors...", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/5qUrtz4tGQ0/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AHUBoAC4AOKAgwIABABGGUgZShlMA8=&rs=AOn4CLDNhzkchgHy71wd7dhoMqdF-W4RuQ\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://v.redd.it/axg0rzddj8kb1", "time": 1692960074.0, "subreddit": "r/ThePPShow", "title": "DIP DIP DIP; TLDR: What Hedgies are trying to say to DIP lenders, DIP buyers and DIPsh@! Household investors.....", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "BeerPizzaGaming", "url": "https://v.redd.it/u9rcz3wmh8kb1", "time": 1692959480, "subreddit": "r/ThePPShow", "title": "What the hedgies are saying about the Dip financing, Dip buying and the \"Dip$!@t Household investors buying and holding BBBYQ\"", "text": "", "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "BeerPizzaGaming", "url": "https://i.redd.it/eg3rgqqrmyib1.png", "time": 1692404267.0, "subreddit": "r/ThePPShow", "title": "PP Show: 8/18 - Teddy Dildo Bingo Card", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/eg3rgqqrmyib1.png\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://i.redd.it/33mpqy2r4rib1.jpg", "time": 1692313498.0, "subreddit": "r/ThePPShow", "title": "PP Show: 8/17 - Teddy Bingo Card", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/33mpqy2r4rib1.jpg\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://i.redd.it/3z4k86ox8lib1.jpg", "time": 1692242312.0, "subreddit": "r/ThePPShow", "title": "PP Show Bingo card: 8/16 I think we hit them all tonight.", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3z4k86ox8lib1.jpg\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://i.redd.it/hplj1k4rtsdb1.jpg", "time": 1690154742.0, "subreddit": "r/ThePPShow", "title": "Mayo getting in on the Twitter.", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/hplj1k4rtsdb1.jpg\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.reddit.com/r/ThePPShow/comments/157smg1/docket_1437/", "time": 1690151916, "subreddit": "r/ThePPShow", "title": "Docket 1437", "text": "I am still holding and I am hopeful a new plan comes out.    \nIf RC and/ or IC are in this and they are not using bonds as a way to acquire the entire company, a new plan would likely be filed just prior to or concurrently with their offer.  \nAs it stands now we are officially SOL per court filings with the projected revenues and are merely holding onto the hopium that something changes.  \nIf you want to look for yourself, see pages 8 and 9 of docket 1437.  All of us shareholders are considered Class 9.", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://i.redd.it/4kkafllj1zcb1.jpg", "time": 1689794151.0, "subreddit": "r/ThePPShow", "title": "Plur as a kid.", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/4kkafllj1zcb1.jpg\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://i.redd.it/422hrmryeucb1.jpg", "time": 1689738147.0, "subreddit": "r/ThePPShow", "title": "PUTS?", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/422hrmryeucb1.jpg\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.reddit.com/r/ThePPShow/comments/14ywqvg/poll_what_should_we_do_about_ucopys_ban_bet_if_we/", "time": 1689282914.0, "subreddit": "r/ThePPShow", "title": "POLL: What should we do about U-Copy's ban bet if we do not see a breakout tomorrow?", "text": "<!-- SC_OFF --><div class=\"md\"><p>U-Copy should only sell his position when/ if he deems appropriate.<br/>\nWhat should the MOD&#39;s do about his ban bet comments though?  </p>\n\n<p>Voting closes Sunday at about 5 PM EST.  </p>\n\n<p>FYI... I know this isnt TA, but with U-Copy I had to select that as the flair.</p>\n\n<p><a href=\"https://www.reddit.com/poll/14ywqvg\">View Poll</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.youtube.com/watch?v=0c58ppLPJcQ", "time": 1689251323.0, "subreddit": "r/ThePPShow", "title": "We need some hype to get going this AM!!!", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/0c58ppLPJcQ/maxresdefault.jpg\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://www.reddit.com/r/ThePPShow/comments/14x31v3/what_is_missing_harmon_subbrands_and_beyond/", "time": 1689108523, "subreddit": "r/ThePPShow", "title": "What is missing..... Harmon, sub-brands and Beyond.", "text": "This is complete speculation and chances are low but we may be seeing a masterclass in screwing over shorts coming up.\n\nThe one and only proven way you make shorts hurt for less than actual market value and remaining a public entity is by offering a dividend.  \nWhy do shorts hate dividends you ask?  \nWhy is a dividend the most effective tool against short selling?\n\nThe answer to the above and more, comes down to the alternatives which some on here have been pushing which do not work against shorts, because shorts can just work around said attempts doing what shorts do.\n\n  \n**Stock swap/ carve out;**\n\nLets say they did a carve out where BBBYQ holders receive company XXX shares (for ease of comparison) at 1 to 1 ratio (1 share of XXX received for 1 share of BBBYQ).\n\nThe shorts merely have to acquire XXX shares in the same quantity as they shorted in BBBYQ to cover their position.  In said scenario they are never/ are not actually forced to close out their positions at any particular time and they can continue to short XXX as much as they want to.\n\n  \n**All cash leveraged buy out;**\n\nSo what about taking the company private in an all cash deal?  Well in said scenario, yes the shorts will be forced to close out their position by the date of closing, however, it would require \n\n1) BBBYQ shareholder vote; which private equity could acquire/ influence (street name vs book entry) enough shares to control the vote. Remember those holding shares in street name may think they have the stock when they do not. \n\n2) Alot of cash and since stocks typically trade in multiples of their actual inherent value, if you believe BBBYQ was worth $X typically an all cash offer could have to be 1.2X to 1.3X.\n\n&#x200B;\n\n**DIVIDEND!!!!!!!!!!!!!**\n\nThe beauty of the dividend play is that;\n\n1) Current holders of the stock will not want to sell the stock as they would rather receive the dividend because of low tax rates when they receive that income.  Remember it is not how much you make, rather how much you keep.\n\n* If you buy a stock and hold it for one year or longer you pay capital gains tax rate, which caps out at 20%.  \n* If you buy and sell a stock in a period of less than one year you end up paying regular income rates which for federal taxes can get near 40%.\n* For a dividend payment to receive the same capital gains treatment it only needs to become a \"qualified\" dividend.  \n   * A dividend will be qualified so long as you hold the stock for more than 60 days in the 121 day period beginning 60 days prior to the ex-dividend date.\n\n2) Prospective holders will want to buy the stock as they will want to attain that juicy dividend.  Dividends are the best way to extract money from investments as you can allow the dividend to pay you (in cash) every quarter or you can have the dividend reinvest and purchase more shares and continue to grow.\n\n3) Shorts Covering;   Shorts will want to close out their position as not only does the dividend sustain the current market price but it increases their cost of doing business.  The more they borrow/ short, the more in dividends they will have to pay out and that would grow infinitely which would all be on top of the borrow rate they are already paying on those shares.  \n\n\n**So how does this all come together now that BBBY and Baby IP have been sold?**\n\nRemember that cosmetics wares brand no one cared about called Harmon?    \nRemember all of the houseware brands which have yet to be auctioned?  \nI made a post in another \"BBBY\" focused sub which was flared as \"speculation/ opinion\" which they actually banned me for making the post.  \n\n\n*Harmon will become a \"REIT\" or real estate investment trust with its own ticker.*  \n\n* REITS by rule have to pay out their earnings as dividends to their equity holders and have very little tax liability.  \n* This is where all of the wanted and highly desirable go forward leases/ properties will go.  \n* Current shareholders will have shares in this \"go forward\" entity and receive substantial (10%+) QUARTERLY dividend payments.  \n\n*\"BEYOND\" will be subletting those spaces to Bed Bath and Beyond stores and Buy Buy Baby stores.*\n\nHarmon will be the umbrella brand for the sub-product brands which BBBYQ still owns/ controls today (or you could also call this Teddy for ease of identification and a desired brand name change).  \n*Bed Bath and Beyond Stores and Buy Buy Baby stores will remain in place and operational.* \n\nThe Harmon brands now will be part of lend/ lease agreements with Overstock AND Janie and Jack and  Harmon brands grow and stick around as well.  This is how it will be an actual co-beneficial agreement for all involved and they all paid in a fraction of what it would actually cost while maximizing value for all stake (including share) holders;  \nBeyond collects rent and acts as a landlord (even if only for a short period of time) paying investors a huge and fat dividend allowing for a sneeze.  \nOverstock and Dream on Me will effectively be operating as they currently do, but have the added benefit of having brick and mortar recognition and influence with none of the risk and/or exposure to opening up an actual retail footprint.\n\nHarmon's brands and product lines grow and they can be sold off into other retailers with greater ease as they are not tied down to just Bed Bath and Beyond and/ or Buy Buy Baby.  \n\n\nThe one big piece I think everyone misses and rightfully so (unless you work in supply chain) is product arriving in a store NOW would have to have been ordered 6 or more moths ago.  This play was absolutely setup well in advance.  The stores would have to close just to attain/ receive product in time to remain open if they are not closing.  Overstock and Dream on Me could have easily taken on addition product supply in anticipation of these acquisitions and collaborative agreements with minimal go forward exposure.  As such this whole situation is and we are upon the zero or hero moment for anyone/ everyone that is involved.\n\n&#x200B;", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BeerPizzaGaming", "url": "https://i.redd.it/fk82z8ohxo2b1.jpg", "time": 1685313234.0, "subreddit": "r/ThePPShow", "title": "Where you show your grandkids how you made your millions", "text": null, "flair": {"text": "🍻 🍕 🎮", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/fk82z8ohxo2b1.jpg\"/></div>"}]