[{"username": "BeTheFunInFunerals", "url": "https://v.redd.it/8fjo2dvqievb1", "time": 1697826997.0, "subreddit": "r/ThePPShow", "title": "All these bananas twists &amp; turns got me feeling like", "text": "<!-- SC_OFF --><div class=\"md\"><p>Bonus points if you can name what this is from</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/a3h3dndqcHFpZXZiMW6Fog2k1WEraDV6jwHLAWfFVlnvF6gQoU1bKbqIS7XC.png?width=140&amp;height=78&amp;crop=140:78,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=e48db4402c09de979cf1e952b5279236955b77cb\"/></div>"},
{"username": "BeTheFunInFunerals", "url": "https://www.reddit.com/r/ThePPShow/comments/16paexg/ibkr_compliance_team_question/", "time": 1695389449.0, "subreddit": "r/ThePPShow", "title": "IBKR compliance team question", "text": "<!-- SC_OFF --><div class=\"md\"><p>IBKR said their compliance team never speak on the phone, a ticket has to be raised and I&#39;ll get a reply in writing in 24-48 hours. Can anyone confirm IBKR doesn&#39;t have a back end compliance team that can be reached by phone?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BeTheFunInFunerals", "url": "https://www.reddit.com/r/ThePPShow/comments/16jute6/are_you_there_rc_pulte_its_me_margaret/", "time": 1694827661.0, "subreddit": "r/ThePPShow", "title": "Are you there, RC &amp; PULTE? It's me, Margaret.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Dear you guys,</p>\n\n<p>Beyond the possibility of wealth exceeding my wildest dreams, this saga has connected me with a community of smart &amp; considerate people who educate &amp; help each other, none of which I imagine anyone could have predicted. You were focused on building an oasis in a desert of manipulation and your focus radiated out to make me and others be the best versions of ourselves. This feels like the future I want, where we focus on doing good things with integrity and it inspires good around us. No one convinced me to do anything, but the diligent research and fact checking of so many gave me visions of a potential utopia, one that focuses on activating the most generous parts of ourselves. I&#39;m so thankful for this moment and pledge to be just, kind, thoughtful, inventive, adventurous, daring, bold, and generous with my dreaming how best to help the world with any gains I make from this epic saga. And even if, by any chance, all of this is thwarted, I will not lose my resolve to leave the world in a better state than it was when I arrived. It won&#39;t be lambos for me (but I won&#39;t yuck anyone&#39;s yum). For me, it&#39;ll be supporting grassroots groups uplifting communities and eradicating poverty and illness. It&#39;ll be money spent in the corners politics and power ignore. It&#39;ll be sustainable, egoless, and wholesome. I&#39;m excited to imagine all it can be. And indebted to everyone whose commitment to greater good taught me so much. Thanks is not enough, but it&#39;s the start of more to come.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]