[{"username": "BigDeal485", "url": "https://www.reddit.com/r/ThePPShow/comments/16jehsi/i_got_a_fever_and_the_cure_is_more_salvatore/", "time": 1694787114.0, "subreddit": "r/ThePPShow", "title": "I got a fever and the cure is more Salvatore… someone send him a phone charger for PPShow’s sake.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I can’t always listen live but there’s a theme on the <a href=\"/r/ThePPShow\">r/ThePPShow</a> lately and that’s Salvatore not being able to stay long because his phone needs to charge.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Stream Live Chat ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BigDeal485", "url": "https://www.reddit.com/r/ThePPShow/comments/16aolim/if_i_havent_drsd_yet_would_drsing_as_the_price/", "time": 1693921256.0, "subreddit": "r/ThePPShow", "title": "If I haven’t DRS’d yet, would DRSing as the price rises add to the probably of a squeeze or DRSing early have more effect?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Smooth brainer here, but as I have been studying BBBYQ over the last year watching my investment shrink to almost nothing I’m trying to be prepared for all the possibilities that might happen especially when this thing blasts off.  Been seeing posts about how the many of of the large brokerages are not in the best of financial shape in this particular time of the market. I don’t want my brokerage (TD Ameritrade now converting over to Schwab) to sell my shares without my permission, which I have heard is a possibility when the baby moonshots, in order for the brokerage to protect itself. It’s got me thinking perhaps I should DRS some and since I haven’t done it yet I’m considering the timing of when to do it. </p>\n\n<p>Also a chance that I’m completely wrong on getting liquidated without my permission but regardless, still trying to be prepared.  Any wrinkled brains want to chime in and give their thoughts it would be appreciated. </p>\n\n<p>PS - Been watching and listening to the PPshow religiously the last few weeks and can’t get enough.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]