[{"username": "BigKat8365", "url": "https://www.reddit.com/r/ThePPShow/comments/131pjyi/only_4m_volume_pre_market_something_is_upm/", "time": 1682682977.0, "subreddit": "r/ThePPShow", "title": "Only 4m volume pre market. Something is up!!!m", "text": "<!-- SC_OFF --><div class=\"md\"><p>IDK if this is good or bad, but something is definitely going on. This bitch is either about to take off like a cheap hooker w/ your wallet, or dump hard.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BigKat8365", "url": "https://www.reddit.com/r/ThePPShow/comments/12xkvaz/true/", "time": 1682349762, "subreddit": "r/ThePPShow", "title": "True??", "text": "Ran across this article this morning. Let’s hope it’s true. \n\nhttps://www.marketbeat.com/instant-alerts/nasdaq-bbby-analyst-earnings-estimates-2023-04-24/", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BigKat8365", "url": "https://www.reddit.com/r/ThePPShow/comments/12r76ks/contract_for_difference_cfd/", "time": 1681857445.0, "subreddit": "r/ThePPShow", "title": "Contract for Difference (CFD)?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I ran across a term today while reading the shit shill story put out by MW about BBBY and retail investors pumping the stock, and causing it to run up the past 2 days!!! ( Sure retail investors are the source behind 600mil + shares traded the last 2 days!!!) Fucking Fake Ass NEWS MEDIA. </p>\n\n<p>Link to article:</p>\n\n<p><a href=\"https://www.marketwatch.com/story/bed-bath-beyond-To\">https://www.marketwatch.com/story/bed-bath-beyond-To</a> stocks-meme-like-bounce-wont-last-analyst-says-3d06de70?mod=newsviewer_click</p>\n\n<p>Anyway I came across a term I hadn’t herd of before called CFD’s or Contract for Difference. My first thought was CFD= FTD, so I decided to do a little research. </p>\n\n<p>Taken from Investopedia. </p>\n\n<p>What Is a Contract for Differences (CFD)?</p>\n\n<p>A contract for differences (CFD) is an arrangement made in financial derivatives trading where the differences in the settlement between the open and closing trade prices are cash-settled. There is no delivery of physical goods or securities with CFDs. </p>\n\n<p>Contract For Difference is basically a derivative that allows an investor to trade a security that he does not own, and actual shares do not exist!! ( Sounds Like a Similar form of Fuckery that has been used to manipulate our stocks.)</p>\n\n<p>CFDs are cash-settled but usually allow ample margin trading so that investors need only put up a small amount of the contract&#39;s notional payoff.</p>\n\n<p>It continues </p>\n\n<p>Contracts for differences is an advanced trading strategy that is used by experienced traders (SHF) and is not allowed in the United States.</p>\n\n<p>Well fuck me. It’s illegal in the United States. Maybe I’m on to something here?  Can this be used by Short sellers as another method of manipulating and tanking the stock???</p>\n\n<p>So I asked Chat GPT. </p>\n\n<p>How can short sellers use Contracts for Differences CFD’s to manipulate the price of a stock??</p>\n\n<p>﻿ Short sellers can potentially use Contract For Differences (CFD) to manipulate a stock by engaging in what is known as a &quot;short and distort&quot; strategy. Here&#39;s how it could work:</p>\n\n<p>The short seller borrows shares of a company&#39;s stock and sells them in the market, with the expectation that the stock price will fall.</p>\n\n<p>The short seller simultaneously enters into a CFD agreement with a counterparty, which allows the short seller to profit if the stock price does indeed fall.</p>\n\n<p>The short seller then begins to spread negative rumors, false information, or otherwise manipulate the market in order to drive down the stock price.</p>\n\n<p>As the stock price falls, the short seller profits on both the short sale of the actual stock and the CFD agreement with the counterparty.</p>\n\n<p>The short seller then buys back the borrowed shares at a lower price, returns them to the lender, and pockets the difference as profit.</p>\n\n<p>This strategy can be effective in causing panic among investors and creating a self-fulfilling prophecy of a declining stock price.</p>\n\n<p>However, it is important to note that this type of manipulation is illegal and unethical, and regulators actively monitor the markets for signs of such activity. Short sellers who engage in manipulative practices risk facing significant legal and financial consequences.</p>\n\n<p>Then It starts to get really juicy!!</p>\n\n<p>Can CFD be used to cover failures to deliver or hide naked or synthetic shares of stock????</p>\n\n<p>In a &quot;fail to deliver&quot; scenario, a short seller may be unable to deliver the shares they borrowed and sold short, which can create a situation where there are more short positions than actual shares available for borrowing. In order to cover this failure, the short seller may enter into a CFD agreement with a counterparty, which would allow them to profit if the stock price falls without having to actually deliver the shares they borrowed. This can create a downward pressure on the stock price and further exacerbate the situation.</p>\n\n<p>In a naked short selling scenario, a short seller sells shares of stock that they do not actually own or have not borrowed. This creates synthetic shares that do not actually exist, which can distort the market and manipulate the stock price. To hide these synthetic shares, the short seller may use CFDs to create a synthetic long position, which offsets their short position and makes it appear as though they are no longer selling the stock short. This can make it difficult for regulators to identify and address such manipulative behaviors. </p>\n\n<p>I would love to hear if anyone has more information or input on this topic.</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BigKat8365", "url": "https://i.redd.it/rrgpm24jnwra1.jpg", "time": 1680612408.0, "subreddit": "r/ThePPShow", "title": "Let’s see if he responds", "text": null, "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rrgpm24jnwra1.jpg\"/></div>"},
{"username": "BigKat8365", "url": "https://www.reddit.com/r/ThePPShow/comments/126t645/explain_this_to_me/", "time": 1587833201, "subreddit": "r/ThePPShow", "title": "Explain This To Me…..", "text": "I understand that we appear to be royally fucked, but wait one minute. Shit doesn’t add up. \n\nWhy wait till now to make this announcement? \n\n Where did all of the extra outstanding shares come from?? Did they include Aprils conversion in that number??\n\nDid someone back out of the deal??  I still don’t believe Hudson Bay were the only investors. \n\nRemember Dragonfly Board members resigning…. What was that all about??\n\nHow are we still on Reg. Sho with all this supposed dilution??\n\n\nI still have way more questions than answers, and I’m definitely a little concerned. \n\nAre we 100% Fuked?? I don’t think so. Im more confused than ever. I would love to know everyone’s thoughts.\n\n\nAfter thinking this through, 300mil worth of new common stock……  Could this possibly be the buyout of the company?  What if BBBY already has the shares sold to another investor. RC and Brett Ican. 300mil for Bed Bath, and Baby.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]