[{"username": "BigMully12", "url": "https://www.reddit.com/r/ThePPShow/comments/17vevq4/blockbuster/", "time": 1700002754.0, "subreddit": "r/ThePPShow", "title": "Blockbuster?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Has anybody noticed that Blockbuster (BLIAQ) went to 0 today? Down 100% from its 1 cent value yesterday. Seems like that ticker is done or going through some sort of corporate action. Very strange timing considering the speculation regarding its involvement with this play.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BigMully12", "url": "https://www.reddit.com/r/ThePPShow/comments/171eebt/glad_i_hopped_on_the_ship/", "time": 1696604040.0, "subreddit": "r/ThePPShow", "title": "Glad I Hopped On the Ship", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone, this is the first post that I&#39;ve actually ever made on Reddit. Longtime HODLer of GME and Popcorn here, but have never had enough karma to make posts or comment on those subs. Just came to say that I am glad and extremely excited that I made a gamble a couple weeks ago and dropped 1500 bucks on BBBYQ. I always knew that BBBY was apart of the basket but never really took a serious look at it until about a month ago.</p>\n\n<p>When I saw it getting mashed into the ground and eventually placed on the &quot;Expert&quot; market, I started looking into more closely what was happening with this stock. There I started seeing all the the theories and evidence of the possible merger/ acquisition in the future and when I found the opportunity to throw some money in I did. </p>\n\n<p>Only been in this play a couple weeks but I have to say I like what I am seeing. Coming from a January &#39;21 Ape, I know the pain you guys have had to endure watching your hard earned money stolen away from you everyday. We are fighting the same demons here and I can&#39;t believe I am saying after all this time of holding the other stocks, BBBY could actually be the first to explode and be the catalyst for the MOASS. </p>\n\n<p>The way I look at it, if this play was over, it would be obvious. All we can do is wait and see what goes down but after every new piece of information we see each day, I am more and more confident in the gamble I made on a stock that is supposedly &quot;worthless&quot; and will be &quot;deleted&quot; from history. </p>\n\n<p>Anyways, this is a solid community and in the end I think the little guy is going to get a much needed victory on this play. Cheers everybody!</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]