[{"username": "blauwechimay", "url": "https://www.reddit.com/r/ThePPShow/comments/17z21cy/a_concise_overview/", "time": 1700414613.0, "subreddit": "r/ThePPShow", "title": "A concise overview", "text": "<!-- SC_OFF --><div class=\"md\"><p>Can I dumb down the current situation as follows?</p>\n\n<p>Bed Bath &amp; Beyond sold its Bed Bath &amp; Beyond IP to Overstock, which changed its name to Beyond Inc (NYSE:BYON). The company is currently without a CEO. <em>Maybe not fur long.</em></p>\n\n<p>Bed Bath &amp; Beyond sold its BuyBuy Baby IP and 11 leases (currently open) to Dream On Me. However, these operations are run by BBBY Acquisition Co LLC (the &quot;BBBY&quot; in this company name supposedly being short for &quot;Buy Buy Baby&quot;). Mark Serure from Dream On Me is the assignee, but recent findings show there are multiple (unknown) investors involved. <em>Imagine Sixth Street and Dream On Me having a meeting. Imagine &quot;not having to worry about Hudson Bay Capital&quot;.</em></p>\n\n<p>Bed Bath &amp; Beyond (meaning everything except the IP, the aforementioned leases and the liquidated assets) changed its name to 20230930-DK-Butterfly-1, Inc (including several other seperate entities that now have the same name). <em>This butterfly hasn&#39;t even emerged from Chapter 11 yet, has it Nolly Etlin?</em></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "blauwechimay", "url": "https://www.reddit.com/r/ThePPShow/comments/17obwmc/sunday_motivation_post/", "time": 1699190755.0, "subreddit": "r/ThePPShow", "title": "Sunday motivation post", "text": "<!-- SC_OFF --><div class=\"md\"><p>Here we are. A bunch of people who landed on some guy&#39;s subreddit. We came from wsb, superstonk, bbby,...wherever. Some of us have been around for more than three years now. It became harder and harder to know what is fact and what is fiction. Everyone threw their own little theories around. Sometimes everything made sense, sometimes none of it did. It&#39;s been a rollercoaster.</p>\n\n<p>I tried to keep things simple. I looked for people to trust because of the way they acted. There&#39;s <strong>DFV</strong>, who is a genuine person like all of us. Look at everything that happened to him before he had to go silent. He is still out there. His story hasn&#39;t been heard yet. All documentaries, movies, stories,...made about him did not include him. There&#39;s <strong>RC</strong>, who is a genuine person like all of us (despite being rich). Look at everything that happened to him before he had to start talking in riddles and memes. He is still out there. His story hasn&#39;t been heard yet. All documentaries, movies, stories,...made about him did not include him (maybe apart from one single interview in which he obviously didn&#39;t speak freely). </p>\n\n<p>All we know is what we see in official documents. Everything else is speculative. Mainstream media CAN be loud, people involved HAVE TO BE quiet. It almost feels like we were pushed into this little corner that is the ThePPShow. But something is different here. Wsb started talking shit about other communities, superstonk started talking shit about other communities, meltdowners started talking shit about other communities. ThePPshow <strong>doesn&#39;t talk shit</strong>. All I see is a bunch of people having a good time analyzing documents while throwing some hilarious tinfoil around. They welcome other views, they challenge eachother to disprove theories and let different voices be heard.</p>\n\n<p>Sure, it&#39;s not perfect. Nothing is. But at least these guys are putting in a lot of effort trying to give some guidance while others have to be quiet. They are putting themselves out there while we are sitting comfortably behind our screens. </p>\n\n<p>We can all make up our own minds but what I try to remember is that until these guys voices are heard, everything is up in the air. At the moment, gamestop seems to be nothing more than a slowly recovering retailer. They have a huge war chest. They have a huge following. They have enormous potential in the gaming industry. Yet nothing big happened. Yet. </p>\n\n<p>Bbby seems to be nothing more than a bankrupt company that got liquidated. Then why have Sue Gove give an enthusiastic interview right before filing for bankruptcy? Why have Holly Etlin value the company in the billions? Why file chapter 11, not 7?</p>\n\n<p>Maybe I am slowly going crazy. Maybe I am ready for the looney bin. At least I know that I am not the only one. NFA.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "blauwechimay", "url": "https://www.reddit.com/r/ThePPShow/comments/17epc8k/degiro_message_to_all_bbbyq_shareholders/", "time": 1698080504.0, "subreddit": "r/ThePPShow", "title": "DEGIRO message to all BBBYQ shareholders", "text": "<!-- SC_OFF --><div class=\"md\"><p>All BBBYQ shareholders of DEGIRO received a message today at 11AM. Loosely translated (orginally in Dutch) it states the following:</p>\n\n<p>&quot;We are contacting you because you currently have a position in Bed Bath and Beyond (US0758961009). Please note that these shares have been canceled by our custodians.</p>\n\n<p>What does this mean to you?</p>\n\n<p>We have removed the position from your account. This happened automatically and requires no action on your part.&quot;</p>\n\n<p>The only interesting thing to note here is the Dutch word &quot;ingetrokken&quot; that was translated by Google Translate as &quot;canceled&quot;. I would rather translate this as &quot;<strong>withdrawn</strong>&quot; or &quot;<strong>revoked</strong>&quot;.</p>\n\n<p>Anyway, this is just an FYI.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]