[{"username": "boatie123a", "url": "https://www.reddit.com/r/ThePPShow/comments/11v974f/the_bbby_death_spiral_at_least_i_died_knowing_how/", "time": 1489860214, "subreddit": "r/ThePPShow", "title": "The BBBY Death Spiral: At least I died knowing how I died", "text": "[removed]", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "boatie123a", "url": "https://www.reddit.com/r/ThePPShow/comments/11tape3/will_the_real_investor_please_stand_up/", "time": 1489860214, "subreddit": "r/ThePPShow", "title": "Will the real investor please stand up?", "text": "This is something I shared with the bbbby subforum as a comment.  You guys should carefully consider it:\n\nI don't have enough karma to post. So let me post some conclusions I have drawn here.\n\nThis is really becoming a game of: who is the real investor.\n\nOn one side are those apes who believe the investor is either/or (or both) Cohen or Icahn. HBC is only acting on their behalf. This side believes barcoding is occurring because shorts are at a dead-end. Shorts have to maintain the price, even if the result is that it build crazy amounts of pressure. As soon as this pressure is released, the price will rise and be out of control. The shorts are way over leveraged and have no way out. All routes for retreating, such swaps, ftds, etc. are closing in on them.\n\nApes further believe that although the offering raises questions, there has been no dilution, the investor is an ally and wants bbby to turn things around and is willing to put money up without converting any shares (nor can they do this without a full shareholders vote). Holders of BBBY loans quickly agree to the offering, given the that Icahn and/or Cohen are providing the funding.\n\nIn addition, bbby board is always acting in the interest of the shareholders, even as it acts in the interest of the company. They have hired top tier people to transition from bankruptcy. Finally and most importantly, Cohen and/or Icahn will make a timely appearance which will signal the completion of a M/A, LBO, or something similar.\n\nIts now just a question of waiting for BBBY-side to complete its M/A, etc. process and announce this. This will trigger a near-MOASS. All apes need do is hold and/or buy to increase the rewards awaiting them.\n\nThe other side are those who believe the investor is actually Hudson Bay Capital, one group of hedge funds who have been practicing the death spiral on various companies. It does not matter how BBBY got here. Perhaps there was a deal in the making between Cohen and BBBY, but it fell through and BBBY ran out of time. Doesn't matter. Here, HBC is the good cop and is working with BBBY, offering them only pathway out of immediate bankruptcy. BBBY's board, despite their desires otherwise, has no option but to take up the offer. The other organizations behind BBBY's loans quickly agree because the only alternative was immediate bankruptcy.\n\nHBC is allied with the bad cops. These are other hedge funds in on this deal. They have been relentlessly shorting the stock and continue to do so. BBBY is bound by NDA with HBC and must remain silent.\n\nApes get excited each time gamma ramp or some hype appears, creating demand and shorts are able sell into this and make a good deal of money. This a creates many new ftds, high short interest, etc.\n\nEventually, it comes out that HBC is the investor. The stock continues to be barcoded, no matter the volume. Finally, apes get wise and stop buying. The shorts also stop. The stock stays flat. HBC, having given BBBY a few months lifeline, now demand that a vote be taken to allow it to dilute the stock, since it had provided funding as stipulated.\n\nHowever, if this vote is passed, the stock will be massively diluted (5x to 9x) such that all allied shorts, ftds, etc. can now be covered at a minimal cost. What happens if such a vote is not passed? Would BBBY have to declare bankruptcy based on stipulations in the offering such as immediately returning funds previously given.\n\nIn any case, all shorts win and BBBY shareholders are left as bagholders, with nearly everyone in the red and the stock massively diluted.\n\nBBBY remains alive and perhaps they can turn things around, since they have been given time. The price might rise as a result, but this will be many months later.\n\nEither Cohen or Icahn make an appearance because it was simply a misinterpretation of the groupthink by apes. They were never involved. However, Cohen's reputation will take a severe hit because, whether he was at fault or not, many apes are here because of him and some are a part of his gme pool of shareholders.\n\nSo which side is it? One side offers an almost-MOASS (expected to produce returns in the 500s and beyond) and the other side offers the ultimate rugpull specifically aimed at clueless retailers who dared to play with the big boys. Which one is the more logically consistent?\n\nI am as unsure as anyone but now I am very wary, so I thought I would share. Feel free to tear this apart. I don't expect happy responses but I really like the apes I have met here and wanted to share the conclusions I have started to draw.\n\nTLDR: This play is either a near-MOASS or the ultimate hedge rugpull. You decide.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]