[{"username": "Boinerman", "url": "https://x.com/gamestopnft/status/1684667563693764609?s=46&amp;t=c9PmkUA0yeyZe72Du9kp5w", "time": 1697248870.0, "subreddit": "r/ThePPShow", "title": "Ummmm guys? Tzero starting on October 20th. Remember GameStop’s NFT rocket showing t-00? Aka tzero?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/HCe5dpabiHbeQuSa1LwplTwmFwk3pu0dNpc5RXkB6ck.jpg\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/16y79w6/why_im_sure_we_arent_fukt_because_still_nothing/", "time": 1696278187.0, "subreddit": "r/ThePPShow", "title": "Why I’m sure we aren’t fukt - because still nothing official has been released telling us that", "text": "<!-- SC_OFF --><div class=\"md\"><p>I mean seriously… how the FUCK is there still nothing in black and white, no beating around the bush, yes or no, zero or hero answer telling us whether we are fukt and getting nothing out of this or getting everything. </p>\n\n<p>I feel like if this was a normal situation they would’ve told us for sure what’s going down at this point in the game, but the fact that everything is kept so inconspicuous even now to me says that there is someone planning something very complex to avoid revealing their identity and the actual fate of bbbyq.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/16t03bf/any_brokers_that_allow_purchasingdrs_right_now/", "time": 1695762552.0, "subreddit": "r/ThePPShow", "title": "Any brokers that allow purchasing+DRS right now?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I saw Schwab is allowing buys over the phone right now. Are you able to DRS from there?</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/16or9x6/did_they_put_bbbyq_under_expert_markets_to_lower/", "time": 1695330166.0, "subreddit": "r/ThePPShow", "title": "Did they put bbbyq under expert markets to lower the price as much as possible before closing out short positions without fear of fomo?", "text": "<!-- SC_OFF --><div class=\"md\"><p>To me this seems like brokerages locked this thing away to bring the price down as much as possible while denying access to us plebes to fomo in while they start closing out their positions so that they can somewhat control the fallout of what is about to happen. Thoughts?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/16onyc5/why_is_everyone_freaking_out_over_the_8k/", "time": 1695322382.0, "subreddit": "r/ThePPShow", "title": "Why is everyone freaking out over the 8k?", "text": "<!-- SC_OFF --><div class=\"md\"><p>It still doesn’t change any of the DD that we’ve had all along. It’s still ramen or lambos/zero or hero. Until our positions are actually 0 this ride is not over.</p>\n\n<p>The 8k didn’t reveal anything new at all. To me it just seems like an in for shills to shill. Unfortunately for them I don’t know how to sell and all I know how to do is HODL.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/16kglpt/imagine_going_through_the_brokerage_shenanigans/", "time": 1694894594.0, "subreddit": "r/ThePPShow", "title": "Imagine Going Through the Brokerage Shenanigans With GME and Still Not Learning Your Lesson About DRS", "text": "<!-- SC_OFF --><div class=\"md\"><p>They’re already shutting off the buy button. Lol do you really think they’re not going to liquidate your position since there aren’t enough shares to go around? Let’s see here, you signed the terms and conditions allowing your broker to liquidate your position. What’s easier for the broker— to liquidate your position or go out and find shares that don’t exist?</p>\n\n<p>This concludes my Ted talk.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/15znwq7/just_another_friendly_reminder_shills_and_psyops/", "time": 1692841666.0, "subreddit": "r/ThePPShow", "title": "Just Another Friendly Reminder: Shills and Psyops Would NOT Be a Thing If We Were Simply Wrong", "text": "<!-- SC_OFF --><div class=\"md\"><p>This can’t be reminded enough!! This is the cornerstone DD. Shills and FUD spam should carry you to Uranus and beyond!</p>\n\n<p>They would not waste their time trying to persuade us and have mass shill attacks whenever major news comes out if there was no merit. SS sub is completely taken over by ex Nazi WWII propaganda masters. Not to mention fucking MSM spamming fud! </p>\n\n<p>I love docket speculation, facts and tinfoil, but gah damn do my tits tickle the moon whenever I see mass fud attacks. </p>\n\n<p>Not sure what future dockets will drop or when RC will finally decide to pull the trigger, but as long as I have shills around I know that I’m in a safe place. </p>\n\n<p>I know this gets brought up a lot, as it should! This is the most solid DD we’ve had so far. Truly!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/15ga8g6/my_interpretation_of_everything_going_on_a/", "time": 1690986139.0, "subreddit": "r/ThePPShow", "title": "My interpretation of everything going on. A wrinkle has formed! THE LOOMING PIVOTAL MOMENT! 🚀⏰", "text": "<!-- SC_OFF --><div class=\"md\"><p>Guys I think… I think I just gained a wrinkle. I think I understand what’s going on here. Feel free to lay down your thoughts about it too.</p>\n\n<p>I’m pretty regarded and eat crayons so take it fwiw. This is all theory and speculation.</p>\n\n<p>Let’s talk about the IP’s being sold and basically bbbyq having essentially what shills keep saying—“nothing left for shareholders”.</p>\n\n<p>This is all part of the plan imo. I believe what’s going on is RC and Icahn have laid the biggest bear trap in history to fund Teddy. </p>\n\n<p>Chapter 11 was the greatest move they could’ve done to protect bbby from shorts. You see in Chapter 11 bbbyq got onto the OTC off of the major exchange and took away much of their manipulation abilities. Can they still manipulate the stock? Yes, not near as much though. I believe RC and the bbby board rushed the company into chapter 11 because he knew the whole basket stock theory was resting on what happens with bbby. I’m sure most of you all are following up to this point and are already aware of this. </p>\n\n<p>So chapter 11 gives RC the ability to activate his trap card whenever he deems fit. </p>\n\n<p>Yes, timing here is going to play a key role in this whole saga. </p>\n\n<p>You see the global economy is tinkering on the brink of collapse and with it we know that the meme stocks will soar to the moon. Especially, bbbyq. </p>\n\n<p>The M&amp;A lawyers and RC are probably waiting for this pivotal moment to reveal their final plan. </p>\n\n<p>So why did I bring up the lack of assets and IP available to bbbyq and shareholders at the beginning of my post?</p>\n\n<p>Well, because getting rid of leases allows them more wiggle room for timing the pivotal moment in the looming global financial crisis. They no longer have to pay for those leases and have extremely low overhead and funding loss. They can always amend the plan and get these leases back at any moment as far as I understand. (Correct me if I’m wrong). So if this is the case it basically allows the stock to cruise into that pivotal moment.</p>\n\n<p>Meanwhile, RC had placed the IP in the hands of Overstock. A company that is a short destroyer. Lol, seriously? That has to be something imo. I believe Overstock is simply holding onto the IP until the pivotal moment. That way HF’s can’t get their dirty hands on it and mess things up. I think the same could be said for Dream on Me. </p>\n\n<p>A lot of this is speculation, tinfoil and an interpretation of how I see everything lining up with all the event up until this point. I’m not sure how this will all play out, but it’s my theory that everything is being intentionally pushed out.</p>\n\n<p>TLDR; I believe RC is purposefully pushing out the final plan to time it with the looming financial crisis AKA Volmageddon 2.0. I also believe the M&amp;A lawyers gave the IP rights away temporarily (imo) to Overstock and Dream on Me. Furthermore, it’s my theory that the leases were sold/rejected to reduce overhead and expenses to give bbbyq more wiggle room on time and financial stability.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/15ervlv/fuck_all_whos_still_holding_to_the_end/", "time": 1690837100.0, "subreddit": "r/ThePPShow", "title": "Fuck all! Who’s still holding to the end?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Too many cohencidences to not see this to the end. I will ride with my fellow apes to zero. That Teddy Rosevelt speech slapping real good right now. Actually it feels so fitting with the amount of shills out in the wild at the moment. I’ve come this far, I will see it to the end. I bought in at .12 and could sell for a profit right now but I will not die with those cold timid souls that know neither victory or defeat. We’re all leaders as Pulte has said. Leaders venture into the unknown willing to risk their own well being. I don’t know what the outcome will be, but a leader often doesn’t. Let’s see where this road leads to. Love you my fellow apes!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Boinerman", "url": "https://www.reddit.com/r/ThePPShow/comments/14xd8w9/tomorrow_the_beginning_of_gmerica/", "time": 1689134185.0, "subreddit": "r/ThePPShow", "title": "Tomorrow: The Beginning of Gmerica🎇🎆", "text": "<!-- SC_OFF --><div class=\"md\"><p>Let’s summarize what happened today:</p>\n\n<p>-bbbyq was affirmed that there is a path to emerge out of chapter 11.</p>\n\n<p>-Icahn made some major capital moves.</p>\n\n<p>-The FTDs from RC’s GME buy are due tomorrow.</p>\n\n<p>-<em>CO_RY</em> twitter account just deleted everything except one RC quote, “I put my money where my mouth is”.</p>\n\n<p>-NFT marketplace tinfoil lines up with the 12th.</p>\n\n<p>-Teddy book points at 12 on the clock.</p>\n\n<p>-TA has never looked spicier for the stock.</p>\n\n<p>Did I miss anything? Is tomorrow finally THE famous tomorrow? I think it is. 😳</p>\n\n<p>Fuck my tits are so jacked right now.</p>\n\n<p>🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]