[{"username": "BrunoMaybach", "url": "https://i.redd.it/qti8oxk09yxb1.jpg", "time": 1698937354.0, "subreddit": "r/ThePPShow", "title": "K&amp;E final expense statement - MUST READ. GIVE ME FEEDBACK IF YOU’RE a fucking shill", "text": "<!-- SC_OFF --><div class=\"md\"><p>Why is a company which according to shills is worthless still at this late stage withholding “privilege and confidential” information? </p>\n\n<p>Not just one lawyer either, most of them work on whatever it is that’s being kept from everyone who’s not deemed “professional eyes only” </p>\n\n<p>NEARLY THE ENTIRE SCREEN SHOT IS WORK FOR CONFIDENTIAL AND PRIVILEGED INFORMATION. </p>\n\n<p>SHILLS - if you are here step the fuck up in the comment section and tell me what the fuck this could be if not m&amp;a and the finer details of a completed deal that leads to shareholder recovery.</p>\n\n<p>I spotted almost immediately the 10b5-1 and posted it on Twitter - that discusses price discovery of equity in order for insiders to sell/convert shares. </p>\n\n<p>HBC converted how many preferred shares into common? Did they get a set price for those in return for converting and joining use? </p>\n\n<p>Is that part of this confidential information?</p>\n\n<p>You’ll remember a few months ago some creditors wanted proof they’d be made whole and the judge ordered the company to show our hand - once they saw this there wasn’t any further objections and they went away presumably happy with what they saw. </p>\n\n<p>We had the fuck head that was representing the 13/14% of the bond holders who opposed the plan - he got to see the plans - he never fucking returned and the plan quickly got accepted and became effective. </p>\n\n<p>This information is what we’re waiting for - all final expenses are in - Lazard are poised to collect that big fucking commission as per their terms of service. </p>\n\n<p>I speculate the RC lawsuit is something that is holding up the play - I don’t think it needs to be worried about to much as most of it is regarding fucking emojis but it’s a time game. </p>\n\n<p>Guy Fawkes did something 500 years ago that we’ve NEVER forgotten. </p>\n\n<p>I seem to remember someone being quoted that they are planning something shorts will never forget. </p>\n\n<p>Stick if you delete this - post it back up on your account. </p>\n\n<p>💜</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/qti8oxk09yxb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/v6iyrcgixkxb1.jpg", "time": 1698776097.0, "subreddit": "r/ThePPShow", "title": "All the big players in one meeting discussing plan funding.", "text": "<!-- SC_OFF --><div class=\"md\"><p>SHOW US THE FUCKING PLAN</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/v6iyrcgixkxb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/r5pdbtp5ylvb1.jpg", "time": 1697916725.0, "subreddit": "r/ThePPShow", "title": "👀", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sorry stock but this is important my guy</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/r5pdbtp5ylvb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/qqsoe40ylltb1.jpg", "time": 1697040921.0, "subreddit": "r/ThePPShow", "title": "Confirmation of BBBY name changed!! SHILLS IN SHAMBLES", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/qqsoe40ylltb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/iaislcxiiltb1.jpg", "time": 1697039770.0, "subreddit": "r/ThePPShow", "title": "K&amp;E “confirmation order addition”", "text": "<!-- SC_OFF --><div class=\"md\"><p>One of the main things you can change after confirmation is retaining shareholders shares and equity. </p>\n\n<p>Here we have, post confirmation but pre effective date - talk of an “addition to the plan” </p>\n\n<p>What’s the addition? </p>\n\n<p>Likely part of whatever is redacted?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/iaislcxiiltb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/y6jxwngggltb1.jpg", "time": 1697039076.0, "subreddit": "r/ThePPShow", "title": "WHOEVER DOUBTED BETTER EAT THEIR WORDS “carve out” and “support plan reorganisation”", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/y6jxwngggltb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/sjoge65qfltb1.jpg", "time": 1697038829.0, "subreddit": "r/ThePPShow", "title": "NEW DOCKET!!! HOLD ON TIGHT!!! REVIEW PLAN OF REORGANISATION!!!!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/sjoge65qfltb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/17573vv", "time": 1697004432.0, "subreddit": "r/ThePPShow", "title": "Cellar Boxing/Naked Short Selling/Infinite Money Glitch", "text": "<!-- SC_OFF --><div class=\"md\"><p>I tried multiple times to post this normally but it just wouldn’t let me - I have no idea what the reason is. </p>\n\n<p>Apologies in advance that you’ll need to scroll through the attachments for the contents. </p>\n\n<p>Open the attachments to full screen view for a more fluent read.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/xumF8q3NO-tqVtNuZ9ffjGRAhLoxsNMnCdMptU1y-aA.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/171zki9", "time": 1696661091.0, "subreddit": "r/ThePPShow", "title": "PROOF! we have every intention to emerge from bankruptcy!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Docket 1848 confirms we (the company) have hired Deloitte as the tax specialist from May 1st until December 2025. </p>\n\n<p>We know any financial commitment whilst in bankruptcy court must be signed off by a judge - what judge who isn’t aware of a plan to successfully emerge from bankruptcy is going to sign off a near 3 year contract agreement for tax services? </p>\n\n<p>If you scroll to the second picture it reads “the date on which client emerges from bankruptcy”</p>\n\n<p>Some comment on my posts which are usually speculation saying I’m wrong - explain this shills - give me a good fucking counter argument for why the fuck a liquidating company who’s sole intention according to MSM, hedgefunds and shills is to cease to exist is signing tax services agreements for a near 3 year term with the exact terminology of emerging from bankruptcy. </p>\n\n<p>I’ll wait. </p>\n\n<p>Credit - EvaderDirt on Twitter. If you see this and have Reddit, please comment and I’ll get a mod to pin you to the top.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/d7GvBAC9j5lATdPbZGohbslGR-g024ky2-8v4riveSw.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/1717n3x", "time": 1696583727.0, "subreddit": "r/ThePPShow", "title": "You think this play is big? YOU HAVE NO FUCKING IDEA!", "text": "<!-- SC_OFF --><div class=\"md\"><p>I see many posts asking how big this play may be - as we all have, I’m sure you’ve whipped open that calculator on multiple occasions and typed (shares x (insert big number) I know I have! </p>\n\n<p>Well, I’m here to tell you - next time you do that you might want to add a few more fucking zeros to the “big number” </p>\n\n<p>Introducing - Frank la Salla, he is the president, CEO and director at the DTCC. Yes the fucking clearing house for the largest stock exchange in the world. </p>\n\n<p>Why do I give a fuck you’re asking? </p>\n\n<p>Good question! </p>\n\n<p>Frank left BNY Melon to take the role with the DTCC the same fucking BNY melon where our shares have likely gone or are being controlled by. </p>\n\n<p>Do you believe in the perfect play? Have you wondered why thus far although it’s taken 84 years there has been little to NO big issues? </p>\n\n<p>Our shares are now under the control of the company who’s long standing, high ranking exec now heads up the DTCC. </p>\n\n<p>For those who’s don’t know for context of this play - we would rely on the DTCC if we were to stay on a normal exchange to distribute shares in the event of a split/acquisition/merger (broker holders relevant) </p>\n\n<p>The other thing, potentially more importantly if you’re here for MOASS - they are legally obligated to fill the short positions of hedgefunds and market makers who go bust due to not being able to meet the financial implications of any market shake up. </p>\n\n<p>(being billions of shares short (naked) on a stock for decades would sure shake things the fuck up) </p>\n\n<p>The DTCC who would be obligated to buy all those shares in question at market price thus a short squeeze occurs. </p>\n\n<p>I started with you aren’t thinking big enough and after reading this you now understand why - there is a real possibly of change and if this play should come off you will be part of not only the new 0.1% club but also be in line to make decisions that actually impact the world you live in. </p>\n\n<p>Salvatore has a space today on x 30minutes after market close if anyone is looking for some content - I presume the pp show is on later also although I’m yet to see that confirmed. </p>\n\n<p>*this post should not be confused as financial advice</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/zPaSdZq7-vJYtRFoF-hi4oR7e-0jVyL7q2m-9Fr_J10.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/716pfpmkymqb1.jpg", "time": 1695749729.0, "subreddit": "r/ThePPShow", "title": "I’m done", "text": "<!-- SC_OFF --><div class=\"md\"><p>Recently updated. </p>\n\n<p>I’m never posting in this sub again.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/716pfpmkymqb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/ta6afvfsugqb1.jpg", "time": 1695675816.0, "subreddit": "r/ThePPShow", "title": "Wtf is this I see amended plan mentioned a few times", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is this in relation to it being amended for the sec objection to be sorted (some wording change) </p>\n\n<p>Or is this confirmation we fuck?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ta6afvfsugqb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16rxta4/13000_pps_understandably_pp_is_busy_lets_never/", "time": 1695661739.0, "subreddit": "r/ThePPShow", "title": "13,000 PP’s!!!! Understandably PP is busy - let’s never forget any big milestone", "text": "<!-- SC_OFF --><div class=\"md\"><p>13,000 legit followers of this sub mostly active is a great achievement - don’t get confused with some groups of people’s followers online who buy followers and engagement - 13,000 authentic followers all with the same goal of saving an all time great company is something you should all be very proud of! </p>\n\n<p>Sometimes I know I can be an angry bitch but I do love and respect each and every one of you.</p>\n\n<p>It’s <a href=\"/u/stock_digest\">u/stock_digest</a> dream to be in control of 15,000 PP’s (I promised I wouldn’t tell anyone but nobody loves pp more than he does) so start referring your friends; family members, hookers, mistresses etc. </p>\n\n<p>On a serious note - he does a great job of keeping the sub in great condition and keeping the peace - we all collectively owe him a big thank you. </p>\n\n<p>Wether we fuck today, tomorrow or next week - do not lose faith and remember the thesis and the guys you’re potentially investing in. </p>\n\n<p>When it’s time to fuck - we will be fucking</p>\n\n<p>Mother of all fucks </p>\n\n<p>Enjoy the show everyone!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16r3fn7/expectations_for_tomorrows_pp_show_with_pulte/", "time": 1695576533.0, "subreddit": "r/ThePPShow", "title": "Expectations for tomorrows PP show with Pulte", "text": "<!-- SC_OFF --><div class=\"md\"><p>I love seeing the excitement in the sub for the show tomorrow, it’s going to be an epic show and a big step in the right direction in terms of gaining the recognition and exposure this sub deserves. </p>\n\n<p>Those that have been here for a while will know I’m not a big fan of dates, all that have come before have failed to live up to the hype. Setting expectations highly for an exact day if history has taught us anything only leads to disappointment. </p>\n\n<p>This show tomorrow is different because regardless of what news we receive as I said above having the show be put on a big stage where we will expose this saga to many other potential investors is great when you think they’ll all be queuing up to buy once we move off expert. </p>\n\n<p>I saw legal billing for a 10q being paid last month, you know they’ve got it ready. They’ve had it all loaded up in advance for some time now. Some may say this is the play of the century and I certainly agree. </p>\n\n<p>Regardless of what happens tomorrow remember who you’re investing in, an individual who cares about his investors more than his profits and potential a giant short killer who’s here to fuck the guys that has been destroying the market for decades. </p>\n\n<p>There is sure to be fireworks, whenever they may be. </p>\n\n<p>On a side note, I am hoping it ends with PP getting to announce the news - it would be the biggest fuck you to the lying,fraudulent and misleading mainstream media. </p>\n\n<p>zero or hero bitches </p>\n\n<p>💰</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16q1s4y/kenneth_cordele_griffin_its_time_to_step_up_and/", "time": 1695467437.0, "subreddit": "r/ThePPShow", "title": "Kenneth Cordele Griffin it’s time to step up and take your punishment", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ken, it’s time to step up and take your punishment in open criminal court my friend - you’ve had a good run, you’ve defrauded millions of retail investors out of tens if not hundreds of billions of dollars. </p>\n\n<p>I think you know your time is up, it never to late to repent - securities fraud, naked short selling, short laddering, stealing from teachers pension funds, manipulating stock prices through fraudulent use of dark pools, spoofing tokenised shares on platforms such as FTX. (Feel free to add any further crimes in the comment section) </p>\n\n<p>Kenneth Griffin CEO of Citadel LLC has spent a lot of money on wiping his search history of his past and likely current crimes. </p>\n\n<p>I hope this post finds you and I’m sure as an unknown Redditor it will touch your heart into doing the right thing. </p>\n\n<p>Remember, whatever you decide - you’re a piece of shit and you’ll be holding a pocket by the end of the decade of that I have no doubt. </p>\n\n<p>P.s - fuck you</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/16p8egz", "time": 1695383920.0, "subreddit": "r/ThePPShow", "title": "The judge Kaplan connection FTX/BBBY/DEEP STATE FURTHER INFORMATION", "text": "<!-- SC_OFF --><div class=\"md\"><p>I posted something earlier regarding to “coincidence” surrounding the face the judge that stepped in for judge papa - Judge Micheal Kaplan shared the same last name as the judge in the FTX scandal who recently jailed SBF - Mr Lewis Kaplan.</p>\n\n<p>Now I appreciate this will scare some people, I know some of you guys are balls deep invested - I will admit myself 85% of all the money I have to my name is invested in this play and to make things worst I’m from the UK stuck with Etoro - you can’t be in a worse position than me. </p>\n\n<p>Some people did comment negatively so I wanted to do dive a little deeper and I will continue after this post also. </p>\n\n<p>It’s very hard to gather public information about judges and or non celebrities for that matter so I have had to really rabbit hole for this. </p>\n\n<p>I’m an attempt to find a connection I started to look at their early lives to get a good idea of where these two judges grew up. </p>\n\n<p>I found on linked in Judge Michael Kaplan went to a school called “Horace Mann School” this school is located in Bronx NY. </p>\n\n<p>I haven’t been able to track down where Judge Lewis Kaplan went to a school (yet) but sources confirm he was born in Staten Island NY. </p>\n\n<p>I’m from the UK so I’ve searched the distance and they’re both within a 35minute area (rough estimate) </p>\n\n<p>What are the chances? </p>\n\n<p>We have a stand in judge for a week who gets to read all the documents previously only privileged to Judge papa who was Judge Michael Kaplan then to find out the FTX court case judge is - Judge Lewis Kaplan. </p>\n\n<p>We had solid and conclusive DD in the last few weeks that proved FTX was being used by hedgefunds to short many stocks on the market including bbby. </p>\n\n<p>I know i wasn’t the only one that felt very uneasy when a different judge popped up on what should have been the confirmation day, Judge Kaplan decided he needed a few days to look at all the documents (his time to have a peak) then ultimately confirmed the plan. </p>\n\n<p>People will say “well he threw out the sec thing, he confirmed the plan etc” </p>\n\n<p>To those people I’d say it’s a good trade isn’t it? To throw out the sec objection and confirm the plan which judge papa would have done anyway in return he gets to see EVERYTHING that’s going on. </p>\n\n<p>I do NOT believe in coincidences. </p>\n\n<p>I’ve attached the four images at the top which you can scroll through. </p>\n\n<p>This post is for entertainment purposes only. </p>\n\n<p>lol</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Q1tC626XtJ9N8X4fAtN7pPJlQ02dJTRqJ0O1vQNYhoM.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/16p1qt9", "time": 1695359677.0, "subreddit": "r/ThePPShow", "title": "The Judge Kaplan Connection. BBBY/FTX/DEEP STATE! This runs fucking deep", "text": "<!-- SC_OFF --><div class=\"md\"><p>No pp show today which I rely on for my morning cardio entertainment - to make the hour go faster I thought I’d rabbit hole.</p>\n\n<p>You aren’t ready for this:</p>\n\n<p>Judge Lewis Kaplan is the judge that has jailed FTX “founder” Sam Bankman-Fried. </p>\n\n<p>Yes, his last name is Kaplan. </p>\n\n<p>We move on to Judge Kaplan who “stepped in” for judge Papa. </p>\n\n<p>That’s right the exact same last name - now I’ve not found a direct family tie and hoping people who read this can do some digging; it seems they’ve gone to some lengths to not list any reference to any family members (even parents) </p>\n\n<p>We never got an answer to why and what was wrong with judge papa and why he was replaced last minute on the last notable court case where we were looking for immediate plan confirmation. </p>\n\n<p>This wasn’t possible on the day as judge Kaplan said “I need to familiarise myself with the case and needed a few days” </p>\n\n<p>Now a few days later he did confirm the plan - my concern is he then became privileged to all the companies plans which have been for “professional eyes only” </p>\n\n<p>The question would now be are these two judges on our side. </p>\n\n<p>Of course Judge L Kaplan was going jail SBF he’s the fall guy for hedgefunds and deep state  corruption - we had guys on this sub that have exposed the real use for FTX I highly doubt Judge Kaplan is unaware. </p>\n\n<p>Judge L Kaplan was the judge for the investigations into prince andrews sex assault claims case - it’s safe to say we know which side he’s on. </p>\n\n<p>I do state above I was unable immediately to confirm family ties. Whilst digging I did find having relatives in the same district isn’t uncommon; attached you’ll find a list with some very notable names: Rothschild, Cohen to name a few. </p>\n\n<p>I’m sure we can agree this is far to coincidental.</p>\n\n<p>I’ll cover myself here - this post is for entertainment purposes only. </p>\n\n<p>I was hesitant to post this - but fuck it. </p>\n\n<p>Lol</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/Knqn39NPtAu5hhb1VWBI2tuAbDLZMuh7u5alwJh0Um4.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/hhgtkj46cnpb1.jpg", "time": 1695318456.0, "subreddit": "r/ThePPShow", "title": "Kirkland and Ellis still being paid as of August - LETS GO!!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Why is this important? Because the work in terms of the plan, confirmation and effective date work was done, they should still be working? </p>\n\n<p>Unless…. </p>\n\n<p>There’s a big fucking plan about to drop real soon!!!!!!! </p>\n\n<p>Side note - the legal guys dealing with the NOL’s have completed their work! </p>\n\n<p>Tick tock mayo!!!!!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/hhgtkj46cnpb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/77oukmrzgmpb1.jpg", "time": 1695307970.0, "subreddit": "r/ThePPShow", "title": "Expert market is to expose them once and for all!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Take a look at this shit! I believe moving to expert market was by design - they at any time could have easily filed a 10q but CHOSE not to.</p>\n\n<p>Ever thought why? </p>\n\n<p>They’ve hired a guy who’s at the very top of his field exposing market manipulation and corruption - this is where you step up and get to work. </p>\n\n<p>With the volume being traded it is quite literally impossible in a fair and impartial market for us to be down nearly 50%. </p>\n\n<p>Life had a good idea but no credibility - our guy who’s on big money has the reputation where if he submits something the court will take it seriously. </p>\n\n<p>I’m here for ££££$$$$$ and to see this fucks fully exposed, publicly humiliation and given those American style sentences we love to see pieces of shit get; </p>\n\n<p>“sir I sentence you to 800 counts of life imprisonment to run consequently” </p>\n\n<p>(By sir I mean bitch)</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/77oukmrzgmpb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/16nqxoc", "time": 1695230345.0, "subreddit": "r/ThePPShow", "title": "Directly from Kirkland and Ellis website - In-depth on Chapter 11 - another GREAT read", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was diving deep on their background, successes (of which there are many) etc and came across this buried in their archive. </p>\n\n<p>It’s a great insight into chapter 11 from the very start up until confirmation date - It’s a prequel to my post the other day (link below if you want to read that to) </p>\n\n<p><a href=\"https://reddit.com/r/ThePPShow/s/le4VHVgQ10\">https://reddit.com/r/ThePPShow/s/le4VHVgQ10</a></p>\n\n<p>This is priceless content being this information is directly from our very own legal team who have been EXTREMELY effective for us in court since this started. </p>\n\n<p>Have a good read! Let me know if anything stands out for you!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/yhH_81-8CR01XmZvPU1V7lEFXFd4mo1SuND_dJ82bZY.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/u0ez5i7bifpb1.jpg", "time": 1695223665.0, "subreddit": "r/ThePPShow", "title": "Siris who acquired AST has an interesting VP who’s head of “investor relations”", "text": "<!-- SC_OFF --><div class=\"md\"><p>Blackrock back ground, ends up as VP investor relations for Siri’s (an American private equity firm) who owns AST (BBBY’s transfer agent) </p>\n\n<p>Should BBBY pull this off, we can never underestimate the level of detail required to identify every obstacle! </p>\n\n<p>Siri’s brought AST at a very volatile time for basket stocks in July 2021. </p>\n\n<p>I feel like more digging is required - I don’t personally like the timing of when it was acquired and the back grounds of some of the people who now make the decisions for AST. </p>\n\n<p>Anyone done any digging into Siris? Please send me any links to DD.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/u0ez5i7bifpb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/16mlxjx", "time": 1695114222.0, "subreddit": "r/ThePPShow", "title": "Sears, Toys R us, Blockbuster etc THE link between BBBY and M3 Partners", "text": "<!-- SC_OFF --><div class=\"md\"><p>In the latest docket drop for legal expenses we find “M3” mentioned many, many times. Namely meeting with K.Kamlani who is the managing director at M3. </p>\n\n<p>So, who are M3? </p>\n\n<p>“M3 Partners provides hands-on leadership to develop actionable strategies that couple data with our broad expertise to align the interests of stakeholders toward a common goal”</p>\n\n<p>•If the common goal is making us fucking rich then welcome M3. </p>\n\n<p>Mr Kamlani who is the managing director quotes his experience:</p>\n\n<p>“Kunal has a passion for effectuating business transformations to maximize value for all stakeholders. With more than 25 years of operating experience” </p>\n\n<p>There’s more;</p>\n\n<p>“Prior to joining M3 Partners, Kunal served as president of ESL Investments where he led the firm’s M&amp;A, divestiture, and financing activities and worked side by side with portfolio company management teams on process reengineering initiatives”</p>\n\n<p>Fuck me all I’m getting is maximising value for all shareholders and specialising in merger and acquisitions! </p>\n\n<p>This alone is cool as fuck right? </p>\n\n<p>But that’s not all, that’s not even worth a post - it’s only when you go on the website to see who they have ties with that this gets fucking spicy! </p>\n\n<p>Attached you’ll find they’ve worked with the likes of blockbuster, sears, toys r us etc. </p>\n\n<p>I’ve picked out those especially because we all know the potential of a spin off which could include all three of those businesses into a brand that has an extension of pure nostalgia. </p>\n\n<p>What once was a bit of tinfoil seemingly now has a whole lot of substance. </p>\n\n<p>It’s all about who you know right?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/jCFIpE5zs9yegKBP4AyjhbF_oZfHuCaFnNX8xnmD4K0.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/16mlxjx", "time": 1695114222.0, "subreddit": "r/ThePPShow", "title": "Sears, Toys R us, Blockbuster etc THE link between BBBY and M3 Partners", "text": "<!-- SC_OFF --><div class=\"md\"><p>In the latest docket drop for legal expenses we find “M3” mentioned many, many times. Namely meeting with K.Kamlani who is the managing director at M3. </p>\n\n<p>So, who are M3? </p>\n\n<p>“M3 Partners provides hands-on leadership to develop actionable strategies that couple data with our broad expertise to align the interests of stakeholders toward a common goal”</p>\n\n<p>•If the common goal is making us fucking rich then welcome M3. </p>\n\n<p>Mr Kamlani who is the managing director quotes his experience:</p>\n\n<p>“Kunal has a passion for effectuating business transformations to maximize value for all stakeholders. With more than 25 years of operating experience” </p>\n\n<p>There’s more;</p>\n\n<p>“Prior to joining M3 Partners, Kunal served as president of ESL Investments where he led the firm’s M&amp;A, divestiture, and financing activities and worked side by side with portfolio company management teams on process reengineering initiatives”</p>\n\n<p>Fuck me all I’m getting is maximising value for all shareholders and specialising in merger and acquisitions! </p>\n\n<p>This alone is cool as fuck right? </p>\n\n<p>But that’s not all, that’s not even worth a post - it’s only when you go on the website to see who they have ties with that this gets fucking spicy! </p>\n\n<p>Attached you’ll find they’ve worked with the likes of blockbuster, sears, toys r us etc. </p>\n\n<p>I’ve picked out those especially because we all know the potential of a spin off which could include all three of those businesses into a brand that has an extension of pure nostalgia. </p>\n\n<p>What once was a bit of tinfoil seemingly now has a whole lot of substance. </p>\n\n<p>It’s all about who you know right?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/jCFIpE5zs9yegKBP4AyjhbF_oZfHuCaFnNX8xnmD4K0.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/16m0kac", "time": 1695055531.0, "subreddit": "r/ThePPShow", "title": "DIRECTLY from Kirkland and Ellis - MUST READ!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is directly from our legal teams website, I googled “3020(e) right to appeal after confirmation” and this is right at the top, above everything - which means they’ve paid for it to be there. This could be because they want everyone to read! </p>\n\n<p>It’s interested to see the potential for any partly to appeal the confirmation for a period of 10 days but that seems to not apply to us because our good friend holly etin got rid of the effective date for us - this could have Ben the real motive behind her request, to once and for all trap them. </p>\n\n<p>Note - “businesses do not usually want to wait long before putting their confirmation date into effect” </p>\n\n<p>I won’t bore you with a long post but please have a read. </p>\n\n<p>I’d love to hear any thoughts.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/WIwL9SzrR60UYF81ed80eHzS21i7o13yKIblzEU0zIM.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16kvpd8/drs_is_optional_v2_civil/", "time": 1694941136.0, "subreddit": "r/ThePPShow", "title": "DRS is optional v2 (Civil)", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have put up 2 posts in the last 48 hours which I’m sure most have seen and/or interacted with. </p>\n\n<p>I realise and understand I must not always rage and put across my point of view so aggressively - after all despite our sometimes slightly differing views we are all in this play for similar results;</p>\n\n<p>•A potential one time shot at blowing the basket open leading to what could be a systematic change </p>\n\n<p>•Financial gain past your wildest dreams </p>\n\n<p>•A unique chance to get in at the ground level of a future Amazon destroyer</p>\n\n<p>•The chance to finally lay bare and fully expose the hedgefunds corruption on such a scale there’s nowhere for them to hide. </p>\n\n<p>Firstly if you’re checking for my post history, you won’t find it as I’ve decided to remove all of it based on the feedback on certain posts in the last few days. The general conscious was that everyone’s investment is Individual and most are making their own decisions based on there OWN interruptions of the dockets being dropped by the company. </p>\n\n<p>With the above in mind I believe I may have been misleading people with my own opinion of what was going on, despite those same people who were showing big love for the simplistic updates, direct messaging me to further the discussions on previous topics. </p>\n\n<p>On to the actual point of the post and what I did not put across correctly yesterday which I apologise for. </p>\n\n<p>I have been 100% drs’d with my GME play for over 2 years now (I’ve left that post up on my history to eliminate any confusion) I am pro DRS but I would say I’ve learned some things including service issues that has led me to be more 50/50 (by this I mean 50% drs and 50% broker on my positions) </p>\n\n<p>Computer share issues I faced were likely due to the retail play setting a president in that large scale of individual investors requiring there service isn’t something they are set up to deal with on a customer serving basis. </p>\n\n<p>The issues I have faced would be:</p>\n\n<p>•online portal crashing</p>\n\n<p>•restrictions on the amount you can set per market order </p>\n\n<p>•restrictions on the amount you can request per share being significantly restricted (those OG apes will remember this) </p>\n\n<p>•Average call wait time for an agent on the phone 30-40 minutes on a quiet day. \n•on the gme split the DTCC fucked with the allocation of shares anyway so ultimately it didn’t matter how your shares were held</p>\n\n<p>•I had some GME shares in a broker when it split and the broker gave me my additional shares without any issue (although I accept part of that was likely possible because of the point above. </p>\n\n<p>It’s important to note that the issues experienced above weren’t during any volatility on the GME price nor at the time was there any big announcements expected. </p>\n\n<p>Let’s go to the flip side:</p>\n\n<p>If you’ve been here for a while you’ll know the pro’s for DRS:</p>\n\n<p>•Share ownership - despite what brokers led you to believe in the past years - you do not legally own your shares. The only way to truly own your shares is to put your fucking name on them (drs) </p>\n\n<p>•Unfavourable terms and conditions for retail investors with brokers - most will state they reserve the right to close your position at any stage for whatever reason without notice. </p>\n\n<p>•Robinhood bs which ultimately stopped the GME squeeze. Robinhood turning off the buy button coupled with brokers such as Etoro “accidentally closing potentially thousands of positions at the exact same time” </p>\n\n<p>•Should BBBY merge the potential issue holding in a broker is that they reserve the right not issue the shares of any new company if a merger should occur and can instead decide to give a monetary alternative - if you believe in this play long term and/or don’t want to risk missing any type of short squeeze on this could likely be detrimental. This part also comes down to when you think a squeeze would take place (whilst it’s still under the bbby ticker with the news of m&amp;a being the catalyst, during the stage of transfer into the new entity or once it’s been completed and confirmed they’re naked short what I do personally believe is billions and billions of shares. </p>\n\n<p>My own personal conclusion based on my experience with DRS and what I believe I understand of which is solely an opinion is as follows:</p>\n\n<p>I would as a preference DRS anywhere between 50-75% of my shares (this secures them in your name) </p>\n\n<p>Due to personal experiences dealing with a transfer agent directly and the many issues that can arise on a normal day let alone at a time of high volatility and uncertainty I would leave a small percentage of shares in a broker - this would be solely as a back up to take advantage of a short squeeze if one should occur. </p>\n\n<p>It’s my opinion we won’t see an immediate short squeeze, we will likely see price discovery first which I believe will be anywhere between $10-20$ wether that’s on the same ticker or another ticker. If it’s the later the split amount would then determine the profits made at that stage. I then think the company would be able to provide enough data to a court to incriminate all corrupt parties at play and blow the entire basket up. </p>\n\n<p>If it’s one thing I learned from the gme split it was these fucks sure know how to kick the fucking can. </p>\n\n<p>Another theory I do have lingering is they’ll let it squeeze straight away and use the liquidity from FTX liquidations to pay us but most importantly for them use FTX as an excuse with the media concentrating solely on that and drowning out the 100k+ new millionaires who used green dildo upvotes to fuck hedgefunds. </p>\n\n<p>As mentioned at the start, I do apologies with the approach in my last few posts - although it’s not all bad because now I understand that no matter how much you try to help people - most in the end remain ungrateful and only have time to be negative little bitches. </p>\n\n<p>I have direct contact with the people of actual value and will look to limit interaction with the masses. </p>\n\n<p>Best of luck to everyone in this play - remember to be conscious of everyone’s situation. </p>\n\n<p>Don’t let new money change your character. </p>\n\n<p>Xxx</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16kv7me/drs_is_optional_v2_civil_version/", "time": 1694939225.0, "subreddit": "r/ThePPShow", "title": "DRS is optional V2 (Civil Version)", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have put up 2 posts in the last 48 hours which I’m sure most have seen and/or interacted with. </p>\n\n<p>I realise and understand I must not always rage and put across my point of view so aggressively - after all despite our sometimes slightly differing views we are all in this play for similar results;</p>\n\n<p>•A potential one time shot at blowing the basket open leading to what could be a systematic change </p>\n\n<p>•Financial gain past your wildest dreams </p>\n\n<p>•A unique chance to get in at the ground level of a future Amazon destroyer</p>\n\n<p>•The chance to finally lay bare and fully expose the hedgefunds corruption on such a scale there’s nowhere for them to hide. </p>\n\n<p>Firstly if you’re checking for my post history, you won’t find it as I’ve decided to remove all of it based on the feedback on certain posts in the last few days. The general conscious was that everyone’s investment is Individual and most are making their own decisions based on there OWN interruptions of the dockets being dropped by the company. </p>\n\n<p>With the above in mind I believe I may have been misleading people with my own opinion of what was going on, despite those same people who were showing big love for the simplistic updates, direct messaging me to further the discussions on previous topics. </p>\n\n<p>On to the actual point of the post and what I did not put across correctly yesterday which I apologise for. </p>\n\n<p>I have been 100% drs’d with my GME play for over 2 years now (I’ve left that post up on my history to eliminate any confusion) I am pro DRS but I would say I’ve learned some things including service issues that has led me to be more 50/50 (by this I mean 50% drs and 50% broker on my positions) </p>\n\n<p>Computer share issues I faced were likely due to the retail play setting a president in that large scale of individual investors requiring there service isn’t something they are set up to deal with on a customer serving basis. </p>\n\n<p>The issues I have faced would be:</p>\n\n<p>•online portal crashing</p>\n\n<p>•restrictions on the amount you can set per market order </p>\n\n<p>•restrictions on the amount you can request per share being significantly restricted (those OG apes will remember this) </p>\n\n<p>•Average call wait time for an agent on the phone 30-40 minutes on a quiet day. \n•on the gme split the DTCC fucked with the allocation of shares anyway so ultimately it didn’t matter how your shares were held</p>\n\n<p>•I had some GME shares in a broker when it split and the broker gave me my additional shares without any issue (although I accept part of that was likely possible because of the point above. </p>\n\n<p>It’s important to note that the issues experienced above weren’t during any volatility on the GME price nor at the time was there any big announcements expected. </p>\n\n<p>Let’s go to the flip side:</p>\n\n<p>If you’ve been here for a while you’ll know the pro’s for DRS:</p>\n\n<p>•Share ownership - despite what brokers led you to believe in the past years - you do not legally own your shares. The only way to truly own your shares is to put your fucking name on them (drs) </p>\n\n<p>•Unfavourable terms and conditions for retail investors with brokers - most will state they reserve the right to close your position at any stage for whatever reason without notice. </p>\n\n<p>•Robinhood bs which ultimately stopped the GME squeeze. Robinhood turning off the buy button coupled with brokers such as Etoro “accidentally closing potentially thousands of positions at the exact same time” </p>\n\n<p>•Should BBBY merge the potential issue holding in a broker is that they reserve the right not issue the shares of any new company if a merger should occur and can instead decide to give a monetary alternative - if you believe in this play long term and/or don’t want to risk missing any type of short squeeze on this could likely be detrimental. This part also comes down to when you think a squeeze would take place (whilst it’s still under the bbby ticker with the news of m&amp;a being the catalyst, during the stage of transfer into the new entity or once it’s been completed and confirmed they’re naked short what I do personally believe is billions and billions of shares. </p>\n\n<p>My own personal conclusion based on my experience with DRS and what I believe I understand of which is solely an opinion is as follows:</p>\n\n<p>I would as a preference DRS anywhere between 50-75% of my shares (this secures them in your name) </p>\n\n<p>Due to personal experiences dealing with a transfer agent directly and the many issues that can arise on a normal day let alone at a time of high volatility and uncertainty I would leave a small percentage of shares in a broker - this would be solely as a back up to take advantage of a short squeeze if one should occur. </p>\n\n<p>It’s my opinion we won’t see an immediate short squeeze, we will likely see price discovery first which I believe will be anywhere between $10-20$ wether that’s on the same ticker or another ticker. If it’s the later the split amount would then determine the profits made at that stage. I then think the company would be able to provide enough data to a court to incriminate all corrupt parties at play and blow the entire basket up. </p>\n\n<p>If it’s one thing I learned from the gme split it was these fucks sure know how to kick the fucking can. </p>\n\n<p>Another theory I do have lingering is they’ll let it squeeze straight away and use the liquidity from FTX liquidations to pay us but most importantly for them use FTX as an excuse with the media concentrating solely on that and drowning out the 100k+ new millionaires who used green dildo upvotes to fuck hedgefunds. </p>\n\n<p>As mentioned at the start, I do apologies with the approach in my last few posts - although it’s not all bad because now I understand that no matter how much you try to help people - most in the end remain ungrateful and only have time to be negative little bitches. </p>\n\n<p>I have direct contact with the people of actual value and will look to limit interaction with the masses. </p>\n\n<p>Best of luck to everyone in this play - remember to be conscious of everyone’s situation. </p>\n\n<p>Don’t let new money change your character. </p>\n\n<p>Xxx</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16k4eqy/drs_is_optional/", "time": 1694861299.0, "subreddit": "r/ThePPShow", "title": "Drs is optional", "text": "<!-- SC_OFF --><div class=\"md\"><p>This sub near overnight seems to have lost its fucking mind over an instagram post with some very standard notice of registering your item. Every fucking item sold within the baby industry that’s used by your child for long periods of time will have this exact same message either on the receipt or box of the item. </p>\n\n<p>There seems to be no thoughts to the thousands upon us who literally can not DRS, wether that’s geographical and the country won’t allow it or the fact people hold there shares in brokers that don’t offer the DRS service which is quite a few specially in Europe. </p>\n\n<p>The fucking mental breakdown I’ve seen isn’t anything I’ve not seen before - it sent me straight back to post gme sneeze almost instantly. </p>\n\n<p>Ask yourself, DRS in the masses by retail although over time would be a good thing potential (completely new idea so who knows) but do you think these agents are equipped for that kind of influx of direct customers? There’s a reason they don’t want people buying direct, they don’t have the fucking staff to deal with call in’s etc and/or all the other dumb fucks like some people on this sub that will ask the same questions everyday. </p>\n\n<p>The above is some of the many negatives I’ve seen thrown around in the past since we’re seemingly going down this route. </p>\n\n<p>The main point of this is spreading fear when al ot of your fellow holders can’t do shit isn’t a great fucking feeling. The buy button not being there is enough to send some of the less faithful to the brink of a meltdown let alone adding this shit in. It’s not new news that drs should be considered but when we’ve got everyone having a fucking meltdown how productive can that really be? </p>\n\n<p>As many messaged back when yesterday to my post about giving back “this is your individual investment and it’s all you bro” </p>\n\n<p>With that in mind shut the fuck up and play your investment - it’s an individual decision. (We’ll pretend it wasn’t started by the exact people who I was asking to be rewarded whilst little fuck heads come on the post to say the reason is here because they became overnight bankruptcy code experts and always understood the play. </p>\n\n<p>I’ll be honest from my point of view the reception my post to giving back got I’ve lost a lot of respect for the individuals that went missing. </p>\n\n<p>DRS - OPTIONAL \nBE MINDFUL THAT THERES MANY GUYS INC ME WHO AT THIS MOMENT IN TIME CAN NOT DRS. </p>\n\n<p>If we aren’t going down the route of being mindful becayse it now doesn’t suit the masses and it’s every man for themselves then this sub is going SS style real quick.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16ijpwn/the_company_isnt_liquidating_read_this_and_tell/", "time": 1694701169.0, "subreddit": "r/ThePPShow", "title": "The company isn’t liquidating - read this and tell me otherwise!!!!!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Why would a company with a sole purpose of liquidating hopefully in there eyes as soon as humanly possible given holly etlin wanting to waive the 14 day effective time period give a single fuck about if we’re on the OTC or Expert market.</p>\n\n<p>This is likely the first of a few bits of good news today as we patiently wait to see if the Judge is going to confirm the plan. If this does happen, the buying pressure from limit orders placed and everyone fomo’n in when we are able to resume trading (likely Monday) you will see your fucking merger Monday with a side of parabolic squeezing. </p>\n\n<p>Further to this I touch on something mentioned on the PP show last night which is the fact they would get sued by every single retail investor if they we’re to liquidate now. </p>\n\n<p>•Selling the baby IP for 15 million (shared ownership I know but not if they went under) for a multi billion dollar company) isn’t going to be accepted by any court as done in good faith.</p>\n\n<p>•Not selling hundreds of leases (why the fuck aren’t we trying to gain as much money to pay out to share/bond holders as possible? </p>\n\n<p>•accepting the second highest bid for baby</p>\n\n<p>•paying off JPM first and in full with no legal requirement to do so </p>\n\n<p>I’ll tell you why they’ve done all of the above - it’s because this isn’t a fucking liquidation! </p>\n\n<p>The courts must have known all along what the play is here otherwise there’s no fucking way they’d allow those things above along others I’ve missed. </p>\n\n<p>The need for the opt out to stand was important because if there is issues confirming the plan at this stage the company can present figures for every retail investor that retained their right to launch legal proceedings of which I’m sure there’s over 100k. That’s a 100k legal battles potentially? What court district is signing up for that shit storm. The legal system would be just as much on the hook being the judge oversaw all these things stated above and allowed them. </p>\n\n<p>The idea of a bankruptcy where your sole intention is liquidation is to raise as much money as possible to repay creditors, shareholders, bond holders etc. </p>\n\n<p>Mayo and do have been fucked from very angle and as someone that’s held GME pre sneeze and BBBY pre banktrupcy, I am loving every fucking moment! </p>\n\n<p>To everyone crying every time something changes and getting a little worried let this serve as an example to you that you’re taken care of here - the big players have planned this out from every single angle. </p>\n\n<p>NFA I’m clinically retarded.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16hq6t0/potential_reason_why_no_brokers_warned_of_the/", "time": 1694619283.0, "subreddit": "r/ThePPShow", "title": "Potential reason why no brokers warned of the expert market switch", "text": "<!-- SC_OFF --><div class=\"md\"><p>I personally think high up execs in the know already have had it confirmed this company isn’t fucking liquidating, they don’t care about warning you because we aren’t fucking staying there for long and who the fuck here is going to care when we’re seeing double and triple digit prices for this stock. </p>\n\n<p>I see the plan being confirmed tomorrow and following that confirmation we get the real plan and any sec filing required to get us off expert market will drop at the same time/close after. </p>\n\n<p>The real short interest we’ve speculated is in the billions, we don’t need anymore buying power in my opinion. We just need to sit here and do fucking nothing! </p>\n\n<p>Stay relaxed - end game! </p>\n\n<p>Not financial advice.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16hoy1x/a_few_links_for_people_who_cant_view_the_price/", "time": 1694616382.0, "subreddit": "r/ThePPShow", "title": "A few links for people who can’t view the price action.", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.cnbc.com/quotes/BBBYQ\">https://www.cnbc.com/quotes/BBBYQ</a> - that’s updating by the minute most of the time. </p>\n\n<p>As you can see we’re seeing some volatility there with a minute to minute change from 0.16 to 0.20 and back down. Nothing to sing about but volatility at this stage is bullish. We want the big swings and for them to lose control. </p>\n\n<p>From comments on my previous post it looks like most orders are getting stuck in pending but I have seen enough comments and screen shots being DM’d to me to confirm as of right now fidelity are filling orders which is quite interesting. </p>\n\n<p>We’re now locked in, your money is where your mouth is. The judge said yesterday he will look to confirm the plan by this Thursday (tomorrow tm) with the effective date potentially being 28th September. </p>\n\n<p>I believe the play is to lock in all voting classes then release an announcement after the confirmation date but before the effective date. </p>\n\n<p>The lien as many have said will be off the table being all classes have accepted the plan and that leaves the big man or someone connected to them to swoop in for baby and show us the REAL FUCKING PLAN. </p>\n\n<p>If you understand this play and have been doing your research and reading the great DD along with listening into the great shows done by PP on YouTube and all the other guys on spaces you will not be worried right now. This is what the fuck we want. </p>\n\n<p>Moments in life like these do not come often. If this does go our way which I have no reason in my own personal opinion to believe it won’t, your lives are potentially about to change  forever! </p>\n\n<p>Posting more today than usual to filter out the fucking shills - anyone who reads the comments on my posts will know I will fight for each and everyone of you guys. No man left behind! </p>\n\n<p>LFG. </p>\n\n<p>NFA and all that bs</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16h1gez/all_objections_overruled_so_far/", "time": 1694548988.0, "subreddit": "r/ThePPShow", "title": "All objections overruled so far", "text": "<!-- SC_OFF --><div class=\"md\"><p>All objections including the SEC’s have been thrown out and the explanation from the judge on each one is like him talking to the objectors like children and reminding them of the very basics of the bankruptcy code and/or basic knowledge. </p>\n\n<p>This is great news providing nothing else pops up -  it will allow the plan to pass then we will learn the confirmation date then between todays date and the confirmation date is when we can be added back in as shareholders if that’s the plan of the company.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16gjb8e/waiving_the_14_day_effective_date_makes_sense/", "time": 1694498629.0, "subreddit": "r/ThePPShow", "title": "Waiving the 14 day effective date makes sense", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have been thinking about why holly etlin would want to waive the 14 day effective date being that’s the window of time for us to be added back in for recovery. </p>\n\n<p>The only thing I can think of that lines up with what’s been touched on recently is the OTC expert market.</p>\n\n<p>I believe they know from the minute the plan is confirmed HF’s will short the stock hard and if they had a good week run at it they may well be able to get us to a penny and below - this would likely have a knock on effect along the way with the less informed investors hitting their max pain threshold and taking the loss. </p>\n\n<p>With that being said I think they’ll be very swift with an announcement regarding the change of the plan to add us back in. </p>\n\n<p>The board will be aware there’s a lot of shareholders with big positions who have put there hard earned money where there mouth is - a lot of very intelligent individuals on this sub and on the various x space’s and pp show spending 100s of hours on DD and research which supports Ryan cohens work hard ethos. They’re aware we’re supporting them and I believe it’s now not going to be long before we are rewarded. </p>\n\n<p>Whatever happens today, trust the process and relax. If we get dropped hard for most of us it’s nothing new. </p>\n\n<p>These are the moments that can define your lives. </p>\n\n<p>This is purely an opinion and shouldn’t be confused for financial advice.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/gallery/16ebqjp", "time": 1694281224.0, "subreddit": "r/ThePPShow", "title": "Cohen reply on X lining up with plan supplement approval day!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Cohen replies on X “Big win for consumers.\nConsumers have also invested their hard earned money in to physical video games.\nDisk drives should be required on consoles” </p>\n\n<p>The plan supplement approval court date is 12th September </p>\n\n<p>National video game day is 12th September </p>\n\n<p>Is he trying to tell us we have been holding the stock and the 12th we will get what we deserve?</p>\n\n<p>Not big on tinfoil but I also have to admit some things found by guys on here match up so well it’s almost impossible to dismiss!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/nR5tkAeBVdPDebau6sy84mEe7hyAyhz_GGSE7GfoGtQ.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16ddr6f/plan_confirmed_that_were_being_wiped_out/", "time": 1694187243.0, "subreddit": "r/ThePPShow", "title": "Plan confirmed that we’re being wiped out", "text": "<!-- SC_OFF --><div class=\"md\"><p>The plan has been accepted confirming we’re being wiped out - so explain to me mayo and co how the fuck are we not trading at under a cent? Not even that how are we currently trading green for the day? </p>\n\n<p>Check mate bitches.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16d3ubh/dates_being_thrown_around/", "time": 1694157990.0, "subreddit": "r/ThePPShow", "title": "Dates being thrown around", "text": "<!-- SC_OFF --><div class=\"md\"><p>The date of September 12th is being thrown around as the final date for the plan to be modified to include shareholders however this isn’t correct. The final date of which this plan can be modified will likely be confirmed on the 12th September as per the plan supplement just released. I am not a fan of dates and in the past i to have been left disappointed. The plan being accepted by all parties is a BIG step in the right direction in my opinion (nfa) this now means they can add us back in without negatively effected any voting party and no one will be able to object or so shit legally. </p>\n\n<p>Whilst I am balls deep in this play as most of us are - it’s important to stay calm and not set expectations of any set date. </p>\n\n<p>We’ve seen TA which means absolutely nothing, once things are released things will move. </p>\n\n<p>Remember glen had a peak into the plans and has shut the fuck up ever since - not attempted to do a single thing - again my own opinion and nfa but;</p>\n\n<p>They\nAre\nFucked </p>\n\n<p>Nothing has changed, I will be doing absolutely nothing.</p>\n\n<p>xxxx</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/16atphg/do_not_worry_about_the_price_action/", "time": 1693933318.0, "subreddit": "r/ThePPShow", "title": "Do not worry about the price action", "text": "<!-- SC_OFF --><div class=\"md\"><p>As the title states, don’t worry about the price action. It’s all on algo and controlled entirely by hedgefuks. It’s harder when were seeing “DD” (utter garbage) on why we saw 23%+ on Friday coupled with TA stating a big run in September but this is all guess game horseshit. </p>\n\n<p>Don’t panic, don’t worry about any the price. Sit tight and wait for cohen and co make their announcement and collect your riches. </p>\n\n<p>That’s all. </p>\n\n<p>P.s DO NOT WORRY. </p>\n\n<p>xxxxx</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/kj31m4mi3amb1.jpg", "time": 1693850610.0, "subreddit": "r/ThePPShow", "title": "Amazon dethroning", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have explained what’s happening with this stock to many friends and family and like many I have heard on this sub they always switch off when I go onto how this play could turn into the company being apart of a huge conglomerate that could not only challenge Amazon but take the number one spot. </p>\n\n<p>When we look at the reviews of amazon it’s easily to see this is far from a pipe dream. There reviews from recent years centre around poor customer service and issues with returns and refunds. </p>\n\n<p>Delving deeper into how a company once known for being almost to reasonable with returns and refunds, is now one of the worst online retailers for this part of their service I find myself coming to some conclusions:</p>\n\n<p>•A large amount of stock is of poor quality (brought in high volume from china) </p>\n\n<p>•Company profits and the profits of their resellers are put ahead of customers satisfaction</p>\n\n<p>•When items are returned because of their fulfilment obligations to resellers they struggle to dispose of unwanted items (you have to think how big of an issue this was to be public knowledge) </p>\n\n<p>So, you’re Amazon - you have these issues (amongst many others) how do you proceed? </p>\n\n<p>You change your returns and refund policies solely in favour of your business and leave customers high and dry. You do this because  you’re aware your market place is now flooded with poor quality items and the issue is on such a large scale it’s to late to clean up the market place, the algorithms etc you choose to deceive the very customer base that gave you your name and billions of dollars. </p>\n\n<p>Could these issues used as an example for a competitor to come along and rip Amazon off their pedestal?</p>\n\n<p>A group of individuals who;</p>\n\n<p>•Put customer satisfaction first \n•Monitor their marketplace for quality control purposes \n•Understand the need for brick and mortar stores so customers can come into store to experience their products in person before ordering online - significantly reducing costs relating to returns. </p>\n\n<p>Imagine if this group of individuals brought back some old brands that BCG fucked with places like blockbusters, toys r us etc. imagine walking into a store which is immediately split up into 4 mini stores - we have a bbby, GME, Blockbusters and toys r us - the last two should be purposely built around their original old school theme for maximum nostalgia. Could you fucking imagine as a 30+ year old walking back into one of those stores again set up exactly how they once were before? </p>\n\n<p>Blockbuster running back the years and becoming the number one streaming giant as they were meant to be if it wasn’t for shit hedgefuks and BCG? </p>\n\n<p>Blockbusters was perfectly positioned with all the customer data they had from people renting dvd’s and games for decades: we all know that customer data is any companies biggest asset so you know for a fucking fact they were fucked with by the same people who have fucked with GME and us here: they were in control of that entire market if they wanted it but someone wanted to short it into oblivion and make sure they never had to cover. </p>\n\n<p>A world full of possibilities!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/kj31m4mi3amb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/0bi8m5vo76mb1.jpg", "time": 1693803628.0, "subreddit": "r/ThePPShow", "title": "I’ll leave this here", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/0bi8m5vo76mb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/168veyk/drs_from_any_country_101/", "time": 1693743115.0, "subreddit": "r/ThePPShow", "title": "DRS from any country 101", "text": "<!-- SC_OFF --><div class=\"md\"><p>I don’t know if people are being fucking shills or they’re serious but I’ll explain it very simply for you. </p>\n\n<p>•You have x shares currently with a broker that doesn’t allow DRS - wow, how are we going to get around this, shall we keep writing posts of should we do some basic searches where you’ll find this has been solved for years. </p>\n\n<p>Steps: </p>\n\n<p>•Do not sell your original shares in your current broker that doesn’t allow DRS</p>\n\n<p>•Open an IBKR or any broker that ALLOWS drs. </p>\n\n<p>•Once open buy 1 single share and DRS said share</p>\n\n<p>•This will generate you the DRS account details with log in details - may take a few weeks in total to complete in some cases (hence don’t sell your shares and risk not being in should good news break) </p>\n\n<p>•open an account online with “wise” this is an international money transfer provider who will generate American payment details for you (you will then be able to load money from your EU/other countries outside the uk)</p>\n\n<p>•once your DRS account is open you can then sell your broker shares and purchase directly. (You may want to do this is increments to again avoid potentially not being in the game if good news came out. </p>\n\n<p>•please will claim they can’t sell but from what I’ve seen that changes from time to time so having a drs account open and ready to load shares in would make sense if DRS is something you want to do. </p>\n\n<p>This isn’t financial advice and my opinion on drs is it’s entirely your choice. 75% (roughly) of my shares are in a broker account - the rest are DRS. You won’t be shamed here regardless of your decision. </p>\n\n<p>If this can clear up the thread for legit good DD then the purpose of this post is a success. </p>\n\n<p>We likely need a mod to pin posts for the very basics and for potential new investors to view - seeing questions like “what are NOLs” etc at this stage is frustrating although I do feel if we pinned the best explanations to some of the basics of this play we’d see a more professional and productive feed.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/167cikq/similar_price_action_one_day_a_few_weeks_ago/", "time": 1693587276.0, "subreddit": "r/ThePPShow", "title": "Similar price action one day a few weeks ago", "text": "<!-- SC_OFF --><div class=\"md\"><p>My guess is we finish todays trading either a very small green or perhaps red. This is likely just another show of strength from hedgefunds that they’re in control until a significant announcement is made. </p>\n\n<p>One day a few weeks ago I remember we were up over 20% and closed red. </p>\n\n<p>Do not let this effect you at all. It’s all mental games at this stage after trading sideways for weeks. </p>\n\n<p>Keep your eyes on the prize!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/l7rcvqxmbnlb1.jpg", "time": 1693574885.0, "subreddit": "r/ThePPShow", "title": "Huge volume pre market", "text": "<!-- SC_OFF --><div class=\"md\"><p>LOL</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/l7rcvqxmbnlb1.jpg\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/166gc4n/ticker_price/", "time": 1693500597.0, "subreddit": "r/ThePPShow", "title": "Ticker price", "text": "<!-- SC_OFF --><div class=\"md\"><p>All these glitches with what is no doubt an issue hiding the dark pool price then we have the price we can see (bullshit price) which seems to be in an algo between 0.211-0.22 when it hits 0.211 which happens a few times per day the prices literally freezes there for a good few minutes. </p>\n\n<p>Anyone got any thoughts on this? </p>\n\n<p>Something is happening for sure. </p>\n\n<p>Either way - pay up bitches</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/165irjy/these_landlords_need_their_financials_investigated/", "time": 1693411401.0, "subreddit": "r/ThePPShow", "title": "These landlords need their financials investigated", "text": "<!-- SC_OFF --><div class=\"md\"><p>The argument currently going on in court by a landlord is ridiculous. It complains the new perspective tenant would be a direct competitor to an existing tenant: the landlord states that it would be subject to financial penalties as per contracts between the landlord and said tenant - contract of which was requested by bbby legal team but that request was denied meaning bbby couldn’t have known what penalties the landlord faced. </p>\n\n<p>I’ve gone on to Google these two “competitors” in question and there are already shopping centres where these two “competitors” are literally next door to each other. </p>\n\n<p>It’s pathetic and clearly a stall and waste of the judges/court time and in my opinion have been motivated by other parties who are against bbby restructuring. What kick back could these landlords be getting either directly or indirectly. </p>\n\n<p>We’re talking about as holly said a 4billion + company and even the judge is sat there thinking what the fuck is this shit. </p>\n\n<p>It’s bullish when we’ve got to this level of petty.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://www.reddit.com/r/ThePPShow/comments/162mmhz/are_we_going_to_ban_ucopy/", "time": 1693131451.0, "subreddit": "r/ThePPShow", "title": "Are we going to ban U/copy?", "text": "<!-- SC_OFF --><div class=\"md\"><p>As the title says. It’s got so bad now that if interested potential investors are searching for information away from MSM this fuck head is coming up. They’ll read his last 20 posts of which you can verify all have been wrong and we all look like dumb fucks (which we are) but you know what I’m saying. </p>\n\n<p>Someone ban him - he’s clearly a shill.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "BrunoMaybach", "url": "https://i.redd.it/xlv0gmcbijjb1.jpg", "time": 1692657008.0, "subreddit": "r/ThePPShow", "title": "Bbby sub is compromised", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m now holding 70k shares and I get banned for voicing an opinion and having a laugh on the sub. Holding pre any squeeze. </p>\n\n<p>Fuck that sub. Everyone join here! </p>\n\n<p>The mods on <a href=\"/r/bbby\">r/bbby</a> moving like superstonk mods post first sneeze - sell out rats </p>\n\n<p>That’s all</p>\n\n<p>Xxx</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/xlv0gmcbijjb1.jpg\"/></div>"}]