[{"username": "butterdaysahead", "url": "https://i.redd.it/3hymya4gnlob1.jpg", "time": 1694862186.0, "subreddit": "r/ThePPShow", "title": "DRS is insurance", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone, long time listener, first time caller. Love this community and have been following ThePPShow for quite some time now. </p>\n\n<p>This post is primarily about DRS and doing whatever the fuck you feel comfortable with. You wanna DRS one share, do that. You wanna DRS nothing, do that. You wanna DRS 100%, you diamond handed ape, do that. </p>\n\n<p>Noticing a bit of resistance and fear being spread about DRS. Notably, posts saying that the DRS movement feels inorganic or forced. Same thing happened in the GME stocks when the DRS movement first started. In my opinion, that is FUD spread by bad actors. Inorganic or force deez nuts in your mouth shills. </p>\n\n<p>Personally, I am 70% DRS GME with my 30% stuck in IRA accounts. I was very skeptical of AST and hesitant to DRS initially because their site was down for so long. Once their site was back up and Pulte came on the show, I sent over 100 shares to set up my AST account. </p>\n\n<p>Again, we are all individual investors who make our own decisions. Pulte did not tell me to DRS, just said to be open-minded. So I did. </p>\n\n<p>Man it feels fucking good man. DRS is insurance. If AST goes down, if brokers go down, owners of shares would still have their names registered as their own, IF DRSed! </p>\n\n<p>Does anyone remember when we first moved into chapter 11 and someone posted about how they felt safe knowing their names would be in dockets as a holder because they DRSed? That post stuck with me and I now have a similar safety and insurance knowing no matter what, I have a couple flags that will be planted on the moon with my DRSed shares on them. </p>\n\n<p>Since I sent those initial 100 shares, I have made two more transfers and 69% of my shares are now directly registered with the other 31% in Fidelity to sell off once this baby starts to rip. </p>\n\n<p>Do whatever you’re comfortable with. If you don’t wanna DRS anything, who the fuck cares. We’re clearly of high-risk tolerance if we’re in this play. With great risk, often comes great reward. </p>\n\n<p>Personally, I’ve DRSed a solid chunk of my shares as insurance against this corrupt system we’ve all banded against, leaving no stone unturned. It really does feel good to have insurance.  </p>\n\n<p>Not financial advice. We are individuals responsible for our own decisions. Take accountability for actions and see you apes on the moon 🌝</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3hymya4gnlob1.jpg\"/></div>"}]