[{"username": "CableGuyAlien", "url": "https://www.reddit.com/gallery/17w7i2t", "time": 1700091234.0, "subreddit": "r/ThePPShow", "title": "Who is SettleMint and what do they have to do with Beyond?", "text": "<!-- SC_OFF --><div class=\"md\"><p>So after having no new posts or replies since November 7th, the Beyond Twitter/X accounts drops some hot foil.</p>\n\n<p>They congratulate the SettleMint team on an exciting announcement and link to SettleMint&#39;s post. The post is about how they are supporting KBC Bank (a Belgium bank) in helping Bolero Crowdfunding extend into the blockchain world with a link to the press announcement from SettleMint. </p>\n\n<p>Following the press announcement link takes you to news.settlemint.com and within the first paragraph I see that SettleMint describes themselves as a &quot;Blockchain Transformation Company.&quot; As I continue to read the article, right after a comment from Matthew Van Niekerk, the CEO and co-founder I spot the juicy tin!</p>\n\n<p>&quot;This significant upgrade included customizing the EIP-2535 Diamond Standard smart contract template from SettleMint’s platform to offer more flexibility than other smart contract standards and to serve two primary purposes. Firstly, this enabled the creation of tokenized bonds. Secondly, it facilitated atomic swaps for seamless cross-chain investments and coupon payments for securities tokenized on one blockchain and cash tokenized on a different blockchain.&quot;</p>\n\n<p>Now why in the world is Beyond congratulating a Belgium Blockchain Transformation Company on seamless cross-chain investments for SECURITIES TOKENIZED on one block chain and CASH TOKENIZED on a different blockchain??</p>\n\n<p>Is SettleMint somehow in this play? Help me dig.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/sIrdDvIRxBmYA9dkgHppsnKsvpvOoloA9ouYW_RIpn0.jpg\"/></div>"},
{"username": "CableGuyAlien", "url": "https://i.redd.it/2olp76yzctsb1.jpg", "time": 1696698919.0, "subreddit": "r/ThePPShow", "title": "I choose to feel unwavering conviction", "text": "<!-- SC_OFF --><div class=\"md\"><p>All the shills saying &quot;big dummy&quot; have no ideas how smart I is.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2olp76yzctsb1.jpg\"/></div>"}]