[{"username": "CanopianPilot", "url": "https://www.reddit.com/r/ThePPShow/comments/171jcee/revolut_bbby_update_of_interest/", "time": 1696615580.0, "subreddit": "r/ThePPShow", "title": "Revolut BBBY update of interest", "text": "<!-- SC_OFF --><div class=\"md\"><p>I thought it might be interesting to some on here to read the in-app text update that&#39;s gone out to BBBY holders. Previously, anyone with a remaining position was to have it liquidated on October 17th. That is now paused as shares can&#39;t be sold in any active market so they&#39;re looking into it more.</p>\n\n<p>The text is as follows:</p>\n\n<p>&quot;Important update to your position in BBBYQ</p>\n\n<p>Bed Bath &amp; Beyond (BBBYQ) has been delisted from OTC trading as of Monday, October 2, 2023. In previous communications we have sent you, the scheduled liquidation date for all remaining positions of Bed Bath &amp; Beyond (BBBYQ) was Tuesday, October 17, 2023. However, now there is no active market where our third party broker can sell these shares. Our third-party broker is awaiting further information from the Depository Trust and Clearing Corporation (DTCC), meaning that you will continue to see your BBBYQ position. Once we have an update, we will notify you via the app.&quot;</p>\n\n<p>So, this could be nothing or it could be something. No idea either way and will wait and see as usual. I think it could be a sign that something is brewing, but that could well be misplaced hopium. I only personally have a small position in BBBY however, and I never did DRS as a result. I am curious where things will end up in the end. Perhaps all gone and dead in the water as many insistent people have shouted, or if some theories about a sort of revival hold any weight.</p>\n\n<p>I&#39;m also wondering if others using other services besides Revolut have had similar messages today?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]