[{"username": "CaptainJohnWick", "url": "https://www.reddit.com/r/ThePPShow/comments/16vlaz8/supposed_share_cancellation/", "time": 1696016648.0, "subreddit": "r/ThePPShow", "title": "Supposed Share Cancellation", "text": "<!-- SC_OFF --><div class=\"md\"><p>NSFW - also not for SHILLS that seem overly concerned about how we invest?</p>\n\n<p>I am relatively new to this group (Feb 2023), and have been buying every single dip since then. </p>\n\n<p>I want to reiterate that for a company’s stock to be cancelled, due notice must be given through a legal filing.</p>\n\n<p>Have we seen this? Technically maybe - with the current plan. But as we have known since the plan was submitted - amendments are expected to be filed either tonight or by Monday open. </p>\n\n<p>So for those unsure what’s happening - NO shares will not magically disappear Monday morning. Notice must be received from my broker with adequate time to action — I spoke with my broker (CIBC) as I bought another 5k shares and she confirmed they have not received any additional information regarding bbbyq. </p>\n\n<p>Salvatore has mentioned - for shorts to be force to close, a new CUSIP # and name change must take place. This gets extremely technical as the going concern must be preserved at the same time for the NOL’s to be reserved for future use (this should be 2+ billion at this point). </p>\n\n<p>Now I want to ask all of you — in what world does anyone become a CEO of a company and receive no compensation? Doesn’t happen without a specific reason. </p>\n\n<p>Now if RC was receiving compensation for being GM CEO - then there would be the issue of conflict of interest… but as you are aware he is not an openly stated that he is involved with other business activities. </p>\n\n<p>To finish off this post - I want all of us to think for a moment, when we went up 89% on Wednesday - why didn’t any news outlets mention a word about BBBYQ? If this was truly expected to go to 0 - we should’ve seen multiple articles saying bbbyq is saved/squeezing… instead they post when we have a -4% day, with something along the lines - shares will be extinguished Friday. </p>\n\n<p>If I have learned anything from Mr.Buffett the news will never tell you to invest when there is opportunity- they will ensure the public sees the  said company (bbbyq) in a negative manner to minimize/mitigate risk. </p>\n\n<p>Conclusion: this is not financial advice. Also thank you to the legends that have continuously researched and shared their findings. This is the collective approach needed to end the shorts. </p>\n\n<p>Best,</p>\n\n<p>A</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"nsfw\"/></div>"},
{"username": "CaptainJohnWick", "url": "https://www.reddit.com/gallery/14m5juw", "time": 1688046614.0, "subreddit": "r/ThePPShow", "title": "This morning movement. Stay Zen.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "CaptainJohnWick", "url": "https://www.reddit.com/gallery/14m5juw", "time": 1688046614, "subreddit": "r/ThePPShow", "title": "This morning movement. Stay Zen.", "text": "I will post three updates from this morning and it seems like someone is selling, buying, and selling the same amount repeatedly (2.73 M) Could explain this mornings drop?", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Jdu_9eOWMYVCWGxkF2_cM_Fm0n4VvyWmGE0qce1A9gY.jpg\"/></div>"},
{"username": "CaptainJohnWick", "url": "https://www.reddit.com/r/ThePPShow/comments/14ira7j/my_thoughts_about_orders_filling_this_past_week/", "time": 1687712565.0, "subreddit": "r/ThePPShow", "title": "My thoughts about orders filling this past week!", "text": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to bring this up for discussion: yesterday (Thursday) I had a day order at .1907 for about 1500 shares. The price dropped under .19 multiple times but the order did not fill. What is important about this is the a week prior I was able to fill orders up to 5k in shares instantly, and typically under the market price. This is a massive step, as fake/ghost/synthetic shares are not moving. In a stock where people (us regards) are holding/been holding, technically the fills should’ve been like this since the move to otc, but this wasn’t the case until yesterday. Today (Friday) I have seen several test orders ( low share amount, price: .01/.02 higher) not fill..</p>\n\n<p>This is the first sign of a squeeze. Shares are not being traded instantly. We now await the court/bidding to lay out the shareholders plan within this restructure. </p>\n\n<p>Shorts and everyone involved is utterly ducked. </p>\n\n<p>Be patient and know our time is almost here. It has been an honour my fellow regards.</p>\n\n<p>Love to hear everyone’s thoughts on this!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]