[{"username": "Challenged_by_Krill", "url": "https://v.redd.it/pb5p79kv2k1c1", "time": 1700509244.0, "subreddit": "r/ThePPShow", "title": "Icahn feel it…", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/NnNwdDJoZXYyazFjMeBsuH61I2qW8_vndinz7xGzKQgOdvoamoAM-xJltjbn.png?width=140&amp;height=138&amp;crop=140:138,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=1bc86047f6ba90cafd38f192813712dc7b941f1b\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://www.reddit.com/gallery/17zr7n4", "time": 1700494582.0, "subreddit": "r/ThePPShow", "title": "Two Scenarios", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/hOPI4Ini0bGk01tTrCRiRtxeABNfQMngLc_6ANIxld8.jpg\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://www.reddit.com/gallery/17xzan4", "time": 1700284955.0, "subreddit": "r/ThePPShow", "title": "David 2.0", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/58chMVhJ0_36DqquGRGqypQCSWOtX6IYUEgM1dKGMkI.jpg\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://www.reddit.com/gallery/17we0ri", "time": 1700108932.0, "subreddit": "r/ThePPShow", "title": "Ode to Diamond Hands", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/fmU2WKzuGEXdw_GnCQt4-g9B7U5HoEeCSAhl5fgN9hU.jpg\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://i.redd.it/8fwtwccln60c1.jpg", "time": 1699910807.0, "subreddit": "r/ThePPShow", "title": "Please tell me “Kansas” is a euphemism for the centralized market.", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/8fwtwccln60c1.jpg\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://www.reddit.com/gallery/17rzka8", "time": 1699604533.0, "subreddit": "r/ThePPShow", "title": "Wouldn’t accept this in a text post so here’s a bunch of images. Make it great Teddy!", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/KEtSpXxpGOa_6U6Qu1NRP6DmYQxNqtMmFWABfra9PBo.jpg\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://www.reddit.com/gallery/17pz7i5", "time": 1699377373.0, "subreddit": "r/ThePPShow", "title": "Ironically this would be banned by the other community that may benefit by hearing it. All the more reason to stick together.", "text": null, "flair": {"text": "Social Media 🐦 📷 🤳 ❌", "text_color": "dark", "back_color": "#ff8717"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/fZUQcUqANwwYzaMVvo6Hb7V-HksIYF2TqXbySztLjsE.jpg\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://www.reddit.com/gallery/17bqqcr", "time": 1697742080.0, "subreddit": "r/ThePPShow", "title": "GameStop covering X in tinfoil today, engaging with more and more BBBYQ investors.", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Yt_TVwyaMqudqGlo5roLEvw13CrGcaeEX0tWMk7vq2E.jpg\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://v.redd.it/f5dq18wygftb1", "time": 1696966632.0, "subreddit": "r/ThePPShow", "title": "Tutorial on how to deal with scam profiles", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/Mzh2YTdydHlnZnRiMTO4j_aO0N-mgrrSq_DDeU-ENUU4pVK021R6Sxt6F1Tq.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=1435bad2999d1e5742073a63ad050fe3bc4f2c38\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://v.redd.it/0dqbqn1g3npb1", "time": 1695315564.0, "subreddit": "r/ThePPShow", "title": "Don’t Stop Believing and Buckle Up!", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/dzBmNG85MGczbnBiMXVLeWLx6RDepHaxMYVaLxhE8VKBJYa9Do2ANQEwBxGZ.png?width=140&amp;height=139&amp;crop=140:139,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=f5c8757724f18e8932ec3d3b8fbde2906a8ddbbd\"/></div>"},
{"username": "Challenged_by_Krill", "url": "https://www.reddit.com/r/ThePPShow/comments/15xbu4v/why_i_hold/", "time": 1692633834.0, "subreddit": "r/ThePPShow", "title": "Why I Hold", "text": "<!-- SC_OFF --><div class=\"md\"><p>I hold because I study history not in the prose of soulless textbooks where history is merely catalogues through the prism of contemporary cultural.  In order to gain insight from history one must judiciously dissect the traditional prose to find the hidden clues that will reveal a universal frequency which serves as music to an eternal poem.  A poem that reveals the nature of the patterns that make history rhyme .  </p>\n\n<p>And once you hear the become fluent in the poetry of the past, you’ll begin the anticipate the modern manifestations of an impending rhyme.  This knowledge is invaluable.  </p>\n\n<p>As dramatic as this all may sound I assure you it is precise in nature and carefully written to reflect the timeless beauty of an eternal poetry that appears to be reaching yet another crescendo in the end of an obsolete era making way for the next evolution of consciousness.</p>\n\n<p>I hold because I can hear the tempo change in the underlying rhythm that always precedes a moment of profound change to the very nature of the human experience where the mechanisms of institutional control begin breakdown leading to the inevitable shortsighted corruption that may buy the elite another day but ultimately guarantees its own demise.</p>\n\n<p>This is where we are today.  Technology has outpaced government, as its always does, and to maintain its weakening grip, the legislature inevitability makes an unholy alliance with a select group of private elite who falsely believe they can effectively leverage the rapidly evolving technology to remain a step ahead of the masses which really only sustains an obsolete legislative system by allowing government to essentially outsource the suppression of societal revolution to private industry. </p>\n\n<p>When this happens it is the always beginning of the end.  Private industry will now have the power to write the laws that govern their practices and, without fail, they will find new and more nefarious ways to siphon resources and capital from the general public because this is the only form of power they understand.  The legislature will of course be completely impotent to prevent the inevitable imbalance, but further more, the speed with which private industry will have to operate to remain a step ahead essentially guarantees they will make at least one if not a number of fatal mistakes in the process and these mistakes will serve as broken bars on the windows of the Great Castle through which the people will eventually storm.</p>\n\n<p>I hold because twenty years ago a man who could not be a more perfect example of just what happens when governments hand the reigns to private industry, none other than Mr. Bernie Madoff, broke the first bar in a window too high atop the castle for anyone to recognize how devastating its impact would eventually be.  The dark pool.  It is precisely this moment that marks the beginning of the slow but inevitable descent of the modern institutions of power and control.</p>\n\n<p>The dark pool, in one fell swoop, broke free market capitalism for good.   Beyond the fact that this mechanism removed supply and demand from the markets which is tantamount to removing the wheels to everyones cars and demanding them to drive, the dark pool facilitated parasites far and wide who lined up to grab their piece of the pie through schemes like PFOF, illegal shorting, coordinated attacks on public companies where the system allowed Market Makers and Hedge Funds to essentially guarantee bankruptcy said targets of their manipulation which ultimately provided the bad actors with enormous, tax exempt gains as.</p>\n\n<p>And so here we have the prose to describe the specific events leading up to today.  The poetry is written into the rise of the household investor who collectively discovered a vulnerability in the system by realizing that the short and distort strategy never accounted for a group of individuals utilizing technology to unite in solidarity by way of crowd sourced due diligence to validate a strategy that could theoretically counter the short attack by merely inspiring an extraordinary number of individual investors to purchase a significant percentage of the float in those illegally shorted companies.  Doing so would theoretically keep the company solvent which would put enormous pressure on short sellers who would have to frantically scramble to avoid exponential loss in the form of a monumental short squeeze.</p>\n\n<p>We all know the GME story including the criminal disabling of the buy button and while the events of the last two years are far too detailed to recap they were captivating enough to ensure that we are still right here, on the precipice.</p>\n\n<p>And so I stand firm in my application of historical analysis in stating that the rise of the household investor is a modern iteration of an age old series of events whereby technological advancement that  outpaces governmental capacity for adaptation inevitably opens the door for private industry to eliminate oversight and ultimately over leverage the market thus causing the same dominoes to fall to create the same increased tempo in the eternal rhythm whereby the masses are compelled to unite against the tyranny of unchecked greed in order to write the last line of the final stanza describing the end of an era.  And these lines while written in contemporary language maintain the eternal rhyming pattern of the greatest poem of all.</p>\n\n<p>TLDR:  Yeah I don’t think I can sum this one up, sorry didn’t readers.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Challenged_by_Krill", "url": "/r/BBBY/comments/11gavm3/the_bear_trap/", "time": 1688005619.0, "subreddit": "r/ThePPShow", "title": "The Bear Trap", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": ""},
{"username": "Challenged_by_Krill", "url": "https://i.redd.it/xps5sjx41u6b1.jpg", "time": 1687118379.0, "subreddit": "r/ThePPShow", "title": "On 7/4 Teddy, Blockbuster, Sears, Toys R Us and GameStop become 1 Gmerica…", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/xps5sjx41u6b1.jpg\"/></div>"}]