[{"username": "Charlie_D_Top_Step", "url": "https://www.reddit.com/r/ThePPShow/comments/149ab1d/at_this_point_in_time_everything_hinges_on_the/", "time": 1686755267.0, "subreddit": "r/ThePPShow", "title": "At this point in time, everything hinges on the NOLs.", "text": "<!-- SC_OFF --><div class=\"md\"><p>With today&#39;s release of the 10-K, there is a ton to read through, absorb, and understand. At the risk of oversimplifying an incredibly complex and constantly changing situation, at this point in time I believe the outcome for us as shareholders comes down to the NOLs. With a shocking $3.5 BILLION in Net Operating Losses, and at a 21% Corporate Tax Rate, this would mean $735 MILLION in potential tax benefits. The key point being, that <strong>in order to maintain and utilise the NOLs, current shareholders need to be retained and kept above 50% ownership, which means that shareholders need to be kept whole and not wiped out at the risk of losing the $735 MILLION in potential tax benefits.</strong> I truly believe the situation is that cut and dry. Regardless of what has come before and your reasons for investing in this stock, at this point in time, this is the only thing keeping shareholders alive and giving us future potential. If you want to look beyond this point for possible squeezes, MOASS, legal challenges to naked and synthetic shorting, etc. etc. there is nothing to stop any of that from happening, but right here and right now, everything hinges on the NOLs being retained along with current shareholders.</p>\n\n<p>I know that a lot of the DD and speculation has been pointed at Ryan Cohen, Carl Icahn, and a couple of others as the lead potential investors/acquirers for BBBY. Previously I had made a short post about the potential for an overseas entity being interested in BBBY, top of the list in my opinion being Alibaba, and with such sizeable NOLs, I think it makes BBBY even more attractive for a currently large, profitable multinational company to consider a bid/investment/partial acquisition. They would be the type of entity who could make great use of the NOLs to offset tax liabilities.</p>\n\n<p>Edit: One important point to note: just because shareholders are not wiped out, does not mean that shares will necessarily gain in value. All this means is that existing shareholders continue to exist and own their shares in conjunction with the entity that invests in up to 49% of the companies equity. The hope would be that the owner would want to act in a way to improve the value of what they own 49% of and as a result, lift the value of the other 51%. </p>\n\n<p>Comments, criticism, and rebuttals are all welcomed.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Charlie_D_Top_Step", "url": "https://www.reddit.com/r/ThePPShow/comments/148k027/a_small_but_important_technical_question_about/", "time": 1686675360.0, "subreddit": "r/ThePPShow", "title": "A small, but important technical question about the Net Operating Loss (N.O.L.).", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>On the back of today&#39;s first (only?) Stalking Horse Bid, and after quickly reading through the docket, a very important question came to me about BBBY&#39;s N.O.L. Quite simply; </p>\n\n<p><strong>Within the corporate structure of BBBY/Harmon/BuyBuyBaby, exactly where does the N.O.L. reside, and how is it determined which buyer (if there are multiple buyers for different parts) receives these? Who is the ultimate arbiter of this? The IRS? The court? Another entity?</strong></p>\n\n<p>In other words, today the bid from Overstock was for the Intellectual Property only. Does this give Overstock the rights to the N.O.L.?</p>\n\n<p>I see the N.O.L. as one of the biggest positives going not only BBBY, but also for us as shareholders, since the ownership restrictions to preserve the N.O.L. makes it much more probable that shareholders will not be entirely wiped out.</p>\n\n<p>Hopefully someone familiar with this can give us some insight.</p>\n\n<p>Thanks in advance.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Charlie_D_Top_Step", "url": "https://www.reddit.com/r/ThePPShow/comments/145itoj/a_simple_and_plausible_theory_on_why_the_stalking/", "time": 1686349585.0, "subreddit": "r/ThePPShow", "title": "A simple, and plausible theory on why the Stalking Horse bid was extended to Sunday the 11th June 2023 at 17:00.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello all,</p>\n\n<p>I wanted to quickly expand on a comment I made in another post about the reason for the Stalking Horse bid extension. Quite simply, I believe that BBBY as well as the court needed a way to fairly compare competing bids that relied entirely or in part on exchanging outstanding shares of another companies equity for BBBYQ. They would need to do this, because given how much share prices can fluctuate, and differing submission dates vs. the date on which the bids are evaluated, could have made it nearly impossible to determine the &quot;Best&quot; bid and &quot;Winning&quot; bid. To make sure it is clear, I will lay out an example below.</p>\n\n<p>Let&#39;s begin with the hypothetical assumption that we have three competing bidders:</p>\n\n<p>Adam Aron offering AMC shares in exchange for BBBYQ</p>\n\n<p>Ryan Cohen offering GME shares in exchange for BBBYQ</p>\n\n<p>Carl Icahn offering IEP shares in exchange for BBBYQ</p>\n\n<p>Using these, let&#39;s work through a scenario to show how difficult this could make evaluating the bids and determining which to accept as the Stalking Horse.</p>\n\n<p>Scenario: Let&#39;s assume that all the bidders were very well prepared, and had their bids ready to go, well in advance of the original deadline of the 8th June. everyone was so well prepared in fact, that they submitted their bids way back on the 1st May! Here are the hypothetical bids:</p>\n\n<p>Adam Aron offers 1 share of AMC for 1 share of BBBYQ, <strong>valuing BBBYQ at $5.65</strong> a share given AMC&#39;s closing price of $5.65 on that day.</p>\n\n<p>Ryan Cohen offers 1 share of GME for 3 shares of BBBYQ, <strong>valuing BBBYQ at $6.18</strong> a share given GME&#39;s closing price of $18.55 on that day.</p>\n\n<p>Carl Icahn offers 1 share of IEP for 7 shares of BBBYQ, <strong>valuing BBBYQ at $7.20</strong> a share given IEP&#39;s closing price of $50.42 on that day.</p>\n\n<p>On the 8th June, BBBY and the court sit down, open the bids, obviously see that Carl Icahn has offered the most at $7.20 a share and confirm him as the Stalking Horse bidder........or would they? Let&#39;s take a look at the above offers, but in the context of the closing prices from the 7th June.</p>\n\n<p>1 share of AMC for 1 share of BBBYQ = valuing BBBYQ at <strong>$4.73 a share</strong></p>\n\n<p>1 share of GME for 3 shares of BBBYQ = valuing BBBYQ at <strong>$8.70 a share</strong> ($26.11/3)</p>\n\n<p>1 share of IEP for 7 shares of BBBYQ = valuing BBBYQ at <strong>$3.86 a share</strong> ($27.02/7)</p>\n\n<p>Now the bids look quite a bit different, don&#39;t they? Not only has Ryan Cohen&#39;s bid become the winning bid, it has also become worth more than the original IEP bid that would have won given the values on the submission date! Note also, that now the IEP bid went from winning to dead last.</p>\n\n<p>&#x200B;</p>\n\n<p>The above scenario keeps things very simple for the sake of an example, but now consider if we have bids submitted on different dates, with different values, and then each of those values is moving independently and then consider that the values would also vary depending on the specific date that the court looks at and tries to evaluate them. Bidders could then persuasively argue that they need the chance to modify/adjust their bid in line with current market prices. Overall, this is at best a dog&#39;s dinner, and a situation that makes it literally impossible to evaluate the bids fairly in the context of each other. Understanding this problem, and looking for a way to fairly evaluate every bid, what if BBBY and/or the court decided to stipulate to bidders to re-submit their bids in the context of their closing share price on Friday the 8th June, then giving BBBY and the court the chance to compare everything on a like for like basis from this snapshot in time, over a weekend when the markets are closed and not moving, mitigating any possibility that a losing bidder complains about being unfairly evaluated on a share price that is outdated.</p>\n\n<p>Just a little Hopium for everyone on what will certainly be a very longggg weekend, waiting to hear who the Stalking Horse bidder is, and the value of their bid.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Charlie_D_Top_Step", "url": "https://www.reddit.com/r/ThePPShow/comments/13z1d52/have_we_missed_the_forest_for_the_trees/", "time": 1685768275.0, "subreddit": "r/ThePPShow", "title": "Have we missed the forest for the trees?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello all,</p>\n\n<p>I have spent some time thinking about today&#39;s filings, specifically Docket #600. This was a fairly simple Docket, requesting the authorisation of additional professionals from &quot;Sandler, Travis, &amp; Rosenberg, P.A. as an Additional Ordinary Course Professional to provide international trade and customs legal services&quot;. This piqued my curiosity, and got me brainstorming on what this might mean, when suddenly a light bulb went off. What if the best potential buyer/acquiring company/merger partner is not U.S. based, but a foreign owned/based company? Who could this be and what could the implications be?</p>\n\n<p>I will try to keep this simple and brief, in the hope that others can pile in and flesh out additional possibilities, etc.</p>\n\n<p>As an example; imagine if an arm of Alibaba was interested in acquiring part or all of BBBY/BuyBuyBaby either on their own, or possibly in conjunction with others such as Ryan Cohen, Carl Icahn, etc.? A deal like this would certainly be subject to some serious scrutiny from the F.T.C. and other government entities, which could explain the long, drawn out process and many of the delays. How about Ryan Cohen&#39;s &quot;Stop shooting down my balloons&quot; Tweet as well as the &quot;Ni Hao&quot; Tweet? BBBY&#39;s large Net Operating Losses and tax credits would be a boon for a large acquiring company and would add a load of extra value. A consortium purchase could bring together a group of interested parties that would all derive benefits from a combined deal.</p>\n\n<p>All of the above sounds pretty plausible, and in hindsight, could explain a lot of what has been going on. There is one kicker to all of this however, that really jumped out at me. Imagine that there really is a desire and goal by those involved to show how corrupt and broken the system is with naked shorts, synthetics, etc. etc. and use this as a catalyst to change the system? As was seen with GameStop, in the end, the retail apes and all others involved got used, abused, and mocked by the system and no real change was effected. Imagine however, that one of the worlds largest, non U.S. based corporations got involved. Imagine if their government also became involved and made it a political issue between China and the U.S.? There would be no sweeping things under the rug, or turning off of the buy button. Imagine that a deal involved a stock swap in order to kick off MOASS? Have there been any Chinese or Hong Kong stocks that have seen short squeezes recently?</p>\n\n<p>This is my base case, and I am hoping that others can chime in with other ideas, and thoughts as to how plausible this might be? Thoughts?</p>\n\n<p>Cheers</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]