[{"username": "Chat_GDP", "url": "https://www.reddit.com/r/ThePPShow/comments/15csakw/am_i_missing_something/", "time": 1690637120.0, "subreddit": "r/ThePPShow", "title": "Am I missing something?", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tpse6daicweb1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=f0333c2eabcd5f74fa3cc043c801ae979edffa0d\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/tpse6daicweb1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=f0333c2eabcd5f74fa3cc043c801ae979edffa0d\" alt=\"https://preview.redd.it/tpse6daicweb1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=f0333c2eabcd5f74fa3cc043c801ae979edffa0d\"></a></p>\n\n<p>*NOT financial advice*</p>\n\n<p>Nearly everything&#39;s been sold off right?</p>\n\n<p>Why is anyone puzzled?</p>\n\n<p>&#x200B;</p>\n\n<p>Because if RC really is planning to open an Amazon competitor there&#39;s only one way to do it.</p>\n\n<p>He&#39;s got to assemble a number of companies quickly, open big, and have the drive to push it for the next twelve to fifteen years.</p>\n\n<p>Amazon has been involved with numerous short positions and is a $1.3 trillion dollar company which will attempt to crush any competitors before they can clear the end of the runway.</p>\n\n<p>&#x200B;</p>\n\n<p>RC is billionaire rich.</p>\n\n<p>&#x200B;</p>\n\n<p>But there&#39;s lots of billionaires now, the big daddy being the one behind the $1.3tn company. So RC needs access to a HUGE cash injection. The GME &quot;splividend&quot; failed which is why RC made heads roll. Amazon, the hedge funds and market makers are the ones who have that cash RC just needs a trap which forces them to hand it over which leads to them being removed from the chessboard which leads to GME igniting. Right?</p>\n\n<p>&#x200B;</p>\n\n<p>Making sure the splividend mistake was not repeated, RC has teamed up with the greatest Chapter 11 pirate in history. The company is now like a coiled spring with more and more pressure being loaded onto it. Debtors are being paid off in lightning-fast bankruptcy proceedings. We know the shares are over-sold multiple times. And we know there are a hardcore gang of diamond-handers ready to grip the rails when the going gets choppy. It&#39;s possible but, until now, unthinkable. Remember, top of the list of companies which Larry Cheng said lost nearly all (94%) of their market cap and rebounded (420x) was Amazon. It took them thirty years to do it.</p>\n\n<p>&#x200B;</p>\n\n<p>As long as our company doesn&#39;t liquidate, the money owed by the hedge funds will come due. To a value multiples that of the NOLs we hear about. And that, in turn, sets off GME. Using this strategy, RC can flip Amazon in twelve to fifteen years. Remember that &quot;talk is cheap...&quot;?</p>\n\n<p>If there is literally a single office chair left after the court process it takes advantage of even more desperate shorting from the hedgies and makes it cheaper for RC to take over the remainder and release the spring.</p>\n\n<p>&#x200B;</p>\n\n<p>If what we think is happening is actually happening it&#39;s more than business, it&#39;s art.</p>\n\n<p>&#x200B;</p>\n\n<p>A legal bank robbery performed like a ballet in ape suits with a heavy metal soundtrack. It&#39;s crazy.</p>\n\n<p>&#x200B;</p>\n\n<p>A bankrupt company left with a single office chair taking down Amazon in fifteen years. Nuts.</p>\n\n<p>&#x200B;</p>\n\n<p>Ignore the recent FUD, the play is not about how many leases or &quot;distribution centers&quot; are remaining.</p>\n\n<p>Forcing the squeeze is the play.</p>\n\n<p>And BBBYQ is the key to it all.</p>\n\n<p>&#x200B;</p>\n\n<p>They&#39;re throwing whatever resources they have in shorting more to stop that 50 cent option chain igniting. They&#39;re flooding media with shills. They&#39;re even attacking the PP show. Tomorrow the attacks will be relentless against shareholders of an obscure company going through the bankruptcy process.</p>\n\n<p>&#x200B;</p>\n\n<p>Why?</p>\n\n<p>&#x200B;</p>\n\n<p>Because they feel trapped, that&#39;s why.</p>\n\n<p>Time to break some necks and write some ********ing checks. Saddle up - we&#39;re gonna ride or die to the Promised Lands.  LFG  💎✊💎🦍💪🍻💫🚀🚀🚀</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/9WWIs833kgK7reokU9TMkdATz3CVZUVMYsjullmKuOM.jpg\"/></div>"}]