[{"username": "ChiefSitsOnAssAllDay", "url": "https://www.reddit.com/r/ThePPShow/comments/16gmocu/let_us_pray_together/", "time": 1694510868.0, "subreddit": "r/ThePPShow", "title": "Let us pray together 🙏", "text": "<!-- SC_OFF --><div class=\"md\"><p>My father just told me the story about how he first overcame his shyness. He was in church and feeling ill. He asked God to heal him of his illness (he didn’t say what he was sick from), and God told him that ‘lots of people in the church were sick’ and He wanted my dad to ‘pray for them’.</p>\n\n<p>Being very shy but determined to answer the call, he asked the pastor if he could pray for the sick the next week. The pastor (Andy) said yes and my dad was literally shaking all week, afraid of standing in front of the packed church.</p>\n\n<p>Battling through his fears, he asked those who were sick and wanted prayer to come forward.</p>\n\n<p>One of the individuals who came up was a man with a walker. He shuffled very slowly, barely able to walk. My dad prayed for him as instructed and he related how the Holy Spirit ‘could be felt’ and the man fell backwards onto the floor.</p>\n\n<p>The man leaped from the floor suddenly and ran down the aisle of the church without his walker.</p>\n\n<p>Another person (woman) had a similar experience and fell backwards hard on the floor without anyone to catch her. </p>\n\n<p>Yet another woman (third person) was suffering from severe kidney problems and was afraid to fall like the others. She pleaded with God to not make her fall, and was told to kneel. She did so and was prayed with without falling.</p>\n\n<p>My dad related how the next day he went to see the pastor who’s office was downstairs. As he enter the basement there was a man changing a lightbulb. Turns out it was the man who was healed the night before.</p>\n\n<p>Not only was he not using his walker, he was standing on the arm rests of a chair to reach the lightbulb to change it!</p>\n\n<p>This experience led to my dad overcoming some of his fears of public speaking and even led to him become a lay pastor at the church, sometimes giving a sermon to the group!</p>\n\n<p>This whole conversation started because my dad retired as a school bus driver and needs to start a business where he’s in charge of sales, yet is having a hard time overcoming the fear of selling. He wanted to relate how he overcame such fear in the past. </p>\n\n<p>He took a leap of faith.</p>\n\n<p>That’s what we’re doing with our investment in BBBYQ. We might not be divinely called to this investment, but it’s certainly a leap of faith to HODL to ♾️ or zero.</p>\n\n<p>It hits me that if we’re right, those on the side of fairness and justice in equity markets (our side) are up against some powerful evil forces.</p>\n\n<p>I don’t know how “in the bag” their strategy  execution is, but there may be a lot of moving parts and it might be a tenuous situation.</p>\n\n<p>It seems appropriate that we pray collectively for the success of the M&amp;A (if it’s planned) and those possibly involved like Ryan Cohen, Carl and Bret Icahn, Holly Etlin, and others.</p>\n\n<p>Let’s pray that those involved in a deal that makes shareholders whole are given clarity, peace of mind and spirit, and a deep sense of fulfillment and purpose that carries them through the deal (and beyond).</p>\n\n<p>Let’s also pray that God confounds the minds and actions of those who would harm the deal for their unjust and selfish aims. Also that they are served justice on this earth and the markets become free of their criminal tyranny.</p>\n\n<p>Anyway, that story my dad told me triggered me to think about us praying for the forces of good, because far too often evil wins in this world (and this should not be one of those times)!</p>\n\n<p>If you’re not a believer of any faith no worries. If you’re offended feel free to ignore this post or cuss me out. Whatever floats your motherfucking boat!</p>\n\n<p>Peace out PP brethren ✌️</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]