[{"username": "ciorexborex", "url": "https://www.reddit.com/r/ThePPShow/comments/15t3q2h/bad_news_first_good_news_later_but_when/", "time": 1692223561, "subreddit": "r/ThePPShow", "title": "Bad news first, good news later. But when?", "text": "Ok, I'm a shill. But i’m a GME hodler for almost 3 years. 100% DRSed. I’m a BBBY bagholder for a year and a half. \n\nBoth investments are losing a lot, but I'm already comfortable with the idea. I still have hopes from GME, although it doesn't seem to me that they are doing anything spectacular (nft marketplace is a joke - realistically speaking, the IMX partnership is the same, only hype for Robbie, it has already been \"working\" for almost 2 years, fking 2 years and only hype for nothing “tangible”).\n\nI don't want to accuse RC, but this kind of keeping everything secret and communicating almost at all, has no way of working in the long term, especially when the criminals on Wall Street are against you. GMERICA is just a story and it was logical for RC to register the trademark. NFT Marketplace & Wallet (now history) is really nothing complicated to create nor expensive. The idea of ​​the marketplace came from Apes, and he probably wanted to deliver something to keep the community. Teddy? Any businessman registers his trademarks. Ok, no more drama about GME.\n\nWhat about BBBY? I was nervous last year, but since then I find it funny. Starting with the drama with the bonds and extensions that ended in nothing, until the statements of Sue, who wanted to save the company, but after a few days announced bankruptcy. And again, it took us a while to find out that BBBY and Baby IPs were sold for nothing. \n\nSince January, I really started to be convinced that the board has bad intentions. And the share price will depreciate enormously. Naturally, I got banned on bbby like many others, because that means free expression. I was laughing because since then I saw the price below $0.50, but I still had hope. But you were accused of being a shill when actually the idiots were \"encouraging\" people to buy at $4-5-6. If those who hyped were actually infiltrated shills? To produce bagholders and demotivate people?\n\nPersonally, since then I have been waiting for the price below 0.50 and I bought more to lower the average at least. I really don't care about money, I feel like it's lost. But the thought that maybe we were fooled by \"billionaires\" in our own home annoys me.\n\nGood news, wen? It's like a stupid movie, which, even though it's stupid, at least I'm waiting for the end to start another one.", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ciorexborex", "url": "https://www.reddit.com/r/ThePPShow/comments/15t3q2h/bad_news_first_good_news_later_but_when/", "time": 1692223561.0, "subreddit": "r/ThePPShow", "title": "Bad news first, good news later. But when?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"}]