[{"username": "cmbhere", "url": "https://www.reddit.com/r/ThePPShow/comments/17hq6ll/can_someone_explain_how_a_stock_behaves_normally/", "time": 1698420708.0, "subreddit": "r/ThePPShow", "title": "Can someone explain how a stock behaves normally during a merger?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m dumb sometimes.  It&#39;s just the way it is.  Fortunately this subreddit continues to be be friendly so I&#39;ll ask my question here.</p>\n\n<p>During a merger and acquisition how does the stock normally behave?  Is it normal for the DTCC to recall all the shares?</p>\n\n<p>ps.  didn&#39;t see a question flair so I picked this...</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "cmbhere", "url": "https://www.reddit.com/r/ThePPShow/comments/14xszqd/a_question_on_mergers_and_what_happens_with_the/", "time": 1689178469.0, "subreddit": "r/ThePPShow", "title": "A question on mergers and what happens with the stock if all shorts can't close.", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is more of a market mechanics question, but I&#39;m asking here in this group as the folks and mods seem to be more friendly to basic questions.</p>\n\n<p>First, let me state my view which may help you understand the root of my question.  Here I am waiting for a stock to squeeze.  I am confidant there will be a squeeze.  I suspect it will be triggered by some form of merger, reverse acquisition, LBO, something to do with bonds, or the weather.  Doesn&#39;t matter.  What does matter is something triggers it and there&#39;s a share recall for the swap to different shares.</p>\n\n<p>So now shorts need to close, and I&#39;m not selling.  The price still goes up.  I still do not sell.  In fact, I don&#39;t ever plan on selling, and if there are naked shorts, and enough people do this then in theory shorts will reach a point where they cannot close the position at all.  In theory the price continues to climb which is really cool and all, but...</p>\n\n<p>If the shorts are unable to close due to lack of shares, and eventually the short holder goes under, and yet I still don&#39;t sell, does this affect the merger?</p>\n\n<p>In other words, what happens when the stock being recalled is held in limbo in people&#39;s accounts forever, and all the short positions cannot be closed?  </p>\n\n<p>Sorry for the flair label.  I couldn&#39;t find one for just a dumb question.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]