[{"username": "CoastalBee", "url": "https://i.redd.it/twd9jm5970rb1.jpg", "time": 1695910040.0, "subreddit": "r/ThePPShow", "title": "Help me confirm meaning of my failed DRS request paperwork", "text": "<!-- SC_OFF --><div class=\"md\"><p>On Thursday September 21 2023 I bought some BBBYQ through my RBC Direct account and immediately called customer service to DRS a bunch to AST.</p>\n\n<p>On the call the agent put me on hold for an unusually long time after my request and came back saying RBC as a policy no longer would initiate any DRS transfers and suggested I contact AST to initiate the transaction. I said, “what’s going on? I DRS’d 3 different stocks in August successfully and have been DRS’ing for over a year with no issues”. The agent said that he ran into this issue with another client recently, but that it was RBC’s policy to no longer initiate DRS transfers. I said, “this seems fishy, just so you know I’ll be sharing this experience on social media, how do I get these shares DRS’d?”. </p>\n\n<p>This is where I’d like help understanding what happened.</p>\n\n<p>My understanding was that the agent was going to send me a ‘paper stock certificate’ of my BBBYQ shares which once received I would call AST and deposit them into my existing account. Frustrating for sure, but whatever, based on one of my previous comments here at PP another poster confirmed the paper stock certificates are as good as DRS.</p>\n\n<p>At the end of the call the agent asked if I would like a copy of the form he was submitting and because my spidey senses were already tingling I said yes. I’ve attached the copy of the form in hopes the PP community can confirm my understanding that indeed I can expect a paper stock certificate to be mailed to me. Here is a copy of the comments circled in red:</p>\n\n<p>“A DRS statement will be mailed to the registered owner directly by the transfer agent. Delivery time TBD by transfer agent. Client may contact the transfer agent to inquire if DRS statement can be exchanged for a certificate.</p>\n\n<p>If certificate is issued, it will be mailed to account owner’s address only via certified mail, please ensure address is correct.”</p>\n\n<p>One final concern, why is the requisition date Mar-20-18 when this went down Sept 21 2023?</p>\n\n<p>Please advise on what I should do, much thanks.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/twd9jm5970rb1.jpg\"/></div>"}]