[{"username": "Coldrices", "url": "https://www.reddit.com/gallery/15ya1zn", "time": 1692720067.0, "subreddit": "r/ThePPShow", "title": "Chapter 11 Plan due date:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Per these dockets/schedules, it looks like Chapter 11&#39;s plan&#39;s due date is on 11/20/23.</p>\n\n<p>Pacer schedule shows that Chap 11 plan was due 08/21 (yesterday) but was already submitted 08/02.</p>\n\n<p>At the bottom, it shows Chap 11 filing (extension?) was filed 08/02 with a due date of 11/20. Per pacer, reference docket 1716.</p>\n\n<p>Thanks to <a href=\"/u/nutsackgadgets\">u/nutsackgadgets</a> for the docket.</p>\n\n<p>Thanks to <a href=\"/u/hsj6\">u/hsj6</a> for the clearer pacer schedule.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/n-S2wdDOTvFGez1xyC8Ul_1pZgWFMQHdbZH_cJr8Sf8.jpg\"/></div>"},
{"username": "Coldrices", "url": "https://www.reddit.com/gallery/15czjmx", "time": 1690656099.0, "subreddit": "r/ThePPShow", "title": "\"Talk is cheap...\"", "text": "<!-- SC_OFF --><div class=\"md\"><p>I googled RC&#39;s whiskey quote and it led me to: </p>\n\n<p><a href=\"https://www.underhoodservice.com/mitch-schneider-talk-is-cheap-it-takes-money-to-buy-whiskey/\">https://www.underhoodservice.com/mitch-schneider-talk-is-cheap-it-takes-money-to-buy-whiskey/</a></p>\n\n<p>-A short opinion peice from April 2009, written by Mitch Schneider, a car mechanic, just as the recession was ending.</p>\n\n<p>Its a short 8 minute easy weekend read and I cant help but to feel RC may have wanted others to read this article (prob not) due to very obvious parallels of certain topics in the article and with current state of the economy/GME/BBBYQ.</p>\n\n<p>I found myself understanding RC and the whiskey quote just a little more after reading the article.</p>\n\n<p>Enjoy.</p>\n\n<p>On a separate note:\nLook how far we have gotten as Apes. \nWe have broke the system, we have hodl&#39;d through thick, thin and fud, we used our voices to enact actual change on wallstreet(altho only minor for now), and we continue to earn wrinkles from apes of all wrinkle counts and ape species.</p>\n\n<p>It is now evident that many apes are now wiser than most around us, if not, smarter than most &quot;advisors&quot; and those involved in Wall Street. We should no longer put ourselves down as regards. We are Ape Investors.</p>\n\n<p>To quote Jon Stewart (with added flair),\n&#39;Everybody&#39;s afraid of Shitadel,\nEverybody&#39;s afraid of Goldman Ballsacks,\nEverybody&#39;s afraid of the big banks,\nSEC are afraid of them,\nFinra are afraid of them...</p>\n\n<p>Apes arent afraid of any of these guys...&#39;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/wQJAFKZkSKRed4fzl40qzuWroi82cVm66C60LPYjLdM.jpg\"/></div>"},
{"username": "Coldrices", "url": "https://www.reddit.com/r/ThePPShow/comments/14lhy8v/i_initiated_100_drs_of_bbbyq/", "time": 1687978850.0, "subreddit": "r/ThePPShow", "title": "I initiated 100% DRS of BBBYQ", "text": "<!-- SC_OFF --><div class=\"md\"><p>I want to chat about DRS for those on the fence, need a refresher or wondering what DRS talk is about, and how it can potentially benefit me.\nI initiated 3 days ago through a 7 minute phone call with Fidelity (including automated service) and it is now gone from my brokerage. I have not yet called AST to confirm shares have landed</p>\n\n<p>DRS may not be for everyone.</p>\n\n<p>You may not want DRS if you are here for a quick squeeze play, and onto the next stonk. Selling through your brokerage is efficient and quick and funds arrive up to 2 days, if not immediate(margin).</p>\n\n<p>-I am DRS because I want the security of owning stock with my name in &quot;book-entry&quot; form, not under my brokerage&#39;s name. This may become important considering the potential of massive amounts of phantom/naked shares.</p>\n\n<p>-I am DRS because as owner of my stock, any payments, voting materials, dividends and other benefits gets sent directly to me. If shareholders are to recieve stock for another company due to a buyout/carveout, DRS&#39;d shares are guaranteed and likely first to be distributed. What if you are holding a rehypothecated share? What if your broker goes bankrupt? What if your broker tries to give you cash in leiu of a share?</p>\n\n<p>-I am DRS because I cannot trust my brokerage to not remove the buy or sell button when i am ready to make changes to my portfolio.</p>\n\n<p>-I am DRS because, due to the nature of shorting and naked shorting, a brokerage may have issued more shares than they own, and when counting votes for company voting your brokerage can &quot;trim votes&quot; to match it&#39;s own  numbers. Your vote may not have counted. I want my votes to count. </p>\n\n<p>-I DRS because I feel like BOBBYQ will be more than just a squeeze. We all feel it and we all know it and we have seen the events that have led to this point. We have watched wall street steal from Americans and American businesses while insulting us as &quot;dumb investors.&quot; Im holding past the squeeze and I think this is where generational wealth will be made.</p>\n\n<p>We have earned many wrinkles from great DD writers and listened to people from RC, to Dr.S.Trimbath and many more on DRS. We now understand the markets more than even your average investment advisor. Now is the time to take what you learned and take control our future. Be involved, speak up, comment, and most of all, take what belongs to you and claim what you own.</p>\n\n<p>-Not your keys, not your crypto.</p>\n\n<p>-Not your name, not your stock.</p>\n\n<p>-Be your own bank.</p>\n\n<p>If this does not fit your investment style, continue doing what works for you.</p>\n\n<p>Edit: I will post AST updates here.</p>\n\n<p>Edit: 07/03: Called today and shares are present in my AST account.\nThrough the automated system, i entered my ss# and it automatically told me how many shares i have. I spoke to a representative in the same call and they confirmed the shares are present in the account. I asked about how to register an online account and they responded that they are transitioning to a new website/system with no ETA at this time. Assuming this is the merging with EQ.</p>\n\n<p>When my shares initially disappeared from my Fidelity, i called 2 days later and the shares were not in the account yet, so give it a few more days.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]