[{"username": "CommunityTaco", "url": "https://www.reddit.com/r/ThePPShow/comments/17s61m5/why_so_many_shills_and_so_much_fud_recently_tried/", "time": 1699629144.0, "subreddit": "r/ThePPShow", "title": "Why so many Shills and so much FUD recently... (tried to post on sstonk, but acct is too new still)", "text": "<!-- SC_OFF --><div class=\"md\"><p>shills, the walls are closing in. Immutable is about to release main net (zkevm rollups going to prod) this allows bundling of transactions to make l2 transactions even cheaper. He said this has been holding games up. once this goes live, there&#39;s nothing stopping games from dropping. he said it goes live in Q4 of this year. All this was mentioned in the first 2 minutes of this youtube video over a month ago.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=qnR36xe5has\">https://www.youtube.com/watch?v=qnR36xe5has</a></p>\n\n<p>Then he just did this interview where he make some pretty awesome claims: he expects the first 1 million+ player game (game with over 1 million players) to hit web3 next year. They talk about potential returns and opportunity in this space and it&#39;s quite the hype video. it&#39;s clear shit is about to drop and that the short thesis that gamestop is done for and that crypto is dead and that nfts have failed and that gamestop/Ryan Cohen is doing nothing to turn the company around is about to go in the shitter.</p>\n\n<p><a href=\"https://youtu.be/9gdYPj6HKmo\">https://youtu.be/9gdYPj6HKmo</a></p>\n\n<p>We know that the boss (RC) doesn&#39;t like to give his game plan away, but it sure seems likely that they dumped their wallet cause there was still too much friction with the normal wallets/onboarding of players to web3. The Immutable email wallet makes this possible and they even talk about some stats around how beneficial that part is. This is why gamestop cancelled their wallet (to utilize immutable&#39;s). The nft market place is likely leaving beta around this time also. Not to mention Playr. We&#39;ve recently seen action moving around their trademarks they submitted oh so long ago. seems like things are ramping up and that we should have a PLAYR and Marketplace launch either in Q4 of this year or Q1 of next.</p>\n\n<p>lets not forget that gamestop had a cash flow positive Q2 and that Q3 had the tail of zelda and a new mario release. Not to mention a new pokemon game (i think pokemon was Q3). Q3 results should be pretty good, and furlong was gone so that&#39;s an immediate savings on employee costs. Q4 is always the best quarter and gamestop is now about to add a new revenue stream to their operations (The nft marketplace). For a company that is almost in the Green already this revenue stream could be the beginning of a profitable gamestop going forward.</p>\n\n<p>so yeah shills have been shilling extra hard, cause they know their time is limited.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]