[{"username": "Consistent_Touch_266", "url": "/r/stocks/comments/17jizc4/are_we_kicking_the_can_down_the_road_and_making/", "time": 1698677525.0, "subreddit": "r/ThePPShow", "title": "Looks like some of the normies are catching on?", "text": null, "preview": ""},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/gallery/17h0snc", "time": 1698338724.0, "subreddit": "r/ThePPShow", "title": "I’m just sayin’ ………", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/acE4CfmBG8iGuPDroR9wg159Oz4Kbxa2RWwbRlDFHik.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/1779ugj/ast_confirmed_my_shares_are_still_there/", "time": 1697234101.0, "subreddit": "r/ThePPShow", "title": "AST confirmed my shares are still there", "text": "<!-- SC_OFF --><div class=\"md\"><p>Very nice customer service. She told me all my shares are still at AST but they “have no value”. I asked if I could move them back to my brokerage and she said no. So I guess they are sort of “frozen”?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/16y5lv3/problems_with_ast/", "time": 1696274410.0, "subreddit": "r/ThePPShow", "title": "Problems with AST", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just received my letter from AST.  They have locked me out from online access and a supervisor told me they have no plans to help me get online access although I can call in to manage the account.\nNot quite what I expected and wanted the rest of you to know.\nHas anyone else run into this problem?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/fcdtusoxjoqb1.jpg", "time": 1695769021.0, "subreddit": "r/ThePPShow", "title": "Probably nothing", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/fcdtusoxjoqb1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/16t2x91/two_predictions/", "time": 1695768702.0, "subreddit": "r/ThePPShow", "title": "Two predictions", "text": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>The tinfoil and DD are largely accurate and the hodlers are about to have generational wealth</p></li>\n<li><p>The PP Show will continue long after the worlds greatest transfer of wealth. It will be the “hive mind” of some (newly) very wealthy people who are dedicated to helping their communities and protecting the world from the predators we are about to wound. </p></li>\n</ol>\n\n<p>And I can’t wait to see what we achieve. 😊😇😊</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/9inqs42i3upb1.jpg", "time": 1695400289.0, "subreddit": "r/ThePPShow", "title": "Hey is this that pool cleaner guy? If not, can we get him to come explain his bear thesis? Sort of a Phil 2.0?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9inqs42i3upb1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://youtube.com/shorts/goTPTxE9lII?si=dDuvrR0AjOPs7E13", "time": 1694795874.0, "subreddit": "r/ThePPShow", "title": "\"NOW YOUS CAN'T LEAVE\" - A bronx Tale #shorts", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/16ckyr0/just_how_big_is_this_play/", "time": 1694105764.0, "subreddit": "r/ThePPShow", "title": "Just how big is this play?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Famous_Variety has convincingly  pointed out how humongous a “team” RC is putting together. If you haven’t read his latest DD, go do it now. I won’t give a TDLR because I am not worthy of the task:</p>\n\n<p><a href=\"https://reddit.com/r/ThePPShow/s/DxfKEN1x9q\">God tier DD</a></p>\n\n<p>I want to point out that a master does not engage in unnecessary actions. For instance, RC could have ATM’d a lot more in 2021 than he did but instead he ATM’d what he needed and no more. What did he need it for?Well, he is assembling a large army because of the size of the opposition. Kenny Boi is not the final boss. I don’t think Blackrock/Vanguard/State Street is the final boss but they seem to be close:</p>\n\n<p><a href=\"https://reddit.com/r/Superstonk/s/NCgEyGaVy4\">Finkle is Einhorn</a></p>\n\n<p>I don’t know the names of the final bosses but I think they have engaged in some nefarious activities in the past that show just how much power (and money) they have: they financed Hitler. They pulled off coups in Iran, Guatemala and other countries. They toppled sky scrapers in Manhattan. They released a bio-enhanced virus upon the world. They assassinate heads of state. They use sex to blackmail political leaders around the world. They manipulate economies and financial markets worldwide to finance their nefarious activities. And they turned off the buy button. But from that moment on, we have had them by the balls.</p>\n\n<p>RC, CI, Lambert, Pulte, and other founders are leading a revolt. Think about that: instead of spending their time on yachts in the Med, they are challenging the worlds most powerful institutions.</p>\n\n<p>We are their soldiers. We are a decentralized army. Keep in mind the way Washington won the Revolutionary War was by refusing to line his troops up in rows for a shoot out with the most powerful military in the world. The patriots hid behind trees; they used unconventional tactics. THEY DECENTRALIZED! And they won.</p>\n\n<p>We are writing the history that our grandchildren and their grandchildren will read about.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/169tk28/this_trade_is_much_bigger_than_consoles_and/", "time": 1693837920.0, "subreddit": "r/ThePPShow", "title": "This “trade” is much bigger than consoles and towels. We are writing the history our grandchildren will be taught.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The stock market is an “economy”:</p>\n\n<p>noun,plural e·con·o·mies.\n“ the complex of activities related to the consumption, production, and trade of goods and services, as an ongoing functioning system”</p>\n\n<p>In this economy, the currency we use is called a “share”. We trade our money for pieces of corporations called “shares”.</p>\n\n<p>There are different players in this game: retail, institutions, exchanges, brokerages, clearing houses, family offices, and hedge fuks. Each has their role to play.</p>\n\n<p>What we object to is that some of the players are secretly counterfeiting shares; they create new shares out of thin air. Sometimes they use the complex rules of the system to legally create shares out of thin air. At other times, several of these players collude together to illegally create counterfeit shares.</p>\n\n<p>Abundance leads to loss of value. So as the counterfeit shares are added to the pool of legitimate shares, each share becomes worth less money. The counterfeiters profit at the expense of everybody who isn’t counterfeiting. But the counterfeiters tell us all that the counterfeiting actually protects the interests of the non-counterfeiters. And we quietly agree because we have to get up at 4am and go to work.</p>\n\n<p>But what we want is an economy that does not allow counterfeiting. What we deserve is the fruits of our labor.</p>\n\n<p>The world is also an “economy”.</p>\n\n<p>In this economy, the currency we use is called “money”. We buy and sell things with money. </p>\n\n<p>There are different players in this game: workers, businesses, regional banks, federal governments, and central banks. Each has their role to play.</p>\n\n<p>What we object to is that two of the players are openly and legally counterfeiting money; they create new money out of thin air. </p>\n\n<p>Abundance leads to loss of value. So as the counterfeit money is added to the pool of legitimate money, each bit of money will buy less. The counterfeiters profit at the expense of everybody who isn’t counterfeiting. But the counterfeiters tell us all that the counterfeiting actually protects the interests of the non-counterfeiters. And we quietly agree because we have to get up at 4am to go to work.</p>\n\n<p>But what we want is an economy that does not allow counterfeiting. What we deserve is the fruits of our labor.</p>\n\n<p>Get the picture? We have the counterfeiters by the balls and they don’t like that. </p>\n\n<p>The chute is just now starting to open, the bull is pissed off because we are yanking on his nuts, and a lot of shit is going to happen between now and the buzzer.</p>\n\n<p>Buckle up.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/163wwxq/probably_nothing_but_maybe_not/", "time": 1693254191.0, "subreddit": "r/ThePPShow", "title": "Probably nothing but maybe not?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Berkshire Hathaway is trading in AH. Can’t remember the last time that happened except for the time in 2020 maybe when it went up 50% on two single share trades in AH and right back down in PM to its previous close.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/jwstv0sb2ikb1.jpg", "time": 1693075371.0, "subreddit": "r/ThePPShow", "title": "Rest up! On Monday we ride back into the fog of war! HODL!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/jwstv0sb2ikb1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/15wf740/things_are_kinda_slow_so_i_started_daydreaming/", "time": 1692547325.0, "subreddit": "r/ThePPShow", "title": "Things are kinda slow so I started daydreaming. What parts of this absolutely could not come true?", "text": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>The DIP lender is for the most part CI and RC</p></li>\n<li><p>RC owns less than 4.5% of BBBYQ (about 2M shares IIRC)</p></li>\n<li><p>The DIP lender makes a credit bid for BBBYQ: retire the DIP in exchange for BBBYQ shares. </p></li>\n<li><p>BYYYQ emerges from bankruptcy relatively debt free and remains on OTC where criminal manipulations (and trading halts) are minimized.  </p></li>\n<li><p>BBBYQ shares become BBBY at a 1:1 ratio</p></li>\n<li><p>TEDDY merges with BBBY or TEDDY does a hostile takeover of BBBY. BBBY shares retired for TEDDY shares, ratio completely unknown</p>\n\n<ol>\n<li>TEDDY shares are only available on the blockchain as described by Salvatore</li>\n</ol></li>\n<li><p>This causes a squeeze on both BBBY (OTC) and TEDDY (blockchain) as described by Salvatore. Apes win big. So do RC, and CI</p></li>\n<li><p>TEDDY does an ATM during the squeeze a la GME 2021 </p></li>\n<li><p>TEDDY, fat with cash and little/no debt, merges with GME. GME shares are “retired” in exchange for TEDDY shares</p></li>\n<li><p>GME finally squeezes because of the same dynamics described in 7 and 8</p></li>\n<li><p>RC, fat with cash, buys DOM (if he doesn’t own it already) and rolls it into TEDDY</p></li>\n<li><p>TEDDY, fat with cash, begins assembling the team (Sears, Apple, OSTK, Blockbuster et al) that will take down Amazon</p></li>\n<li><p>CI, fat with cash, pays off early his entire YOLO loan (collateralized with 300M IEP shares). This allows him to immediately recall all those IEP shares that were loaned out to shorts when they were tied up in the YOLO loan </p></li>\n<li><p>IEP squeezes. CI owns 90% of the shares and he’s pissed</p></li>\n</ol>\n\n<p>Constructive criticism much appreciated. I revere the hive mind at least as much as Oliver Anthony reveres the common man.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/15uu1fr/rcs_next_tweet/", "time": 1692387335.0, "subreddit": "r/ThePPShow", "title": "RCs next tweet", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/15uu1fr/rcs_next_tweet/", "time": 1692387335, "subreddit": "r/ThePPShow", "title": "RCs next tweet", "text": "It’s a damn shame what the worlds gotten to", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/15m1m42/why_is_this_not_possible/", "time": 1691546329.0, "subreddit": "r/ThePPShow", "title": "Why is this not possible?", "text": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li>Elon, RC, and CI hate shorts</li>\n<li>BBBYQ is a shell company with distribution assets. This is ideal for a reverse merger</li>\n<li>Elon wants an “everything app”</li>\n</ol>\n\n<p>What if Elon and some friends (Pulte, RC, Icahn, Dragonfly, etc) reverse merge X Into BBBYQ? This new company becomes a holding company much like IEP only IEP is merely one holding along with GME, Teddy, BBBYQ, and others?</p>\n\n<p>Teddy has filed internationally and is also listed as a bank which would probably help Elon create a payment system.</p>\n\n<p>The holding company would include a “basket” of what some of us think are criminally manipulated stocks: GME, IEP, BBBYQ, maybe others. Can you imagine what that dividend would be?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/oamg9eyvhzfb1.jpg", "time": 1691107179.0, "subreddit": "r/ThePPShow", "title": "Rock hard", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/oamg9eyvhzfb1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/154a4mv/what_if/", "time": 1689808416.0, "subreddit": "r/ThePPShow", "title": "What if……", "text": "<!-- SC_OFF --><div class=\"md\"><p>We have quite a string of daily green dildos, huh? Got me day dreaming. What if Papa and CI understand the algos better than the Citadel interns and they have figured out a way to avoid a MOASS and formulated a way to make the stock go up 7% per day for the next year? There’s actually a website that will math that out for you:</p>\n\n<p>$18,482,106.89</p>\n\n<p>Per share</p>\n\n<p>No puts over here and leave my mom out of this ok?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/wvnxfsdoaxcb1.jpg", "time": 1689772996.0, "subreddit": "r/ThePPShow", "title": "Well, that escalated quickly", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/wvnxfsdoaxcb1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/dph9prrgqwcb1.jpg", "time": 1689766207.0, "subreddit": "r/ThePPShow", "title": "I bought the DIP, bitches!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dph9prrgqwcb1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/eklpn8j65nbb1.jpg", "time": 1689214239.0, "subreddit": "r/ThePPShow", "title": "Another late night daydream", "text": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>CI put up 320M IEP shares and $2B of other stuff. He has 334M so it looks like he hung onto 14M.</p></li>\n<li><p>TSO minus CI is 369M minus 334M equals 35M.</p></li>\n<li><p>CI hung onto 40% of 35M. The other 60% are either beneficially owned or DRS’d.</p></li>\n<li><p>Why hang onto 14M out of 334M and then make up the difference by adding $2B of something from somewhere else? Why not pledge all 334M?</p></li>\n<li><p>Could Carl be showing the SHFs that he can end a squeeze with his 14M? That he holds the key to their future? His 14M shares can stop this squeeze the same way that Porsche stopped the 2008 VW squeeze.</p></li>\n</ol>\n\n<p>I wrote a post earlier today arguing that, via dividend reinvestment, CI will soon own the entire TSO. I probably got some details wrong but I think the theory is sound. The SEC can’t let that happen because some very good lawyers that Glenn has nightmares about would be claiming incontrovertible proof of naked shorting and sue for damages.</p>\n\n<p>They’ve already got that MMTLP egg on their face and they really don’t want any more bad press or god forbid a congressional investigation.</p>\n\n<p>I think this refi publicly tells the shorts two things:</p>\n\n<ol>\n<li><p>You are fucked with no good options. You need to close.</p></li>\n<li><p>I, Carl Icahn, will make the pain stop when you reach the point that you will never forget. </p></li>\n</ol>\n\n<p>And I bet he has SEC/DOJ onboard. And so does RC. This squeeze will clear the deck but it won’t break the economy.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/eklpn8j65nbb1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/14xrq26/carl_icahn_is_a_genius/", "time": 1689175738.0, "subreddit": "r/ThePPShow", "title": "Carl Icahn is a genius", "text": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>Carl Icahn did a refi. Nothing more. He had a loan and he renegotiated the terms of that loan.</p></li>\n<li><p>CI went “all in” with this refi. He put up 96% (320M of 334M) of his IEP shares plus kicked in $2B from somewhere else. That’s a YOLO.</p></li>\n<li><p>A major change in the refi terms is that his collateral (IEP) is not valued at the stock price but instead at the net asset value of the companies that comprise IEP. Think of it as book value. It’s a very conservative valuation. Something that makes bankers feel safe.</p></li>\n<li><p>This means short attacks can’t force a margin call: the NAV does not change just because the stock went down. It also means CI is daring them to short IEP. Here’s why:</p></li>\n<li><p>Speculation: those 320M shares can be used as legitimate “locates” for SHFs.</p></li>\n<li><p>But the lower the price of IEP goes, the more dividend shares CI will be awarded on or about 9/30. He currently owns 334M shares of IEP. If the price of IEP drops to $20 (again), Carl will receive 33.4M shares in dividends. 334M+33.4M=367.4M.</p></li>\n<li><p>TSO is 369M.</p></li>\n<li><p>There are currently 35M shares not owned by CI. 369M-334M=35M. These might be beneficially owned or DRS’d (at CS btw).</p></li>\n<li><p>In response to the Hindenburg hit piece, IEP set $500M aside for share buybacks that will occur “from time to time”. How much of that will be needed to push things over the TSO?</p></li>\n<li><p>What will the SEC do if Icahn’s share count alone is more than TSO?</p></li>\n<li><p>What will CI do if his share count alone is more than TSO?</p></li>\n<li><p>Cherry on top: currently 87% of the TSO can’t be traded because it’s loan collateral. That leaves 13% of the entire TSO to exit the building. </p></li>\n<li><p>Whipped cream and sprinkles: Carl owns 28% of that door ( 334M-320M).</p></li>\n</ol>\n\n<p>Tell me where I’m wrong. I don’t in fact know that bankers can loan out those 320M shares but even if they can’t, CI is daring them to naked short it.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/14xc698/did_carl_just_do_a_double_dog_dare/", "time": 1689131225.0, "subreddit": "r/ThePPShow", "title": "Did Carl just do a double dog dare?", "text": "<!-- SC_OFF --><div class=\"md\"><p>So Carl Icahn put 320M IEP shares up as collateral and $2B from some other stash he has. I know we’re all focused on the size of the collateral but I’m wondering if we should focus on the market mechanics.</p>\n\n<p>He borrowed from 6 big banks. They hold the collateral. Well, doesn’t that give them the right to loan them out to the SHFs? Did CI just dare the shorts to dig their hole deeper?</p>\n\n<p>If they can’t loan those shares out or if those 320M shares were already open for loaning to SHFs, tell me and I will delete this post.</p>\n\n<p>Great show tonight!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/q9irhnj1ylab1.jpg", "time": 1688763876.0, "subreddit": "r/ThePPShow", "title": "Third times a charm. Apparently my flip off game needs work. This is for Hanna and Roach.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/q9irhnj1ylab1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/q9irhnj1ylab1.jpg", "time": 1688763876, "subreddit": "r/ThePPShow", "title": "Third times a charm. Apparently my flip off game needs work. This is for Hanna and Roach.", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/q9irhnj1ylab1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/rbre999sulab1.jpg", "time": 1688762782, "subreddit": "r/ThePPShow", "title": "I am reposting my friendly hello to Hannah, Roach, their handlers and frens because stock_digest told me too. Plus it feels good.", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rbre999sulab1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/rbre999sulab1.jpg", "time": 1688762782.0, "subreddit": "r/ThePPShow", "title": "I am reposting my friendly hello to Hannah, Roach, their handlers and frens because stock_digest told me too. Plus it feels good.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rbre999sulab1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/r70egknkxkab1.jpg", "time": 1688751639, "subreddit": "r/ThePPShow", "title": "Just a friendly message for Hannah, Roach, and all the other shills and those who pay them.", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/r70egknkxkab1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/14rlvho/thumb_war/", "time": 1688587863.0, "subreddit": "r/ThePPShow", "title": "Thumb war?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is it possible for BRK to bid on Baby? Is that what RC meant by a thumb war?\nI don’t believe BRK or Buffet were listed as an interested party so I guess I’m asking if bidding is restricted to those on the interested party list.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/14lkvrf/two_wrinkles_trying_to_understand/", "time": 1687985759, "subreddit": "r/ThePPShow", "title": "Two wrinkles trying to understand", "text": "I tried to keep up with the courtroom stuff today. Until today I thought rollups had to do with fruit. But here’s my “too smooth to know” (TSTK):\n\nChina provided the DIP and the SHFs did not like that because it gave BBBY a chance; so they got Hindenburg to smear IEP hoping this would cause China to withdraw from the “units” mentioned by Mr. E Barnes. It did not work.\n\nSo today they attacked the need for the DIP as unfair. Not sure why it’s unfair to bet a company won’t fail but that’s what I got.\n\nStrike two.\n\nMr. Glenn got his ass handed to him. The only thing he said that was right is that everyone in the court is against him.\n\nIf any of this is inaccurate, please set me straight either here or on the PP show tonight.\n\nI love this sub and the hive mind!", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/ilr8fbaj2i5b1.jpg", "time": 1686537720.0, "subreddit": "r/ThePPShow", "title": "I am become Jed Clampett. Not yet. Tomorrow.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ilr8fbaj2i5b1.jpg\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/145padz/is_this_real_life_is_this_just_fantasy/", "time": 1686367711.0, "subreddit": "r/ThePPShow", "title": "Is this real life? Is this just fantasy?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I don’t read financial reports so my numbers are just a WAG. </p>\n\n<p>But If IC ends up purchasing BBBYQ for, say, 1 IEP for every 3 BBBYQ, that puts a price of about $9/share on BBBYQ (this weekend).</p>\n\n<p>So, just like with the bird stock, the market price will quickly approach the tender offer “price”of $9. Jumping from $0.2 to $8.50 will wreck the options: the gamma ramp and FOMO will propel it above the tender offer “price”. The BBBYQ shorts need to close which jacks the price up even more.</p>\n\n<p>But as BBBYQ surpasses $9, arbitrage kicks in because IEP needs to be 3x of BBBYQ. By the time BBBYQ hits 30, IEP will sit at an arbitrage value of 90. Bill and Hindenburg know this so they’re trying to close their IEP shorts by either buying 3 BBBYQ or 1 IEP per open short.</p>\n\n<p>Now you have IEP shorts bidding against BBBYQ shorts. </p>\n\n<p>And the really cool thing is IC controls 87% of the IEP shares. If he diamond hands that 87%, then the “value” of 3 BBBYQ shares goes up.</p>\n\n<p>I think I need to call somebody’s mom.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/13w9wxm/how_high_am_i/", "time": 1685500636.0, "subreddit": "r/ThePPShow", "title": "How high am I?", "text": "<!-- SC_OFF --><div class=\"md\"><p>GME loans a bunch of GME treasury shares to Uncle Carl for “future considerations”.  CI uses the shares to close his short position on GME, which means his IEP shares are no longer collateral. He recalls those shares which means the shorts have to close or cover. But CI owns 87% of the shares and refuses to sell. EVER. IEP moons. </p>\n\n<p>IEP buys BBBY with the IEP shares that are mooning. This is the “healthy premium” that RC mentioned. BBBY sharehodlers now moon with IEP unit hodlers.</p>\n\n<p>CI repays it’s loan by selling Baby to GME. What’s left of BBBY becomes part of West Point/Newell. GME continues its profit-driven trek beyond Uranus for years, dragging those who shorted it at $1/share. They will be working off those short positions for years, longer than that time they shorted Tesla.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://www.reddit.com/r/ThePPShow/comments/13fyt30/thank_you_to_all_the_diamond_handlers/", "time": 1683929668.0, "subreddit": "r/ThePPShow", "title": "Thank you to all the diamond handlers!", "text": "<!-- SC_OFF --><div class=\"md\"><p>The weekend is here and <a href=\"/u/alebubu\">u/alebubu</a> has ensured yet another weekend of edging at the casa. This is my thank you to all the diamondhandlers of towels, Jimmies, and Carls. </p>\n\n<p>I am old and retired with a lifelong anti establishment streak. I bought my first Jimmies at $380 because I wanted to tell my grandchildren I tried to make the world a better place; I kissed that money goodbye because everybody gets crushed by the establishment. I bought my first towels at $11 and Carls at a 24% yield. I now have a very comfortable average in all three. </p>\n\n<p>No matter how this turns out it has been the most remarkable two and a half years of my retirement. I hope you all realize that movies and documentaries will be made. I intend to watch them all and if I can I’m going to bring a posse. </p>\n\n<p>We are making history. We are changing the game by stopping it. Congratulations to us all!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Consistent_Touch_266", "url": "https://i.redd.it/mw854kw3shza1.jpg", "time": 1683919126.0, "subreddit": "r/ThePPShow", "title": "Did Hindenburg lift its “research” from a 2016 article? Tick tock, tick tock.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mw854kw3shza1.jpg\"/></div>"}]