[{"username": "Conscious-Fun6949", "url": "https://www.reddit.com/r/ThePPShow/comments/16ot5ep/the_time_is_now_brothers/", "time": 1695334503.0, "subreddit": "r/ThePPShow", "title": "The time is now brothers", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve never been on the PP show, but I have listened to it multiple times and when I was feeling down and in the dumps, watching the show would never fail to make me feel better. It&#39;s a great show and I&#39;m very glad I found it. </p>\n\n<p>With Pulte inviting PP to his office, the 10 day countdown, the canceling of shares, TEDDY speculation, and so much more, it is evident the time is finally here. The moment we have been waiting months and even years for. For those of us that have been in Gamestop since the sneeze and even prior, for those of us that have been in BBBY since the 2022 August run up and even before that, and to those who have been a part of both, these next 9 days leading up to September 30th will be the most exciting and anxiety ridden days of our entire journey. </p>\n\n<p>Anxiety is the fear of the future, but I do not fear our future because I know we are in good hands. I am excited for the future. I cannot wait to finally have an answer after waiting for years. We thought it was going to happen with Gamestop, we thought it was going to happen with BBBY, but it will happen with TEDDY. All roads lead to TEDDY. When this is all said and done, we will look back on all the hints, the breadcrumbs, the interviews, the DD, and it will be obvious that is was TEDDY the entire time. Some of us feel that it is always TEDDY, but it is only that, a feeling. We do not know yet, but for some, it is a conviction. We know it in our guts that it is TEDDY and that we will win. For those who are 100% in this play, those who are absolutely certain that this will play out, you will be rewarded the most. </p>\n\n<p>Even if you lose in the traditional sense and this play was all a massive head fake, you will have to reevaluate your life. Even if you win in the traditional sense and this play was actually what it seemed to be, you will have to reevaluate your life. This is no backing down now. Once your heart and mind are 100% committed to this play and you have taken that leap of faith that pushed you believing in the play from 99% to 100%, you cannot lose in the traditional sense. Even if this play were a head fake, what you learned about the stock market, the economy, your risk tolerance, and your willingness to believe in something so vague yet so tangible, cannot be taken away from you.</p>\n\n<p>There is no losing when you fully believe in this play. Every negative opportunity can be turned into a positive one when you realize you really didn&#39;t lose as losing is a mental construct. The money I have put into this play is already lost to me. I do not think about the money I have put in as it&#39;s essentially a lost cause. I will have to reevaluate my life after this is over if BBBY hits $0 or $1,000. How can you lose with a mindset like that? You cannot. Take every loss and look at how you can turn it into a positive. I already have because I have learned so much about the stock market since buying Gamestop in 2021. </p>\n\n<p>I believe we will win though. There are too many coincidences to be ignored. All roads lead to TEDDY. When you see your brokerage accounts hit the number you have in your head, do not lose sight of yourself. Reevaluate your life. Ask yourself what is important, who is important to you, what is your personal philosophy? Do not let the money change you. Spend time getting to know yourself before you see those numbers in your brokerage accounts or else it will be too late. You are going to have to reevaluate your life regardless of the outcome. Do not turn into the people we beat. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Conscious-Fun6949", "url": "https://twitter.com/0xtykoo/status/1654989132416835584?s=12&amp;t=012OqscjFHOaYLGZkSxyEQ", "time": 1683845990.0, "subreddit": "r/ThePPShow", "title": "NLPC Chairman Peter Flaherty is arrested and charged after calling out Warren Buffet, Bill Gates, and Berkshire Hathaway during $BRK Annual Shareholder Meeting", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"}]