[{"username": "Cool_Ad5268", "url": "https://v.redd.it/l28k4w33fc1c1", "time": 1700416446.0, "subreddit": "r/ThePPShow", "title": "“Unwinding positions at DISTRESSED prices”", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have been following Wealthion for some time as I really enjoy all of the macro financial discussions and he interviews the top industry experts. </p>\n\n<p>Adam Taggart recently transitioned channels and this little clip caught my attention. </p>\n\n<p>Listen closely to what he says about internal rumors regarding the likely event hedge funds may have to abruptly unload positions at distressed prices. </p>\n\n<p>The entire interview is great and highly recommend. This whole meme stock event is just a big piece of the much MUCH bigger puzzle (problem). </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/MWxqZnczMjNmYzFjMVsSzgiQ8NU5v1qJYadFdDq_wI0e784GWfU3N4HDZYnC.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=cc2dab6d6e29dabf16371fbbf12bdfa92bf97b99\"/></div>"},
{"username": "Cool_Ad5268", "url": "https://www.reddit.com/gallery/17rhsdu", "time": 1699549875.0, "subreddit": "r/ThePPShow", "title": "“TEMPORARILY” closed = Bullish!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Two things: </p>\n\n<p>I was listening to the PP show and they were saying the search bar is repressing any searches on BBBY (picture attached) This was not the case for me but more importantly….</p>\n\n<p>It says online that the store is “TEMPORARILY” closed!</p>\n\n<p>Damn straight! </p>\n\n<p>PS: unrelated, PP listen to your show all the time! You all should take a peace at Neil Howe’s book called “The 4th Turning” where it talks about every 70-90 years there’s a massive generational crisis. And he asserts we are actively IN zone now. This movement coincides perfectly. This play is a small piece of the puzzle. The author coined the term Millennials, etc. check it out! </p>\n\n<p>You can learn more any searching 4th Turning, Neil Howe etc on YouTube or just get his book.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"}]