[{"username": "Correct_Idea7514", "url": "https://www.reddit.com/r/ThePPShow/comments/164l0dc/forbes_fud_incoming_overstock_to_take_over_bbby/", "time": 1693321680.0, "subreddit": "r/ThePPShow", "title": "Forbes FUD Incoming - Overstock to take over BBBY Ticker?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Link to article released at 10:31am ET today: <a href=\"https://www.forbes.com/sites/qai/2023/08/29/bed-bath--beyond-stock-yo-yos-ahead-of-september-liquidation/?sh=41b380c82f5b\">https://www.forbes.com/sites/qai/2023/08/29/bed-bath--beyond-stock-yo-yos-ahead-of-september-liquidation/?sh=41b380c82f5b</a></p>\n\n<h1>Bed Bath &amp; Beyond Stock Yo-Yos Ahead Of September Liquidation</h1>\n\n<p><strong>Key takeaways</strong></p>\n\n<ul>\n<li>Bed Bath &amp; Beyond stock has phenomenally high trading volume among retail investors despite the stock’s impending liquidation</li>\n<li>Overstock, which bought the bankrupt retailer in July, will take over the brand and BBBY ticker</li>\n<li>Overstock’s shares are up nearly 35% since the start of the year</li>\n</ul>\n\n<p>Bed Bath &amp; Beyond has risen from the dead - in more than one sense. Its new owner, Overstock, has officially relaunched the business as an online-only retailer - and it plans to transition to the Bed Bath &amp; Beyond name as soon as possible.</p>\n\n<p>That might explain some of the reasoning around why Bed Bath &amp; Beyond stock is seeing massive trading volumes even though the stock is essentially dead in the water. The activity has left Wall Street rolling its eyes at the memestock, but at least retail investors are having fun. Here’s what you should know.</p>\n\n<p><em>Put bluntly, there are better ways to spend your hard-earned cash than investing in a stock that’s literally about to be liquidated. If you’re after good value stocks, Q.ai’s</em> <a href=\"https://learn.tryq.ai/blog/value-vault-kit?utm_campaign=Forbes&amp;utm_medium=article&amp;utm_source=Forbes\"><em>Value Vault Kit</em></a> <em>should be right up your alley.</em></p>\n\n<p><em>It’s powered by a sophisticated AI algorithm that does the heavy lifting with the data, predicts which stocks with solid valuations and balance sheets relative to their valuation could hit it big, and then shifts around the Kit’s holdings to help you stay one step ahead.</em></p>\n\n<h2>What’s happening with Bed Bath &amp; Beyond?</h2>\n\n<p>After months of struggling and fundraising efforts to keep the company afloat, Bed Bath &amp; Beyond filed for Chapter 11 bankruptcy in April. After a bidding process, e-commerce giant Overstock.com declared itself the new owner of the ailing brand in July for $21.5 million.</p>\n\n<p>In an unusual move, Overstock has decided to shed its name in favor of using Bed Bath &amp; Beyond’s brand capital. Overstock also didn’t purchase Bed Bath &amp; Beyond’s brick-and-mortar stores, just the trademarks, patents and website domains as the brand moves to online only.</p>\n\n<p>At the time, Overstock’s CEO Jonathan Johnson said about the name change that “The combination of our winning asset-light business model and the high awareness and loyalty of the Bed Bath &amp; Beyond brand will improve the customer experience and position the company for accelerated market share growth”.</p>\n\n<p>Wall Street was enamored with the announcement, with Overstock’s share price sailing 6.5% higher. The main reason? According to Johnson, Bed Bath &amp; Beyond’s customer list is roughly double the size of Overstock’s, so the brand has a captive audience to capitalize on.</p>\n\n<h2>Why is Bed Bath &amp; Beyond’s stock so volatile?</h2>\n\n<p>Given the situation, Bed Bath &amp; Beyond’s stock should be naturally petering out. But there’s still a tremendous amount of interest in Bed Bath &amp; Beyond stock, even though the shares are mere weeks away from becoming worth absolutely zilch, zip, nada.</p>\n\n<p>New Nasdaq data showed there were 15 million transactions for the disappearing retailer on August 16 alone. The BBBYQ (the ‘Q’ indicates the company is being liquidated) shares, which have reached memestock status among retail traders, are only trading for around 20 cents as of today, but it’s possible hobby investors think there’s a chance the stock will pick up.</p>\n\n<p>That’s because Overstock is also changing its stock market ticker from OSTK to BBBY to further ingratiate itself in the household name brand. The reality of that happening is slim, and Bed Bath &amp; Beyond has made that clear in its SEC filing.</p>\n\n<h3>BBBY’s ongoing bankruptcy proceedings</h3>\n\n<p>“Trading prices for the Company’s securities may bear little or no relationship to the actual recovery, if any, by holders of the Company’s securities in the Chapter 11 Cases,” Bed Bath &amp; Beyond said. The company also warned that investors “could experience a significant or complete loss on their investment” depending on how the bankruptcy proceedings pan out.</p>\n\n<p>Bed Bath &amp; Beyond reiterated the warning in its July 20 <a href=\"https://tryq-ai.medium.com/wework-bankruptcy-risk-grows-as-share-price-tanks-dd7c3062ab60\">bankruptcy</a> plan that once the liquidation wraps up, everyone who had a financial stake in the company’s claims will be settled for good, and nobody can ask for more money based on those claims in the future.</p>\n\n<p>Even with Overstock’s $21.5 million payment, Bed Bath &amp; Beyond’s debt exceeds the assets left. In short? Retail investors and memestock lovers likely won’t see a cent in returns for their investment, and the only way they can hope to squeeze any juice out of the share price is if it rises incrementally before September 12, when the bankruptcy proceedings wrap up.</p>\n\n<h2>How’s Wall Street handled the news?</h2>\n\n<p>Bed Bath &amp; Beyond’s share price has lost 91% of its value since the start of the year and has become a penny stock ahead of its rebirth under Overstock’s management. The share price is worlds away from its all-time high in 2014 at over $80.</p>\n\n<p>Overstock is currently trading for $25.40 - the share price has lost 30% in value after stocks fell across the board in a dismal August performance fueled by the global economic outlook and worries over interest rates, but Overstock’s share price is still up 34.5% since the start of 2023.</p>\n\n<h2>How has Bed Bath &amp; Beyond’s relaunch gone?</h2>\n\n<p>Overstock recently relaunched the newly revamped Bed Bath &amp; Beyond to its new online-only home. CEO Jonathan Johnson <a href=\"https://www.cnbc.com/2023/08/01/bed-bath-beyond-relaunches-as-online-only-retailer.html\">told</a> CNBC he is laser-focused on growing Overstock’s active customer base and order frequency, with the new Bed Bath &amp; Beyond app moving to the top quartile of downloads for the month.</p>\n\n<p>The move comes as Overstock’s latest <a href=\"https://tryq-ai.medium.com/foot-locker-shares-spiral-downwards-at-gloomy-earnings-beat-d1235bd703e4\">earnings</a> reflected mixed results, as many other retailers have seen as consumer demand weakens. The retailer posted an adjusted loss of 2 cents a share for the second quarter, beating Wall Street’s expectations of an 8 cents loss. While sales were predicted to fall to $409.6 million, Overstock also performed better than expected by reporting a 20% drop to $422 million.</p>\n\n<p>Customer figures were less optimistic - the number of visitors buying from the Overstock website declined by 29% from the year before, while the average order declined by 5%. However, investors are likely betting that the Bed Bath &amp; Beyond rebrand will help to take care of that issue.</p>\n\n<p>Overstock’s share price rose 13% at the earnings beat as Wall Street chose to focus on the positives, with narrower-than-expected losses from the retailer.</p>\n\n<h2>The bottom line</h2>\n\n<p>Overstock is marching forward with its rebrand to the well-recognized Bed Bath &amp; Beyond name, with initial signs on sales and app downloads looking promising. Wall Street will be watching closely to see if the Bed Bath &amp; Beyond brand can live another day with a new business strategy and management at the helm.</p>\n\n<p>The volatility over BBBYQ shares is a head scratcher, but in the world of memestocks, not a lot makes sense anyway. Retail investors will likely walk away with little more than a piece of paper to say they owned the stock, but perhaps that’s reward enough for those playing the game.</p>\n\n<p><em>Retail investors hope there might be some sort of gain from holding Bed Bath &amp; Beyond at this late stage, but it’s never a good idea to pin your hopes on individual companies. If you’re looking for bargain stocks, give Q.ai’s</em> <a href=\"https://learn.tryq.ai/blog/value-vault-kit?utm_campaign=Forbes&amp;utm_medium=article&amp;utm_source=Forbes\"><em>Value Vault Kit</em></a> <em>a whirl instead.</em></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Correct_Idea7514", "url": "https://listingcenter.nasdaq.com/IssuersPendingSuspensionDelisting.aspx", "time": 1683073846.0, "subreddit": "r/ThePPShow", "title": "BBBY is on the pending suspension list for NASDAQ. Effective date 05/03/23, no Form 25 filed.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"images/nasdaq-logo-new.png\"/></div>"}]