[{"username": "CottonSlayerDIY", "url": "https://www.reddit.com/r/ThePPShow/comments/17tnla9/what_are_the_odds/", "time": 1699806011.0, "subreddit": "r/ThePPShow", "title": "What are the odds?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey gurls,</p>\n\n<p>I know talking numbers is not really a thing we do here (besides regarded monkey dates), but what has been your journes on the odds of this play?</p>\n\n<p>I started out as a lurker early this year and thought it would be like 5% in our favor.</p>\n\n<p>Then after they called bankruptcy I jumped in as I saw the odds at like 15% wich would feel like a fair gamble to toss in some money.</p>\n\n<p>I doubled down after reading more DD soon after.</p>\n\n<p>When the attorney costs and the 10B came in a few weeks ago the odds went to about 85% in my head.</p>\n\n<p>It&#39;s just like so many puzzle pieces fit together that this play going down south wouldn&#39;t really make sense at all.</p>\n\n<p>Then came the big wait .. the last stretch infront of the goal post.</p>\n\n<p>Amazing news could come in any day now and it feels like I have bled through 84 years twice already. (My deep respect for the people that are into BBBY since 2-3 years!)</p>\n\n<p>It feels like forever and nothing is really happening. Every date we set is just a random date with weeks or even months to follow up.</p>\n\n<p>Currently the odds in my head are at like 95% but with depression from the long wait it feels like 5% again.</p>\n\n<p>There&#39;s nothing I can do anyway, but I really hope for Teddy to finally open up and start the shitshow.</p>\n\n<p>How are you guys feeling about it? How has your journey been? Is your gut feeling 100%?</p>\n\n<p>I would so love to be able to quit my job already. :<sup>)</sup></p>\n\n<p>PS: Since people call everyone a shill that isn&#39;t posting DD or Tomorrow-Memes; precautionary I am not a shill :<sup>)</sup></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "CottonSlayerDIY", "url": "https://www.reddit.com/r/ThePPShow/comments/17qkpeh/anyone_willing_to_give_a_small_loan_of_a_million/", "time": 1699447014.0, "subreddit": "r/ThePPShow", "title": "Anyone willing to give a small loan of a million dollars?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey fellow regards,</p>\n\n<p>at the moment I am a little out of money and my mind began to scrub on the floor in search for calm.</p>\n\n<p>By this day I had originally hoped to be a millionaire already, but from July/August until now my mind has only getting the worse of all the delays and shit.</p>\n\n<p>I still am thinking that it&#39;s about 80% likely we will fck the hedgies with their AmEx unlimited, but I kinda.. can&#39;t anymore.</p>\n\n<p>I am a depressive, alcoholic piece of garbo at the moment and can&#39;t even afford to buy winter tires at the moment. </p>\n\n<p>My mothers car is dying down and needs like 5k for repairs to be able to keep doing her job. I can&#39;t give her that atm. If Bobby doesn&#39;t give birth I should still be able to afford her car to be fixed up by like February/March. But I am scared that her car will just fall apart before that, lol.</p>\n\n<p>It feels so shitty that I can&#39;t support my mom who litteraly squished a melon from her PP and cared so much for me in my last two decades (and still does now, lol).</p>\n\n<p>If someone knows me here from commenting for the past few months you&#39;ll know that I just want to FIRE with like 500-1000k and want to do good for my surrounding communities with the rest.</p>\n\n<p>No need for Lambos, when you can have a nice campfire with friends. Aim for the Lambo though :p.</p>\n\n<p>So.. idk.. will get deleted anyway, but.. is there some secret millionaire that just randomly wants to give me a small loan of a million bucks and He/She&#39;ll get it + interest back as soon as Bobby rips? And if it doesn&#39;t rip.. maybe I can give you like 950k back, lel.</p>\n\n<p>We could also trade shares if that&#39;s somehow possible. So let&#39;s say you get 1k Bobby shares from me in the future for giving me a small milli now :D</p>\n\n<p>I just can&#39;t live like this anymore. I am stressed out to the top and just want this fking play to end for once.</p>\n\n<p>Maybe having all those turbo erections from the DD drained the blood from my head and made me lightheaded.. for the last couple of weeks.</p>\n\n<p>I want to quit my job and help my family and myself now. Help pls.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "CottonSlayerDIY", "url": "https://www.reddit.com/r/ThePPShow/comments/17ngnx3/was_iep_and_sixth_street_earnings_of_any_relevance/", "time": 1699084096.0, "subreddit": "r/ThePPShow", "title": "Was IEP and Sixth Street earnings of any relevance?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen some IEP posts about that they are basically doing better than expected but nothing from Sixth Street.</p>\n\n<p>Was ther anything worthwhile?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]