[{"username": "Couper16", "url": "https://www.reddit.com/r/ThePPShow/comments/17wt7rz/all_you_can_eat_buffet_opening_soon/", "time": 1700157667.0, "subreddit": "r/ThePPShow", "title": "All You Can Eat Buffet Opening Soon?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Reduced stake in Amazon?</p>\n\n<p>Warren Buffett&#39;s Berkshire Hathaway reveals it sold a bunch of long-held stocks - and made at least one secret bet</p>\n\n<p>Warren Buffett&#39;s company sold a bunch of stocks and made at least one confidential bet last quarter.</p>\n\n<pre><code>Berkshire Hathaway exited long-held stakes in GM, J&amp;J, P&amp;G, UPS and Mondelez.\n\nBerkshire didn&#39;t disclose one or more of its purchases as it was still building its positions.\n</code></pre>\n\n<p>Warren Buffett&#39;s Berkshire Hathaway sold a bunch of long-held stocks last quarter, and started building positions in one or more mystery companies, a SEC filing revealed late on Tuesday.</p>\n\n<p>The famed investor&#39;s conglomerate exited its positions in General Motors, Johnson &amp; Johnson, Procter &amp; Gamble, Mondelez, UPS, Celanese, and Activision Blizzard. It first invested in P&amp;G, J&amp;J, UPS, and Mondelez in the 2000s, and GM in 2012.</p>\n\n<p>Berkshire also reduced its stakes in Amazon, Aon, Chevron, HP, Markel, and Globe Life. On the other hand, it disclosed new positions in SiriusXM, as well as the Atlanta Braves and both &quot;A&quot; and &quot;C&quot; shares of Liberty Media Live, which stemmed from the spin-off of the Braves into a separate public company this summer.</p>\n\n<p>Notably, Berkshire omitted one or more holdings from its public portfolio update and requested the SEC treat them as confidential for now. Buffett and his team asked for and received the same discretion when they were building stakes in Chevron, Verizon, and Marsh &amp; McLennan in 2020, as they feared disclosing the incomplete wagers would drive up the stocks&#39; prices and increase their cost bases.</p>\n\n<p>Berkshire&#39;s batch of stock sales was foreshadowed by its latest earnings, which showed the company spent only $1.7 billion on stocks but sold $7 billion worth last quarter. The conglomerate&#39;s cash pile also swelled to a record $157 billion, suggesting Buffett and his colleagues struggled to find bargains in the period.</p>\n\n<p>Buffett and his colleagues made similar tweaks to their stock portfolio in the second quarter. They switched out three holdings and pared several others, while also taking stakes in a trio of homebuilders.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/warren-buffetts-berkshire-hathaway-reveals-175513888.html\">https://finance.yahoo.com/news/warren-buffetts-berkshire-hathaway-reveals-175513888.html</a></p>\n\n<p>Berkshire&#39;s vice chairman and Buffett&#39;s business partner, Charlie Munger, hinted he had soured on GM during a recent podcast. &quot;In its heyday, General Motors was a great company — it  just gradually went to hell one contract at a time,&quot; he said.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Couper16", "url": "https://www.reddit.com/r/ThePPShow/comments/17w6kar/schwab_sma_figure/", "time": 1700089012.0, "subreddit": "r/ThePPShow", "title": "Schwab SMA figure?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m with Schwab after with TD.</p>\n\n<p>I&#39;ve checked my account daily since forever to see any changes.</p>\n\n<p>Today I check and something never there before.</p>\n\n<p>Under funds available it lists </p>\n\n<p>Under Funds Available:\nTo Trade:</p>\n\n<p>Cash Investments $10.33\nSettled Funds.        $10.00\nCash &amp; Borrowing. $10.33</p>\n\n<p>SMA and a $XX,XXX dollar figure.</p>\n\n<p>This is a Margin account but BBBY shares were all cash.</p>\n\n<p>Since BK and OTC and delist I stopped trading. No $$ lol.</p>\n\n<p>I did buy 3 shares of GME 2 weeks ago lol. Just to have something there to watch something and anything odd. Also if our we are made whole i am ramping up on GME. </p>\n\n<p>Today is odd with what I see.</p>\n\n<p>Can a real brain explain if this is something or not.</p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Couper16", "url": "https://www.reddit.com/r/ThePPShow/comments/17rxwxr/life_lesson_unlocked/", "time": 1699597287.0, "subreddit": "r/ThePPShow", "title": "Life Lesson Unlocked", "text": "<!-- SC_OFF --><div class=\"md\"><p>&quot;An Unwavering Commitment To Delayed Gratification.&quot; </p>\n\n<p>August 2022 here.</p>\n\n<p>How long has your journey been?</p>\n\n<p>IT&#39;S TIME to be gratified and grateful. </p>\n\n<p>Our ultimate flood of  gratitude and generosity will build a new foundation of gratitude that will spread a Renaissance of hope for the common honest person.</p>\n\n<p>I&#39;ve been very humbled by this journey so far and will that will only grow deeper very soon.</p>\n\n<p>Personal development and relationships have grown stronger as I&#39;ve drawn strength from my faith and from within and found a calm I&#39;ve never had during this chapter in my life. </p>\n\n<p>The very real people in this PP sub and those vested in this play have been an inspiration and even on the seemingly darkest of days I found hopium, laughter and another round of great DD to step into the next day with head held high knowing we are going to be fine.</p>\n\n<p>Cheers to all and your next chapters of life and should you ever find yourself in the Great NW give a shout out and let&#39;s grab a drink!</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Couper16", "url": "https://i.redd.it/uwv6ulqbxcyb1.jpg", "time": 1699115026.0, "subreddit": "r/ThePPShow", "title": "Uprising of the Apes", "text": "<!-- SC_OFF --><div class=\"md\"><p>Paranoia is in bloom\nThe PR transmissions will resume\nThey&#39;ll try to push drugs that keep us all dumbed down\nAnd hope that we will never see the truth around</p>\n\n<p>Another promise, another scene\nAnother packaged lie to keep us trapped in greed\nAnd all the green belts wrapped around our minds\nAnd endless red tape to keep the truth confined</p>\n\n<p>They will not force us\nThey will stop degrading us\nThey will not control us\nWe will be victorious</p>\n\n<p>Interchanging mind control\nCome, let the revolution take its toll\nIf you could flick the switch and open your third eye\nYou&#39;d see that we should never be afraid to die</p>\n\n<p>Rise up and take the power back\nIt&#39;s time the fat cats had a heart attack\nYou know that their time&#39;s coming to an end\nWe have to unify and watch our flag ascend</p>\n\n<p>They will not force us\nThey will stop degrading us\nThey will not control us\nWe will be victorious</p>\n\n<p>Muse/Uprising </p>\n\n<p>LFG!!</p>\n\n<p>Our Time Is Now!!</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/uwv6ulqbxcyb1.jpg\"/></div>"},
{"username": "Couper16", "url": "https://i.redd.it/4msh72qq95yb1.jpg", "time": 1699022347.0, "subreddit": "r/ThePPShow", "title": "Uncle Carl on the Move!", "text": "<!-- SC_OFF --><div class=\"md\"><p>IEP earnings today!</p>\n\n<p>Merger Monday on the horizon!</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/4msh72qq95yb1.jpg\"/></div>"},
{"username": "Couper16", "url": "https://i.redd.it/3on77xa8xcxb1.jpg", "time": 1698679152.0, "subreddit": "r/ThePPShow", "title": "Just Maybe a Tinfoil Strike with Teddy", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m quite the regard and love all this great DD and tinfoil!</p>\n\n<p>I&#39;ve been looking at my new book set sleeve cover that arrived last week and while staring at Teddy over Ted&#39;s shoulder the bear said something to me about the picture I was looking at.</p>\n\n<p>Follow me on this. Let me know if I&#39;m actually too regarded.</p>\n\n<p>The bear has 10 marks on its head.</p>\n\n<p>7 companies.</p>\n\n<p>2 Banks (bank? blockchain?) I&#39;m not smart.</p>\n\n<p>1 Holding company or umbrella company.</p>\n\n<p>Marks are set up like bowling pins as in a Strike!</p>\n\n<p>The bears ears are same pink as the two piggy banks indicating to me two banks and Teddy being the Holding company if the 7 companies.</p>\n\n<p>Love this community!</p>\n\n<p>It all feels like it&#39;s a Mad Mad Mad Mad World chase!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3on77xa8xcxb1.jpg\"/></div>"},
{"username": "Couper16", "url": "https://www.reddit.com/gallery/17f6mi8", "time": 1698130334.0, "subreddit": "r/ThePPShow", "title": "Diamond Handed RC clock?", "text": "<!-- SC_OFF --><div class=\"md\"><p>To me the shaded area and even on a larger scale from 10 to 2, looks like how a diamond 💎 is depicted.</p>\n\n<p>Diamond 💎 Hands  🙌 </p>\n\n<p>Plus a second image from Tag Hauer.\nMaybe a commemorative watch for RC?</p>\n\n<p>I pray I get my Tendies before someone signs my commitment papers!</p>\n\n<p>Stay Zen!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/HRnU2W4ZdIaIPDv8sqTNi4jjUJEC06xoEWaJRUOhzbE.jpg\"/></div>"},
{"username": "Couper16", "url": "https://www.reddit.com/r/ThePPShow/comments/16zryag/patrick_byrne_a_secret_agent/", "time": 1696437394.0, "subreddit": "r/ThePPShow", "title": "Patrick Byrne a Secret Agent?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just a wow article. A must read!</p>\n\n<p>This whole dealio is the strangest play I&#39;ve ever been involved with.</p>\n\n<p><a href=\"https://www.lewrockwell.com/2023/10/no_author/871051-2/\">https://www.lewrockwell.com/2023/10/no_author/871051-2/</a></p>\n\n<p>This story also ties in with the claims of Patrick Byrne, who has been a government informant and impromptu agent for decades and who claims that he was sent out to bribe Hillary Clinton with $18 million so that James Comey and John Brennan and Barack Obama could blackmail her while she was in office.</p>\n\n<p>The war is hardly over, however chinks are already appearing in their armor. As reported by CNN, the DOJ has indicted Smartmatic for rigging an election in the Philippines and Patrick Byrne says he’s involved in the background of this case and he says that this indictment means that “They are done.”</p>\n\n<p>election tampering.</p>\n\n<p>A US Prosecutor in Florida brought this case because a US bank was used to make money transfers in violation of the Foreign Corrupt Practices Act (FCPA). He then left the DOJ and he’s now working on Patrick Byrne’s legal team!</p>\n\n<p>Patrick says that this is the most important breach in the opponent’s defense since they stole the election on November 3rd, 2020, because the Department of Justice and an American grand jury has looked at this and said, ‘Yes, elections are riggable with these machines and Smartmatic did it.”</p>\n\n<p>The same Smartmatic operating system is used in the voting machines produced by Hart InterCivic, ES&amp;S and Dominion. The question then becomes, “Why did Fox pay?“</p>\n\n<p>Because, Patrick says, “Fox is dirty. I think you’re going to see Fox get sold and that great big payment that was made is actually part of stuff going on – you’re going to see Fox sold. I believe…to State Street – same company that bought Dominion! Huh! Wouldn’t it be funny, if State Street buys Fox? Would that start making any sense to you?”</p>\n\n<p>Patrick then directly addressed the military and the DOJ:</p>\n\n<p>“Every part of the American government, you should be going in and telling your boss that, given these developments, you have misgivings, that you need guidance, that you need legal guidance – flood the zone! Flood your Internal Affairs guys, flood your legal departments, professional responsibility, ask them for advice…We need you, from within to flood the zone up. And if you all do it at once, they can’t fire you all. You can start today, knowing that you’re right.”</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Couper16", "url": "https://www.reddit.com/r/ThePPShow/comments/16sthpl/amazon_sued_for_monopoly/", "time": 1695747695.0, "subreddit": "r/ThePPShow", "title": "Amazon Sued for Monopoly!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Well this is interesting timing  indeed with Teddy and RC ready to go to Battle with Bozos.</p>\n\n<p><a href=\"https://l.smartnews.com/p-im7nF/pksvBw\">https://l.smartnews.com/p-im7nF/pksvBw</a></p>\n\n<p>17 states suing Amazon.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]