[{"username": "crisptapwater", "url": "https://www.reddit.com/r/ThePPShow/comments/17bvqcd/sitting_here_with_my_mom/", "time": 1697754876.0, "subreddit": "r/ThePPShow", "title": "Sitting Here with My Mom.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Told her I would come over and watch the Phillies games with her after the market closed. We originally are from Philly. </p>\n\n<p>We are sitting here just chatting and I brought up the news about how I “lost” all my shares. She doesn’t know shit about the stock market let alone personal finance. She sat and watched a Tuesday hearing with Judge Papa back in June with me and likes when I explain things to her about the process because she feels like she is included with all us idiots. I always tell her I’m gonna get “rich rich” and force her into retirement.</p>\n\n<p>So we are sitting here and I expressed how it’s a weird time, shares disappearing, and she was nervous I lost my money. I reassured her that was not the case. I told her RC, who she knows as the “Teddy guy”, is most likely involved at this point and I will know soon if I made life changing money. She laughed and she goes “well you know it’s moments like these where you really appreciate what you have.” I sat there, kinda paused, and started tearing up a bit because we never came from a lot. There were some moments where we didn’t have shit so it brought me back and hit me like train in that quick instant. I looked at her and idk why but the Kelly Clarkson song, “A Moment Like This”, popped into my head. I started butchering it jokingly, she followed suit, and it just became one of those moments I will remember for the rest of my life.</p>\n\n<p>This experience has been a rollercoaster but if everything works out the way we all think it will then our lives are about to change drastically. While there is a lot of “noise” right now, just remember why you are doing what you are doing. Appreciate your loved ones and don’t sell for pennies so you can take care of them. NFA.</p>\n\n<p>Also this song is a banger in this situation so I thought I would share.</p>\n\n<p><a href=\"https://youtu.be/S7b8ADhadJU?si=ozSnILwS9C0xQ9AZ\">https://youtu.be/S7b8ADhadJU?si=ozSnILwS9C0xQ9AZ</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "crisptapwater", "url": "https://www.reddit.com/r/ThePPShow/comments/16srlo1/expectation_seminar_how_not_to_react_and_how_to/", "time": 1695743329.0, "subreddit": "r/ThePPShow", "title": "Expectation Seminar - How Not to React and How to Approach “The Final Days”", "text": "<!-- SC_OFF --><div class=\"md\"><p>I really didn’t think I was gonna have to type this up but after reading all the sob stories and negativity towards a certain individual it’s time that I personally chimed in. Mods please adjust flair as you see fit.</p>\n\n<p>Hi, I’m Crisptapwater. I have been involved in this crazy journey since Jan 21’. You can catch me jumping around the sub talking shit and trying to encourage individuals to temper their expectations. I come from nothing. I have nothing besides my word, my balls, and my Bobby/Jimmy shares.</p>\n\n<p>The amount of negativity I have seen on the sub in the past 24 hours is actually fucking ridiculous. I’m going to assume that the majority are shills trying to get their last licks in before we get an amended plan but it also seems that people aren’t as unwavering in their conviction as it was previously stated.</p>\n\n<p>THIS PLAY HAS ALWAYS BEEN $0 OR LAMBOS.</p>\n\n<p>Let’s talk about what that means. </p>\n\n<p>That means that this was and always has been a gamble. If you chose to purchase shares in Jan 2021 - September 2022 you did it off the basis that this stock was most likely a part of a basket of stocks that is heavily manipulated that could pop at any moment due to swaps going bust and volatility increasing not because they are the best retailer at selling wicker baskets. If you chose to purchase the stock from December 2022 - current times then you bought the stock off the basis that this company is going bankrupt and it’s a huge risk to get involved but the payout of a potential turnaround could be life changing due to the amount of short volume at any given time.</p>\n\n<p>No one made YOU get involved knowing all of this information. No one made YOU hold until you were -99% on your investment. </p>\n\n<p>This is the gambit. This isn’t Apple or Microsoft. This isn’t Amazon or Google. This is fucking Bed Bath and mother fucking Beyond.</p>\n\n<p>Now that we got that out of the way let’s talk about the duration/length of this trade.</p>\n\n<p><em>”Getting to space was never going to be easy.”</em></p>\n\n<p>It took Michael Burry almost 5 years until he came out on top of his short position with sub-prime loans in 2008. The Big Short is one of my favorite movies because it doesn’t show the protagonists spending their money after they won but because it showed the harsh reality of what they had to endure to be successful. The most important aspect of this saga isn’t the money it’s the transformation that everyone has gone thru and the knowledge you have acquired along the way.</p>\n\n<p>Idk what everyone else has been up to since Jan 21’ but I’ve been personally using this time to prepare for life after this trade. Money is just like alcohol and drugs. It’s an amplifier. Since we already talked about this trade like it’s playing the lottery let me explain that more than half of everyone involved will go broke after everything is said and done. You think you can manage millions of dollars but the funniest aspect is unless you are mentally and physically prepared for wealth you are going to fail long term. This game has always been designed this way. The frustrations many are showing now about “it’s tough to put food on the table” are in for a rude awakening when they actually have the funds.</p>\n\n<p>I see many people, most being OG apes, say they are frustrated that “it’s taken so long” to achieve what many will never achieve in their entire existence. “We have had to endure so much torment and being called a cultist from others because I chose to get involved.” Respectfully imma need y’all to STFU. One of the most freeing aspects of life is living it without recognizing others opinions.</p>\n\n<p>Let me say it again, people who aren’t involved with this trade will never understand what the fuck is going on. This means trying to explain or justify your actions is a complete waste of fucking time. </p>\n\n<p>That’s the polite way of saying it. My extremely transparent way of saying it is “fuck your family, fuck your friends, fuck your co-workers, fuck MSM, fuck the analysts, fuck everyone on the internet that thinks they know otherwise.” That is what we call unwavering conviction.</p>\n\n<p>If and when this works out the way it does, it’s going to be in your best interest and yours alone. Just like it was your decision to get involved with this trade it’s your decision who you choose to surround yourself with and who you choose to trust moving forward. One of the best things I’ve learned about this voyage is I only wanna surround myself with people I am inspired by. </p>\n\n<p>Wanna know the kind of people I am inspired by? Some gentlemen named Ryan Cohen and Bill Pulte.</p>\n\n<p>RC buying in was never a reason to get involved. It was only a show of confidence that he saw value when others did not. RC is not a God or a King. He is an extremely bright, strategic businessman that we can all look up to and learn from. Just because he does something doesn’t mean you should.</p>\n\n<p>Bill Pulte is another person I personally look up to and would like to associate with after this trade. He is successful and has plenty of money. Why would he choose to put himself in harms way of the law and get involved with the PP show? He already explained he doesn’t hold BBBYQ. He is trying to inspire others whether that’s thru philanthropy or just being a part of the show. The amount of negativity I have seen directed at Bill because expectations were high is utterly disgusting. He is not a God or a King. He is a human who is trying his best to help others with the situation he was given.</p>\n\n<p>“The Final Days” are here. I said everything I needed to say. Idgaf about karma or Reddit. I care about maintaining my health. I care about emotional and mental stability. I care about inspiring people to better themselves.</p>\n\n<p>Stay hydrated, get off the internet, go for a walk, touch some grass, find quan.</p>\n\n<p>This is the best time to be alive in human history.</p>\n\n<p>Good luck to everyone moving forward. I will see y’all on the other side. 🫡</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]