[{"username": "cryptogeographer", "url": "https://v.redd.it/0r7us5guzrwb1", "time": 1698441049.0, "subreddit": "r/ThePPShow", "title": "Evidently, in the stock event pitting Reddit Vs Wall Street... Robinhood was the center of everyone's attention, but there's a highly interesting twist in the data... &lt;3 minutes&gt;", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Go4d3YDpBkEP2cyRIJtgLHeO5rFONKgjgpXMDyzpITo.jpg\"/></div>"},
{"username": "cryptogeographer", "url": "https://www.reddit.com/r/ThePPShow/comments/15zf8w4/cra_charge_for_unqualified_security_in_tfsa/", "time": 1692821658.0, "subreddit": "r/ThePPShow", "title": "CRA CHARGE FOR UNQUALIFIED SECURITY IN TFSA", "text": "<!-- SC_OFF --><div class=\"md\"><p>As the title says\n TD notified me today that a penalty was placed on my account for holding an inqualified security in my TFSA.</p>\n\n<p>Call dropped (of course)\nBut I had moved my stocks within 90 days of BBBY going OTC.</p>\n\n<p>I am looking into how to fight this. </p>\n\n<p>If you have any insight lemme know. </p>\n\n<p>I will have to call back to see what recourse there is. </p>\n\n<p><a href=\"/u/ppseeds\">u/ppseeds</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "cryptogeographer", "url": "https://www.reddit.com/r/ThePPShow/comments/15nnyc3/any_canadians_receive_notice_of_claim_emails/", "time": 1691700498.0, "subreddit": "r/ThePPShow", "title": "ANY Canadians receive notice of claim emails?", "text": "<!-- SC_OFF --><div class=\"md\"><p>As the title suggests. I hold with TD Bank.\nI&#39;m aware of the IBKR folks receiving such an email. Any Maple Apes out there receieve an email? If not, what&#39;s your plan?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "cryptogeographer", "url": "https://www.reddit.com/r/ThePPShow/comments/157x578/getting_in_front_of_the_fuckeryhow_will_rc_et_al/", "time": 1690164182.0, "subreddit": "r/ThePPShow", "title": "Getting in front of the Fuckery...how will RC et al. Get through the SHF Shenanigans", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is speculation/discussion. \nThe deal may be done as has been said by many. But what about ACTUALLY getting our tendies?</p>\n\n<p>To what degree do you think the Acquirer/RC/Ichan/The White Knight prepped for the Gauntlet that is to come?</p>\n\n<p>Setting up the biggest bear trap in history has to include: greasy the trap and creating the environment for it to succeed, limiting  intervention so to speak. What I mean is: to what extent do you think meetings/discussions have been had with SEC/powers that be to let BBBYQ run once it lifts off?</p>\n\n<p>The Acquirer has had to have realized potential road blocks in the system and arrange for the guard to fall asleep, let BBBYQ escape. \nGranted, not everyone can be swayed. Not ever broker will allow participation in this as we know they have ties to SHF. </p>\n\n<p>What do you think?</p>\n\n<p><a href=\"/u/ppseeds\">u/ppseeds</a> <a href=\"/u/travis_b13\">u/travis_b13</a>  <a href=\"/u/mjonesgcms\">u/mjonesgcms</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "cryptogeographer", "url": "https://www.reddit.com/r/ThePPShow/comments/14i43sh/tfsa_to_hodl_or_not_to_hodl/", "time": 1687641966.0, "subreddit": "r/ThePPShow", "title": "TFSA: to hodl or not to hodl", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi,\nCanadian here holding in a TFSA; wanted to see if others are at this stage to and get some sentiment. \nI&#39;m aware of holding non qualified investments in a registerd account. I have a non-reg account to transfer to. TD Direct (my broker) has not notified me of anything, which to me suggests CRA hasn&#39;t ruled anything at this point. I&#39;m aware Wealthsimple et al. have passed down advice to apes to move their stocks, however I believe this is them  being  cautious as an org not actions based on actual direction  from CRA. \nAnyway, my thoughts at this point have been hold in TFSA with the hope there is an announcement in coming weeks which reveal a timeline for re-listing on NASDAQ. Should that timeline be relatively short, it makes sense to keep stock in the TFSA. \nIssue with this is: missing squeeze prices while still OTC. </p>\n\n<p>I don&#39;t think this will occur as the &quot;liquidity&quot; will  be needed to close positions plus fomo, etc. And that I believe the squeeze will take place over weeks. \nI don&#39;t want  to digress too much.</p>\n\n<p>Point is, continue  to hold in TFSA or just transfer and accept capital gains?\nA transfer from TFSA to non reg only takes a couple days as I understand it. </p>\n\n<p>Lemme know what you&#39;ve done, are thinking of doing. \nThanks for the kind replies, eat shit if you&#39;re shilling. </p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]