[{"username": "d3geny", "url": "https://www.reddit.com/r/ThePPShow/comments/16xejl5/shares_are_cancelled_insight_from_a_ma_lawyer_ama/", "time": 1696198159.0, "subreddit": "r/ThePPShow", "title": "Shares Are Cancelled [Insight from a M&amp;A Lawyer] AMA", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi - I am a 5th year M&amp;A associate at a V5 (top 5 law firm; higher ranked then Kirkland). I&#39;ve been practicing M&amp;A for 2 years now, but before I did capital markets work (i.e., IPO/financings) and M&amp;A together, but now I have specialized to just M&amp;A. Not legal advice; I am not your lawyer. You can search up my history and see that I started working in Canada and moved to the US. That has no bearing with my qualifications as it is common in Big Law to hire in other jurisdictions. No I will not be sharing my identity - I&#39;ll just present objective facts.   </p>\n\n<p>I&#39;m what you call a shill (as I know it, anyone that goes against to the moon is a shill). Why do I post? Because its entertaining to watch the pure denial and the incorrect analyses. You can google how much a big law lawyer gets paid; no need for Kenny :)</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Shares are Cancelled.</em></strong></p>\n\n<p>8-K (<a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/886158/000119312523247428/d579010d8k.htm\">https://www.sec.gov/ix?doc=/Archives/edgar/data/886158/000119312523247428/d579010d8k.htm</a>)</p>\n\n<p>&quot; <em>Cautionary Note to Holders of the Company’s Common Stock and Series A Convertible Preferred Stock</em></p>\n\n<p>As a result of the Confirmed Plan becoming effective, all of the Company’s equity interests, consisting of outstanding shares of common stock and Series A Convertible Preferred Stock of the Company and related rights to receive or purchase shares of common stock, <strong>were cancelled on the Effective Date without consideration and have no value</strong>.&quot; [<strong>Tl;DR your shares are cancelled</strong>]</p>\n\n<p>&quot; The Company intends to file a Form 15 with the SEC deregistering the Company’s common stock pursuant to Rule 12g-4(a)(1) under the Securities Exchange Act of 1934 (“Exchange Act”). Upon filing the Form 15, the Company intends to immediately cease filing any further periodic or current reports under the Exchange Act. &quot; [<strong>See below</strong>]</p>\n\n<p>&quot; On September 21, 2023, the Company filed with the New York Secretary of State a Certificate of Amendment (the “Certificate”) to the Company’s Amended and Restated Certificate of Incorporation to change the Company’s name from “Bed Bath &amp; Beyond Inc.” to “20230930-DK-Butterfly-1, Inc.” This name change was implemented by the Company pursuant to the Confirmation Order entered by the Bankruptcy Court.&quot; [<strong>Butterfly, and all the other Butterfly entities are literally BBBY entities RENAMED because they were REQUIRED TO</strong>]. </p>\n\n<p>(see Section 8.10 of the Purchase Agreement: <a href=\"https://bedbathandbeyond.gcs-web.com/node/17301/html\">https://bedbathandbeyond.gcs-web.com/node/17301/html</a> -  Section 8.10 Legal Entity Names. Without limiting Section 8.9, to the extent that any Sellers or their Affiliates continue to incorporate the Trademarks or words “Bed Bath &amp; Beyond,” “Bed Bath and Beyond,” or any combination or variation of the foregoing (“Beyond Marks”) in their corporate or legal names following the Closing, Sellers shall, and shall cause any such applicable Affiliates to, by no later than <strong>September 30, 2023</strong>, (a) dissolve such entities or (b) change the corporate and legal names of such entities to no longer incorporate any Beyond Marks._</p>\n\n<p><strong><em>Shares are Deregistered.</em></strong></p>\n\n<p>15-G (<a href=\"https://bedbathandbeyond.gcs-web.com/node/17421/html\">https://bedbathandbeyond.gcs-web.com/node/17421/html</a>)</p>\n\n<p>Please place an X in the box(es) to designate the appropriate rule provision(s) relied upon to terminate or suspend the duty to file reports:</p>\n\n<p><strong>Rule 12g-4(a)(1) [</strong><a href=\"https://www.law.cornell.edu/cfr/text/17/240.12g-4\"><strong>https://www.law.cornell.edu/cfr/text/17/240.12g-4</strong></a><strong>]:</strong> Which provides:  <strong><em>Termination of registration of a class of securities</em></strong> <em>under</em> <a href=\"https://www.law.cornell.edu/definitions/index.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=173a7921097964a53368c5594b93546a&amp;term_occur=999&amp;term_src=Title:17:Chapter:II:Part:240:Subjgrp:85:240.12g-4\"><em>section</em></a> <em>12(g) of the Act (</em><a href=\"https://www.law.cornell.edu//uscode/text/15/78\"><em>15 U.S.C. 78</em></a><em>l(g)) shall take effect 90 days, or such shorter period as the Commission may determine, after the</em> <a href=\"https://www.law.cornell.edu/definitions/index.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=b9b4119395200d44b487aae01e96d953&amp;term_occur=999&amp;term_src=Title:17:Chapter:II:Part:240:Subjgrp:85:240.12g-4\"><em>issuer</em></a> <em>certifies to the Commission on Form 15 (</em><a href=\"https://www.law.cornell.edu/cfr/text/17/249.323\"><em>§ 249.323</em></a> <em>of this chapter) that the class of securities is held of record by:</em>   <strong><em>Fewer than 300 persons</em></strong> </p>\n\n<p>Approximate number of holders of record as of the certification or notice date: <strong>None</strong> </p>\n\n<p>[<strong>TL;DR Shares are cancelled, and this was cited as a reason to deregister the Common Stock from SEC obligations</strong>]</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Counter-arguments</em></strong></p>\n\n<ol>\n<li><em>&quot;Look at Hertz and AA&quot; they issued shares after cancellation.</em> Cancellation has to be viewed in context. In Hertz and AA, prior to <strong>confirmation</strong>, their amended plan provided that a <strong>restructuring</strong> deal whereby <strong>new shares</strong> would be issued. BBBY&#39;s plan, which was confirmed, provided for <strong>liquidation</strong>, where all shares are cancelled <strong>without any new equity issuances</strong>. Comparing to Hertz and AA is comparing apples and oranges. Chapter 11 reorganization is extremely flexible, and is essentially a means to come to a deal with the creditors. You can&#39;t just compare certain aspects of a deal with another. </li>\n<li>&quot;<em>deletion vs. cancellation</em>&quot; - deletion is not legalese. That is simply not language we use in the context of shares. You can look up any purchase agreement, merger agreement, or asset purchase agreement. You won&#39;t find that language. The confusion is conflating two different things. Deletion is used in reference of the ticket as per FINRA. Cancellation means the shares are actually cancelled. Cancellation, as noted above, can be in conjunction for anything - (1) shares issued incorrectly, (2) two 100 share certificates are cancelled and a single 200 share share certificate is issued, (3) a share is repurchased into treasury, (4) a share is exchange, or (5) or a share is just cancelled without any further action. Again it has to be in context.</li>\n<li>&quot;<em>Look at Rule 12g-4(b)&quot; it talks about deregistration from a merger</em> - read further; it says if an ex-issuer is filing the form to not further comply with the SEC obligations via deregistering as a result of a merger/acquisition, then the <strong>successor entity</strong> must file the form. As noted above, Butterfly is literally just BBBY entities <strong>renamed</strong>. Under your theory, Teddy or whoever you&#39;re hoping to issue shares ought to have filed the form.</li>\n<li><strong>TBD - add anymore; happy to provide objective factual counterpoints.</strong></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><strong><em>For the people calling the naysays &quot;shills&quot;</em></strong></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=lKj8PlIiZVA\"><strong>https://www.youtube.com/watch?v=lKj8PlIiZVA</strong></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]