[{"username": "daddyyboyy", "url": "https://i.redd.it/tl0sq2g3vesb1.jpg", "time": 1696523402.0, "subreddit": "r/ThePPShow", "title": "Fidelity Chat Support: Confirms that BBBYQ's Transfer Agent is now Mellon Investor Services, LLC", "text": "<!-- SC_OFF --><div class=\"md\"><p>Chat Support correspondence is attached. Classic Trust Me Bro! Reach out to your brokers for support. Let&#39;s share our feedback on this sub today! </p>\n\n<p>This all leads me to the following speculation: </p>\n\n<ul>\n<li><strong>Why in the Kentucky Fried Fuck would Bed Bath &amp; Beyond (AKA Our Beautful Butterfly) go to the effort of changing Transfer Agents if equity holders are to be provided no relief as a result of bankruptcy?</strong> <em>Surely, this would be a needless &amp; unnecessary expense, and deemed so by the bankruptcy judges.</em> </li>\n</ul>\n\n<p>Gentlemen, it&#39;s time to buy mount our watermelons!</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/tl0sq2g3vesb1.jpg\"/></div>"},
{"username": "daddyyboyy", "url": "https://i.redd.it/dmv8hyc6l0sb1.jpg", "time": 1696350570.0, "subreddit": "r/ThePPShow", "title": "Two Ice Cream Tweets from Elon Musk in One Day. I Guess He Likes Ice Cream!", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://twitter.com/elonmusk/status/1709241929148379566?t=LVK0yiYJhSK5tmBkRU_yWw&amp;s=19\">https://twitter.com/elonmusk/status/1709241929148379566?t=LVK0yiYJhSK5tmBkRU_yWw&amp;s=19</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dmv8hyc6l0sb1.jpg\"/></div>"},
{"username": "daddyyboyy", "url": "https://i.redd.it/e7jknc3lj0sb1.jpg", "time": 1696350035.0, "subreddit": "r/ThePPShow", "title": "DRS From Fidelity is Still Supported. What is Dead May Never Die!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello PPs,</p>\n\n<p>I decided to DRS about 20% of my total position today. Better late than never si they say! I initially had concerns that this request would not be processed, but I can confirm (it&#39;s OK - trust me bro) that Fidelity will honor DRS requests.</p>\n\n<p>What does this mean? Fuck if I know. Other than I will never sell my DRS&#39;d shares. I&#39;ll be playing with what I have in my broker for my trendiest, and will maintain a long position in whatever the hell this ends up being for all eternity. </p>\n\n<p>I am inspired to leave with You this wisdom. From the house of Greyjoy of the Iron Islands:</p>\n\n<p><em>What is Dead May Never Die!!!</em></p>\n\n<p>I&#39;ll see You all in Valhalla!</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/e7jknc3lj0sb1.jpg\"/></div>"},
{"username": "daddyyboyy", "url": "https://reddit.com/r/BBBY/s/TbAL83d76c", "time": 1696106758.0, "subreddit": "r/ThePPShow", "title": "Wrinkle Brains Needed", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello Community - We remain in the endgame. I&#39;m proud to be here alongside my fellow PPs. We all came here for our own reasons.  Bringing with us or hopes, our dreams, &amp; our unwavering conviction. I for one, have been thoroughly entertained through my participation in this community. I am accomplishing what i set out for through my ongoing participation. </p>\n\n<p>Soon, and as it does;  fate will arrive for us all:\nThe bulls, the bears, the apes, and the PPs alike. <strong>I maintain my resolve and conviction in a positive outcome for equity holders</strong>. For this reason, I am hopeful that the council of girthy PPs, wrinklebrained as they are, can address the points outlined in the attached reddit post.</p>\n\n<p><strong>The attached DD is bearish &amp; conclusive in its nature. I do not have the skills, experience, or the wrinkles required to object and counter the arguments presented in this post. But in my opinion the arguments made are logical and well reasoned. But this does not mean that they are correct.</strong></p>\n\n<p>I am, as many of us are, seeking knowledge as to what we can expect to happen next. </p>\n\n<p>My fellow PPs - please review this. And if you have the wrinkles, please comment to counter the points being presented here. </p>\n\n<p>U/stock_digest - please let me know if this counts as brigading. To brigade is not my intent.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"}]