[{"username": "dankniss", "url": "https://www.reddit.com/gallery/16nxeb4", "time": 1695245989.0, "subreddit": "r/ThePPShow", "title": "RC is about to deliver", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/u/ghyze\">/u/ghyze</a> posted this earlier and I immediately started to think about RC&#39;s baby tweet from last year.</p>\n\n<p>If you&#39;ve been following this since 2021 then you know that there&#39;s a lot to unpack whenever he tweets.</p>\n\n<p>Whether it&#39;s insights into past/future events, there&#39;s always been something to find or learn.</p>\n\n<p>He posted this famous tit jacking tweet on April 3, 2022.</p>\n\n<p>Exactly one year later, media is reporting that as a significant date for our beloved barbecue.</p>\n\n<p>Another tweet he posted on January 18, 2023 was a user made meme from Reddit (sorry forget where) and iirc the time correlated with Bobby&#39;s closing price.</p>\n\n<p>That same day was also when it was reported that the company was looking for buyers.</p>\n\n<p>We also see a similar trend looking back to May 3, 2022 when he tweeted about General Tso, or as users have theorized to represent Total Shares Outstanding.</p>\n\n<p>A year later Bobby gets delisted.</p>\n\n<p>Then on November 23, 2022 he tweets about how Teddy makes Thanksgiving great again. Iirc, this illustration wasn&#39;t a part of any of the books that were published.</p>\n\n<p>This makes me believe that this tweet is a premonition about the future.</p>\n\n<p>We truly must be living in a simulation because November 23, 2023 is also Thanksgiving this year.</p>\n\n<p>TL;DR: Teddy will be changing our lives by Thanksgiving 2023.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/YR21aO6e1Z52fak8twujpzqarxOxRIgbxeTOuQlAAYw.jpg\"/></div>"},
{"username": "dankniss", "url": "https://i.redd.it/lcixxjiurajb1.png", "time": 1692551252.0, "subreddit": "r/ThePPShow", "title": "Why Teddy will happen before Thanksgiving 2023", "text": "<!-- SC_OFF --><div class=\"md\"><p>Thanksgiving family get togethers can suck sometimes. I&#39;m sure if you told them about buying into GME, BBBY, AMC, etc during the sneeze they probably have roasted the fuck out of you if you&#39;re bag holding heavy with it dipping so bigly in the past couple years. MOASS is always tomorrow until it isn&#39;t, but I believe with how insane this bankruptcy processing has been going and the recent connection with the Teddy books with Princeton and Kingston nearly being a straight line to BBBY and DOM headquarters...</p>\n\n<p>I feel like I&#39;ve drank the kool aid and I&#39;m smoking some premium hopium, but it&#39;s way too much of a coincidence to say the books aren&#39;t little bread crumbs for us.</p>\n\n<p>Ryan Cohen also tweeted this last year: </p>\n\n<p><a href=\"https://twitter.com/ryancohen/status/1595454594351616000?t=jykedDBLccgxdNsVXfuf6w&amp;s=19\">https://twitter.com/ryancohen/status/1595454594351616000?t=jykedDBLccgxdNsVXfuf6w&amp;s=19</a></p>\n\n<p>I&#39;m sure Thanksgiving this year we&#39;ll be able to tell our friends and families &quot;I told you so&quot; and fuck off into the sunset with our watermelons and lambos.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/lcixxjiurajb1.png\"/></div>"}]