[{"username": "danny-1981", "url": "https://www.reddit.com/r/ThePPShow/comments/17hs3z5/my_general_plan/", "time": 1698425946.0, "subreddit": "r/ThePPShow", "title": "My general plan.", "text": "<!-- SC_OFF --><div class=\"md\"><p>While we wait im just going to explain my perspective to this play. (Gme &amp;Bbby).</p>\n\n<p>I&#39;m a relatively new bbby holder as per some OGs. I was able to get a nice bag of tickets for a low average. Over 50k shares.</p>\n\n<p>However I am an OG gme holder. So my average there sucks and is hard to lower. I went balls deep before I knew what was up. Just over 1600 with like 40 dollar average from like 60  (400 pre split).</p>\n\n<p>As of now, noone can do anything bbbyq related so I know many of you (us) are buying gme. This is great because its cheap atm. Apes just getting into gme are going to have an awesome average. </p>\n\n<p>My point is that I will not need to sell all my bbbyq or even many. If we get a cash +equity, I won&#39;t need to sell any.  Say there is no cash and just equity and we squeeze i can hold over 40k shares until the biggest bbby bagholder is green and rich; probably more like 48k held back. </p>\n\n<p>At the same time a new gme holder can hold almost all their shares until I am green and rich.</p>\n\n<p>We know for a fact we have purchased multiple floats on bbby just from volume and buy pressure in the last 2 months, also I know we have multiples owned over at gme.</p>\n\n<p>Maybe what I&#39;m saying is it will be easy to lock the floats indefinitely forever and even longer on both these nuggets if people individually with their own thought only sell from where they got the best deal.</p>\n\n<p>Then one could think,  if floats are locked and hedgies are being forced to buy... but they&#39;re locked, and they need to buy... 🤣🤣🤣 the fucking price is  ♾ .</p>\n\n<p>We can live on dividends! Whose fuckin regarded now?</p>\n\n<p>Choke on that hedgefuks!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "danny-1981", "url": "https://www.reddit.com/r/ThePPShow/comments/16yb3uk/little_poem/", "time": 1696286826.0, "subreddit": "r/ThePPShow", "title": "Little poem", "text": "<!-- SC_OFF --><div class=\"md\"><p>So we&#39;re sitting in a time, where we can&#39;t do shit.<br/>\nMelties having nightmares, an absolute fit.</p>\n\n<p>Why attack someone, about being down on their money.<br/>\nIts a big waste of time, definitely its not funny.  </p>\n\n<p>Of all the world tickers, they do it to a few.<br/>\nWell to be honest, I can think of only two.  </p>\n\n<p>They scream so loud, but I cannot hear their voices.<br/>\nWhy be so hateful over someone else&#39;s choices?  </p>\n\n<p>Its because what you hold, is an absolute desire.<br/>\nTo the hedge funds, we have set fire.  </p>\n\n<p>So just relax, and have trust in the plan.<br/>\nYou&#39;ve done the hard work; they&#39;re already in your hand.  </p>\n\n<p>These hedge fuks have stolen, with their crooked play.<br/>\nIt is up to us, but they all must pay.  </p>\n\n<p>So don&#39;t give a fuk, what these shills they will say.<br/>\nYou only battle hatred, when you go the right way.    </p>\n\n<p>Don&#39;t ever think this battle, you just cannot do.<br/>\nApes together strong, we&#39;re regarded too.    </p>\n\n<p>Our system is broken, this cannot be fine.<br/>\nTime to diamond up, and toe the damm line.  </p>\n\n<p>You may not realise, until your much older.<br/>\nBut the value at hand, is us, the holder.  </p>\n\n<p>Solid customer base, and a war chest at hand.<br/>\nClear for send off, to our new promise land.  </p>\n\n<p>To the fud, I say to it;\nFuk off you trash, its all bullshit.    </p>\n\n<p>If your just now, all broken in stitches.<br/>\nYour either a shill, or papery bitches.</p>\n\n<p>I know we are good, and all will be fine.<br/>\nI feel it in my cock, and even my spine.  </p>\n\n<p>To the mods;  our PP crew,\nThanks for DD and all that you do.  </p>\n\n<p>Together we ride, right to the very end.<br/>\nTo the death pit, the hedgies we send</p>\n\n<p>I know I&#39;m not much, merely 1 simple specimen.<br/>\nBut Ive got solid diamond balls and I&#39;m the &quot;fukn snow mexican&quot;!</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "danny-1981", "url": "https://i.redd.it/3jbcankl39rb1.jpg", "time": 1696017771.0, "subreddit": "r/ThePPShow", "title": "Well this is how I feel", "text": "<!-- SC_OFF --><div class=\"md\"><p>Fuk Ken thats how. 52,000 total now.. good luck all</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3jbcankl39rb1.jpg\"/></div>"},
{"username": "danny-1981", "url": "https://www.reddit.com/r/ThePPShow/comments/16lssw0/hard_tinfoil/", "time": 1695036088.0, "subreddit": "r/ThePPShow", "title": "Hard tinfoil", "text": "<!-- SC_OFF --><div class=\"md\"><p>WE WILL NOT LOSE!  Think about it.</p>\n\n<p>It is time. Time for these crooks to get what they deserve. They have pushed this system to collapse, even without us.  This is why it is time.</p>\n\n<p>The system will implode by design. Then big bailouts and all the money goes back to the banks and big guys..... until now.</p>\n\n<p>We are supposed to be free money right at the end (like a golden parachute for c.e.os but billions.)</p>\n\n<p>But we will not sell, we flipped the table at exactly the right time, giving the &quot;good guys&quot; the green light to full send. Standing by them and continuously buying more shows them that we are determined and solid as fuk.</p>\n\n<p>So think about it really.</p>\n\n<p>There is an nft stock market waiting for the right time to be revealed. Sweet how does that work.</p>\n\n<p>Think of the nft as a serial number and thats it. Right now its 1 of 500million per say. If those 500 million are not in the same place (drs) noone can track the float.  That changes, the system would error and say duplicate. No more synthetic shares.. a true and real market.  </p>\n\n<p>Fuk Amazon. </p>\n\n<p>Piece of shit billionaires destroy good companies and filter them to Amazon, Amazon makes bank and they gain control..</p>\n\n<p>Enter teddy 🧸. </p>\n\n<p>What a great name for the new Amazon.</p>\n\n<p>Ok so new market.... </p>\n\n<p>Who would join? Everyone .. why?</p>\n\n<p>So many companies are shorted to oblivion, when they need to raise money, they can&#39;t or have to use so many shares to do it because of fuckery. That all stops. We will decide what a company is worth.</p>\n\n<p>When Teddy pops who will be under them on the new market.? Let&#39;s see,</p>\n\n<p>Chewy\nBbby\nGme\nBlockbuster\nSears</p>\n\n<p>And so many more. When a company sees the success of this, they will all move. I didn&#39;t list bbbyq there because they may become the teddy shares. All traded on gmerica. Think of the people we suspect being involved directly or indirectly.</p>\n\n<p>So when this happens realise that we have co.pletely shattered Amazon in</p>\n\n<p>Pet food and supplies.\nGaming\nBaby stuff\nMovies (blockbuster prime.)\nClothing \nHome decor.</p>\n\n<p>CHECKMATE BITCH!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "danny-1981", "url": "https://i.redd.it/8qt2747h5hob1.jpg", "time": 1694807715.0, "subreddit": "r/ThePPShow", "title": "Can't scare me with a good time.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I know its not much, but  it is to me. And fuk them thats why, we are not wrong. </p>\n\n<p>13,000shares  (+2200 this week) = 15,200 total. </p>\n\n<p>Best I could do at the moment.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/8qt2747h5hob1.jpg\"/></div>"},
{"username": "danny-1981", "url": "https://www.reddit.com/r/ThePPShow/comments/15dkptx/fud_buster/", "time": 1690721050.0, "subreddit": "r/ThePPShow", "title": "Fud buster", "text": "<!-- SC_OFF --><div class=\"md\"><p>Well shills are out in full force. Perfect. </p>\n\n<p>Here&#39;s what I&#39;m seeing and reading.  Well if everything valuable is sold whats left for RC. Why spend the big money for nothing. 🤣🤣 fuk outta here with this bullshit.</p>\n\n<p>You think a company gets valued at 5billion and then sold for 30ish million. ooop sorry accounting error? Lol </p>\n\n<p>Do we realise that bbby was a profitable company destroyed from the inside out?</p>\n\n<p>Who signs overpriced leases and takes unnecessary loans for dumb interest, and does a  share buy back in the $30.00 then a dilution in the $0.30s ? Lol </p>\n\n<p>Ok so here we are. How long have you been holding? For most people a long time, for some the whole time, and for a bunch just recently. Most recent buyers (imo) are from Jimmy. Jimmy and Bobby are going to face fuk wallstreet. Thats where I came from, I&#39;m obviously still there (4×)  but I&#39;m here too 5xholder.</p>\n\n<p>Are you seeing any value yet? Ok 1 more.</p>\n\n<p>When bbby dropped like a bitch what did you do? Lol exactly buy the fukn dip. Who remembers trading close to 2 billion or well over 1 billion in the week before entering ch. 11  if you do then you also remember 90% buying pressure. Who did that? Thats right you did, I did, we did.</p>\n\n<p>So where is the value? You are the fukn value, I am the value, and that person in the corner eating a crayon wrapping tinfoil on his head is the value.</p>\n\n<p>We are unique, we have given the activists the green light to take the gloves off and destroy these bad actors. Create new goodness and make each and everyone one of us wealthy for doing so. We have been tested and proven to be 100% ride or die. This major shift play would not work with normal retail paperhanded bitches.</p>\n\n<p>Theres no company in the world with holders like this, this is a companies dream. We are the dream team. </p>\n\n<p>If we were going to lose, we would have already lost. Understand that. For me I love to toe the line, also I have never in my life had so much fun/excitement/stress/disappointment/all that stuff holding tickers ever. </p>\n\n<p>For when re run, remember if the $.50 calls hit they will push the price to 1.00 easy. When the 1 dollar hits itll send this bitch sailing passed the 2.00 if we hit 2.00 hang the fuck on because there&#39;s now billions of shares due and every short will be so badly underwater itll be insane. So where would it then stop? Lmfao who knows no price anchoring, but when supply and demand take over well.... whats a bottle of water worth if you need it to save your life right now and im the only one with water and there&#39;s 5 of you that need it. 🤣🤣🤣🤣🤣🤣. Let the bidding begin!</p>\n\n<p>You have been trained your whole life that you are an ant. You have been conditioned to believe you are irrelevant and can change nothing. Look in the mirror and understand that they have spoon fed you bullshit! You are the value! You!</p>\n\n<p>We are the captains now! 🏴‍☠️🏴‍☠️🏴‍☠️🏴‍☠️🦍🔥</p>\n\n<p>Ps. I will ftd any charges related to financial advice. For i am the one in the corner! 🤣🤣 fuk these stupid rules. Fuk wallstreet and anyone that rides that way.. 🦍TOGETHER💪</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]