[{"username": "DarkVybz", "url": "https://www.reddit.com/r/ThePPShow/comments/16nz9ee/cancelled_shares_were_about_to_be_rich_beyond_our/", "time": 1695250448.0, "subreddit": "r/ThePPShow", "title": "Cancelled shares? We're about to be rich beyond our wildest dreams", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong><em>This is not financial Advice!</em></strong></p>\n\n<p>A lot of apes are worried about bbbyq shares getting cancelled as per today&#39;s 8k. Shills are also quick to point this out.</p>\n\n<p><a href=\"https://preview.redd.it/64wz9fogkhpb1.png?width=1025&amp;format=png&amp;auto=webp&amp;s=dc26960ab8ae1b774b838c3a7b1a83f633ac258e\">https://bedbathandbeyond.gcs-web.com/node/17371/html</a></p>\n\n<p>Did a quick check with ChatGPT and found that shares are actually never cancelled under a chapter 7 liquidation; they simply become worthless. I did some googling and found that our friends over at Finra wrote a beautiful article in 2021 on when shares get cancelled .</p>\n\n<p><a href=\"https://preview.redd.it/hz5clf2glhpb1.png?width=787&amp;format=png&amp;auto=webp&amp;s=6bc6c56f7eed8ce2aa60ec6732cc6b56c67dacb7\">https://www.finra.org/investors/insights/what-corporate-bankruptcy-means-shareholders#:~:text=When&#37;20a&#37;20company&#37;20files&#37;20for,That&#39;s&#37;20bad&#37;20news&#37;20for&#37;20shareholders.</a></p>\n\n<p>At this point, we are just waiting for the announcement on which new shares existing shareholders will be getting in return. When could this be announced? Where is PP hosting the PPShow on Mooonday?</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Additional thoughts:</em></strong></p>\n\n<p>Shares will be cancelled on September 30th, leaving only 7 more trading days (starting tomorrow) for shorts to close their positions. <strong>But we are in the expert market</strong>, where <strong>most apes cannot buy or sell bbbyq shares</strong>. It raises a particular question, <strong>why was this done?</strong> To prevent paper handed apes from selling? So that <strong>retail</strong> <strong>investors</strong> are not blamed for what&#39;s about to happen?</p>\n\n<p>I believe this is the famous short killer dividend we have all been waiting for the last few years. The company (bbby) asks the transfer agent how many shares they have on their books, the company gives the transfer agent that amount, and whatever is left is sent over to the DTC for distribution. Let the fireworks begin. <strong>T-7</strong></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/3tlsnJ18h07IOYZOpHjTKW2pIcjJGoWC1ACevCTGW0Q.jpg\"/></div>"},
{"username": "DarkVybz", "url": "https://www.reddit.com/r/ThePPShow/comments/14uj5h1/short_squeeze_season_is_upon_us/", "time": 1688859870.0, "subreddit": "r/ThePPShow", "title": "Short Squeeze Season is Upon Us", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was originally responding to a comment but then realized a post may be more appropriate to share some thoughts and quick maffs. </p>\n\n<p>I noticed a lot of apes here, including yours truly, are thinking of rotating some of the BBBYQ earnings into GME and IEP. For me, personally, this would be a dream come true but seems too good to be true. I remember a few weeks ago PP said someone somewhere was saying that BBBYQ&#39;s success posses a systematic risk. I think this is the risk - <strong>compounded short squeezes</strong>.</p>\n\n<p>&#x200B;</p>\n\n<p><em>\\</em>The prices I use in the examples below are, in my opinion, VERY conservative which will help prove my point later on.*</p>\n\n<p>Let&#39;s say, someone owns 50,000 shares of BBBYQ and in 3 different scenarios, they sell at $25, $50, and $100.</p>\n\n<p><strong>50,000 * $25</strong> <strong>= $1,250,000</strong></p>\n\n<p><strong>50,000 * $50 = $2,500,000</strong></p>\n\n<p><strong>50,000 * $100 = $5,000,000</strong></p>\n\n<p>&#x200B;</p>\n\n<p>For the sake of simplicity, and because apes are everywhere in the world, I will not discount taxes on those earnings. Now, say they want to buy GME (Currently at $23). I did not round up, I just dropped the dingleberries.</p>\n\n<p><strong>$1,250,000 / $23 = ~54,347 shares</strong></p>\n\n<p><strong>$2,500,000 / $23 = ~108,695 shares</strong></p>\n\n<p><strong>$5,000,000 / $23 = ~217,391 shares</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Until now, the money that was made from BBBYQ is not that crazy and would most likely not collapse the system. However, this is what happens if they do not let GME run at the same time and let APEs rotate to GME. Let&#39;s say, GME runs ONLY 10x. </p>\n\n<p><strong>54,347 * $230 = $12,499,810</strong></p>\n\n<p><strong>108,695 * $230 = $24,999,850</strong></p>\n\n<p><strong>217,391 * $230 = $49,999,930</strong></p>\n\n<p>&#x200B;</p>\n\n<p>You can already see how big these numbers can get. DeepFuckingValue once made a post about GME potentially reaching <strong>$1.5 trillion in market cap (which is still only half of Apple&#39;s market cap)</strong>. Today, after the dividend split, that would give us around <strong>$4,922</strong> per GME share.</p>\n\n<p>Phone numbers have always been very unrealistic, in my opinion, which is why I think BBBYQ is the catalyst for the whole basket of shorted stocks.</p>\n\n<p><strong>If I am wrong, we will all be STUPID rich (APEs will not have a few million, but rather a few hundred million).</strong></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]