[{"username": "dazhawk", "url": "https://i.redd.it/h2o9dbmfp5yb1.jpg", "time": 1699027623.0, "subreddit": "r/ThePPShow", "title": "Just received this letter today from Fidelity - could this mean they received instructions for a cash payout?", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is where I hold xx,xxxx shares of BBBYQ and I did not receive one of these letters last year. Probably a nothing burger, just interesting timing. Curious if any other BBBYQ investors received this same letter last year?</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/h2o9dbmfp5yb1.jpg\"/></div>"},
{"username": "dazhawk", "url": "https://i.redd.it/yi2e9q5rimtb1.jpg", "time": 1697051955.0, "subreddit": "r/ThePPShow", "title": "Maybe one day soon, this will be our day! 🦋", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/yi2e9q5rimtb1.jpg\"/></div>"},
{"username": "dazhawk", "url": "https://i.redd.it/iroxzen0oumb1.jpg", "time": 1694099644.0, "subreddit": "r/ThePPShow", "title": "Even Bloomberg has now joined the fray of misinformation.", "text": "<!-- SC_OFF --><div class=\"md\"><p>This from an article this morning regarding Party City&#39;s emergence from bankruptcy. Apparently we&#39;ve already liquidated and are no longer operating after a failed Chapter 11.</p>\n</div><!-- SC_ON -->", "flair": {"text": "MSM FUD ", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/iroxzen0oumb1.jpg\"/></div>"},
{"username": "dazhawk", "url": "https://www.reddit.com/r/ThePPShow/comments/1652bq4/a_question_for_the_next_pp_show_why_havent_shorts/", "time": 1693362671.0, "subreddit": "r/ThePPShow", "title": "A question for the next PP Show - why haven't shorts been covering?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been in this play since Feb 2023 and bought my first 10,000 at $1.60 and have been averaging down ever since (managed to get to a modest 30,000 @ $0.67.) I have tuned in to listen to almost every PP Show for the past 6 months (and even OKbets and Salvatores space calls.) Guess you would call me a professional lurker as I never feel qualified to reply with anything of significant value to the show or to this sub. I&#39;ve been actively investing in stocks for the past 25 years and have come to learn the basics of naked shorts, synthetic shares, FTDs, short interest and all the other nefarious tools that SHF have at their disposal...here&#39;s what I&#39;m failing to understand. </p>\n\n<p>We have a LOT of very intelligent people in this community, and I would argue the communal knowledge rivals that of the punks at the hedge funds...BUT, they have access to the same information we do, if not more. If our thesis holds any degree of merit, then why in the world have they not been gradually covering their exposed short positions over the past couple of months? I would venture a very large wager that most, if not all, of their short positions are in the money. I highly doubt they&#39;ve been opening a significant amount of new short positions that are under water when we&#39;re trading at $0.20. </p>\n\n<p>What more do they stand to gain by holding out to $0? Especially if there&#39;s even a 10% chance that shareholders are made whole with a new plan supplement? I must be failing to miss something else about the market mechanics. They could have spent the past 3 months slowly and gradually closing their short positions without risking sending the price to Uranus in a few trading sessions and still made a TON of money exiting their positions and reducing their infinite exposure.</p>\n\n<p>I&#39;m sure I&#39;m missing something very obvious and would love to hear from the smooth brains as to how much more they stand to gain by holding onto their short positions when we&#39;re @ $0.20.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "dazhawk", "url": "https://www.reddit.com/gallery/15rp689", "time": 1692096375.0, "subreddit": "r/ThePPShow", "title": "buybuy Baby has a new CEO", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "dazhawk", "url": "https://www.reddit.com/gallery/15rp689", "time": 1692096375, "subreddit": "r/ThePPShow", "title": "buybuy Baby has a new CEO", "text": "Pete Daleiden has rejoined the team. I know this hire was posted earlier but it was buried inside the comments of the Glen Cary (Chief Stores Officer) hire. Both of these new hires are tagged as Aug 2023 and both previously worked at Baby during Mark Tritton's reign of terror.  I only posted here so I could share the screen grab of his profile for those who don't have access to LinkedIn. No way in hell Dream On Me can afford all these recent senior exec hires without some additional capital backing.\n\nNOTE: The 3rd image is from Glen Cary's About section he also shares some stats on previous Baby revenue performance - $1.2B business.", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/1w5e8u0lMhINGV5G_-SjwkYUZ0QITq4-Znt0v_f9220.jpg\"/></div>"}]