[{"username": "Deadriel83", "url": "https://www.reddit.com/r/ThePPShow/comments/16stcyo/i_find_it_comical_so_many_here_are_upset_at_pulte/", "time": 1695747412.0, "subreddit": "r/ThePPShow", "title": "I find it comical so many here are upset at Pulte and PP", "text": "<!-- SC_OFF --><div class=\"md\"><p>I do I really do, I understand some of you have sank massive savings into this. And because of that your brain WANTS to believe, CRAVES some confirmation you didn&#39;t make a dumb ass decision based on hype and excitement. </p>\n\n<p>Let&#39;s be real for a second shall we, PP clearly believes in the move. Created this sub to give the real apes a way to escape the toxicity and shilling in the former main sub. As for Pultes involvement/knowledge of the play behind the scenes, we&#39;ve been given no concrete evidence as to shit. </p>\n\n<p>The guy posts on twitter/x and here come 469 posts on ppshow labeled bLaCk TaR tInFoiL. Like hes got any obligation or motivation to explain to a bunch of plebs why he&#39;s posted it or what it means. Do you have any idea how much bigger things he&#39;s got going on in his life than a bunch of regarded apes hoping to strike it rich and punish the evil in the financial cabal?</p>\n\n<p>Honestly if you think he comes here and reads 1/10th of the shit we post here your delusional, he&#39;s taken an interest in PP that much is clear and feels he deserves compensation for his efforts. I for one agree don&#39;t really care what the rest of you think. </p>\n\n<p>As for myself I look to no man to save me from my own mistakes not RC not PP not Pulte. If this plays out bad for us I&#39;ll have forgotten it before the money even disappears and be focused on my other investments. </p>\n\n<p>Having said that, I hope to see you all on the moon! 🚀🚀🚀🚀🚀</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]