[{"username": "delta_squared", "url": "https://v.redd.it/0k7a8ue0oltb1", "time": 1697041810.0, "subreddit": "r/ThePPShow", "title": "The Heimlich Maneuver", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/kTPrU8cQqvEzbg5W2sztQM5LLDsIqz-1BVJygMDtgWI.jpg\"/></div>"},
{"username": "delta_squared", "url": "https://i.redd.it/offfajvzkjhb1.png", "time": 1691786227.0, "subreddit": "r/ThePPShow", "title": "The Trial of Life", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/offfajvzkjhb1.png\"/></div>"},
{"username": "delta_squared", "url": "https://i.redd.it/3h8ov0ngjjhb1.png", "time": 1691785806, "subreddit": "r/ThePPShow", "title": "The Trial of Life", "text": "", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3h8ov0ngjjhb1.png\"/></div>"},
{"username": "delta_squared", "url": "https://www.reddit.com/r/ThePPShow/comments/15bj8s8/drs_the_ultimate_destination_for_shareholders/", "time": 1690506558.0, "subreddit": "r/ThePPShow", "title": "DRS: The Ultimate Destination for Shareholders", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wws6rzjohmeb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=6eb9613335ca8f1556fc4d5069062b422ac108ff\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/wws6rzjohmeb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=6eb9613335ca8f1556fc4d5069062b422ac108ff\" alt=\"https://preview.redd.it/wws6rzjohmeb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=6eb9613335ca8f1556fc4d5069062b422ac108ff\"></a></p>\n\n<h1>TLDR:</h1>\n\n<p>While the fate of our boy Bobby and his ability to thwart the harrows of a murderous death spiral lies firmly in the hands of K&amp;E, Holly Etlin, and Sixth Street (+ their unknown affiliates), the extent, momentum, and duration of price discovery resulting from an emergence from Chapter 11 will be directly tied to the DTC&#39;s available BBBYQ liquidity, or known &quot;locates&quot; at the time of forced delivery. When MOASS hits, the DTC and their brokers will do everything in their power to mitigate damages, including screwing over beneficial &quot;share owners&quot; to the maximum extent allowable by law. If you were there like I was on January 29, 2021, you will know this is more probable than it is just possible. But you can raise the MOASS roof AND protect your idiosyncratic investment from the equally idiosyncratic and desperate actions of certain unscrupulous, underhanded, professional crooks with this one fundamental time-tested tactic: actually own stuff.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qu0ox2igbmeb1.jpg?width=612&amp;format=pjpg&amp;auto=webp&amp;s=8dff495a32f0dd79a70b012013f4cb453a6d1aa0\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/qu0ox2igbmeb1.jpg?width=612&amp;format=pjpg&amp;auto=webp&amp;s=8dff495a32f0dd79a70b012013f4cb453a6d1aa0\" alt=\"https://preview.redd.it/qu0ox2igbmeb1.jpg?width=612&amp;format=pjpg&amp;auto=webp&amp;s=8dff495a32f0dd79a70b012013f4cb453a6d1aa0\"></a></p>\n\n<h1>WHO CARES:</h1>\n\n<p>Notice how Pulte asked ABC about the panel&#39;s opinion on DRS immediately after discussing a potential tipping point for retail investors? His verbal excitement on the topic is further confirmation for me about the importance of DRS in the fight against naked shorting and institutional corruption. There is a reason Ryan Cohen called himself the Book King, and it wasn&#39;t his extensive line of five whole children&#39;s books.</p>\n\n<p>Dr. Susanne Trimbath speaks about the corporate voting fraud enabled by fractional reserve ledger accounting, predatory share lending, naked shorting, and settlement failures. DRS helps there to thwart corporate election over-voting, but in the event of MOASS, DRS also plays a key role in price action/suppression, asserting legal custody, and ensuring a full conversion of equity rather than a cash-in-lieu settlement in the event of an equity exchange or share dividend.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/c62jsk4ogmeb1.png?width=1018&amp;format=png&amp;auto=webp&amp;s=caf218fca5b6f7af14f73102d576d5ea8096c6df\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/c62jsk4ogmeb1.png?width=1018&amp;format=png&amp;auto=webp&amp;s=caf218fca5b6f7af14f73102d576d5ea8096c6df\" alt=\"https://preview.redd.it/c62jsk4ogmeb1.png?width=1018&amp;format=png&amp;auto=webp&amp;s=caf218fca5b6f7af14f73102d576d5ea8096c6df\"></a></p>\n\n<h1>MM MECHANICS:</h1>\n\n<p>Bonafide market makers are legally exempt from the laws preventing naked shorting in order to always fulfill orders made within the NBBO regardless of the number of shares they have on hand to facilitate the requested trades. This is important because it is this internalization / inventory fulfillment which keeps trades from hitting the public exchanges and moving the NBBO. It is not typically until a market maker runs out of internal inventory of a stock AND runs out of known locates to naked short AND still faces buy-side pressure that they will resort to open market arbitrage in order to fulfill those buy orders.</p>\n\n<p>Therein lies the limit to how much market makers can legally (and sensibly) naked short, which is the number of shares they can vouch to be potentially obtainable, or known locates. Known locates however have devolved into (or maybe always have been) simply the number of shares outstanding minus the shares held in book entry under shareholder names that are not Cede and Co. Until they hit that limit though, there is nothing stopping them from fulfilling orders using naked shorted shares and kicking the can on delivery for a time arbitrage opportunity. Combine the delayed settlement with coordinated hit pieces, astroturfed social media sentiment, and a flimsy low-liquidity small cap stock, and buying on the open market in order to fulfill becomes less profitable than taking on the risk of longer-term (and artificially created) time arbitrage opportunities.</p>\n\n<p>Brokers are entitled to loan your shares out for non-naked shorting if they are held in margin accounts or if you opt in to a share lending program, but simply holding any beneficial street name shares through the DTC guarantees their availability as a known locate, and thus for naked shorting for market making. DRSing those Bobbies in your name guarantees they are not available as potential borrows or as known locates.</p>\n\n<p>However, even registered shares held in a company&#39;s dividend reinvestment DRIP plan, but not book entry, are still made available to the DTC&#39;s pool of known locates for bonafide market makers. This was theorized in the heat lamp DD first published and then suppressed on r/[redacted].</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/mrxut9rdgmeb1.jpg?width=751&amp;format=pjpg&amp;auto=webp&amp;s=c3e976ff0239196e3122b6ac9d1e88a4405f9a71\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/mrxut9rdgmeb1.jpg?width=751&amp;format=pjpg&amp;auto=webp&amp;s=c3e976ff0239196e3122b6ac9d1e88a4405f9a71\" alt=\"https://preview.redd.it/mrxut9rdgmeb1.jpg?width=751&amp;format=pjpg&amp;auto=webp&amp;s=c3e976ff0239196e3122b6ac9d1e88a4405f9a71\"></a></p>\n\n<h1>RECYCLING FTDs:</h1>\n\n<p>Because market makers are also given an extended window for forced buy-ins to make good on aged FTD deliveries, total outstanding naked short sales can be distributed across all the days within a market maker&#39;s extended delivery exempt window. However, because of the quant HFT nature with which market makers operate, it would surprise me if the aggregate number of fails across the entire window ever added up to more than the total shares available in the known locate pool (Cede and Co registered shares). The role of tokenized shares further opens the Pandora&#39;s box of fraudulent known locates, but with the downfall of FTX, that too seems to me to be an emerging and precarious bandaid mechanism reserved for acute liquidity emergencies.</p>\n\n<p>FTDs are THE ultimate mechanism by which the NBBO is manipulated (by way of forced derivative delta hedging and selective exchange routing), so limiting the available pool of known locates would directly affect the mechanism by which naked shorting is justified. The business model relies on replenishing inventory for cheaper than the price sold in order to recycle the deadline of forced delivery. Removing known locates from the DTC pool helps remove the risk-free sell-side naked short pressure and prevent market makers from flooding the open market with sell orders and from reloading their retail inventory as cheaply as they would otherwise. This is a compounding effect based on the profitability of that sell-buy spread that market makers are constantly arbitraging.</p>\n\n<p>For DRS though, the effect of removing liquidity from the fraud fairy is multiplied thanks to the rehypothecation of short sales (naked and regular) due to lax and false adherence to short reporting requirements. The only indications of whether shares bought through a brokerage are long or short sales is self-reported, and we all know how well self-enforcement works on wall street. Conceivably, without accurate 3rd party reporting, the same shares can be sold short into the market multiple times over by different brokerages who are none-the-wiser about where those shares came from. The share lending market along with PFOF has become the central mechanism of the new brokerage business model. It is rife with conflicts of interest and opaque enough to create plausible deniability in enforcement cases. Pulling your shares from the known locate pool has the potential of removing the known locate used to back multiple historic naked short transactions per share.</p>\n\n<p><a href=\"https://preview.redd.it/qskc9778hmeb1.png?width=600&amp;format=png&amp;auto=webp&amp;s=df96e91ca02128a4d21e751b94b4fe2d7e1d5e73\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/qskc9778hmeb1.png?width=600&amp;format=png&amp;auto=webp&amp;s=df96e91ca02128a4d21e751b94b4fe2d7e1d5e73\" alt=\"https://preview.redd.it/qskc9778hmeb1.png?width=600&amp;format=png&amp;auto=webp&amp;s=df96e91ca02128a4d21e751b94b4fe2d7e1d5e73\"></a></p>\n\n<h1>DISPELLING THE FUD AROUND DRS:</h1>\n\n<p>Q: How is this possible if AST doesn&#39;t let me create a new account anymore?</p>\n\n<p>A: You do not need to create an account through AST in order to transfer out of your brokerage. Your broker has all necessary personal info for AST to create an account on your behalf. AST/Equiniti will mail a letter with account details and login instructions upon receiving your share transfer.</p>\n\n<p>Q: How long does it take?</p>\n\n<p>A: Initiating the transfer can take a few days to process the work order + 1-2 days settlement time</p>\n\n<p>Q: What if I&#39;m mid-transfer when MOASS happens?</p>\n\n<p>A: Shares will sit in your brokerage account until after market close on the day the transfer is done.They will show up in AST 24-48 hours later ready to sell or transfer again. You can still sell in your brokerage until the shares leave your account. It will simply cancel the transfer-out request.</p>\n\n<p>Q: What if I&#39;m waiting for them to settle when it rips?</p>\n\n<p>A: What if it rips even harder later in the week? You can also transfer a portion of your holdings at a time if you&#39;re worried about immediate access.</p>\n\n<p>Q: Can I just transfer back to my broker?</p>\n\n<p>A: Some brokers will not allow transfers-in because of the OTC status. The rep I spoke to at AST assured me there were no restrictions on BBBYQ so any decisions to not allow transfers-in are broker to broker. I find it odd that my particular broker will sell OTC shares to you no problem but will not accept a transfer-in supposedly due to extra compliance for OTC stocks. But I digress...</p>\n\n<p>Q: how long does it take to sell through the Transfer Agent?</p>\n\n<p>A: Sales through AST/Equiniti take up to 2 business days to process. Sales are batched daily with other sale requests.</p>\n\n<p>Q: Is there a commission when selling?</p>\n\n<p>A: AST/Equiniti charges a fee of $15 + $0.12 per share to sell through them. Transfers-out back to a broker are free.</p>\n\n<p><a href=\"https://preview.redd.it/6n4vsxrkhmeb1.jpg?width=381&amp;format=pjpg&amp;auto=webp&amp;s=3d0c07163c25d36b451e1aed4e9a79cb368c4a24\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/6n4vsxrkhmeb1.jpg?width=381&amp;format=pjpg&amp;auto=webp&amp;s=3d0c07163c25d36b451e1aed4e9a79cb368c4a24\" alt=\"https://preview.redd.it/6n4vsxrkhmeb1.jpg?width=381&amp;format=pjpg&amp;auto=webp&amp;s=3d0c07163c25d36b451e1aed4e9a79cb368c4a24\"></a></p>\n\n<h1>ADVANTAGES OF DRS:</h1>\n\n<p>- First in line for dividends, equity dividends and equity conversion distribution</p>\n\n<p>- Guarantees a full equity conversion rather than cash-in-lieu payment or delayed delivery on broker terms</p>\n\n<p>- Equity is safe in the event of broker liquidation</p>\n\n<p>- In the event of a broker default, recovery could be tedious and potentially capped at the FDIC insurable max of $250,000 (worst case scenario you may be SOL)</p>\n\n<p>- Helps to control sell-side impulses during volatile periods</p>\n\n<p>- Removes those shares from the pool of shortable shares accessible by the DTC</p>\n\n<p>- DRS has the effect of a share recall for lent out shares and naked short sales backed by known locates</p>\n\n<p>- Because of short sale rehypothecation, each DRSed share can remove multiples of itself from the pool of shares being used for market maker exempt bonafide naked shorting</p>\n\n<p>- You don&#39;t need to be in a margin account or to knowingly lend out shares for market makers to use your shares as known locates for naked shorting</p>\n\n<p>- Amount of DRSed shares would have a direct impact on the ability to legally mitigate any hypothetical rapid price appreciation in the event of MOASS</p>\n\n<p>- HFT quant market making risk models are also affected by the availability of known locates</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/pelhn3rcyneb1.jpg?width=976&amp;format=pjpg&amp;auto=webp&amp;s=05d6ac469d71161b80ff8b7780b7e5749967a831\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/pelhn3rcyneb1.jpg?width=976&amp;format=pjpg&amp;auto=webp&amp;s=05d6ac469d71161b80ff8b7780b7e5749967a831\" alt=\"https://preview.redd.it/pelhn3rcyneb1.jpg?width=976&amp;format=pjpg&amp;auto=webp&amp;s=05d6ac469d71161b80ff8b7780b7e5749967a831\"></a></p>\n\n<h1>IMPLEMENTATION:</h1>\n\n<p>- You can initiate a transfer either on the phone or through many brokerage online chat systems</p>\n\n<p>-Simply tell them you would like to DRS X number of shares and that they should have all the relevant info needed to complete the request</p>\n\n<p>-Defining a preferred cost basis can slow down or block the process if you do not specify exactly which shares (date and price) you wish to register</p>\n\n<p>- Brokers are very capable of canceling your request without notice. Follow up and request written confirmation to ensure your expected transfer timeline</p>\n\n<p>- If your broker claims one or multiple clerical errors to prevent you from transferring out, ask to speak with the brokerage compliance department and request a written confirmation of the number of shares you requested to DRS</p>\n\n<p>- You may not have immediate access to the online portal. AST Financial is merging with Equiniti and online access for new accounts seems to be limited until the site merger is complete</p>\n\n<p>- Account details are verifiable by phone and by snail mail until accounts are converted to Equiniti accounts</p>\n\n<p>- Sell orders and transfers-out can be made by phone</p>\n\n<p>&#x200B;</p>\n\n<p>As always, NFA.</p>\n\n<p>-△▢</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/N18m7ILmUBdxIRQ4IEtx6hM7KoQapUFSgdgTf1ZTkN8.jpg\"/></div>"},
{"username": "delta_squared", "url": "https://www.reddit.com/r/ThePPShow/comments/15biyj1/drs_the_ultimate_destination_for_shareholders/", "time": 1690505751, "subreddit": "r/ThePPShow", "title": "DRS: The Ultimate Destination for Shareholders", "text": "# TLDR:\n\nWhile the fate of our boy Bobby and his ability to thwart the harrows of a murderous death spiral lies firmly in the hands of K&E, Holly Etlin, and Sixth Street (+ their unknown affiliates), the extent, momentum, and duration of price discovery resulting from an emergence from Chapter 11 will be directly tied to the DTC's available BBBYQ liquidity, or known \"locates\" at the time of forced delivery. When MOASS hits, the DTC and their brokers will do everything in their power to mitigate damages, including screwing over beneficial \"share owners\" to maximum extent allowable by law. You can rise the MOASS ceiling AND protect your idiosyncratic investment from idiosyncratic and desperate action from unscrupulous, underhanded, professional crooks. If you were there like I was on January 29, 2021, you will know this is more probable than it is just possible.  \n\n\n# WHO CARES:\n\n  \nNotice how Pulte asked ABC about the panel's opinion on DRS immediately after discussing a potential  tipping point for retail investors. His verbal excitement on the topic is further confirmation for me about the importance of DRS in the fight against naked shorting and institutional corruption. There is a reason Ryan Cohen called himself the Book King, and it wasn't his extensive line of five whole children's books.  \n\n\nDr. Susanne Trimbath speaks about the corporate voting fraud enabled by fractional reserve ledger accounting, predatory share lending, and naked shorting. But in the event of MOASS, DRS plays a key role in price action/suppression, asserting legal custody, and ensuring a full conversion of equity rather than a cash-in-lieu settlement in the event of an equity exchange or share dividend.  \n\n\n# MM MECHANICS:\n\nBonafide market makers are legally exempt from the laws preventing naked shorting in order to  always fulfill orders made within the NBBO regardless of the number of shares they have on hand to facilitate the requested trades. This is important because it is this internalization / inventory fulfillment which keeps trades from hitting the public exchanges and moving the NBBO. It is not typically until a market maker runs out of internal inventory of a stock AND runs out of known locates to naked short AND still faces buy-side pressure that they will resort to open market arbitrage in order to fulfill those buy orders.  \n\n\nTherein lies the limit to how much market makers can legally (and sensibly) naked short, which is the number of shares they can vouch to be potentially obtainable, or known locates. Known locates however have devolved into (or maybe always have been) simply the number of shares outstanding minus the shares held in book entry under shareholder names that are not Cede and Co. Until they hit that limit though, there is nothing stopping them from fulfilling orders using naked shorted shares and kicking the can on delivery for a time arbitrage opportunity. Combine the delayed settlement with coordinated hit pieces, astroturfed social media sentiment, and a flimsy low-liquidity small cap stock, and buying on the market in order to fulfill becomes more profitable than the risk of longer-term (and artificially created) time arbitrage opportunities.  \n\n\nBrokers are entitled to loan your shares out for non-naked shorting if they are held in margin accounts or if you opt in to a share lending program, but simply holding any beneficial street name shares through the DTC guarantees their availability as a known locate, and thus for naked shorting for market making. DRSing those Bobbies in your name guarantees they are not available as potential borrows or as known locates.\n\n  \nHowever, even registered shares held in a company's dividend reinvestment DRIP plan, but not book entry, are still made available to the DTC's pool of known locates for bonafide market makers. This was theorized in the heat lamp DD first published and then suppressed on r/\\[redacted\\].  \n\n\n# RECYCLING FTDs:\n\n&#x200B;\n\nBecause market makers are also given an extended window for forced buy-ins to make good on aged FTD deliveries, total outstanding naked short sales can be distributed across all the days within a market maker's extended delivery exempt window. However, because of the quant HFT nature with which market makers operate, it would surprise me if the aggregate number of fails across the entire window ever added up to more than the total shares available in the known locate pool (Cede and Co registered shares). The role of tokenized shares further opens the Pandora's box of fraudulent known locates, but with the downfall of FTX, that too seems to me to be an emerging and precarious bandaid mechanism reserved for acute liquidity emergencies.  \n\n\nFTDs are THE ultimate mechanism by which the NBBO is manipulated (by way of forced derivative delta hedging and selective exchange routing), so limiting the available pool of known locates would directly affect the mechanism by which naked shorting is justified. The business model relies on replenishing inventory for cheaper than the price sold in order to recycle the deadline of forced delivery. Removing known locates from the DTC pool helps relieve risk-free sell-side naked short pressure and prevent market makers from flooding the open market with sell orders and from reloading their retail inventory as cheaply as they would otherwise. This is a compounding effect based on the profitability of that sell-buy spread that market makers are constantly arbitraging.  \n \n\nFor DRS though, the effect of removing liquidity from the fraud fairy is multiplied thanks to the rehypothecation of short sales (naked and regular) due to lax and false adherence to short reporting requirements. The only indications of whether shares bought through a brokerage are long or short sales is self-reported, and we all know how well self-enforcement works on wall street. Conceivably, without accurate 3rd party reporting, the same shares can be sold short into the market multiple times over by different brokerages who are none-the-wiser about where those shares came from. The share lending market along with PFOF has become the central mechanism of the new brokerage business model. It is rife with conflicts of interest and opaque enough to create plausible deniability in enforcement cases. Pulling your shares from the known locate pool has the potential of removing the known locate used to back multiple historic naked short transactions per share.   \n\n\n# DISPELLING THE FUD AROUND DRS:\n\nQ: How is this possible if AST doesn't let me create a new account anymore?\n\nA: You do not need to create an account through AST in order to transfer out of your brokerage  \nYour broker has all necessary personal info for AST to create an account on your behalf  \nAST/Equiniti will mail a letter with account details and login instructions upon receiving your share transfer.  \n\n\nQ: How long does it take?  \nA: Initiating the transfer can take a few days to process the work order + 1-2 days settlement time  \n\n\nQ: What if I'm mid-transfer when MOASS happens?  \nA: Shares will sit in your brokerage account until after market close on the day the transfer is done.  \nThey will show up in AST 24-48 hours later ready to sell or transfer again.  You can still sell in your brokerage until the shares leave your account. It will simply cancel the transfer-out request.  \n\n\nQ: What if I'm waiting for them to settle when it rips?  \nA: What if it rips even harder later in the week? You can also transfer a portion of your holdings at a time if you're worried about immediate access.  \n\n\nQ: Can I just transfer back to my broker?  \nA: Some brokers will not allow transfers-in because of the OTC status. The rep I spoke to at AST assured me there were no restrictions on BBBYQ so any decisions to not allow transfers-in are broker to broker. I find it odd that my particular broker will sell OTC shares to you no problem but will not accept a transfer-in supposedly due to extra compliance for OTC stocks. But I digress...\n\nQ: how long does it take to sell through the Transfer Agent?  \nA: Sales through AST/Equiniti take up to 2 business days to process. Sales are batched daily with other sale requests.  \n   \nQ: Is there a commission when selling?  \nA: AST/Equiniti charges a fee of $15 + $0.12 per share to sell through them. Transfer-out back to a broker are free.  \n\n\n# ADVANTAGES OF DRS:\n\n  \n\\- Removes those shares from the pool of shortable shares accessible by the DTC  \n\\- DRS has the effect of a share recall for lent out shares and naked short sales backed by known locates  \n\\- Helps to control sell-side impulses during volatile periods  \n\\- Because of short sale rehypothecation, each DRSed share can remove multiples of itself from the pool of shares being used as market maker exempt bonafide naked shorting  \n\\- You don't need to be in a margin account or to knowingly lend out shares for market makers to use your shares as known locates for naked shorting  \n\\- Amount of DRSed shares would have a direct impact on the ability to legally mitigate any hypothetical rapid price appreciation in the event  \n\\- HFT quant market making risk models are also affected by the availability of known locates  \n\\- In the event of a broker default, recovery could be tedious and potentially capped at the FDIC insurable max of $250,000 (worst case scenario you may be SOL)  \n\n\n# IMPLEMENTATION:\n\n  \n\\- You can initiate a transfer either on the phone or through many brokerage online chat systems  \n\\- If your broker claims one or multiple clerical errors to prevent you from transferring out, ask to speak with the brokerage compliance department and request a written confirmation of the number of shares you requested to DRS  \n\n\nAs aways, NFA.  \n\\-△▢", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]