[{"username": "DescriptionSad7702", "url": "https://www.reddit.com/r/ThePPShow/comments/17fi2kn/the_system_is_broken/", "time": 1698168096.0, "subreddit": "r/ThePPShow", "title": "The System is Broken", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is for discussion. \n As we see the court case has been delayed once again. This I am convinced is on purpose.\n Let me share. I worked for a Canadian company owned 50% by a publicly traded company.  The private company went bankrupt.. so someone said while I worked there.... the company actually wasn&#39;t bankrupt, it was behind on bills, had 2 million in debt and 5-7 million assets plus the public company to raise capital.  The Auditors came in , with the lawyers and judges. At the end of 9 months they manged to make the company value negative 1.2 million and auctioned it off. \n  Lead forward 20 years, a colleague owned what is now &quot;Zoom&quot; hedgie infiltrated the board as he wouldn&#39;t sell them shares to close they&#39;re shorts. Shorts at Cannacrap tried everything including extortion.  Eventually once the psyops got on the board,  they ran the stock down, couldn&#39;t raise capital, closed the shorts, made money. Another psyop from the same groups bought the assets out of bankruptcy and sold to eventually what is now Zoom. 13 years , 13 fucking years in court and millions of dollars in legal and no judgment yet on the case for my colleague.<br/>\n As with BBBYQ, the judges are bought, if the judge is sick have a backup judge , the lawyers make billions to never resolve problems, the brokers have the shares, the shorts are way in the money and they all use the collateral to do it over and over. Fines and legal is cost of doing business.  I don&#39;t expect anything from BBBYQ until at least late 2024 or early 2025. Pulte knows exactly what&#39;s going on and is in damage control for the situation.  Look at his own case , years and years, millions of dollars and no judgement. It&#39;s all a giant ponzi we can&#39;t afford to play. Happy to hear other opinions and see precedent court cases where the opposite of what I am saying happened . I don&#39;t think they exist. The only good thing I see is we can&#39;t buy or sell,  so our money is considered gone and if we get something back we&#39;re lucky</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "DescriptionSad7702", "url": "https://www.reddit.com/r/ThePPShow/comments/16nnbl4/pp_questions/", "time": 1695221639.0, "subreddit": "r/ThePPShow", "title": "PP Questions", "text": "<!-- SC_OFF --><div class=\"md\"><p>PP please ask pulte if he trusts the SEC and regulators..</p>\n</div><!-- SC_ON -->", "flair": {"text": "Stream Live Chat ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "DescriptionSad7702", "url": "https://www.reddit.com/r/ThePPShow/comments/16hs8xd/i_have_only_1_question/", "time": 1694624015.0, "subreddit": "r/ThePPShow", "title": "I have only 1 question", "text": "<!-- SC_OFF --><div class=\"md\"><p>Wen 🌛</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "DescriptionSad7702", "url": "/r/Superstonk/comments/161e0g2/no_comment_on_the_creation_of_the_obligation/", "time": 1693005395.0, "subreddit": "r/ThePPShow", "title": "No comment on the creation of the obligation warehouse?", "text": null, "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": ""}]