[{"username": "Difficult_Section461", "url": "https://www.reddit.com/r/ThePPShow/comments/17snk2z/holding_like_a_tick_on_a_dog_in_a_snowstorm_aint/", "time": 1699679682.0, "subreddit": "r/ThePPShow", "title": "Holding like a tick on a dog in a snowstorm. Ain’t no shaking me!", "text": "<!-- SC_OFF --><div class=\"md\"><p>LFG!🚀🚀🚀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Difficult_Section461", "url": "https://www.reddit.com/r/ThePPShow/comments/17m8f02/you_nervous_stressed_nah_im_just_making_sure_my/", "time": 1698945099.0, "subreddit": "r/ThePPShow", "title": "You Nervous? Stressed? Nah, I’m just making sure my space suit doesn’t have any holes in it.", "text": "<!-- SC_OFF --><div class=\"md\"><p>LFG! 🚀🚀🚀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Difficult_Section461", "url": "https://www.reddit.com/r/ThePPShow/comments/17ifvei/an_old_man_and_an_inexperienced_investor_learns_a/", "time": 1698506127.0, "subreddit": "r/ThePPShow", "title": "An old man and an inexperienced investor, learns a lesson.", "text": "<!-- SC_OFF --><div class=\"md\"><p>As I come to the realization that there are fewer days that lie ahead of me than behind me, I’d like to point out the importance of this sub and a couple others. I’ve only been investing since January of 21’. I would describe myself as a person with an above average IQ and a pretty good head on my shoulders when judging right from wrong. However, looking back I must say that without this sub I would certainly have folded my cards long ago, not knowing what I could potentially miss. I’ve since learned to question everything before making any emotional decisions by following along and studying the DD. I’ve learned how easily the public can blindly follow the MSM. (Myself included) But most importantly, I can’t believe the amount of corruption I’ve learned about. Quite frankly, it sickens me. I’m so fortunate to have stumbled upon this community and joined the fight for what’s right. I’m confident that I’m making the right decisions to hold on and see this journey through. Thank you to all that have contributed. This has been quite the few years for me and one heck of a learning experience. If it ends the way I think it will, this world should be a much better place. LFG! \nPS. It was embarrassing telling my wife that I’m getting my information from a PP Sub. 🤦‍♂️</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Difficult_Section461", "url": "https://www.reddit.com/r/ThePPShow/comments/16r5ls1/2_out_of_3_aint_bad/", "time": 1695581837.0, "subreddit": "r/ThePPShow", "title": "2 out of 3 ain’t bad.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was told to 1. buy, 2. hold and 3. DON’T sell to soon. I’ve bought every share I could afford. I’ve held every share I bought. But completing the trifecta, means not selling until we see phone numbers. That’s the way we liquidate the hedgies and change the future for the working class. If you believe in the cause, then we are the chosen ones. I have friends that don’t have that many shares. I’m holding for them. I have shares that I will never sell. I want everyone that has sacrificed to be able to bathe in the glory when we have lift off. I Don’t care if they have one share or a million. Be proud of what you’ve sacrificed! Be proud of what you’re about to be part of. Never again will we have an opportunity like this to change our generational wealth. Exciting times ahead. Thanks to all of the contributors that have helped make this truly a once in a lifetime experience! Let’s light this fuse! I’ve got lives to change!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Difficult_Section461", "url": "https://www.reddit.com/r/ThePPShow/comments/16qijii/curiosity/", "time": 1695511761.0, "subreddit": "r/ThePPShow", "title": "Curiosity", "text": "<!-- SC_OFF --><div class=\"md\"><p>I know there’s no crystal ball but what can we expect next week if/when we find out we’re all moon bound? Will we take off immediately? Will we dip? Will our accounts have phone numbers right away or will it take days/weeks to rocket. It’s a fair question and I’d love to hear some opinions. \nSigned,\nAn old fart that has been clutching his shares since the beginning of time.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]