[{"username": "directedbymichael", "url": "https://i.redd.it/p7faybendxmb1.jpg", "time": 1694132476.0, "subreddit": "r/ThePPShow", "title": "Pulte on RC and the Teddy trademarks (when he came on The PP Show). Couldn't agree more!", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/p7faybendxmb1.jpg\"/></div>"},
{"username": "directedbymichael", "url": "https://www.reddit.com/r/ThePPShow/comments/15dcnxk/what_was_the_picture_that_pp_said_he_was_going_to/", "time": 1690692961.0, "subreddit": "r/ThePPShow", "title": "What was the picture that PP said he was going to share on the show last night? I was watching but got too tired and went to bed.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Anyone know? He said it was tinfoil and he was hyped. Was just curious. Thanks in advance.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "directedbymichael", "url": "https://www.reddit.com/r/ThePPShow/comments/14sfw69/genuine_question/", "time": 1688664390, "subreddit": "r/ThePPShow", "title": "Genuine Question", "text": "Watched the show last night for the first time. Really solid group and fun to listen to you guys. Looking forward to seeing Pulte on there someday. Definitely get some DFV vibes.\n\nAfter listening to David and some of the back and forth, though, I'm left with a question I'm hoping someone can help me with. How do we know that an all cash deal can't preserve enough shareholder value or shareholder ownership (to carry over NOLs)? Is it because an all cash deal means the stock ceases to exist? Whoopass has been one of my favorite writers on this journey, so I get what he is saying, but not sure I fully understand the why.\n\nJust trying to find the same confidence in an up and coming cash plus equity transaction (like you guys seem to have), but need to understand why no other transaction type maintains at least the 50% ownership required to carry NOLs forward.\n\nI guess another way to ask the question is, are there any avenues that an all cash buyout deal COULD carry NOLs forward?\n\nHappy to delete once I get an answer. Thanks.", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]