[{"username": "Dom_Hasmann", "url": "https://i.redd.it/0r0v2dfrlkwb1.jpg", "time": 1698336296.0, "subreddit": "r/ThePPShow", "title": "For everybody using etoro", "text": "<!-- SC_OFF --><div class=\"md\"><p>This should calm everybody using etoro since There is a lot of drama and shills atacking it. </p>\n\n<p>Got this few hours ago i Hope the etoro apes Will sleep well tonight.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/0r0v2dfrlkwb1.jpg\"/></div>"},
{"username": "Dom_Hasmann", "url": "https://www.reddit.com/r/ThePPShow/comments/17ch6ep/dark_times/", "time": 1697824282.0, "subreddit": "r/ThePPShow", "title": "Dark Times", "text": "<!-- SC_OFF --><div class=\"md\"><p>I am Just glad, That during this dark Times we have a Light bringer in the form of PP a the guys. There were a few Times i wanted to give up on my Dreams since August 2022. I did not sell i did buy more NFA and a heleď through everything. </p>\n\n<p>I would like to thank all the guys doing the work that brings us Light and a Smile. Thank you PP for creating a safe space for us and that you did being so many great People together. </p>\n\n<p>I feel like its time for this lift off, thats why i wanted to thank you now before we will have celebrations on our minds. </p>\n\n<p>Kind regards\nDom</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Dom_Hasmann", "url": "https://www.reddit.com/r/ThePPShow/comments/17b2bdn/etoro_shares_still_in_there/", "time": 1697665583.0, "subreddit": "r/ThePPShow", "title": "Etoro shares still in There.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was worried that etoro was a bad actor. But i am surprised my shares are still There.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Dom_Hasmann", "url": "https://www.reddit.com/r/ThePPShow/comments/14ye4ez/all_eyes_on_bbbyq/", "time": 1689233894.0, "subreddit": "r/ThePPShow", "title": "All eyes on bbbyq", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys, i don&#39;t write DD&#39;s because of time issues (life happening and shit like that) but i have a feeling like we and bbby is in the midle and everybody looking at us like they know what is going to happen. All the companies waking up and teasing us. And i don&#39;t mean it in a bad way. Its more like they now a revolution and a fight against SHF is About to be won.</p>\n\n<p>I am starting to think that all those breadcrumbs were meant for us to stay in. We might not like amc but i believe amc is in this play in one way or another too or atleast it Will be. </p>\n\n<p>For example... Pulte i love him He bought a whole new aspect to the play and a lot of People started to Come out and want to help other with the money that comes out of this (NFA) why Would He go around but not ppshow? Everybody keeps distance from Bobby for a reason. The community needs to Come together. </p>\n\n<p>I am not a speaker, my grammar sucks and i am not a expert at all. I am in this since August, i did buy all the dips, i went through a very difficult time during the bigest FUD called otc. And i held. We need someone like pp and we should apreciate him for what He is doing. </p>\n\n<p>I have so much on my mind that needs to be Said but it Would be a mess. Simply People need to leave their ego behind and start work together..  There Will be a lot of rich People and my plán is to help those activists clear house and i plán to build my company too... But There should be and open mindeed community that is actualy working together instead of infighting and trying to up one another... Cooperation... If There Will be more People involved in the rescue od bbby... Why cant we do the same? Why Would pulte go around and preach? People need to start to listen and work together..  Then we can move mountains... </p>\n\n<p>Its a shit post but pp you are doing well grow this community properly because after this There Will be more work to be done and a strong community can do a lot....</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Dom_Hasmann", "url": "https://www.reddit.com/r/ThePPShow/comments/14wk7kk/markenzeichen_fur_teddy_in_deutchland/", "time": 1689060648.0, "subreddit": "r/ThePPShow", "title": "Markenzeichen fur teddy in deutchland.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ich suche jemanden der mír hilf ein trademark fur teddy zu finden. Wen ich sah das teddy in spanien und englas registriert wurde, konte es sein das auch in deutchland ein markenzeichen registriert wurde. </p>\n\n<p>Weil ich nicht deutch bin sonder aus tschechien komme also halb.... Weiss ich nicht wo ich suchen sollte. </p>\n\n<p>I am looking for someone from germany to help mě find a possible teddy trademark in deutchland. I saw the trademark fur spain and great britain and i am wondering if There Would be a german one too... I mean... Looks like teddy want to go international which is logical. Also i am thinking... Is it enough to register a trademark in one of the EU nations to trade with the EU? And in that čase why spain. 😆</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Dom_Hasmann", "url": "https://www.reddit.com/r/ThePPShow/comments/135kwg0/etoro_transfer/", "time": 1683033297.0, "subreddit": "r/ThePPShow", "title": "Etoro transfer", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys, so, etoro is saying we get delisted tomorrow. In case they force close my positions. I am looking for a broker to buy in with what is left. I think There is no chance for me to miss out... Neither moon or bust NFA. </p>\n\n<p>What broker should i as an europoor buy Back in?</p>\n\n<p>Bc etoro looks like they don&#39;t Care if it is suspension or delisting they will propadly trest it the same way.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]