[{"username": "DopestDope__", "url": "https://www.reddit.com/r/ThePPShow/comments/16st6w5/calling_it_now_tinfoil_theory/", "time": 1695747026.0, "subreddit": "r/ThePPShow", "title": "Calling it Now!!! Tinfoil Theory", "text": "<!-- SC_OFF --><div class=\"md\"><p>After watching the latest and greatest PP show featuring Bill Pulte it all clicked to me on why Bill Pulte is such a fan of PP and KAIS MAALEJ.</p>\n\n<p>If you haven&#39;t heard by now Elon Musk plans on transforming X formerly known as Twitter into a super app. Bill Pulte invested in X. Some ideas/features I think Elon is going to implement are pretty genius.</p>\n\n<ol>\n<li>You will be able to buy stock on X, all these purchases will have an option to DRS seamlessly and easily. i.e blockchain a.k.a loopring.</li>\n<li>After buying whatever stock you will have channels/categories to *blank* stock. These categories will include Official Company Filings, News Articles, AND A COMMUNITY CHANNEL. (You will find The PP show there)</li>\n</ol>\n\n<p>Here is where KAIS MAALEJ comes in. He will not be part of The PP Show unfortunately but off to bigger and greater things for himself.</p>\n\n<p>KAIS MAALEJ will be X&#39;s new stock news reporter. He will dig in deep and dirty and get the real news while providing comedic relief. Like come on, wasn&#39;t his latest Jim Cramer video the absolute nuts? Bill Pulte told him to trademark his name....I wonder why? He keeps saying &quot;Kaaaaisss Maaleeejjjj, I love that name.&quot; *I see talent in him as a news reporter/tv personality personally*</p>\n\n<p>Bill Pulte is a very smart man. He see&#39;s the power and potential of The PP Show and what it could become.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "DopestDope__", "url": "https://www.reddit.com/r/ThePPShow/comments/16pioyp/tinfoil_theory_about_the_latest_citadel_fine/", "time": 1695409990.0, "subreddit": "r/ThePPShow", "title": "Tinfoil Theory about the latest Citadel fine", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey pp&#39;s,  </p>\n\n<p>Ever since reading famous variety&#39;s dd how this could potentially be a sting operation it got me thinking about the latest charge to Citadel for marking short sales as long for 10 years (which is basically cooking the books). They got charged $7 million....yeah I know right cost of doing business. But what if this time it is different? By paying the fine they admitted to basically being guilty. Could this not come back to bite them later on in the actual MOASS court case against them? Could the SEC be building a stronger case against them by doing this?  </p>\n\n<p>I could be totally wrong but just a thought I had. Anyway, let&#39;s see what comes Monday! I wanna see that big PP.   </p>\n\n<p>*side tinfoil hopium* </p>\n\n<p>RC jumps out of the closet during Monday&#39;s stream  </p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "DopestDope__", "url": "https://www.reddit.com/r/ThePPShow/comments/16imqf4/borrow_fee_grift/", "time": 1694708523.0, "subreddit": "r/ThePPShow", "title": "Borrow fee grift", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey fellow pps, </p>\n\n<p>I have uncovered something that I think many are unaware of.</p>\n\n<p>A few months ago I decided to lend out my portfolio to take advantage of the high borrow fees related to meme stocks.</p>\n\n<p>After looking at my statement I realized my broker was lending my shares for a 0% loan rate. WAIT WHAT?! Yes, you heard that right 0%. So I contacted my broker to find out why (wealth simple).</p>\n\n<p>Finally after a couple weeks I have gotten the answer.</p>\n\n<p>These scum bag brokers are circumventing the high borrow fees for their stupid SHF friends by INSTEAD lending out your shares for a SET percentage of the posted collateral the borrower gave. Which for me was 1%…..</p>\n\n<p>Just another grift I thought I would pass on. Seems like it doesn’t matter if the borrow fee is high, they will find a way not to pay it.</p>\n\n<p>Ps: broker was wealth simple</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]