[{"username": "Educational_Limit308", "url": "https://i.redd.it/k8z8fx6aklyb1.jpg", "time": 1699219602.0, "subreddit": "r/ThePPShow", "title": "Pulte hosting a pre-party in NYC on Tuesday?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/k8z8fx6aklyb1.jpg\"/></div>"},
{"username": "Educational_Limit308", "url": "https://www.reddit.com/r/ThePPShow/comments/16zqcdu/if_the_bear_thesis_is_true/", "time": 1696433614.0, "subreddit": "r/ThePPShow", "title": "If the bear thesis is true…", "text": "<!-- SC_OFF --><div class=\"md\"><p>So if the bear thesis is true and shorts won, shouldn’t that be verified at market close today? With a T-2 settlement, all shorts should get zeroed out and all their positions closed today, correct? </p>\n\n<p>If they don’t, well…..</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Educational_Limit308", "url": "https://www.reddit.com/gallery/16x8fxg", "time": 1696184303.0, "subreddit": "r/ThePPShow", "title": "Some Sunday tinfoil for you Regards", "text": "<!-- SC_OFF --><div class=\"md\"><p>As I was sitting on my lawnmower this afternoon, I was thinking back through some of RC’s tweets. He told us every detail matters and it’s obvious he has been dropping clues in his tweets and Teddy books.</p>\n\n<p>The one tweet that has been on my mind a lot lately has been the thumb war with Warren Buffett tweet.</p>\n\n<p>What if, and hear me out here, he’s suggesting that he might challenge the Berkshire Hathaway stock price? What if, whatever this new company is that we will be getting, can challenge $BRK as the highest priced stock on the market? </p>\n\n<p>I don’t know about you, but I’m willing to fuck around and find out. $531,000 is not a meme! See you all in Valhalla!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/nyIz8OeXrWAqoYLNUGZ5IeUvnZxQW4peyq8J4W6Cz00.jpg\"/></div>"},
{"username": "Educational_Limit308", "url": "https://i.redd.it/puq5v45votnb1.jpg", "time": 1694523670.0, "subreddit": "r/ThePPShow", "title": "Welcome to the Revolution!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/puq5v45votnb1.jpg\"/></div>"},
{"username": "Educational_Limit308", "url": "https://i.redd.it/psdhzbkcdalb1.jpg", "time": 1693418216.0, "subreddit": "r/ThePPShow", "title": "Just going to leave this standing order right here. If they drop the price to $0.15, I will own 1,000,000 shares. If not, I'm content with my current investment.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/psdhzbkcdalb1.jpg\"/></div>"},
{"username": "Educational_Limit308", "url": "https://www.reddit.com/r/ThePPShow/comments/15vu20l/why_did_you_just_set_70k_on_fire_buying_the_stock/", "time": 1692485155.0, "subreddit": "r/ThePPShow", "title": "“Why did you just set $70K on fire buying the stock of a bankrupt company?”", "text": "<!-- SC_OFF --><div class=\"md\"><p>So on Monday I increased my holdings from 50K+ to 325K+. Since then I have gotten no less than 10 DMs asking why. Most clearly have a nefarious intent in reaching out, but a few were genuinely interested in why I am so confident in this play. After much dialogue, I thought it might be best to just share my confidence as a post.</p>\n\n<p>While I enjoy reading all the great DD and investigative inquires you apes put together, my confidence is held solely in Ryan Cohen. “Wait, what? RyAn SoLD aNd LeFt ApEs HoLdInG tHe BaG!” Or you can fill in the response with your favorite doomer “Ryan is out” comment. While the sockets seem to be a bit contradictory, I am still 100% confident even if he did sell. But why? Great question…let’s discuss it.</p>\n\n<p>First and foremost, I enjoy studying people. I have worked in sales for nearly 30 years, so it’s my job to discover what makes people tick. Why do they do what they do? What motivates them? You see, behavior is driven by desire - so it stands to reason that if you want to know why Ryan does what he does, you need to understand his motivation.</p>\n\n<p>Okay, so let’s look at the PuMp AnD dUmP he is accused of. First off, Ryan is not a dumb guy. He knew that with his strong base of GME investors, if he bought a substantial stake in BBBY, many apes would follow. And we did in large numbers. Many mirrored his January 23 options, even to the tune of $80 strikes (guilty myself). </p>\n\n<p>So let’s say he did change his mind and sell off everything and leave BBBY and all interest behind. In the process he made about $110M, leaving his followers holding the bag. Not a bad payday, huh? Even for a billionaire. We know have the perfect narrative to turn the apes against their fearless leader. </p>\n\n<p>But not so fast, now let’s talk about Ryan’s motivation. Why did he do that? While there are certainly some ruthless billionaires out there, this behavior doesn’t match his character. If money was his motivation, why work for free? Why call out others that make money at the expense of retail to only do it yourself? </p>\n\n<p>The truth is that Ryan doesn’t need $110M. He could buy a secluded mansion somewhere and never work another day of his life. He has all the money he could ever need. What motivates Ryan is his legacy. This is clear in his communication, his actions, and what he is building in the memory of his father. Why in the world would he take the black eye this would leave over money he doesn’t need. Even at worst, he could have dropped $12M at the auction and got a piece of BuyBuyBaby to bail out his reputation. That’s a small price to pay when you got $110M and left your legion holding the bag.</p>\n\n<p>That is why I am 100% confident in this play. Ryan isn’t out. It’s against his nature and would be a black stain on his legacy…one that he is building in the memory of his father. Now couple that with another billionaire <a href=\"/u/pulte\">u/pulte</a> who has also tied himself to this play by coming on the PP Show and you’ve got two that are staking their reputations on BBBY. Pulte could have easily continued to support and praise Ryan through GME, but he purposely came to us, knowing that would now tie his name and his great family legacy to BBBY. You don’t do that unless you’re confident in the end game. And that my fellow apes, is why I am. See you in Valhalla!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]