[{"username": "elfonziemero", "url": "https://i.redd.it/jfpd2idubnrb1.jpg", "time": 1696190041.0, "subreddit": "r/ThePPShow", "title": "Saw this. Who knows? Leaving it here at face value.", "text": "<!-- SC_OFF --><div class=\"md\"><p>New Tesla spotting. Texas plates. Who da fuck knows.  Space X.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/jfpd2idubnrb1.jpg\"/></div>"},
{"username": "elfonziemero", "url": "https://www.reddit.com/r/ThePPShow/comments/16wdcuf/we_did_not_lose_no_matter_what_happens_next_we/", "time": 1696096737.0, "subreddit": "r/ThePPShow", "title": "We Did Not Lose. No Matter What Happens Next. We. Did. Not. Lose.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have some words for those that insist it’s actually “Game Over” To those spreaders of hate and fear-mongering, and especially to those that laugh at us and ridicule us for still believing today, I say this: </p>\n\n<p>Was this Chapter 7? No. Listen to any of the hearings? Nope again. I did. Judge clearly stated that this WAS NOT A LIQUIDATION.  This is/was at all times a reorganization, thus the uncommon expediency of the process. </p>\n\n<p>Are the old shares worthless as to BBBYQ? Absolutely. Do the shares evaporate into some abyss? Nope. They will sit on the expert market under the new name, possibly forever, or…until some entity affiliated with 2023930-DK-Butterfly-1 does. </p>\n\n<p>Some entity may like to have those 1.5-2 billion in NOLs. Maybe not. My guess is yes. The sheer amount of work that has gone into this lighting-speed bankruptcy screams yes. </p>\n\n<p>Some of us don’t and didn’t mind a zero occurrence here—it was always a possibility. Still is. When we say “zero or hero,” we actually mean it. Those of you that can’t fathom that notion aren’t our kind of people anyway, so basically, fuck you for being the very type that would lick Kenny and Doug’s ballsack.  That’s on you for not having integrity or purpose and your value as a person is wholly dependent on money—and ironically, most of you that fit this mold are probably broke yourselves. </p>\n\n<p>However, a deep read of the filings, taken with the hearings, circumstantial evidence, and perhaps enough craziness, virtue, and fucking bravery to be truly meritorious of a positive outcome when everyone else laughed, indicates something more may still be at play. That window is not closed, despite what you think to be true by taking one final filing at face value and without a comprehensive understanding of the bankruptcy laws that to this date still allow for a non-BBBYQ entity to do whatever the fuck they want within those constructs. </p>\n\n<p>You may wonder why. That’s ok. Not every CEO/Wall Street type is cut from the same dubious cloth. In fact, those that are not, and have the requisite ounce of benevolence in them and a desire for more fair markets for everyday people have likely come to realize they can still profit hugely from doing the right thing and at the same time reclaiming money that was stolen via market manipulation. That’s above your pay grade, Mr. Naysayer/keyboard ninja/paid troll/sorry excuse for a human being that takes pleasure in squashing other’s hopes and dreams whether they come to fruition or not. </p>\n\n<p>Some of us, most of us, are fine with the outcome no matter what. Truly getting nothing will sting, no doubt, but those of us that held gained so much more that money can’t buy and we do not care if you “get it” or not. You aren’t like us. You’re a miserable, soulless bitch (who laughs at others that may have lost life savings??). </p>\n\n<p>You may be thanking us later, actually, little bitches. Those that fucking stood for something in the face of mountainous obstacles should be respected given the odds. But we don’t fucking need your respect, just as much as we don’t need your attacks and fake pity. </p>\n\n<p>That said…Let’s fucking squeeze this bitch. 🍆🍉🚀☘️🍉🚀🍆🍉☘️🦋🦋🦋🦋🦋</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "elfonziemero", "url": "https://www.reddit.com/gallery/16mfe7z", "time": 1695095484.0, "subreddit": "r/ThePPShow", "title": "DTC Underwriting Alert! DTC reminds folks of rules around Citadel Finance LLC's $600,000,000 3.375% Senior Notes due 2026: 'If you buy these notes, you can only sell or transfer them to another qualified buyer and you have to let them know about these rules.' (my paraphrasing)", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.redditstatic.com/desktop2x/img/renderTimingPixel.png\"/></div>"},
{"username": "elfonziemero", "url": "https://i.redd.it/lzzqs22e2zhb1.jpg", "time": 1691973669.0, "subreddit": "r/ThePPShow", "title": "Leaving Vegas and GMerica convention just starting at the Venetian. Nice.", "text": "<!-- SC_OFF --><div class=\"md\"><p>According to the manager, “they just got here and are celebrating something tomorrow. The convention area is full of Mario and Barbie stuff. They are pumped. All the GameStop managers and leadership from all over are here.”</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/lzzqs22e2zhb1.jpg\"/></div>"},
{"username": "elfonziemero", "url": "https://i.redd.it/dpry7yv8zoza1.jpg", "time": 1684006273.0, "subreddit": "r/ThePPShow", "title": "This dude fucks. He is also giving money away again, in SEPARATE news", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dpry7yv8zoza1.jpg\"/></div>"}]