[{"username": "elhamm1", "url": "https://i.redd.it/qq8q04kjpksb1.jpg", "time": 1696594175.0, "subreddit": "r/ThePPShow", "title": "There will be no liquidation od BBBYQ share on Revolut", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have share with them a complaint and they changed their stand l!! Congratulations guys and see you on the moon !!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/qq8q04kjpksb1.jpg\"/></div>"},
{"username": "elhamm1", "url": "https://www.reddit.com/r/ThePPShow/comments/16x6dt0/for_you_you_made_it_to_the_end_line_cheers/", "time": 1696179554.0, "subreddit": "r/ThePPShow", "title": "For you!! You made it to the end line!! Cheers!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Feeling Anxious and sleepless.. Thinking about the opportunities and decisions you habe made.. You try to sleep thinking why&#39;s?? You Are ME !!\nSensing the disappointment you&#39;re grappling with, someone who wholeheartedly believed in fair markets and honest play. It&#39;s disheartening to witness the actions of those who&#39;ve turned this belief upside down through deceit and trickery. You placed your trust in a system, only to be let down by individuals employing dishonest tactics and shenanigans. Your ideals were trampled upon, and it&#39;s a bitter pill to swallow. Remember, your commitment to fairness and decency remains a testament to your integrity. Despite the deceit, your belief in a just world shines through. Hold on to that belief and keep fighting for what&#39;s right—your perseverance will be the beacon of hope for genuine change. 🌟\nCheers to all of you.. those who believe we won and those who believe we were let down.. Either it was the ride of my life !!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]