[{"username": "emeterio_o", "url": "https://www.reddit.com/r/ThePPShow/comments/16wzobh/lets_talk_about_internal_revenue_code_section_382/", "time": 1696162737.0, "subreddit": "r/ThePPShow", "title": "Let’s talk about Internal Revenue Code Section 382 and how it relates to BBBYQ -&gt; Butterfly", "text": "<!-- SC_OFF --><div class=\"md\"><p>From my discussion with ChatGPT:</p>\n\n<p>When a company undergoes significant financial distress, it often accumulates net operating losses (NOLs), which can be valuable assets. NOLs can offset future taxable income, potentially reducing future tax liabilities. However, the Internal Revenue Service (IRS) has implemented rules to prevent the trafficking of these NOLs, primarily through Internal Revenue Code (IRC) Section 382.</p>\n\n<p><strong>What is Section 382?</strong></p>\n\n<p>Section 382 exists to prevent companies with NOLs from being purchased primarily for their tax attributes. In essence, it limits the amount of post-change taxable income that can be offset by pre-change NOLs after an &quot;ownership change.&quot;</p>\n\n<p>An &quot;ownership change&quot; under Section 382 is a technical term. It occurs when the stock ownership of one or more &quot;5% shareholders&quot; increases by more than 50 percentage points over a specified testing period, typically three years. It&#39;s not just outright purchases of stock that count; indirect shifts in ownership, like stock redemptions, can also trigger an ownership change.</p>\n\n<p>If an ownership change occurs, the annual use of NOLs becomes restricted. The new limit is generally the value of the company (right before the ownership change) multiplied by the long-term tax-exempt rate (published monthly by the IRS). This rate is often quite low, so the resulting NOL limitation can be a fraction of the company&#39;s actual NOLs.</p>\n\n<p><strong>Bankruptcy and NOLs</strong></p>\n\n<p>Interestingly, there&#39;s a special exception for companies in Chapter 11 bankruptcy. Under this exception, the usual Section 382 limitations may not apply, provided the company&#39;s old shareholders and creditors end up owning at least 50% of the company&#39;s stock after reorganization. This helps struggling companies maintain the value of their NOLs post-bankruptcy.</p>\n\n<p><strong>Redeeming Shareholder Shares</strong></p>\n\n<p>If you&#39;re considering canceling or redeeming shareholder shares, especially with the intention of preserving NOLs, be cautious. Such actions can alter the ownership structure enough to trigger an ownership change under Section 382, thereby limiting the future use of NOLs.</p>\n\n<p>Before making such decisions, it&#39;s crucial to perform an in-depth analysis of past ownership shifts to ensure that redeeming shares won&#39;t unintentionally trigger Section 382 limitations.</p>\n\n<p><strong>Key Takeaways</strong></p>\n\n<ol>\n<li><p><strong>Value of NOLs</strong>: NOLs can significantly reduce future tax liabilities, making them valuable assets, especially for companies undergoing financial restructuring or recovery.</p></li>\n<li><p><strong>Section 382&#39;s Purpose</strong>: This provision prevents &quot;NOL trafficking,&quot; where companies are bought primarily for their NOLs. It imposes limitations on NOL usage after substantial ownership changes.</p></li>\n<li><p><strong>Ownership Change</strong>: Stock transactions, including redemptions or cancellations of shares, can trigger ownership changes. It&#39;s vital to be aware of the cumulative shifts in ownership to avoid unintended NOL limitations.</p></li>\n<li><p><strong>Planning and Professional Advice</strong>: Given the potential value of NOLs and the intricacy of Section 382, companies should engage tax professionals to navigate these waters. Whether contemplating mergers, acquisitions, or significant stock transactions, a clear understanding of Section 382 implications is paramount.</p></li>\n</ol>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]