[{"username": "Epohhh", "url": "https://i.redd.it/yfwhre852yib1.jpg", "time": 1692397324.0, "subreddit": "r/ThePPShow", "title": "Etoro allows you to short BBBY again and they had this disabled for over a year atleast", "text": "<!-- SC_OFF --><div class=\"md\"><p>The odd thing is why would they keep it disabled for over a year and enable this option now?</p>\n\n<p>Since FUD is spread and fed everywhere, wouldn&#39;t it have been much wiser keeping that option enabled and use investors to drive it further down or atleast put some extra pressure on it via FUD?</p>\n\n<p>The timing is kinda suspicious and im pretty sure they wouldn’t just enable it now, and let everyone profit from shorting this guaranteed no brainer.\nBrokeragers aren&#39;t really known to be that <em>good hearted</em></p>\n\n<p>One of many guesses are, they are somewhat in the dark like us, uncertain about the ultimate outcome of this and therefore cautiously kept it disabled just in case some big news are coming out of the blue causing a MOASS and billions of losses.</p>\n\n<p>Or another nothingburger, do with it what you want 🌚</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/yfwhre852yib1.jpg\"/></div>"},
{"username": "Epohhh", "url": "https://i.redd.it/mdk1r90so6gb1.jpg", "time": 1691194246.0, "subreddit": "r/ThePPShow", "title": "I asked ChatGPT what happens when a stock is shorted over 100% and there is an share recall announcement", "text": "<!-- SC_OFF --><div class=\"md\"><p>Given the fact that there are probably more synthetic shares outside and in positions, than humans on earth by now, its safe to say that BBBYQ, is definitely shorted more than 100% (probably a lot more lol) </p>\n\n<p>So, as ChatGPT said above, some positive announcements COMBINED with a reason for a Share recall is basically all thats needed, to light the rocket that sends this stock to not only to Uranus, but also in light speed, as soon as the big bang hits. Good News alone would be enough, combined with a share recall is what everyone would probably a MOASS</p>\n\n<p>Stay tuned!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mdk1r90so6gb1.jpg\"/></div>"}]