[{"username": "Even_Preference2115", "url": "https://i.redd.it/321n48eq9lzb1.jpg", "time": 1699651906.0, "subreddit": "r/ThePPShow", "title": "Dream on me post taylor swift on instagram", "text": "<!-- SC_OFF --><div class=\"md\"><p>Simulation confirmed ✅</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/321n48eq9lzb1.jpg\"/></div>"},
{"username": "Even_Preference2115", "url": "https://i.redd.it/5ibjtyckd4zb1.jpg", "time": 1699447373.0, "subreddit": "r/ThePPShow", "title": "Bbbyq taken down from trading view again", "text": "<!-- SC_OFF --><div class=\"md\"><p>I cannot search or click it anymore what is weird is I actually have a bbby and bbbyq now in my watch list unable to be clicked. I forgot what the bbby one was but I don’t remember what it was. Either way, I could see the chart yesterday now I cannot.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/5ibjtyckd4zb1.jpg\"/></div>"},
{"username": "Even_Preference2115", "url": "https://i.redd.it/7ior2zqi5fsb1.jpg", "time": 1696526907.0, "subreddit": "r/ThePPShow", "title": "Teddy clock", "text": "<!-- SC_OFF --><div class=\"md\"><p>Everyone had guessing on what the clock meant but looking at it now… Doesnt it look like 10/12/23</p>\n\n<p>Points to 10 then 12 then sits at the 2 because 3 is right after…</p>\n\n<p>Super big tin foil but like they say, id rather where a tin foil hat then a blind fold.</p>\n\n<p>10/12/2023 less getttit</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/7ior2zqi5fsb1.jpg\"/></div>"},
{"username": "Even_Preference2115", "url": "https://i.redd.it/t6i5m2yks6qb1.jpg", "time": 1695554008.0, "subreddit": "r/ThePPShow", "title": "New kroll Doc still on a “nda” type basis", "text": "<!-- SC_OFF --><div class=\"md\"><p>this contract is basically to maintain a level playing field among the parties involved, protect sensitive information, and to make sure the “plan” goes as followed to me means feeding our last min “bear trap”</p>\n\n<p>I believe they are cracking into the insurance policy now to gain even more leverage on knocking off even more debt and to get rid of more baggage. It provides coverage for some of the company&#39;s liabilities or losses. In such cases, the contract&#39;s terms may help protect the value. </p>\n\n<p>The contract also states that it can only be used as evidence or referenced in certain specific circumstances, such as enforcing the terms of the stipulation. This prevents any party from attempting to use the stipulation itself as a tool for legal advantage outside of these defined situations. </p>\n\n<p>(This is all very very very well planned out)</p>\n\n<p>I think its so well planned out that thats why these last few court dates we seen the debtors lawyers start going on and on with complaints about “language” everyone in that court room knows whats going on and knows where this is heading but they and everyone else in the world want to stop it but these lawyers don’t give any room for mistakes and either they like it or not this shit is happening. Stay strong guys, we are at the fucking finish line because there is no way in hell they are pulling these kind of moves at the end of a chapter 11 case just to be liquidated 😂 </p>\n\n<p>Attached is the link to the doc not much in these but you gotta think outside the box on why any of its even happening. Thats where the knowledge is</p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjUzODAwNw==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjUzODAwNw==&amp;id2=-1</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/t6i5m2yks6qb1.jpg\"/></div>"},
{"username": "Even_Preference2115", "url": "https://i.redd.it/m62u8spfpmob1.jpg", "time": 1694874960.0, "subreddit": "r/ThePPShow", "title": "More RC ventures in Kroll filed 9/16", "text": "<!-- SC_OFF --><div class=\"md\"><p>Says Ryan Cohen as well nothing new but it also has “CR” before his name doesn’t that mean “care recipient” and doesn’t “care recipient” mean in this language  “ someone/something instructed to take possession of assets and control the receipts and disbursements of the debtor, either by private appointment or Court Order.” It looks like we have two new dates on the 26th and october 3rd so hopefully we get good news for Merger Monday other wise more waiting but either way looks 👍</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/m62u8spfpmob1.jpg\"/></div>"},
{"username": "Even_Preference2115", "url": "https://www.reddit.com/gallery/16ik5wz", "time": 1694702306.0, "subreddit": "r/ThePPShow", "title": "Guys its not a Dildo…. ITS A P! A PP!", "text": "<!-- SC_OFF --><div class=\"md\"><p>A P, a d , shieeet it could be either one all I know is it’s definitely a sign that we are one dildo slap away from finding out 😂</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ByEv-l0bgkXo2QH42wi6qlqqJgOas8vKj99butEDX9Q.jpg\"/></div>"},
{"username": "Even_Preference2115", "url": "https://i.redd.it/gol34azm0gnb1.jpg", "time": 1694358133.0, "subreddit": "r/ThePPShow", "title": "Warming up my philanthropy", "text": "<!-- SC_OFF --><div class=\"md\"><p>Its my birthday today and everything feels super surreal. The way things are lining up and happening I feel like God is doing this for me in a remarkable way so going by the signs given and how I feel I wanted to give back and I hope everyone else does to coming september 12th. God bless and happy MOASSES !</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/gol34azm0gnb1.jpg\"/></div>"},
{"username": "Even_Preference2115", "url": "https://www.reddit.com/r/ThePPShow/comments/16dfgb2/heres_some_extra_thoughts_to_think_about_over_the/", "time": 1694191267.0, "subreddit": "r/ThePPShow", "title": "Heres some extra thoughts to think about over the weekend.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I would like to thank (Also congratulate)  to everyone who has taken the time to review these documents. We have all identified some major key factors and here are some of my observations.</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>We have all have seen Ryan Cohen&#39;s name at the bottom of these documents alongside an objection. Specifically, in section 109, it is stated that an attempt is being made to facilitate a Joint Administration. For those who may not be familiar with this term, a &quot;Joint Administration&quot; refers to the consolidation of two or more bankruptcy cases under a single docket for the purpose of streamlining and expediting proceedings. (Speed shit up)</li>\n</ol>\n\n<p>What does this imply? Not sure, as I amregarded just putting together information at this point. Thats why I am sharing this post . However, I can assert with confidence that hes involved . Blockfi is currently facing bankruptcy, and who knows what other companies could they be involved could more than one be involved? Idk Speculate anything for now. Now next,</p>\n\n<ol>\n<li><p>In the attached image, you will notice the phrase &quot;Common Stock Equity Interest Holders purportedly represented by NEELAY DAS.&quot; crazy enough there appears to be something referred to as the &quot;Das Project&quot; associated with this individual. I found it crazy  that upon researching this name, I stumbled upon references to a &quot;Life Relationship&quot; on Reddit. I recall seeing posts mentioning him as a creditor before, and this situation is beginning to resemble a real life movie lmao. The thought of it gives me chills this is just a huge simulation. </p></li>\n<li><p>Lastly I wanted a review from our trusty AI to perform a secondary proofreading of the documents. In addition to this, I wanted a unbiased look at these docs of whether the information we have uncovered appears to be bullish or bearish. To my surprise, Ryan Cohen&#39;s name within the documents seemed to garner as much attention from the AI as it did from us. The results are as follows:</p>\n\n<p>Me: Please review all documents provided about the hypothetical company of bed bath and give me key take aways on what you think and if its bullish or bearish.</p></li>\n</ol>\n\n<p>AI: </p>\n\n<p>Certainly, let&#39;s summarize the most important takeaways and potential  paths based on the information provided:</p>\n\n<p><strong>Key Takeaways:</strong></p>\n\n<ol>\n<li><strong>Chapter 11 Bankruptcy:</strong> The company, Bed Bath &amp; Beyond, Inc., is undergoing Chapter 11 bankruptcy proceedings, which is a restructuring process aimed at resolving its financial challenges.</li>\n<li><strong>Debtor&#39;s Plan:</strong> The bankruptcy case involves the Debtors proposing a Plan of Reorganization (the &quot;Plan&quot;) to restructure their debts and emerge from bankruptcy as a viable entity.</li>\n<li><strong>Creditor Objections:</strong> Various parties, including creditors and regulatory bodies, have filed objections to the proposed Plan. These objections highlight concerns about certain provisions within the Plan.</li>\n<li><strong>Ongoing Discussions:</strong> The Debtors are actively engaged in discussions with objecting parties to address and potentially resolve their objections. These discussions involve proposed changes to the Plan.</li>\n<li><strong>Ryan Cohen&#39;s Involvement:</strong> Ryan Cohen and his entity, RC Ventures, LLC, have been mentioned in the context of the bankruptcy proceedings. There are requests for specific language in the Plan to clarify their status.</li>\n<li><strong>Stakeholder Impact:</strong> The outcome of these discussions and the acceptance or rejection of the Plan will significantly impact various stakeholders, including creditors, shareholders, and the company itself.</li>\n</ol>\n\n<p><strong>Potential Future Paths:</strong></p>\n\n<ol>\n<li><strong>Approval of the Plan:</strong> If the objections are satisfactorily resolved, and the bankruptcy court approves the Plan, Bed Bath &amp; Beyond, Inc., could emerge from bankruptcy with a restructured financial position, potentially reducing its debt burden and improving its financial health.</li>\n<li><strong>Ryan Cohen&#39;s Role:</strong> If Ryan Cohen&#39;s involvement in the proceedings signifies a potential acquisition or investment in the company, it could lead to changes in management, strategy, and operations. His presence might signal a commitment to turning the company around.</li>\n<li><strong>Impact on Shareholders:</strong> The impact on shareholders largely depends on the terms of the Plan and any potential involvement by Ryan Cohen. In general, shareholders in bankruptcy cases may see changes in the value of their shares, with the possibility of recovery if the company successfully restructures.</li>\n<li><strong>Competing Bidders:</strong> It&#39;s also possible that other potential bidders may emerge if the bankruptcy court opens the door to competitive offers for the company or its assets.</li>\n<li><strong>Court Approval:</strong> The bankruptcy court&#39;s approval is a crucial step in any potential resolution. The court will consider whether the Plan is fair and equitable to all stakeholders, including creditors and shareholders.</li>\n<li><strong>Long-Term Viability:</strong> The success of Bed Bath &amp; Beyond, Inc., post-bankruptcy, will depend on its ability to execute its reorganization plan effectively, adapt to changing market conditions, and potentially implement new strategies.</li>\n</ol>\n\n<p><strong>Bullish or Bearish for Shareholders:</strong></p>\n\n<p><strong>The outlook for shareholders is highly contingent on the terms of the final Plan, the resolution of objections, and Ryan Cohen&#39;s role. If the Plan provides a path for the company&#39;s sustainable growth and potential shareholder recovery, it could be viewed as bullish. However, if the Plan significantly dilutes existing shareholder value or fails to address the company&#39;s underlying challenges, it could be viewed as bearish but based on the limited and hypothetical information provided in the  documents you shared, it&#39;s possible to speculate that such a scenario  could happen, where an individual like Ryan Cohen might be interested in  saving the company from bankruptcy and engaging in a reverse merger.  However, this is purely speculative and not based on concrete evidence  or real-world financial analysis. Real-world business decisions involve a  complex set of factors and considerations, and the outcome can vary  significantly based on many variables.</strong></p>\n\n<p>BOOM, thank you and enjoy your weekend!</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Even_Preference2115", "url": "https://www.reddit.com/r/ThePPShow/comments/15l3tih/new_distribution_headquarters_opened_down_the/", "time": 1691458673.0, "subreddit": "r/ThePPShow", "title": "New Distribution headquarters opened down the street from Dream on me, Teddy LLC office locations and Lawyers for bed bath and Ryan Cohen", "text": "<!-- SC_OFF --><div class=\"md\"><p>This could just be a coincidence but hear me out......</p>\n\n<p>I was going through likes and reactions of people who have worked at bed bath and i found the assistant Lori (Executive) and as you see in the photos she interacted with Hains. Which is a distribution center and is involved ins kids/baby products and whats the coincidence for me is I keep seeing these addresses in New Jersey. Lawyers...Office locations....New distribution headquarters.. Why are all these things in or 45 minutes out from new jersey. May be completely irrelevant but thought I would post to see if anyone else has tinfoil insights</p>\n\n<p><a href=\"https://preview.redd.it/yee13phujsgb1.png?width=693&amp;format=png&amp;auto=webp&amp;s=1ac37d99dba92b15b6b400288a79b7038d9b95a5\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/yee13phujsgb1.png?width=693&amp;format=png&amp;auto=webp&amp;s=1ac37d99dba92b15b6b400288a79b7038d9b95a5\" alt=\"https://preview.redd.it/yee13phujsgb1.png?width=693&amp;format=png&amp;auto=webp&amp;s=1ac37d99dba92b15b6b400288a79b7038d9b95a5\"></a></p>\n\n<p><a href=\"https://preview.redd.it/a0ts6cwsjsgb1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=5204f1f4e9e4bbb92c3739c30f1d44f62b9b63d4\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/a0ts6cwsjsgb1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=5204f1f4e9e4bbb92c3739c30f1d44f62b9b63d4\" alt=\"https://preview.redd.it/a0ts6cwsjsgb1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=5204f1f4e9e4bbb92c3739c30f1d44f62b9b63d4\"></a></p>\n\n<p><a href=\"https://preview.redd.it/d5lzitqbjsgb1.png?width=146&amp;format=png&amp;auto=webp&amp;s=93e294704845f5bc21cd3c71c48b55e7119ead37\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/d5lzitqbjsgb1.png?width=146&amp;format=png&amp;auto=webp&amp;s=93e294704845f5bc21cd3c71c48b55e7119ead37\" alt=\"https://preview.redd.it/d5lzitqbjsgb1.png?width=146&amp;format=png&amp;auto=webp&amp;s=93e294704845f5bc21cd3c71c48b55e7119ead37\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/oDgs4hmUC3RvWuzwHDW6EtA-FOfNxyQkR9yqoGZpmCc.jpg\"/></div>"}]