[{"username": "EveryDogeHasItsDay_", "url": "https://www.reddit.com/r/ThePPShow/comments/16kbglo/some_new_info_on_the_mystery_bahamas_caller_and/", "time": 1694881116.0, "subreddit": "r/ThePPShow", "title": "Some new info on the mystery \"Bahamas\" caller and other fresh tinfoil that ties in with other peoples thoughts and observations.....", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey Guys - this is my own TMB tinfoil - enjoy!</p>\n\n<p>&#x200B;</p>\n\n<p>Finally I get to use my skills for the community - I&#39;ve waited nearly three years to be of some use and today may just be that day.  On last nights show I heard for the first time the &quot;Bahamas&quot; mystery caller.  I have somehow never heard of this caller before.</p>\n\n<p>Anyway, I am a specialist in audio and in particular - voices. I won&#39;t say anymore because I don&#39;t want to dox myself (happy to confirm with PP or Mods though) but what I can tell you is that the voice that called in to the show and said &quot;you will own the Bahamas&quot; is almost certainly CARL FUCKING ICAHN. </p>\n\n<p>I ran some basic analysis of the waveforms.  I&#39;d be shocked if it&#39;s not him.</p>\n\n<p>The voice that appeared on the show is simply played slower and hence has a slightly deeper tone. The pronunciation,  timbre, phrasing and acoustic frequency nature of those two voices when played at the same speed is identical.   </p>\n\n<p>I also noticed  as has previously been observed that for a few seconds at 7.41 on the video they deliberately zoom in on the frame and ensure that the 147 time on the clock is exactly framed. That is not an accident, it is a deliberate video framing edit and It only happens once in the whole 55 minute video.   </p>\n\n<p>I believe that Bahamas in the background is telling us that it will be a Reverse Triangle Merger 741 - 147. What is in the Bahamas?  The Bermuda TRIANGLE.   </p>\n\n<p>Furthermore, In electronics an  IC 741 is a triangular shaped operational amplifier and they were used to perform mathematical operations like addition, subtraction, multiplication and integration. </p>\n\n<p>&#x200B;</p>\n\n<p>Love you guys - LFG!!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "EveryDogeHasItsDay_", "url": "https://www.reddit.com/r/ThePPShow/comments/16jdl4y/did_pulte_actually_tell_us_that_he_is_invested_in/", "time": 1694784817.0, "subreddit": "r/ThePPShow", "title": "Did Pulte actually tell us that he is invested in Teddy during his interview with PP?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was just rewatching the Pulte interview from a month ago and at 13:29 he says, whilst recounting some of his current investments, that he is invested in &quot;someone you will all know&quot;, &quot;who I think will be worth 100 billion someday&quot; but couldn&#39;t talk about it because he is under an NDA.  Surely that must be RC and Teddy? </p>\n\n<p>&#x200B;</p>\n\n<p>Has this already been discussed?</p>\n\n<p>&#x200B;</p>\n\n<p>LFG!!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "EveryDogeHasItsDay_", "url": "https://www.reddit.com/r/ThePPShow/comments/16h1617/im_sure_i_can_speak_for_many_people_here_when_i/", "time": 1694548361.0, "subreddit": "r/ThePPShow", "title": "I'm sure I can speak for many people here when I ask the question....", "text": "<!-- SC_OFF --><div class=\"md\"><p>What the fuck is going on?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "EveryDogeHasItsDay_", "url": "https://i.redd.it/yc8mk8g6znlb1.jpg", "time": 1693582832.0, "subreddit": "r/ThePPShow", "title": "18% Up and rising ............ Looks like the FOMO crowd are starting to gather. Welcome Apes, we've been expecting you!!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/yc8mk8g6znlb1.jpg\"/></div>"}]