[{"username": "Evil0w1", "url": "https://www.reddit.com/r/ThePPShow/comments/16dnqj1/aqusitiong_theory_gme_moves_into_mobile_gaming/", "time": 1694210622.0, "subreddit": "r/ThePPShow", "title": "Aqusitiong theory: GME moves into mobile gaming with the acquisition of an existing successful mobile game studio?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Usually just a lurker, but on the back of Pulte&#39;s thought exercise the other day, I&#39;ve come up with something that could have some serious potential.  </p>\n\n<p>There&#39;s a possible expansion route for businesses delivering a certain type of products where they expand into creating and delivering their own products as well.... the most relevent that springs to mind would be Netflix. </p>\n\n<p>This got me thinking, the next logical step for gme would be to create their own games. Which brought me to this list of gaming companies by marketcap: <a href=\"https://companiesmarketcap.com/video-games/largest-video-game-companies-by-market-cap/\">https://companiesmarketcap.com/video-games/largest-video-game-companies-by-market-cap/</a></p>\n\n<p>I haven&#39;t had any serious look through them for potential and I figured console game studios may be a bit too expensive, so a mobile game studio would be a better option. This would be the best route for gme break into the ofton overlooked mobile gaming market. This path would then also provide a launch pad for the release and development of Playr. This can then be expanded into the underlying crypto/NFT gaming marketplace and web3 expansion (when the world is ready for that!).</p>\n\n<p>The only affordable studio I recognised on quick glance, was 11 Bit Studios. They created Frost Punk for PC and I think went to consoles at a later date. It&#39;s a really good civ city builder game in a post apocoliptic ice age world, if you want to check it out... but the company has a marketcap of 400M, Revenue Q/Jun23: 9.99M, Net income: 1.55M..... so not so good an option. </p>\n\n<p>I havent looked too far because one caught my eye covered in tinfoil:</p>\n\n<p>iDreamSky</p>\n\n<p>This is a Chinese mobile game developer that has release many popular moblie games such as Temple Run, Fruit Ninja, Subway Surfers, Cookie Run, Doodle Jump, Brizzle, and Asphalt.</p>\n\n<p>Marketcap: 680M\nQ/Jun23: 560M\nNet Income: 20M\n(FYI: owned by iDreamSky Technology Holdings Ltd, marketcap:5.34B)</p>\n\n<p>IMO this would be the best direction for gme in terms of business expansion, with an acquisition on the cards. Gme is trying to get the leg up on on web3 gaming which is good for long term goals, but it has lacked in making any stride into the moblie gaming market thus far. This is the untapped market that gme has been missing out on and holds alot of future growth and expansion, especially with the NFT marketplace, Playr and crypto/NFT gaming future.</p>\n\n<p>Tinfoil on this is all of the breadcrums with China the sleeping giant, i - apple and all of the dreaming/DreamOnMe stuff, not sure if theres any sky breadcrums???...... was DOM always the wrong dream?!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]