[{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/17lpbsl/oak_street_investment_grade_net_lease_fund_listed/", "time": 1698880785.0, "subreddit": "r/ThePPShow", "title": "Oak Street Investment Grade Net Lease Fund Listed in Docket 2501 was attached to today's docket and shows up as having Swaps on about 270 mortgages.", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jcyt06uejtxb1.png?width=1863&amp;format=png&amp;auto=webp&amp;s=9ff87502f1c456550deca22128c40aaa9213c0f5\">This needs to be looked at more </a></p>\n\n<p>ABG-15G: <a href=\"https://www.sec.gov/Archives/edgar/data/1891837/000114036121037005/0001140361-21-037005-index.htm\">https://www.sec.gov/Archives/edgar/data/1891837/000114036121037005/0001140361-21-037005-index.htm</a></p>\n\n<p>Exhibit 1 on that page is from Deloitte. Also lots of NOV 5th and 19th 2021 Dates on this.</p>\n\n<p>Docket 2501 also lists Nordstrom and BLUE OWL REAL ESTATE LLC which bought Oak Street.</p>\n\n<p>&#x200B;</p>\n\n<p>PS. In Docket 10 Oak insurance company is also listed as an insurer for BBBY</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/fEC_FBI1hSx-Qem91P9WtWnSW1Ua9KnkKpFBgvu3qvg.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/177omfp/correction_docket_2455_proposed_granting_of/", "time": 1697287132.0, "subreddit": "r/ThePPShow", "title": "Correction: Docket 2455 PROPOSED Granting of Emergency Order.", "text": "<!-- SC_OFF --><div class=\"md\"><p>After rereading the docket it seems the order IS NOT YET GRANTED.</p>\n\n<p>I should have looked more closely, but after hearing the PPshows assesment of the filing I assumed that they had properly checked the facts.</p>\n\n<p>Pages 31-34 is the Proposed order and has not yet been signed as far as we can see from any filing.</p>\n\n<p>My 69 UNO Reversal theory does not change IF this order is approved in current or similar form. Filing it on a Friday was probably not too smart on Neelay&#39;s part though, in my opinion.</p>\n\n<p>There are other theories that may still hold true though, and all we can do is wait and see.</p>\n\n<p>I apologize for getting people&#39;s hopes up too early.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/177hkre/could_this_be_the_69_reversal_only_the_hung/", "time": 1697258502.0, "subreddit": "r/ThePPShow", "title": "Could this be the 69 REVERSAL? Only the Hung", "text": "<!-- SC_OFF --><div class=\"md\"><p>NFA, I smoke blue crayons out of tinfoil.</p>\n\n<p>Today is Friday the 13th and the start of the Swift movie. I think they hid the announcement so good even we didn&#39;t realize it dropped.</p>\n\n<p>&#x200B;</p>\n\n<p>The Emergency stay just undid the canceling of our shares just in time for the OCC options acceleration.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xbux5ghzi3ub1.png?width=919&amp;format=png&amp;auto=webp&amp;s=49a12350ed269c7d2e90ff775b70601d766f56d1\">AND they have to undo any actions taken since the 14th (such as canceling our shares)</a></p>\n\n<p>The options acceleration means you get paid out the STRIKE PRICE for your calls, making any price paid for our shares that is under $45 less than what they would owe for the most expensive options.</p>\n\n<p>So if they let our shares start trading again on the expert market I would expect them to try and buy up as many shares as possible, in the process driving a gamma ramp for every last option expiring on the 20th.</p>\n\n<p>This propels the stock price up to a minimum of $45 causing a squeeze for the 80m+ shorted shares currently out.</p>\n\n<p>&#x200B;</p>\n\n<p>As it stands right now there is ZERO liquidity because all buy/sell orders have been removed so as soon as trading resumes there will be very few shares if any available to control price movement. If I am correct this is gonna be a VIOLENT squeeze.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>$420,741.69 is NOT A MEME</strong></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/xmNc8r8xDOJn02aWAKlr1aXXPd87OJhkJwK_nh9VDzE.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://i.redd.it/dxi305lol1tb1.png", "time": 1696798751.0, "subreddit": "r/ThePPShow", "title": "I think we are all \"Pros\" around here", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dxi305lol1tb1.png\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/16qlb03/gamestop_throwback_thursday_posts/", "time": 1695519887.0, "subreddit": "r/ThePPShow", "title": "Gamestop Throwback Thursday posts", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gf2z6zzet3qb1.png?width=519&amp;format=png&amp;auto=webp&amp;s=9a8770278278cd0256250291c25c5576b6e26bd2\">What was the first trip to Gmerica?</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/atqhsa1jt3qb1.png?width=528&amp;format=png&amp;auto=webp&amp;s=70dbf08f602880cb261797641a62701b32c4b7d6\">Throwback Thursday 2 Weeks earlier.</a></p>\n\n<p>GME hit it&#39;s altime high on Jan 27th, 2021. July 27th they are thinking back to their first trip to Gmerica with their rocket NFT. Coincidence?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wvwg0jflv3qb1.png?width=532&amp;format=png&amp;auto=webp&amp;s=768c43f44c3552548b9905ea140d76628d76e059\">Sept 6th New York NFT</a></p>\n\n<p>What was located in New York you might ask. BBBY Headquarters.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ekj4nwkxw3qb1.png?width=524&amp;format=png&amp;auto=webp&amp;s=0b9bf81740a205524fe7536abcb50de6d1c6eba1\">https://preview.redd.it/ekj4nwkxw3qb1.png?width=524&amp;format=png&amp;auto=webp&amp;s=0b9bf81740a205524fe7536abcb50de6d1c6eba1</a></p>\n\n<p>The original BBBY NFT clue was the skull and bones Ascii art.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/uf5ysihhx3qb1.png?width=538&amp;format=png&amp;auto=webp&amp;s=0abe49a4e63296390480e8852d6c0d8af566c967\">This was posted before the answer to the last poll</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rxqebqy7y3qb1.png?width=545&amp;format=png&amp;auto=webp&amp;s=a938f537a752a93e343db012b86e7765aaccdc2b\">Aug 14th, The pirate was the clear winner.</a></p>\n\n<p>I think Oct 3rd to 14th we will be getting good news.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/IlwOei5p3pjscyMy8XgY1yid7Ee3ALcxdChh9tWZ_PQ.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/16bwdos/gme_should_focus_on_bringing_used_game_sales_to/", "time": 1694035056.0, "subreddit": "r/ThePPShow", "title": "GME should focus on bringing used game sales to digital game licenses.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Some of you may have read my posts focusing on BBBY&#39;s and Baby&#39;s options for turning around the company. After Bill Pulte&#39;s question in the live space tonight I wanted to offer some thoughts on GME.</p>\n\n<p>GME&#39;s main business is used game sales and I think the most logical expansion for them is to expand into digital sales.</p>\n\n<p>Getting game companies to go along with resale of digital licenses is something that would require a certain scale in order for them to invest in any one system that would need to be implemented into their games. This means there are only a handful of competitors with the size to make something like this to happen.</p>\n\n<p>The best way to do this would be using NFTs that are tied to your game license and can be resold through the GME market. By tieing an NFT to the license would also increase the value of the individual license keys, helping adoption by users and could even be used to give in game rewards as others have mentioned. Giving a small royalty of every game sale to the game developer could work as an additional incentive for developers to go along with this over forcing people to buy a new license.</p>\n\n<p>Being able to offer resale of digital licenses would give GME a HUGE advantage over Stream and Epic game stores, making them not just another game launcher and bring a legitimate use case for NFT/blockchain technology. In my opinion this would be the most logical option for GME to expand revenue</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://i.redd.it/g8g215b5iljb1.png", "time": 1692681182.0, "subreddit": "r/ThePPShow", "title": "After being silent for several weeks _CO_RY posts a new tweet", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/g8g215b5iljb1.png\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15n3wm3/the_hidden_ftds_on_eu_exchanges/", "time": 1691647697.0, "subreddit": "r/ThePPShow", "title": "The hidden FTDs on EU exchanges", "text": "<!-- SC_OFF --><div class=\"md\"><p>There has been lots of speculation about FTDs being hidden on EU exchanges using Regulation S to avoid having to report them on the short interest. With EU exchanges disabling trading of BBBYQ those FTDs are all stuck and can&#39;t be closed out.</p>\n\n<p>What this means for us, I don&#39;t know. Does this mean they will need to buy those shares within 35 days before they show up on US exchanges, or is it done to stop the bad actors from destroying the evidence as the investigation closes around them? Or was it done by the bad guys to buy time so that they do not need to deliver those shares, since EU shareholders can&#39;t sell their shares anyway? Maybe they are hoping the shares get wiped and by then they won&#39;t need to deliver them.</p>\n\n<p>In my opinion, this was done on purpose. Either by bad actors or some regulators, we saw so much short action every morning for months and barcoding all afternoon. There is no way that it was normal trading that caused a 30-40% drop every day in the 2 hours before EU markets closed and then nothing for the rest of the day.</p>\n\n<p>Keep in mind the good guys already prepaid NASDAQ fees with their S1/S3 filing which was canceled meaning if the company emerges from ch11 it will most likely be fast tracked back onto the exchange, which would also reopen trading on the EU exchanges, and putting those FTDs back into play.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15k45m3/go_back_to_go_forward/", "time": 1691364830.0, "subreddit": "r/ThePPShow", "title": "Go back to go forward", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://i.redd.it/zaxm8d9plkgb1.gif\">https://i.redd.it/zaxm8d9plkgb1.gif</a></p>\n\n<p>What would you consider a super priority creditor coming out of nowhere and having the whole BK case thrown out because he hadn&#39;t been served a single time throughout the whole process? Sounds like quite the reversal to me, don&#39;t it?</p>\n\n<p>Just imagine how quickly the shorts will run for the exit, when something like that hits the evening news.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/oXSUY7laiSbZJ__hQx-Cv8sWbBtQTn1flHcNJPnW6TU.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15j7kby/approximate_number_of_bondholders/", "time": 1691271579.0, "subreddit": "r/ThePPShow", "title": "Approximate number of bondholders", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was just reading the BBBY lawsuit against Mara Sirhal and found this, which lists the approximate number of bondholders. Thought it might be interesting since we saw that they intend to send ~440k non-voting/opt-out forms, which lets us calculate roughly how many shareholders there are. With about 10k bondholders the rest would have to be going to shareholders (or other nonvoting classes).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gc7afohz1dgb1.jpg?width=1169&amp;format=pjpg&amp;auto=webp&amp;s=e151146a1b4558c7109ed16974fd34ea86248ba2\">~10k Bondholders total</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/MRpYQfDelZ2hlC21gl1lWS49nLdHDY7RjDKiR7_Uvlc.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15j6q6z/800m_call_options_locates_otc_and_the_exclusivity/", "time": 1691269560.0, "subreddit": "r/ThePPShow", "title": "800m Call Options, Locates, OTC, and the Exclusivity Period", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is just a hunch, but we have long been aware that the shorts have used far out of the money call options as locates and to hedge against a short squeeze. Every few weeks they have had 800m shares of calls for an entire year. Retail has no reason to buy $45 strike options while the stock is trading for pennies.</p>\n\n<p><strong>As it stands:</strong></p>\n\n<p>In OTC you can no longer buy new options contracts and they can only be exercised. This means the longer we are in OTC the more of their calls expire.</p>\n\n<p>If we make it to Jan 19th 2024 on OTC, the 800m shares worth of calls they have from before expire, and they lose their hedge and locates FORCING them to close.</p>\n\n<p>THIS is why I believe we have been seeing this delay. As the clock runs down, more and more of their options have been expiring. Jan 19th 2024 is the FINAL expiration date, sealing their fate. As long as those options exist, they have set a limit to their damage and can shift the burden to whoever sold the contract. The shorts will never be on the hook for more than the strike on those contracts.</p>\n\n<p><strong>Terminating Exclusivity:</strong></p>\n\n<p>So is this why all of a sudden there is this claim of fraud being filed to remove the BK plan exclusivity, which would have run until EXACTLY that week of January? Seems plausible.</p>\n\n<p>By terminating the exclusivity period, it allows others to present a plan and speed up this BK process and get BBBY shares disposed of, BEFORE those options expire.</p>\n\n<p>I have little doubt that as soon as the exclusivity period is over we will be presented with a lowball offer which they will then force through. I wouldn&#39;t be surprised if there is an offer for 3-4B on the table as soon as the court order is filed. Just enough to pay all the creditors and some pennies for us in return for all the old shares getting extinguished.</p>\n\n<p>Remember the Hertz BK deal? Shareholders got 3% of the new shares, or a loss of 97% of their ownership stake.</p>\n\n<p><strong>Conclusion:</strong></p>\n\n<p>Keep in mind, any offer that is accepted by enough of the creditor classes does not require our consent. We are LAST in line. What do the creditors care if they are getting paid in full? Might as well take the lowball offer? If shareholders are thrown some pennies, the judge has no reason not to approve the deal either.</p>\n\n<p>In my opinion, all the talk about shorted bonds and is to distract from their real plan in hopes that shareholders will help shoot themselves in the dick and let them end the exclusivity.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PS:</strong></p>\n\n<p>So while I was getting attacked in my last post, this may clarify why I believe that there is more to this docket than meets the eye. My other post would have turned into a book if I had added all of this as a side note to the main point I was making.</p>\n\n<p>There are at minimum 4 &quot;groups&quot; in this who will throw EACH OTHER under the bus if it benefits them. We know the Good Guys, Freeman and his Relatives (bondholders), The Shorts, and the Banks / Market Makers / Counterparties for the swaps. I am not in the least surprised to see freeman and his bondholding family being named, if it will give the shorts or the banks a way to get out of this.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15i773h/m_gabriel_rostom_second_name_on_docket_1728/", "time": 1691172291.0, "subreddit": "r/ThePPShow", "title": "M Gabriel Rostom? second name on docket 1728", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15i773h/m_gabriel_rostom_second_name_on_docket_1728/", "time": 1691172291, "subreddit": "r/ThePPShow", "title": "M Gabriel Rostom? second name on docket 1728", "text": "Who is this person and what do we know?\n\nWe have a name and address in france that comes back as management of a real estate/property investment company called Targa.\n\nI don't read french so that is all I could find on the quick. I would like to know how this company is tied back to Neelay Das and any potential ties to the SI/emoji lawsuit, which we know was also switched to some french guy after the original guy dropped out. Are there any links?", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15i30ib/so_much_for_the_trade_suspension_fud/", "time": 1691162685.0, "subreddit": "r/ThePPShow", "title": "So much for the trade suspension FUD.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15i30ib/so_much_for_the_trade_suspension_fud/", "time": 1691162685, "subreddit": "r/ThePPShow", "title": "So much for the trade suspension FUD.", "text": "Already up 5% today even though according to the Fudders trading was supposed to be suspended as of today.\n\n&#x200B;\n\nI say that we need to be more diligent about removing not only this FUD but also the people posting it. The BBBY main sub removed the 1000 karma post limit which leads me to believe they are running out of aged fake accounts with enough karma to pass as real. \n\nI have also noticed most shill accounts have between 1-100 post karma and between 60-300 comment karma with a 3-9 month account age. At the very least we should assign a special flair to any users with a very low karma score and age to make it easier to judge who is more trustworthy or not.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15hod6o/life_relationship_is_sus_just_like_roach_is_sus/", "time": 1691118385.0, "subreddit": "r/ThePPShow", "title": "Life_Relationship is SUS, just like roach is sus. How 1728 could FUCK US", "text": "<!-- SC_OFF --><div class=\"md\"><p>Knowing now that the objection came from life_relationship has me more worried than the original filing.</p>\n\n<p><strong>Let me start with Docket 1728 though:</strong></p>\n\n<p>We know freeman and his relatives have been trying to screw BBBY to get Baby for cheap through predatory lending. If the good guys get their exclusivity taken away it could allow freeman&#39;s family to present an offer just slightly higher than what is currently on the table, forcing our side to spring the bear trap before it is ready, IF it is even possible at that point.</p>\n\n<p>Freemans family held basically ALL the 24 bonds and they tried to value BABY for 300m last year in hopes of snapping it up once they forced bbby into bankruptcy. RC SAVED us with the 6th street loan and now they are trying to get the exclusivity removed so they can tank the deal with a counter offer.</p>\n\n<p><strong>What if:</strong></p>\n\n<p>Exclusivity is removed AND Freemans FAMILY make a credit bid for Baby for lets say $500m RIGHT NOW. This would force a bidding war between them and our team BUT also screws up the complex structure of RC/Icahn&#39;s deal.</p>\n\n<p>Any offer higher than the dream on me offer would have to be considered because it could lead to more money for CREDITORS. OUR team has a 69D chess play though as we all know and many of the traps they are using DON&#39;T WORK in a bidding war and depending on what the plan is, even a SHARE offer which forces shorts to close could not be possible.</p>\n\n<p>It would also reduce OUR cut massively because in a bidding war WE ARE PAID LAST. As you have seen so far, many debts have been reduced, which wouldn&#39;t happen if creditors know there is a big payout on the way. But they are paid first so we only get paid if there is more than enough to pay them in full.</p>\n\n<p>This outcome basically screws our share, drive up the cost for RC and the team. or even nuke the entire thing and we get nothing.</p>\n\n<p>This screwing up the exclusivity has been my big worry since the filing was mentioned during the hearing and I am actually pissed PP knew about it and kept it secret. This should have been public, so they don&#39;t get blindsided in court.</p>\n\n<p>All the docket 1728 posts it seems the bots are really pushing them, just like old time FUD pushes.</p>\n\n<p><strong>Life the Plant:</strong></p>\n\n<p>Life_Relationship has built a rep in the community JUST LIKE ROACH, then in recent weeks as we have gotten more and more POSITIVE NEWS his DD has gotten more and more shillish. All under the guise of analyzing things with a realistic view of the filings. We all know this play is supposed to trap the shorts and obviously has to make things look bad. We have been given enough clues though to know things are not the way they seem. Life also posts his &quot;DD&quot; in the bbby sub where most of the OGs who could uncover his deception are banned and can&#39;t reply. I think after seeing how quickly roach was unmasked they decided to be more careful with their next plant. The reason &quot;life knows his stuff&quot; as pp said is because he is a plant, just like roach knew his stuff, but turned &quot;bearish&quot; over BS.</p>\n\n<p>&#x200B;</p>\n\n<p>If I am wrong I will be the first to apologize, but just like with roach I called it as soon as he started to flip. If they manage to push this through and get the exclusivity removed it literally could be our downfall.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>The only hope</strong> is that this takes off before the exclusivity is needed, as the lawyers said it was only out of abundance of caution. BUT his claims of fraud could delay things to run out the clock. In connection with the exclusivity getting removed, it would be the perfect outcome for our enemies. This is the absolute worst time to do something like this, which is why this proves it for me that Life is a plant.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PS</strong>. The Hertz restructuring plan that was accepted came from GLENN and we know that Icahn sold just days before the squeeze happened. So did Icahn step back because Glenn managed to push through the alternate restructuring plan? I still need to dig in more. I actually found the first clue with the Glenn and Hertz connection from a shill. The Hertz plan saw equity get paid but not much and if you didn&#39;t sell during the squeeze you lost out. This could be our future if the shills win.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15hf0li/trading212_share_lending_important/", "time": 1691094522.0, "subreddit": "r/ThePPShow", "title": "Trading212 share lending IMPORTANT", "text": "<!-- SC_OFF --><div class=\"md\"><p>Trading212 just added share lending and it is AUTOMATICALLY TURNED ON. THIS is how we have seen the shortable shares increase so much these last 2 weeks.</p>\n\n<p>It is IMPORTANT that YOU TURN IT OFF. If you have an account with them. YOUR investment is NOT SPIC insured if the share lending is on.</p>\n\n<p>If you are on trading212 turning off share lending is the most important thing you can do right now, not only for your own investment but for BBBY. It takes 2 DAYS to take effect, so do not wait, by the time this squeezes and shorts go broke you lose.</p>\n\n<p>ps. not to mention they are ripping people off on the lending fees.</p>\n\n<p><strong>Post by ok_connection about the new lending program:</strong></p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/15h9far/trading212_requires_4x_the_value_of_lent_out/\">https://www.reddit.com/r/ThePPShow/comments/15h9far/trading212_requires_4x_the_value_of_lent_out/</a></p>\n\n<p>I am so sick of these broker shenanigans. how the fuck are they suddenly going to lend out your property without getting your approval first.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15hdmhz/super_spicy_docket_1728/", "time": 1691091339.0, "subreddit": "r/ThePPShow", "title": "Super Spicy Docket 1728", "text": "<!-- SC_OFF --><div class=\"md\"><p>I am still reading, but pages 3 and 6 already have me close to ripping a hole through my pants.</p>\n\n<p>&#x200B;</p>\n\n<p>&quot;Current plan is unconfirmable unless we get distributions.&quot;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15fnb8w/overstock_may_be_taking_more_assets/", "time": 1690920586.0, "subreddit": "r/ThePPShow", "title": "Overstock may be taking more assets", "text": "<!-- SC_OFF --><div class=\"md\"><p>The narrative hese last few days has been they are surprise by the sales they are getting AND they want to ditch their tainted ticker symbol.</p>\n\n<p>Sounds like a setup.</p>\n\n<p>little talked about fact. Overstock has grandfathered Shorts from back in the day. wonder what happens if they merge with bbby and suddenly need to close.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/15fmnit/rc_will_finally_get_served_for_the_first_time/", "time": 1690919103.0, "subreddit": "r/ThePPShow", "title": "RC will finally get served for the first time.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Looks like they will have to send him this vote notice at which point he will find out about BBBY bankruptcy.</p>\n\n<p>Yall didn&#39;t think it was weird the judge asked about witnesses coming to the discovery on the 11th.</p>\n\n<p>Judge had a shit eating grin the whole time. He is OG degenerate Ape. Wouldn&#39;t be surprised if he Hodln more shares than any of us.</p>\n\n<p>I can&#39;t wait to buy the dip tomorrow.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://i.redd.it/rwk9dlwr9jfb1.png", "time": 1690910746.0, "subreddit": "r/ThePPShow", "title": "Anyone else see the batman symbol? BBBYQ LFG", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rwk9dlwr9jfb1.png\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/158udjy/where_amc_is_going_wrong_and_how_they_could_fix_it/", "time": 1690250413.0, "subreddit": "r/ThePPShow", "title": "Where AMC is going wrong and how they could fix it.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/158udjy/where_amc_is_going_wrong_and_how_they_could_fix_it/", "time": 1690250413, "subreddit": "r/ThePPShow", "title": "Where AMC is going wrong and how they could fix it.", "text": "All this talk about AMC has got me thinking about why AMC is in the situation they are in and what they should do to get out of it. \n\nAMC needs to get back on track, saving the movie theater experience in an age where everyone has access to a big screen TV and home viewing experience that is more convenient and cheaper than going to a theater.\n\nIn my opinion, AMC is throwing away their last chance to save the business by angering their customer base, investors and spreading into other businesses instead of improving the value proposition of their current business model. They need to bring back focus onto what their core business is and not venture out into buzzword crypto hype.\n\n**Movie theaters' main weakness is also their strength.** They require large real estate which is mostly empty for large periods of the day and even during main business hours.\n\nIf you have ever left the movie mid-show you will know that the hallways, and food stalls are all EMPTY. This is a major cost that is underutilized.\n\nInstead of letting this space go to waste, it could be turned into a strength by offering a movie themed entertainment experience more along the lines of a carnival. This is a low-cost opportunity to increase revenue with little up front investment and low running costs.\n\nImagine halls lined with Movie themed stalls, offering games, shopping, food and entertainment. Disney has seen huge success with their movie themed parks such as Harry Potter world and others. This could be replicated in the halls of the theater and turning the theater experience into more than just going to see a movie but an outing more like going to an amusement park. Sports stadiums have done this for a long time and rive huge sales, through restaurants etc.\n\n**Implementation:**\n\nPrepaid cards simplify purchases for food, snacks and entertainment, to speed up sales and throughput. A few $100k per theater\n\nModular stalls that can quickly be re-themed for different movies, to sell movie themed, food, snacks, games, and toys. \\~$1.5m per theater\n\nAdd proper rotating theme restaurants offering movie themed meals, since many people go to eat before the movie. $2m per theater\n\nMove the ticket checks to the movie's doors, giving the public access to the gaming, food, and merchandise sales. Allowing the public to spend without watching a movie. \\~$100k for 20 movie theater\n\n**Result:**\n\nThese changes could increase the revenue per guest by several 100%. Instead of selling a movie ticket and snack for \\~$20 you can also sell the pre movie meal, a toy, and additional entertainment.\n\n*Lets assume a Star Wars movie release:*  \nMovie Ticket $15-20  \nTie Fighter Lego set $20-30  \nFlight Simulator ride $5-10  \nOuter Rim Restaurant Meal $15  \nSnacks $10\n\nPER CUSTOMER\n\nBy turning what would have been a 2 hour movie into a 3-4 hour mini themepark outing, utilizing dead space you have more than doubled your revenue. With little extra investment\n\nIn addition, it opens opportunities for marketing deals, and promotional partnerships, IE movie themed candy, Lego sets, other toys, \n\nA movie might pay to set up a game booth as marketing for their movie or video game.\n\nConsumers hate the ads at the start of a movie, but are much more receptive to ads that are disguised as entertainment.\n\nYou can offer band/play performances and special events in off seasons and increase revenue through merch sales.\n\nThis is how you could expand the offering of the movie theater into something the customer can't get at home. Offering yet another branded credit card or NFT is not going to save your movie theater chain.\n\nUntil I see AMC start making some of the right choices, you are basically hoping for someone to buy them out, or some other news to force the shorts to close. Both of these are simply looking to leave someone else holding the bag and not keeping a movie theater experience for people to enjoy years into the future, which will also cause upheaval for the movie industry, which is largely financed by the box office sales.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/157sun4/recovering_the_dip_loan_and_the_liquidation/", "time": 1690152504.0, "subreddit": "r/ThePPShow", "title": "Recovering the DIP loan and the Liquidation Scenario", "text": "<!-- SC_OFF --><div class=\"md\"><p>The way I see it, there is little prospect for the DIP lender to get their 240 Mil DIP and FILO loan back in a strictly liquidation scenario.</p>\n\n<p>There are nowhere near enough assets to be sold to make up the difference at these bottom dollar prices they are selling the assets for.</p>\n\n<p>The ONLY way for them to recover their money is to take possession of the company and keep the shareholders alive, so they can cash in on the NOLs.</p>\n\n<p>Keep in mind that right now any money that is raised over a certain amount (50% I believe) is shared between several creditors and therefore they are guaranteed to lose a ton of money on their loans.</p>\n\n<p>If they take possession of the company and give the shareholders at least 50% of the new company, though, they can keep the NOLs and make up any difference through the tax credits.</p>\n\n<p>If in the process the old shares are erased and new shares created we will see a force closing of the shorts because the new shares will not be available on the market immediately in order for the shorts to make their dividend payments, and even if they are the shorts would have to buy them first causing the new shares to squeeze.</p>\n\n<p>&#x200B;</p>\n\n<p>PS. there has been talk of naked shorting of bonds in several interviews, and this current restructuring plan is probably being put to a vote (with VERY stringent rules) in order to get an accurate measure of how many bondholders there are. I haven&#39;t had the time to get deeper into this yet, though, so there may be a followup to come.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/155q5ek/liferelationship_you_handsom_devil_i_would_like/", "time": 1689950948.0, "subreddit": "r/ThePPShow", "title": "LifeRelationship you handsom devil. I would like to solve the puzzle", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lhhirom2xbdb1.jpg?width=1203&amp;format=pjpg&amp;auto=webp&amp;s=f9091cfe8525e93e41fe0efcdbde21af18d69380\">\\&quot;Substitute 50&#37; with 80&#37; shareholder ownership\\&quot;</a></p>\n\n<p>Once the ownership change happens, we need to own 80% of the equity in the NEW company to maintain the NOLs generated by the OLD company &quot;immediately&quot; after.</p>\n\n<p>Remember what the Co-op Agreement with RC said. He and his Affiliates will get 19.9% of the company.</p>\n\n<p>This means, we along with any creditors who are given equity in exchange for debt will own 80% of the shares once exchanged, and RC and any affiliates will own 20%.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>UNLESS:</p>\n\n<p>RC hasn&#39;t been served a single time through this whole BK process, so there is still an ace up the sleeve. Each notice that listed him, or RC Ventures, listed him under entities that were not notified due to duplicate address. Remember what the judge said at the last hearing about how important the filing was for who was served and who wasn&#39;t. I believe, in case things don&#39;t go their way, they will simply have the whole case dismissed.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/5DaxfXOyKRzIfb6rrwUpCrmWwgNtxPU-UI29DadoKvY.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/154qmmv/bbbyq_still_trading_on_eu_exchanges_and_premarket/", "time": 1689858874.0, "subreddit": "r/ThePPShow", "title": "BBBYQ STILL trading on EU exchanges and pre-market in US. NOT DELISTED", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yahoo Finance marking it as delisted as of today was WRONG... again</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/153jsfd/wtf_was_plurs_problem/", "time": 1689738538.0, "subreddit": "r/ThePPShow", "title": "WTF was plurs problem.", "text": "<!-- SC_OFF --><div class=\"md\"><p>For plur to call anyone&#39;s TA astrology for men is the joke of the century. Many times I feel he is trying to bore viewers into leaving, but we give him the respect and let him talk. He owes the same respect to every other guest.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1509onq/9921_short_utilization_on_ibkr_and_borrower_depth/", "time": 1689420751.0, "subreddit": "r/ThePPShow", "title": "99.21% short utilization on IBKR and borrower depth of 3X.", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I saw this 2 days ago while buying another 56k shares but sat on it because I couldn&#39;t get a screenshot to post on the other computer I was  on. I am currently  traveling so I can&#39;t log in but figured maybe someone wants to look into this.</p>\n\n<p>On IBKR BBBYQ ticker page if you click on the research section in the top right, then click on the securities lending tab (second to last I think) when you  scroll all the way to the right.</p>\n\n<p>Thanks to ByeByeShorters for finding the screenshot:</p>\n\n<p><a href=\"https://preview.redd.it/8w9un3c955cb1.png?width=1400&amp;format=png&amp;auto=webp&amp;s=438d4d0f4c5a36fca56b6d50a6aae8b1f7c290da\">https://preview.redd.it/8w9un3c955cb1.png?width=1400&amp;format=png&amp;auto=webp&amp;s=438d4d0f4c5a36fca56b6d50a6aae8b1f7c290da</a></p>\n\n<p>It shows:</p>\n\n<ul>\n<li>99.21% share borrowing utilization</li>\n<li>Borrower depth of 3X</li>\n</ul>\n\n<p>If my interpretation is correct that means each float share has been borrowed sold and borrowed AGAIN 2 times.</p>\n\n<p>This would mean the REAL TSO is ~735m - ~50m institutions - ~18m insiders - ~380m treasury/reserved shares divided by 3 giving us a float around ~60-80m.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/4FYemyOpzMJDrqKXxGntNwPKy4n5IHvnlFlUIaIpvDk.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/149beby/news_from_court_jpm_has_been_paid_in_full/", "time": 1686757975.0, "subreddit": "r/ThePPShow", "title": "NEWS FROM COURT JPM has been paid in FULL", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is big in my opinion. They just announced in court that JPM has been paid off in full and they are forced to give up any claims against BBBY.</p>\n\n<p>This means no matter what happens, JPM can not hold up a sale.</p>\n\n<p>&#x200B;</p>\n\n<p><em>I am on the road today, so I will be missing lots of the hearing and I hope someone can analyze the 10k for me because I won&#39;t have time to do it but there were some spicy bits in my opinion.</em></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1449vyq/q1_2023_earnings_about_time_now_isnt_it/", "time": 1686232329.0, "subreddit": "r/ThePPShow", "title": "Q1 2023 Earnings? About time now, isn't it?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have pretty much given up on Q4 2022 Earnings, for now, but Jan 12th was the date we got the Q3 2022 Earnings and the preliminary earnings were released on Jan 5th.</p>\n\n<p>With the Q4 ending date of Feb 15th-18th we should be nearing Q1 2023 earnings release date some time within the next 2-3 weeks. Q1 2022 earnings announcement date was June 29th but it could really be any time between now and then.</p>\n\n<p>Why do I care? Because Sue Gove had projected BREAK EVEN numbers by end of Q1 and with the company not needing to buy in inventory it should be much easier to break even due to the reduced cash outflows.</p>\n\n<p>Obviously it all depends on many other factors such as store closing costs, etc. but they have much less staff working right now, along with many other costs. </p>\n\n<p>Something else that reminded me of something and got my interest was in last night&#39;s PPshow. The talk about their supplier/inventory testing could be used to fudge the numbers and hide their true earnings.</p>\n\n<p>Remember, BBBY overpaid taxes and got a $250m tax credit, meaning they have had multiple Quarters of overly negative earnings if I am correct. I have noticed a few things in their finances that make me think they are shifting liabilities and earnings in opposite directions. They could have made 2-3 quarters look more negative than they really were, and now report 2 quarters of insanely good financials in comparison.</p>\n\n<p>I am still wondering if they are going to announce a surprise quarter or 2 along with the stalking horse bid, just to really throw the shorts for a loop.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/141skyc/the_blind_bid_ipo/", "time": 1686000695.0, "subreddit": "r/ThePPShow", "title": "The BLIND bid IPO", "text": "<!-- SC_OFF --><div class=\"md\"><p>I think people are missing what COULD really have happened here.</p>\n\n<p>Lets say that BBBY only ever had 117m real shares available but was shorted all the way to 750m shares on the assumption that those shares will be available or never delivered due to bk.</p>\n\n<p>Some mystery party owns all the shares over the 117m real shares though.</p>\n\n<p>If this mystery party is BBBY (who did own ~250m Treasury shares at some point) or Icahn through some network of proxies and is now acquired, the shorts are forced to buy up those shares at WHATEVER price they set. </p>\n\n<p>This actually makes sense with the company shares + 117m being roughly 50% of ALL claimed shares.</p>\n\n<p>It is like having an IPO for a company without disclosing the price you will pay ahead of time.</p>\n\n<p>The shorts are forced to close at some point, either if the buyer takes the company private and recalls ALL shares, or the post buyout price per share is so high that the CTB is unsustainable.</p>\n\n<p>With the shorts already having sold those shares into the open market they have no choice but to pay the asking price for every last share.</p>\n\n<p>If you are trying to recapitalize a company or launch a new company, there are few better ways I can think of to raise the money to do so.</p>\n\n<p>There are many ways to go depending on what the actual share ownership split is. It all comes down to the shorts having sold shares and now the price they pay is decided.</p>\n\n<p>If this mystery party offers $200 a share, They know that only the first 117m worth of that is coming from them which they can offset by selling part of the 650m hidden shares to the shorts in order to close their positions. This means they will always come out on top no matter what their buyout offer is. Any shorts that don&#39;t close right away, will be stuck paying them a CTB (on the BUYOUT price per share) until they do close.</p>\n\n<p>You could sell 117m mystery shares to cover your purchase costs and retain 30% ownership at ZERO cost to yourself. </p>\n\n<p>You would end up owning about 250m shares out of BBBY with a new ~750m TSO once all is said and done. The company would have a huge nest egg of 250m X share price (ie $200) and it cost you nothing except what you paid for those shares (HBC deal average).</p>\n\n<p>Or if all the mystery shares belong to someone else they could have 50% ownership for free and the company is debt free.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/140zpqn/pulte_icahn_connection/", "time": 1685933258.0, "subreddit": "r/ThePPShow", "title": "Pulte, Icahn connection?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just stumbled across this tweet by Pulte again.</p>\n\n<p><a href=\"https://twitter.com/pulte/status/1512133409631522820\">https://twitter.com/pulte/status/1512133409631522820</a></p>\n\n<p>Where he says that 2016 is when his grandfather and him had to rescue Pulte Homes from BCG group.</p>\n\n<p>I remember seeing a Tweet from Pulte saying 2016 is the first time he met Carl Icahn and that he was always nice to him.</p>\n\n<p>&#x200B;</p>\n\n<p>Would it be far-fetched to think that Icahn had something to do with Pulte and his struggle to save the company.</p>\n\n<p>I was wondering if anybody has tried to look into any ties between Icahn and Pulte Homes / Pulte around 2016. Or Icahn/BCG conflicts or run-ins.</p>\n\n<p>Might be some interesting info to find there. Especially with all the anti corruption and BCG connections being made between RC and Pulte. Maybe Icahn has similar connection to BCG.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13u2oj2/will_we_finally_see_earnings_on_wednesday_31st_of/", "time": 1685286531.0, "subreddit": "r/ThePPShow", "title": "Will we finally see earnings on Wednesday 31st of May?", "text": "<!-- SC_OFF --><div class=\"md\"><p>After so many delays and extensions, I am still hopeful that we will finally see Q4 22 earnings reports.</p>\n\n<p>Docket 9 asked for an extension until and including the 27th of May, which was granted in Docket 99 until and including the 30th of May.</p>\n\n<p>This means if we do not see a filing for another extension on Tuesday, we should FINALLY see the Q4 earnings report released by the 31st of May.</p>\n\n<p>What do you think? Will we get earnings? And if we do, what will they say?</p>\n\n<p>I, for one, am hopeful.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13ret7e/the_double_squeeze_buyout_play_squeeze3/", "time": 1685012956.0, "subreddit": "r/ThePPShow", "title": "The DOUBLE squeeze buyout play. Squeeze^3", "text": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know how much of this matters for this play, this is just a thought I had after listening to the shills.</p>\n\n<p>So imagine you are buying a company that is EXTREMELY heavily shorted.</p>\n\n<p>Why not make an offer that is outrageously high, but not just for cash, but cash AND shares. (the cash is unimportant to this, it only applies to pay off debts)</p>\n\n<p>So many shares in fact, that the shorts who are on the hook for the dividends of the shorted shares, need to go out and buy all those shares of Company A to pay out their short positions on the open market causing a second squeeze.</p>\n\n<p><strong>Let&#39;s say:</strong></p>\n\n<ul>\n<li>Company A has 10M shares outstanding</li>\n<li>Company B has 100M shares plus 100m shorted (ie 200m total)</li>\n<li>Company A, buys company B in a share plus cash deal.</li>\n<li>Company A gives 1 share of company A for 10 shares of company B.</li>\n<li>20M shares are supposed to change hands but only 10M come from company A, the rest need to be bought by shorts on the open market to pay their obligations.</li>\n<li>Now company A has 20M shares outstanding. Where do the other 10M shares come from that the shorts need to pay out?</li>\n<li>Since there are not enough shares of company A to pay the obligations of the shorts you get a squeeze of company A in addition to the squeeze of company B, for any positions that need to be closed in order to cover the missing shares.</li>\n</ul>\n\n<p>Obviously I just picked random numbers to make the math easier to follow but depending on the situation this can have huge implications for the buying pressure of company A and your ownership % after all is said and done.</p>\n\n<p>This could be interested in a situation where the FTC wouldn&#39;t approve a direct buyout, but after the deal, your ownership has grown enough to give you a controlling stake.</p>\n\n<p><strong>The BEST PART</strong></p>\n\n<p>This would allow you to force 2 squeezes at once with little to no warning to any of the shorts involved, especially if you can hide who the buyer is, in order to reduce the time for shorts to close positions before the deal is announced.</p>\n\n<p>Where this would get really interesting is, if a bunch of highly shorted companies were all to be merged at once into some form of giant holding company, launching a whole series of squeezes at the same time and making it much harder to figure out how much risk you are exposed to as a shortseller. This could amplify a squeeze exponentially.</p>\n\n<p><strong>If for example:</strong></p>\n\n<ul>\n<li>Deal 1 causes Company A and B to squeeze</li>\n<li>Deal 2 causes Company C and D to squeeze</li>\n<li>Deal 3 FORCES the shorts to deliver a ton of shares for all 4 companies at a time when all their shares are highly inflated.</li>\n</ul>\n\n<p>This could be done in many variations as above or even as a chain of company A paying in shares for company B, and Company A is then bought by company C, and they are then bought by company D. </p>\n\n<p>At each level the squeeze would build as the shorts need to buy shares on the open market to pay out obligations on their loans. The starting point for each squeeze being the height of the previous squeeze.</p>\n\n<p>Imagine what would have happened if the day GME reached $400 a share the company was sold in an all share deal requiring the closing of every last short position. Then multiply that many times over.</p>\n\n<p><strong>THAT would be MOASS.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>PS. hopefully this all makes sense. I have had to cut out almost 2 pages of clarification and examples because it was getting too long, as my posts always tend to do.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13r69av/shorts_are_trying_to_force_iep_margin_call_but_i/", "time": 1684984134.0, "subreddit": "r/ThePPShow", "title": "Shorts are trying to force IEP margin call but I see a squeeze coming.", "text": "<!-- SC_OFF --><div class=\"md\"><p>IEP is a highly illiquid stock, usually selling just a few thousand shares a day.</p>\n\n<p>Carl Icahn owns almost 90% of the shares, and they just shorted close to 5m shares before bringing out massive anti IEP FUD. That is close to 20% of the float in a company where practically nobody ever sells due to the dividends.</p>\n\n<p>It is the BBBY playbook to a T.</p>\n\n<p>Make it look like the price is going down based on the Hindenburg article, but in reality it is being pushed down by the shorts to make it look like people are selling.</p>\n\n<p>The shills are suddenly out in force. </p>\n\n<p>Today Person IEP (who claims not to hold IEP) comes and claims it is a revaluation. But the only people selling are SHORTS.</p>\n\n<p>Ackmann is pushing the same FUD as the shills</p>\n\n<p>Hindenburg claims were all BS an uninformed investor would believe. (25% dividend claim sounds high but at $70 a share </p>\n\n<p>My DD from last week shows EXACTLY that the price drops are connected to the shorts and not the articles and news about IEP.</p>\n\n<p><strong>So why squeeze?</strong></p>\n\n<ul>\n<li>IEP has paid $2 a quarter dividends for 72 QUARTERS STRAIGHT.</li>\n<li>IEP float is only around 57m and SHRINKING</li>\n<li>IEP just announced a $500m stock rebuy which is almost 20m shares</li>\n<li>NOBODY who has been holding IEP for a long time wants to sell.</li>\n<li>That means Icahn is holding the shorted shares as the only big buyer right now.</li>\n<li>Who sells DAYS <strong>BEFORE</strong> a DIVIDEND PAYOUT?</li>\n<li>Icahn isn&#39;t selling his own shares SHORT but he uses them as collateral</li>\n</ul>\n\n<p><strong>The Play</strong></p>\n\n<p>I think whoever Icahns lender is &quot;screwed&quot; him and is lending his shares to the shorts. That is the only way I see that many borrowable shares being available.</p>\n\n<p>Then Icahn buys up the shorted shares at half price on the open market along with some of the retail investors who are now clued into his company from the BBBY deal.</p>\n\n<p>Icahn pays off the loan and the bank calls back the lent out shares from the shorts.</p>\n\n<p>IEP SQUEEZEEES hard because there are practically no shares for sale.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13p5dte/familiar_tactics_being_used_against_iep_to_drive/", "time": 1684794018.0, "subreddit": "r/ThePPShow", "title": "Familiar tactics being used against IEP to drive the price down. The BOBBY playbook", "text": "<!-- SC_OFF --><div class=\"md\"><p>The media will have you believe that the Hindenburg article along with a realization of IEPs bad performance is the cause of the decline in price. In reality the data tells a very different and familiar story.</p>\n\n<p><em>Processing img cm4z6jvnvh1b1...</em></p>\n\n<p><a href=\"https://chartexchange.com/symbol/nasdaq-iep/failure-to-deliver/\">ChartExchange FTDs</a></p>\n\n<p><em>Processing img 3reulg66yh1b1...</em></p>\n\n<p><a href=\"https://data.nasdaq.com/data/FINRA/FNYX_IEP-finranyse-trf-short-interest-iep\">FINRA</a></p>\n\n<p><em>Processing img zuovic9cyh1b1...</em></p>\n\n<p>&#x200B;</p>\n\n<p><em>Processing img wr2tdx1ozh1b1...</em></p>\n\n<p><em>Processing img i28q996svh1b1...</em></p>\n\n<p>&#x200B;</p>\n\n<p><em>Processing img tt6qotwxvh1b1...</em></p>\n\n<p>&#x200B;</p>\n\n<p><em>Processing img oz4h490awh1b1...</em></p>\n\n<p><a href=\"https://www.nasdaqtrader.com/Trader.aspx?id=shortinterest\">Nasdaq Trader Short Interest</a> </p>\n\n<p>&#x200B;</p>\n\n<p>It is all to covenient to believe the media narrative of why IEP price crashed from around $70 to $30 in the last 6 months. I became truly suspicious when big economics youtubers started putting out full length anti IEP videos just days after the Hindenburg piece.</p>\n\n<p>When you know the playbook, it takes more than just negligence not to see the obvious manipulation, and I am not surprised there was a swift response from investigators.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://twitter.com/_CO_RY_/status/1660489923231879168", "time": 1684769127.0, "subreddit": "r/ThePPShow", "title": "How hasn't anyone posted this _CO_RY_ tweet", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/d18k1DoQ7gLlrCTeLgUgCrlnZF5VyONZ3ROpi0A07uc.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13o816q/better_get_comfortable_new_deadlines/", "time": 1684707201.0, "subreddit": "r/ThePPShow", "title": "Better get comfortable. New deadlines.", "text": "<!-- SC_OFF --><div class=\"md\"><p>So docket 415 lists a bunch of new dates for auctions going all the way to the end of JUNE and far into JULY. A few of us have been assuming that they would pretend to get this over with quickly to keep the shorts from closing, and then move all the dates back and stretch this out.</p>\n\n<p><strong>Why is that a good thing?</strong></p>\n\n<p>Well the derivatives settlement dates coming up around those times.</p>\n\n<p>All those fancy Credit Default Swaps, Total Return Swaps, Bullet Swaps, Basket Swaps, etc., etc. end on 3, 6, 9, 12 month cycles. Some run 1 year, others 2 years, some even run 5 years or longer.</p>\n\n<p><strong>So what is the point and why does it affect us?</strong></p>\n\n<p>If you want to trigger the Mother of All squeezes, you need the maximum number of these events to coincide with a massive short position becoming unprofitable.</p>\n\n<p>This is where ETFs come in. Synthetic ETFs are derivatives that track the price of an underlying asset without owning that asset. This is done for tax reasons and is similar to a CFD, or contract for difference. Since these investments are not backed by any shares, it allows them to grow in size, way beyond any limits that would be imposed by shares outstanding.</p>\n\n<p>For example, If there are only 1 million shares available that is how many bets against that share can be made, while still being backed by physical shares. A synthetic ETF however can be sold an unlimited number of times, because it only depends on share price and not on the number of shares.</p>\n\n<p><strong>Anyway I am getting off topic.</strong></p>\n\n<p>These Derivative investments usually have expiration dates tied to them which just so happen to pile up around certain dates, and this is what creates our cyclic stock runs.</p>\n\n<p>The next big settlement &quot;pile up&quot; just so happens to be june-august. </p>\n\n<p>Since there is more risk for the shorts and hedge funds around those dates, it only makes sense to announce the buyout around those dates and cause the maximum flood of shorts rushing to close their positions, in order to reduce their losses as much as possible, while at the same time the flood of closures, drives the price of the stock up past uranus.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13kna5s/are_we_still_trading_bed_bath_and_beyond_shares/", "time": 1684380811.0, "subreddit": "r/ThePPShow", "title": "Are we still trading BED BATH and BEYOND shares?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Things are getting weird and at this point I don&#39;t know what to believe.</p>\n\n<p><a href=\"https://preview.redd.it/apfqkj51ei0b1.jpg?width=1470&amp;format=pjpg&amp;auto=webp&amp;s=71179b9ec2735d5e5205d20cea4a5d445226d863\">Investor relations update.</a></p>\n\n<p>Last night BBBY investor relations got an update and it clearly says that trading was suspended of their common stock.</p>\n\n<p>Seems like a weird thing to put up when we are all still buying BBBYQ shares.</p>\n\n<p>So what is it that we are trading?</p>\n\n<p>Did they pull a switch-a-roo and simply give out an equal number of shares in a new company during a switch? Or is it simply semantics due to the ticker symbol change?</p>\n\n<p>&#x200B;</p>\n\n<p>I am so confused at this point, I am going to have to buy more.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/NysM-z9FhPJkai6Wq-5NGQAAMTJ8IqWnDdrC22y5za8.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13jyoiw/hudson_we_have_a_problem_only_2_equity/", "time": 1684321923.0, "subreddit": "r/ThePPShow", "title": "Hudson, we have a problem. Only 2 Equity Shareholders", "text": "<!-- SC_OFF --><div class=\"md\"><p>I believe this should answer the question of ACTUAL share count.</p>\n\n<p><a href=\"https://preview.redd.it/dforvvcqgd0b1.jpg?width=1318&amp;format=pjpg&amp;auto=webp&amp;s=563b8e4da84da83df4c7ea8624d4862e39dae4a7\">How many shares does Blackrock own again?</a></p>\n\n<p>As you can see, this is from MAY 15th Docket 345 and lists only 2 equity shareholders. IE shareholders who count as insiders.</p>\n\n<p>We know Blackrock recently sold half their shares and now only owns &lt;7m shares. If they are to count as an insider. We must be at or around 120m shares. Anything over 140m would make this document false unless there is a Form 13 filing from Blackrock we don&#39;t know about yet.</p>\n\n<p>&#x200B;</p>\n\n<p>So did David S Kurtz of Lazard sign off on this without making sure it is correct, or are there really only about 124m shares outstanding?</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/foxo8jwujd0b1.jpg?width=1132&amp;format=pjpg&amp;auto=webp&amp;s=9883b92e885ef12f614497140b3a525519254079\">https://preview.redd.it/foxo8jwujd0b1.jpg?width=1132&amp;format=pjpg&amp;auto=webp&amp;s=9883b92e885ef12f614497140b3a525519254079</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/S866xfl23DfnyT0cSOCXKzyfpAHvHCiOD4VJfeLEOec.jpg\"/></div>"},
{"username": "Excitedbox", "url": "/r/BBBY/comments/11sdw5l/69d_chess_taking_a_company_private_for_cheap/", "time": 1684147487.0, "subreddit": "r/ThePPShow", "title": "Looks like HoustonWade finally had the same idea I had back in March.", "text": null, "preview": ""},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13gon7w/is_ucopy_another_roach_fake_namura_and_rakuten_fud/", "time": 1684001722.0, "subreddit": "r/ThePPShow", "title": "Is U-Copy another Roach? Fake Namura and Rakuten FUD", "text": "<!-- SC_OFF --><div class=\"md\"><p>As I had immediately suspected after using google translate on his Japanese Emails. I realized there was something fishy going on. </p>\n\n<p>Because google image translation sucks I could only get partial translations but he was claiming the 19th was when users would be forced to close while the email only referenced not being able to trade the stock after the 9th.</p>\n\n<p>This is nothing new and has been seen from many foreign brokers. Many required you to either transfer or call support to sell.</p>\n\n<p>So this made me suspicious and got me thinking.</p>\n\n<p>What has U-Copy been saying as of late:</p>\n\n<ol>\n<li>He is out because he couldn&#39;t hold BBBYQ (FALSE but makes great FUD don&#39;t it?)</li>\n<li>Fake hype dates (Tomorrow we are gonna run guys)</li>\n<li>lowball price capping (More FUD and BS to destroy morale)</li>\n<li>Classic attention seeking misinformation titles 🚨 (If you have seen the Superstonk sub you know any post with this siren is BS)</li>\n<li>Posting the emails as pictures, with no links to the source text. (Classic shill move, makes it harder to debunk. You can&#39;t just copy it into Google Translate and how many people will take 30 minutes to clean up a grainy image to get a good scan?) </li>\n</ol>\n\n<p>His reaction to being corrected seals it for me.</p>\n\n<p>After seeing his reaction to the <a href=\"https://www.reddit.com/r/BBBY/comments/13fj37p/comment/jjvhwft/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">debunking</a>, I am now pretty certain. Not only is he corrected by someone who speaks Japanese and translated the email, matching to what has come from other brokers, the user also confirmed that Rakuten and Namura are not connected. Something I had already verified before.</p>\n\n<p>U-Copy claims the emails came from one of his viewers (classic blame deflection) but is adamant that his viewer is correct and list YAHOO FINANCE as his credible source to back it up. We all know yahoo finance is compromised and working for the shorts, so to use them to back up a claim, that is already being contested as false, is highly suspect.</p>\n\n<p>&#x200B;</p>\n\n<p>I know people will say I am overreacting, and I would have given him the benefit of the doubt if he hadn&#39;t reacted the way that he did to being corrected. We have all been misled by shills at one point or another. But there are too many things that don&#39;t add up with his post to be defending it the way he is and then trying to use YAHOO FINANCE to back up the claim. GTFO.</p>\n\n<p>&#x200B;</p>\n\n<p>I wish we didn&#39;t have to constantly worry about this and be so mistrusting of people who have built a reputation in the community, but that is EXACTLY how they operate. Infiltrate, Build Trust, Create Mistrust.</p>\n\n<p>What better way for the shorts to impact many people at once than to pretend to be a TA analyst and suddenly drive ALL your followers away from the stock.</p>\n\n<p>&#x200B;</p>\n\n<p>I really liked U-Copy&#39;s TA, like many of you, but if you ignore your feelings towards him as a person and evaluate the facts from a neutral and objective standpoint, it becomes pretty obvious.</p>\n\n<p>Let&#39;s all keep in mind that even Keith Gill (Roaring Kitty) wasn&#39;t who he was pretending to be during the GME squeeze, but at least he was one of the good guys.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13g7mpt/big_brain_pulte_playing_69d_chess_too_how_to_sell/", "time": 1683953577.0, "subreddit": "r/ThePPShow", "title": "Big Brain Pulte playing 69D chess too. How to sell homes in a Recession", "text": "<!-- SC_OFF --><div class=\"md\"><p>We know the Banks are about to get hit HARD as fuck. </p>\n\n<ul>\n<li>Recession is bound to be incoming.</li>\n<li>So how do you make sure your REAL ESTATE company doesn&#39;t tank?</li>\n<li>You make retail investors who are all looking to buy their own homes RICH.</li>\n<li>How many of you are planning to buy a home after this play?</li>\n<li>How many of you are gonna buy a PULTE home after this?</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Pulte is going to be selling homes like hot cakes in the coming years. By getting money into the hands of the average home buyer, he can make sure that there are people who have enough liquidity and net worth to either finance or buy a home. </p>\n\n<p>By making himself one of the heroes in this, he puts himself at the top of the list for any of the people looking to buy a home, while also getting massive exposure in the media for his company.</p>\n\n<p>&#x200B;</p>\n\n<p>If Pulte was building homes in Europe, I know that is the first company I would be looking at. How about you?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13g08rt/this_decade_long_struggle_against_shorts_and/", "time": 1683933170.0, "subreddit": "r/ThePPShow", "title": "This decade long struggle against shorts and hedge funds is coming to an end. Time to Hodl is now.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not financial advice. Inform YOURSELF. Read the FILINGS CAREFULLY. There are traitors EVERYWHERE.</p>\n\n<p>We know the end is near and success is within our grasp. The shorts are doing everything they can to get us to crack and fold. </p>\n\n<p><strong>All they have left is to bluff over and over in the hopes that you fold on the RIVER card, with a huge pot on the table. They are ALL IN.</strong></p>\n\n<p>We have seen the FUD changing these last few weeks as the end moves closer, and closer.</p>\n\n<p>First it was all about, you are going to lose everything</p>\n\n<ul>\n<li>The company is going broke</li>\n<li>RC is out</li>\n<li>The board is against you</li>\n<li>Dilution</li>\n<li>The shorts won&#39;t have to cover</li>\n<li>OTC will let them off the hook</li>\n<li>Your broker will sell your shares</li>\n</ul>\n\n<p>When that didn&#39;t work, they switched it up to price capping.</p>\n\n<p>Now the FUD is.</p>\n\n<ul>\n<li>The price won&#39;t go up much at all.</li>\n<li>They removed the buy button to keep the price down</li>\n<li>etc. etc</li>\n</ul>\n\n<p>We have seen all their lies and tricks and we have just a few weeks until their THE DERIVATIVES come due.</p>\n\n<p><a href=\"https://preview.redd.it/35q5bmcm1hza1.jpg?width=937&amp;format=pjpg&amp;auto=webp&amp;s=3882503dc889649e7f12b844eeb5a877ed98c1cd\">Just one of many</a></p>\n\n<p>This is the ultimate END DATE for THEM. Every big squeeze happens in this time frame. The last few times it has started around June. Don&#39;t get your hopes up before then, you will know when the time comes.</p>\n\n<p>My ASSUMPTION is that many hype dates before then are misinterpretations of the facts or people hoping to either keep you holding just a bit longer to make this all work, or trying to break your spirit to make this fail. Who knows.</p>\n\n<p>I know this is going to end in a GME 2.0 x 100 though. At this point, the only smart move that I see is to bet it all on black and hodl till this goes ballistic.</p>\n\n<p>&#x200B;</p>\n\n<p>No matter how long you are in this, there are people who have been working towards this for a decade and they have many millions riding on this.</p>\n\n<p><strong>DO NOT WASTE THIS OPPORTUNITY</strong></p>\n\n<p>For fair markets and a better future for you and generations to come.</p>\n\n<p>&#x200B;</p>\n\n<p>The shorts want you to crack and sell as low as possible out of fear and doubt. But the only thing you have left to fear is regret and failure, to take them down.</p>\n\n<p>The shorts have dug themselves a hole that they can not climb out of unless YOU let them.</p>\n\n<p>What is more important than getting rich, is that we get eyes on this corruption, theft, and destruction of the economy and peoples&#39; lives. No movement can succeed if nobody knows about it.</p>\n\n<p>Making a boatload of money is just a happy side effect of their idiocy.</p>\n\n<p>Obviously, I hope that you and everyone you know makes the same decision as me, but I can&#39;t tell you what to do with your money.</p>\n\n<p>But what I want you to do is to tell all your friends and family to watch these events unfold these next few weeks.</p>\n\n<p>If they want to invest a couple bucks and gamble on a better life, the chances are much better than playing the lottery.</p>\n\n<p>But even if they don&#39;t, it is more important that people watch and see what is going on.</p>\n\n<p><strong>GET THE WORD OUT $420.69 is not a meme.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>PS:</strong></p>\n\n<ul>\n<li>Don&#39;t FOMO in once this takes off. </li>\n<li>If you are going to invest, do it NOW. </li>\n<li>DON&#39;T use SHIT BROKERS. It is not worth saving $10 on a trade and lose it all in the end.</li>\n<li>TURN OFF margins, lending, internalization, etc.</li>\n<li>INFORM YOURSELF</li>\n</ul>\n\n<p>This year has aged me tremendously, but I have also learned a lot, and I am glad to have had and used the opportunity. After this is all over I am going to invest in Hotels, alcohol and condoms. Because we are all going on a long vacation.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/t0DKXFTf_51Ilof_I33NhsQ1U9jNRTIfS7CiPgKoPNc.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13fg9z1/sale_of_leases_and_closed_stores_can_be_profitable/", "time": 1683884590.0, "subreddit": "r/ThePPShow", "title": "Sale of Leases and closed stores, can be profitable", "text": "<!-- SC_OFF --><div class=\"md\"><p>I posted a few weeks ago that there is probably substantial value in BBBY leases.</p>\n\n<p>Some might have favorable terms to the leasee that can be sold on, or in other cases the landlord might have someone willing to pay more due to improvements in local rents since the signing of the lease.</p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTUwMDk4MQ==&amp;id2=-1\">Here we see our first evidence of such profits.</a></p>\n\n<p>BBBY sold a lease back to the landlord including a Solar Facility, for $3 million.</p>\n\n<p>This is 3x of what I had calculated the value of such store leases to be and since we can not assume this to be the norm and we don&#39;t know the size of the Solar system, lets say the average lease is valued at half that.</p>\n\n<p>Depending on the number of leases left from previously closed stores, and number of stores remaining open, there could be anywhere from 450-900+ leases.</p>\n\n<p>Assuming that half of these can be terminated at a $1.5m profit, this could add $350-700m in addition to the reduction in liabilities we saw in last weeks court dockets.</p>\n\n<p>Since Tritton spent almost $1 Billion renovating almost 600 stores before getting thrown out, I am guessing that there is still a substantial value left to recover in these stores.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13e284u/you_know_how_i_know_this_company_has_been_naked/", "time": 1683750518.0, "subreddit": "r/ThePPShow", "title": "You know how I know this company has been naked shorted?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I own over 0.05% of this company.</p>\n\n<p>&#x200B;</p>\n\n<p>I am no whale.</p>\n\n<p>I am a little guy, just throwing a few grand into shares of a company I believe in.</p>\n\n<p>&#x200B;</p>\n\n<p>The more they tell me to sell, the more I believe they NEED me to sell.</p>\n\n<p>If fewer than 2000 people like me can buy this company, then there is something illegal going on.</p>\n\n<p>&#x200B;</p>\n\n<p>We know there are many thousands of us. There are people who own millions of shares.</p>\n\n<p>&#x200B;</p>\n\n<p>I know of at least 50 people who own over 1 million shares.</p>\n\n<p>We know how many shares the board owns.</p>\n\n<p>We know there are institutions holding almost 50 million shares.</p>\n\n<p>&#x200B;</p>\n\n<p>That is already 100% of the shares.</p>\n\n<p>&#x200B;</p>\n\n<p>They need our shares many times over.</p>\n\n<p>$420741.69 is not a meme</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13da6xy/new_si_numbers_ill_believe_em_when_i_see_it/", "time": 1683675990.0, "subreddit": "r/ThePPShow", "title": "New SI numbers. Ill believe em when I see it.", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/4klmbj0v6wya1.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=997d84c81659c6d1e91de2199bc8c64e1be162b5\">I find it highly unlikely that the SELF REPORTED short interest went down by 33m shares.</a></p>\n\n<p>How many FTDs are there then? This is during the time with the 400-900m Days. Some shorts may have covered but I highly doubt that they covered over 2 BILLION short volume when they thought the company was going BK.</p>\n\n<p>I don&#39;t even know who would be dumb enough to sell right now. I am still buying.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/oN3Xi9ZcEqr1akQyzcq7gALVtDOhIGi9XMAnP1fuzzc.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13cpe03/shill_chooses_tso_fud_it_is_not_very_effective/", "time": 1683637766.0, "subreddit": "r/ThePPShow", "title": "Shill chooses TSO FUD, it is not very effective. General TSO Chicken.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Shares outstanding is the total number of shares that COULD be sold into the market NOT that ARE in the market.</p>\n\n<p>It is made up of.</p>\n\n<ul>\n<li>Reserved shares\n\n<ul>\n<li>Bonus programs</li>\n<li>Warrant reserve</li>\n<li>Approved but not issued</li>\n</ul></li>\n<li>Insider Shares</li>\n<li>Institutional Shares</li>\n<li>Public Float</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/ghrg3ejkusya1.jpg?width=1366&amp;format=pjpg&amp;auto=webp&amp;s=01fde2bf020defd8a843956ad3ec7db46acc0522\">122.355m is the HUDSON shares / Equity deal RESERVE (200&#37; of warrants have to be reserve according to deal terms)</a></p>\n\n<p>The last line &quot;Commitment shares&quot; is the commission for B Riley and is a part of the 112m shares. I believe it was 2% of the proceeds from sale.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wuezk9jkusya1.jpg?width=1309&amp;format=pjpg&amp;auto=webp&amp;s=92bc0c78a097d5b6c74a28cd480d113d851954c4\">These 112m were NOT SOLD EVER. They were given to B Riley, to hold, and MAYBE SELL later. </a></p>\n\n<p>&#x200B;</p>\n\n<p>You can also see that 558m from above leaves the company with 334.7m shares. Giving a total of 900m</p>\n\n<p><a href=\"https://preview.redd.it/7txaqajkusya1.jpg?width=1297&amp;format=pjpg&amp;auto=webp&amp;s=c3988c93b722b1bbf16e900001f9b25337db6da4\">111.7m = 20&#37; of total</a></p>\n\n<p>So from the 558m we can subtract the</p>\n\n<p>18.3m incentive shares. (RESERVE)</p>\n\n<p>5m Exchange shares (No RS no Exchange) (RESERVE)</p>\n\n<p>1/2 of the 122.3m Warrant shares or 61m (RESERVE)</p>\n\n<p>111.7m shares from B Riley which were NEVER SOLD (ISSUABLE)</p>\n\n<p>Gives us around <strong>362m Shares.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>This 362m may still shrink. This number agrees with the April 24th filing of ~480m shares though because the S1 wasn&#39;t canceled at that time and hadn&#39;t been subtracted yet.</p>\n\n<p>People arguing they could have sold shares after that date are probably also forgetting the 2 week PAUSE in the proceeds testing period. Do you really want me to look up the exact date or can we agree it probably lines up?</p>\n\n<p>&#x200B;</p>\n\n<p>Do you want me to keep going?</p>\n\n<p>&#x200B;</p>\n\n<p>I believe we are gonna see that 362m number keep shrinking. Why? Because we got the mother fucking A-Team on this, that&#39;s why.</p>\n\n<p>&#x200B;</p>\n\n<p>To find out how, you are going to have to wait for Next week&#39;s episode, of General TSO (sp?) Chicken.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/IgidcptQ1pjjZ-LRk5D_f-Vx32i4CNmsZB9eirXis30.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13ch2kn/edwins_dd_may_have_solved_the_puzzle_about_the/", "time": 1683611868.0, "subreddit": "r/ThePPShow", "title": "Edwin's DD may have solved the puzzle about the other players involved.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday&#39;s DD is MUCH BIGGER than we previously noticed IF HE IS CORRECT.</p>\n\n<p>What industries did he list for the 90% requirement?</p>\n\n<ul>\n<li>Natural Resources = Metamaterials. TESLA lithium mining</li>\n<li>Real Estate = Pulte Group</li>\n<li>Energy = Tesla</li>\n<li>Commodities = eToro</li>\n<li>Dividends = GME NFTs, or maybe even STOCK LENDING if BBBY gets a high CTB delisting.</li>\n<li><a href=\"https://www.law.cornell.edu/uscode/text/26/1221#a_1\">Selling real property</a> = Teddy, Gamestop (big things coming), BBBY marketplace?, BABY? APPLE App store?</li>\n</ul>\n\n<p>The only thing that doesn&#39;t make sense to me is that it would require these companies to combine their shares as one. </p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>(f) Effect of becoming corporationAs of the 1st day that a <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-975639300-454322956&amp;term_occur=999&amp;term_src=\">partnership</a> is treated as a <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-1322278904-454322955&amp;term_occur=999&amp;term_src=\">corporation</a> under this section, for purposes of this title, such<a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-975639300-454322956&amp;term_occur=999&amp;term_src=\"> partnership </a>shall be treated as—   </p>\n\n<p>(1)  transferring all of its assets (subject to its liabilities) to a newly formed <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-1322278904-454322955&amp;term_occur=999&amp;term_src=\">corporation</a> in exchange for the<a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-109770518-454322951&amp;term_occur=999&amp;term_src=title:26:subtitle:F:chapter:79:section:7704\"> stock </a>of the <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-1322278904-454322955&amp;term_occur=999&amp;term_src=\">corporation</a>, and  </p>\n\n<p>(2)  distributing such <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-109770518-454322951&amp;term_occur=999&amp;term_src=title:26:subtitle:F:chapter:79:section:7704\">stock</a> to its <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-792929080-454322956&amp;term_occur=999&amp;term_src=title:26:subtitle:F:chapter:79:section:7704\">partners</a> in liquidation of their interests in the <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-975639300-454322956&amp;term_occur=999&amp;term_src=\">partnership</a>.  </p>\n</blockquote>\n\n<p>I guess if you created a company and all these players just invest in that company, they wouldn&#39;t need to combine.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-1447621300-451549511&amp;term_occur=999&amp;term_src=title:26:subtitle:F:chapter:79:section:7704\">https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=26-USC-1447621300-451549511&amp;term_occur=999&amp;term_src=title:26:subtitle:F:chapter:79:section:7704</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13bsso8/shaking_out_the_paperhands/", "time": 1683556650.0, "subreddit": "r/ThePPShow", "title": "Shaking out the paperhands", "text": "<!-- SC_OFF --><div class=\"md\"><p>I called it before. Now they are holding it just below the 20 mark.</p>\n\n<p>Why?</p>\n\n<p>Because many people bought at $0.10 and will sell now for a quick profit.</p>\n\n<p>Others will shit themselves thinking this is the top and sell at a loss.</p>\n\n<p>Fake resistance to shake those that are weak. </p>\n\n<p>I think those selling now will kick themselves come next week.</p>\n\n<p>We are waiting for the buyout news though, which will be many thousand percent higher, sending a shockwave through the shorts portfolios and initiating the launch sequence.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://i.redd.it/nbr8mf8ygiya1.jpg", "time": 1683545671.0, "subreddit": "r/ThePPShow", "title": "An oldie guide for when to sell during MOASS", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/nbr8mf8ygiya1.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13b51q7/kroll_only_down_for_bbby/", "time": 1683498376.0, "subreddit": "r/ThePPShow", "title": "Kroll only down for BBBY.", "text": "<!-- SC_OFF --><div class=\"md\"><p>So a few weeks ago I was checking out the Sears dockets which are also handled by Kroll.</p>\n\n<p>After not being able to access the Kroll docket search all day, I decided to test if the Sears dockets were up.</p>\n\n<p>To my surprise, they were.</p>\n\n<p>If Kroll was really under maintenance, how likely is it that only the server with BBBY dockets is under maintenance?</p>\n\n<p>Normally you would expect the whole system to be down but ok, it could be the file servers, or a network switch. But you really expect me to believe that they wouldn&#39;t set up redundancy for an ACTIVE case, with a <del>hearing</del> Deadline in 48 hours? The quick links in the sidebar still work as well. Which kind of disproves the theory that the file server is under maintenance.</p>\n\n<p>&#x200B;</p>\n\n<p>This seems like a coincidence with a sub 1 in a trillion chance of not being on purpose.</p>\n\n<p>It seems they added a captcha, which I hadn&#39;t seen before, so maybe they are doing maintenance, and I am just going crazy, but then why isn&#39;t everything offline.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13b3wrs/remember_to_adjust_your_take_profit_before_this/", "time": 1683495855.0, "subreddit": "r/ThePPShow", "title": "Remember to adjust your Take Profit BEFORE this squeezes. IMPORTANT", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>This could be the MOST IMPORTANT thing you do this year.</strong></p>\n\n<p>~2 Weeks ago I was going through my old eToro account where I still have some shares from last year and realized you can only set your TP to 1000% of your cost +/- 1000% current P/L.</p>\n\n<p>This applies not just to eToro other brokers set arbitrary limits as well.</p>\n\n<p>This means anybody who bought recently and didn&#39;t remove these would have a TP in the range of $1-5 MAX. If you set them last year, they could be higher. (eToro set mine at $102 last year).</p>\n\n<p>This is obviously not even a fraction of the buy out price and could stop a squeeze before it ever gets going if there are enough shares, with automated sell orders.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>It is up to YOU to make sure that your investments are properly configured.</strong></p>\n\n<p>Look over your portfolios NOW.</p>\n\n<p>I have taken out my TP&#39;s from ALL my positions, because I want to be in control of my investment. What you do is up to you, but you don&#39;t want to be the idiot selling for pennies, just days before a buyout announcement. You can take it out all together or set it at a price you feel comfortable with.</p>\n\n<p>Making sure that your positions are set up correctly could be the <strong>MOST IMPORTANT</strong> thing you do <strong>THIS YEAR or YOUR LIFETIME</strong>.</p>\n\n<p>You can always add them again later, but you can&#39;t undo it once they have been liquidated.</p>\n\n<p>Make sure your <strong>FRIENDS and FAMILY</strong> also take the time to look over their portfolio, <strong>BEFORE MARKET OPENS.</strong></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13ay8cv/kroll_still_down_hmmm_curious/", "time": 1683483379.0, "subreddit": "r/ThePPShow", "title": "Kroll still down. hmmm curious", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13ahpc3/666_the_mark_of_the_beast/", "time": 1683448692.0, "subreddit": "r/ThePPShow", "title": "666 The mark of the beast.", "text": "<!-- SC_OFF --><div class=\"md\"><p>So while Kroll was down I had to search a bunch of PDFs to find something I was looking for, and stumbled on some interesting loan amounts in the BBBY court documents.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/f4oo9aktedya1.jpg?width=1046&amp;format=pjpg&amp;auto=webp&amp;s=71b6c17d0f378a66b411a39cc0e51a1335e118fb\">https://preview.redd.it/f4oo9aktedya1.jpg?width=1046&amp;format=pjpg&amp;auto=webp&amp;s=71b6c17d0f378a66b411a39cc0e51a1335e118fb</a></p>\n\n<p>It could mean nothing but on 2 lists?</p>\n\n<p><a href=\"https://preview.redd.it/apiyvwuredya1.jpg?width=1031&amp;format=pjpg&amp;auto=webp&amp;s=11caa8bdfcf65f0ac8707e32be5aab65849a4c8f\">https://preview.redd.it/apiyvwuredya1.jpg?width=1031&amp;format=pjpg&amp;auto=webp&amp;s=11caa8bdfcf65f0ac8707e32be5aab65849a4c8f</a></p>\n\n<p>With how often these coincidences have been signs to tell us something, I am going to believe that someone with that many sixes has to be evil.</p>\n\n<p>&#x200B;</p>\n\n<p>PS. I also found more files listing the Restore Capital consignment deal as having been completed after all, but they are not listed on the top 30 creditors list, this seems strange considering with $120m they should be number  2 on the list.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/yDqiX9k2enpTDlO1KIwzR-dcr5ygeD_4tDrGlWrpH9Y.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13agchh/kroll_down_for_maintenance_now_ast_repeat/", "time": 1683444457.0, "subreddit": "r/ThePPShow", "title": "Kroll down for maintenance now. AST repeat?", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0fxtluz03dya1.jpg?width=957&amp;format=pjpg&amp;auto=webp&amp;s=fd86955f337b02e1e7d27ebfcb2068e77fa6fc4b\">Anyone know when this started?</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/M0T3lEnuttJFFYqFDZAX0zruuVNvG2VErFSFTPEf-lo.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13a7tcg/shareholder_list_speculation/", "time": 1683420717.0, "subreddit": "r/ThePPShow", "title": "Shareholder list speculation", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I have been trying to figure out when that shareholder list was made.</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/static-files/4f8724e9-6246-4336-a0d4-281c7ed3bc27\">This S1 list 2,363 holders of record on April 10th</a></p>\n\n<p>After importing the actual list of shareholders into excel and subtracting a few rows of headings, I get close to 2500. Which leads me to believe that the list was created at least a couple of weeks later. 150+ DRS accounts don&#39;t show up overnight.</p>\n\n<p>How much later it was created is anyone&#39;s guess. Did BBBY specifically call up AST to get a new count? Or did they submit an earlier copy, like we have seen them do with some other materials. It can&#39;t be the same list that they got the April 10th count from, and it can&#39;t be the list from the &quot;date of record&quot; for the shareholder vote since that was March 27th a full 2 weeks before April 10th.</p>\n\n<p>My guess is that very few people DRSed shares after AST went down. Since the list was filed in the afternoon on the 5th it could very well be from that day, for all we know, but since all trades take 2 days to settle, it must be at least 2 days out of date.</p>\n\n<p>That means not only could that list be over 100 million shares off, when considering the trading volume for those 2 days. Who is to say that Cede and Co even submitted the ACTUAL share count.</p>\n\n<p>For all we know, Cede and Co could have taken the highest number they found on some filing and added 1/2 the reported shorts to it. Why 1/2 you ask? Because they are about 50 million over the highest number I have found, and there hasn&#39;t been any days when they could have substantially reduced the short interest.</p>\n\n<p>By the way, we are still waiting until the 9th to get the short interest for the 2 weeks of highest volume, including that 900m day. Judging by the 30% increase on the last 2 weeks, this one won&#39;t be much better. I doubt anyone closed, after we declared BK.</p>\n\n<p>&#x200B;</p>\n\n<p>Well, I am rambling, so I will stop here. just wanted to put some thoughts out there about possibilities I had eliminated. I still think the actual share count is much lower than expected, and the real FLOAT is even lower.</p>\n\n<p>&#x200B;</p>\n\n<p>I hope you all are ready for the CARNAGE on monday as the shorts rip each other to shreds, to close.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/139l005/their_next_fud_naked_shorts_buyout_etc_dont_get/", "time": 1683374547.0, "subreddit": "r/ThePPShow", "title": "Their next FUD (naked shorts, buyout, etc.) Don't get Punked, inform yourself", "text": "<!-- SC_OFF --><div class=\"md\"><p>We are already seeing the testing of various other FUD topics.</p>\n\n<p>I am no expert and this is not FINANCIAL or LEGAL advice, this is my opinion based on what I have observed.</p>\n\n<p>&#x200B;</p>\n\n<p>Some things I have noticed.</p>\n\n<ul>\n<li><strong>Cede &amp; CO was allowed to sell those shares</strong>\n\n<ul>\n<li>Not true, the S1 itself does not mean shares exist. It even says they MAY sell shares at certain times. They don&#39;t exist as soon as the for is filed, and even when given to B Riley they don&#39;t become available for purchase by the shorts unless sold into the market</li>\n</ul></li>\n<li><strong>Cede &amp; CO owns all shares</strong>\n\n<ul>\n<li>Not true, Just like a bank doesn&#39;t own your money that you deposit with them. They are HOLDING them FOR somebody.</li>\n</ul></li>\n<li><strong>In a Buyout only real shares will get paid</strong>\n\n<ul>\n<li>Not true, just like any other corporate action the short seller is responsible for paying ALL dividends, and RETURNING those borrowed shares IMMEDIATELY when YOU ask for them. You can even raise the CTB and they have 25 min to agree or return the shares. <a href=\"https://www.interactivebrokers.com/en/software/twsHelp/usersguidebook/specializedorderentry/about_stock_borrow_loan.htm\">(According to IBKR lending guide)</a></li>\n</ul></li>\n<li><strong>The offer will be tiny because of BK</strong>\n\n<ul>\n<li>Not true, not only are there various protections, to stop predatory companies from driving down the price, but we know the buyer is trying to get the shorts and has made a previous valuation of what the assets would be worth. It is my assessment that it would be hard for that same buyer to convince a Court that they were off by an order of magnitude with all the evidence of shorts manipulating the price.</li>\n</ul></li>\n<li><strong>The price will never go higher than a few cents</strong>\n\n<ul>\n<li>Not true. The moment there is an offer announce the price will jump TO THAT OFFER amount, Giving us a massive boost from which the price will continue to rise as the shorts, naked shorts, etc NEED TO COVER. Especially in a deal, where a single entity will own 100% of shares, they would expose themselves to a recall that would create an INFINITY pool, or negotiated settlement situation. This was the case where Martin Shkreli bought 100% of a BK pharma company and recalled the lent shares.</li>\n</ul></li>\n</ul>\n\n<p>It is no longer about making you believe it won&#39;t happen, but to minimize the damage.</p>\n\n<p>We have seen lots and lots of things play out exactly as expected, and I believe they will continue to do so.</p>\n\n<p>In the fall there was a Bond Conversion offer that valued shares at $10-14. I believe whoever took that deal will still be profitable, taking the buyout offer. I believe this offer will be many times higher though.</p>\n\n<p>Kais mentioned a pre-inflation price of $142, which I have seen come up in my math before.  Remember the $80 options? They wouldn&#39;t have been worth exercising unless the price went over.</p>\n\n<p>What could be meant by inflation? Was it the buyout price + shorts squeezing the price upwards? Or is the inflation our shares outstanding? Who knows.</p>\n\n<p>What I do know is that the <strong>shorts are FUCKED no matter what.</strong></p>\n\n<p>Right now they are shitting themselves, because now, it is court RECORD that they did something VERY illegal. They just proved that they have been bankrupting companies in order to profit, while robbing people, manipulating people, and costing people their jobs.</p>\n\n<p>&#x200B;</p>\n\n<p>The shares outstanding listed by Cede is most likely not including MILLIONS of naked shorts, CFDs, ETFs and Tokenized shares.</p>\n\n<p>There is blood in the water and <strong>WE ARE THE SHARKS</strong> and <strong>I AM HUNGRY.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>$420741.69 is not a MEME. Moon Soon, Uranus, Theranus, and Evryanus next.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>*Just caught up on last night&#39;s PPshow and EVERY ONE of these FUDs was pushed by his guests. People like <strong>Mm</strong> who pushed multiple of them at once. They all act like they are on our side and are just giving info. In reality, <strong>THEY ARE THE SHILLS.</strong></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1392g54/i_am_ready_to/", "time": 1683323132.0, "subreddit": "r/ThePPShow", "title": "I am ready to...", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://i.redd.it/ephtstdc23ya1.gif\">https://i.redd.it/ephtstdc23ya1.gif</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/UShe8dR1oLUGPDcE2XxCEt1LENOiZP6cUbzF1ePwZE4.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1391byc/let_the_blood_bath_begin_shares_sold_at_least/", "time": 1683320639.0, "subreddit": "r/ThePPShow", "title": "Let the blood bath begin Shares sold at least 782,610,390", "text": "<!-- SC_OFF --><div class=\"md\"><p>According to the official <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5Nzg4MA==&amp;id2=-1\">list of shareholders</a> Someone said this was as of APRIL.</p>\n\n<p>This is at bare minimum 200 million more than shares EXIST.</p>\n\n<p>&#x200B;</p>\n\n<p>The shorts are beyond FUCKED. </p>\n\n<p>I also think this list is incomplete since we are missing many known shareholders who are unlikely to be holding their shares with Cede and Co.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/138w7pk/seems_the_shorts_got_smart_quick_iep_share_price/", "time": 1683309283.0, "subreddit": "r/ThePPShow", "title": "Seems the shorts got smart quick, IEP share price back to $38.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Either the shorts realized they made a big mistake or people saw the chance at a savings and like many people here, rushed to buy in.</p>\n\n<p>Lets see where this goes in the coming days.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/138l54o/how_the_shills_test_their_fud/", "time": 1683291901.0, "subreddit": "r/ThePPShow", "title": "How the shills \"test\" their FUD", "text": "<!-- SC_OFF --><div class=\"md\"><p>We all know the Shills are working in teams and coordinated in order to come up with new FUD every few days, but how do they know what will work?</p>\n\n<p>To see which FUD will work the best, they sprinkle in little pre-FUD A/B testers.</p>\n\n<p>These are little feeler posts to see: </p>\n\n<ul>\n<li>how people react to them, </li>\n<li>how many replies, </li>\n<li>upvotes, downvotes, </li>\n<li>what the replies are about, </li>\n<li>or if they trigger suspicion.</li>\n</ul>\n\n<p>This is a Feeler comment:</p>\n\n<p><a href=\"https://preview.redd.it/ngcndukd80ya1.jpg?width=803&amp;format=pjpg&amp;auto=webp&amp;s=647b74bdf8da8a2338cb90dcab5d29f3f3f2dc1e\">This is a post by a 7 month old account with almost no Karma asking about relisting in a thread about the CO-OP Agreement.</a></p>\n\n<p>Seem familiar? Anyone who spends enough time here has seen the comments asking about the relisting process this week. I have seen at least 10+ comments specifically about this</p>\n\n<p>&#x200B;</p>\n\n<p>That is not coincidence. That is by design.</p>\n\n<p>They use these to</p>\n\n<ul>\n<li>seed a subject in your mind</li>\n<li>get you thinking about it</li>\n<li>let you dwell on it to build doubt</li>\n</ul>\n\n<p>Then they STRIKE.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/w5lomqt7g0ya1.jpg?width=829&amp;format=pjpg&amp;auto=webp&amp;s=f1861b5b1495d8843c9d2a704d981de4ce084b7f\">Yesterday&#39;s Topic was trading halts.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0rrk1o9cg0ya1.jpg?width=885&amp;format=pjpg&amp;auto=webp&amp;s=3f6962af9ca56a4569e6e07fe1843148d3c531b5\">This one is great, filled with claims of 100k shares and this is their only post</a></p>\n\n<p>Well would you look at that. They even seed them with similar numbers of comments.</p>\n\n<p>&#x200B;</p>\n\n<p>Anybody asking to see your share count, cost basis, or penis, should be viewed with utmost suspicion.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>WE NEED a marker for these posts and these accounts. It will increase the costs of shilling for them if they constantly need to buy or farm new accounts.</strong></p>\n\n<p>&quot;poopyfud&quot; is not enough for these types of posts because it conveys a level of innocence which these posts are NOT.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/iL-DoY1HN-m3Y1bRqlkuaeTwgptXq6fY9aP99x-Y8Ow.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/138ik74/newells_earnings_not_final_8k/", "time": 1683285419.0, "subreddit": "r/ThePPShow", "title": "Newell's earnings not final. 8K", "text": "<!-- SC_OFF --><div class=\"md\"><p>The same day Newell released their earnings report they released an 8K Filing relating to their financial statements which says that these statements should not be considered &quot;filed&quot; meaning they are subject to change.</p>\n\n<p>Along with lots of other language in the earnings report about exclusions that are still under wraps, and statements made during the earnings call, leads me to believe we are going to get some big news in the coming days.</p>\n\n<p><a href=\"https://ir.newellbrands.com/static-files/33b7a4fc-3edd-4be5-a41f-6bca23e5c2ae\">https://ir.newellbrands.com/static-files/33b7a4fc-3edd-4be5-a41f-6bca23e5c2ae</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1388k37/china_is_a_sleeping_giant_and_when_she_wakes_shit/", "time": 1683255311.0, "subreddit": "r/ThePPShow", "title": "China is a sleeping giant and when she wakes, shit is on", "text": "<!-- SC_OFF --><div class=\"md\"><p>We know Icahn is under a short attack but how much damage can they do?</p>\n\n<ol>\n<li>Carl owns most of the float.</li>\n<li>They stated they have $2 Billion cash.</li>\n<li>He is paying $2 dividend</li>\n<li>and he is taking his dividend as shares.</li>\n<li>That means he is going to decrease the float by about 8 million shares.</li>\n<li>That leaves what 35 million shares MAX that he is paying out dividends on.</li>\n<li>That is $700m MAXIMUM of $2 Billion.</li>\n<li>He doesn&#39;t need any collateral to buy BBBY.</li>\n</ol>\n\n<p>Carl isn&#39;t stupid, He is gonna cover himself so even if he loses the bid he still wins.</p>\n\n<p>I believe he already owns most of the debt.</p>\n\n<ul>\n<li>If he has $1.3B + $1.2B of Bonds that is the majority of his share of the purchase.</li>\n<li>If RC is going half cash, half shares for his part of the purchase</li>\n<li>The rest comes from Newell, Pulte, and various other players who want smaller parts of what is left.</li>\n</ul>\n\n<p>I wouldn&#39;t be too worried that the Hindenburg hit piece is going to make him change his mind. It is way too late for that. I have been right about a lot of my predictions, and I believe he already has enough money in this play that there is no backing out.</p>\n\n<p>Between today and the 19th of May I believe this is going to come to an end and if we hold we will destroy the shorts.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1381h6q/we_need_a_misleading_flair_to_fight_the_shills/", "time": 1683237675.0, "subreddit": "r/ThePPShow", "title": "We need a \"Misleading\" flair, to fight the shills", "text": "<!-- SC_OFF --><div class=\"md\"><p>We keep seeing misleading headline articles posted such as the one claiming that the BBBY spinoff is facing a collateral crunch.</p>\n\n<p>FUDsters and Shills use these articles to spread fear and doubt.</p>\n\n<p>Instead of adding context to the misleading headline to make people aware of the deception, they just post the misleading headline as is with a screenshot and often with NO link to the actual story. This is a clear deception tactic designed to scare people.</p>\n\n<p>Another thing that points to  the user being a shill is that they make it as difficult as possible to verify the story, by not linking to the article in question and only posting the screenshot.</p>\n\n<p>If we have a misleading tag/flair. It will make it easier to mark these posts to make people aware of the deception.</p>\n\n<p>Users, who post these types of articles, without proper markings, should also be given as SUSPECT flair to make it more expensive for the shills to post these articles.</p>\n\n<p>These methods will easily and quickly allow us to cut down on FUD posts, and make them burn through their shill accounts at a much faster rate.</p>\n\n<p>&#x200B;</p>\n\n<p>Can the mods please implement these 2 suggestions as quickly as possible to help preserve the integrity of this sub before it turns into <a href=\"/r/BBBY\">r/BBBY</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/13809ih/eyes_on_the_prize_we_are_just_getting_started/", "time": 1683234998.0, "subreddit": "r/ThePPShow", "title": "Eyes on the prize. We are just getting started.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not financial advice. I am no expert, and everyone needs to make their own decisions. This is MY OPINION.</p>\n\n<p>That being said</p>\n\n<ul>\n<li>The shorts know you are on your last leg.</li>\n<li>They know you are expecting big things to happen QUICKLY.</li>\n<li>They will manipulate the price anyway they can.</li>\n<li>They want you to think this is over as soon as possible to minimize losses.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>We have seen this all play out for months and OTC will be no different. After yesterdays run and todays 50% climb mid day obviously some people would take profits.</p>\n\n<p>We are in the final stages though, and if we HODL this will be the last time.</p>\n\n<p>Until we get news I doubt that anything big will happen. There are many paperhands with a low enough average that we will see many swings and lots of volatility.</p>\n\n<p>They know this and they will use that to their advantage.</p>\n\n<p>Why do you think PP keeps asking what your cost basis is. It gives the shorts an idea of what your breaking point is.</p>\n\n<p>If they know many of you are desperate to end this and have a cost basis around $1-2 that is where they will apply the maximum pressure.</p>\n\n<p>They will tell you it is over, they will tell you, you will lose everything if you don&#39;t take your profits and run.</p>\n\n<p>That is the 2 cigs and half a bag of chips.</p>\n\n<p>Did you work tirelessly for a year to break even? Or did you put up with this mental torture for a year to make fuck you money and tell your boss to suck a fat one?</p>\n\n<p>&#x200B;</p>\n\n<p>I am holding. They need ALL our shares, multiple times over.</p>\n\n<p>They are short, they have FTDs, they have short exempts, they have naked shorts, ETFs, CFDs, and all kinds of swap derivatives to cover and close.</p>\n\n<p>They have HUNDREDS of billions riding on this. Just one company, Archegos, exposed them to $180B in losses, how many more Archegos are out there?</p>\n\n<p>They are all praying, hoping, and betting,</p>\n\n<p>On YOU capitulating.</p>\n\n<p>$420,741.69 is not a meme.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/137zkk8/iep_issues_counter_statement_and_announces_2/", "time": 1683233482.0, "subreddit": "r/ThePPShow", "title": "IEP issues counter statement and announces $2 dividend early.", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.prnewswire.com/news-releases/icahn-enterprises-issues-statement-301816600.html\">https://www.prnewswire.com/news-releases/icahn-enterprises-issues-statement-301816600.html</a></p>\n\n<p>You can take cash or shares and as always Carl is taking the shares.</p>\n\n<p>That means the float is getting even smaller. With each quarter, he is basically buying back 1 in 20 shares. That is like an 8 million share buyback every year.</p>\n\n<p>At this rate, within the next 5-10 years he will own 100% of the company unless they do a split at some point or issue more shares.</p>\n\n<p>&#x200B;</p>\n\n<p>Too bad my order today didn&#39;t get filled. It bounced back up as I put it in, and I thought it would dip again, but never did. Maybe the shorts realized how bad of an idea that was.</p>\n\n<p>Tomorrow is another day.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/137xmtr/value_in_grandfathered_leases/", "time": 1683229277.0, "subreddit": "r/ThePPShow", "title": "Value in grandfathered leases.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just had a thought after seeing a post about CH11 allowing BBBY to ditch bad leases more easily. On the flip side it also lets them transfer leases more easily</p>\n\n<p>In the commercial leasing world, sometimes there are special terms that can work in your favor or against you.</p>\n\n<p>One of them can be a clause against rent increases. A mall might do this for anchor stores that they believe will bring in more customers making their other leases more valuable.</p>\n\n<p>A few months ago I had read about a lease in the Mall of America that was practically free.</p>\n\n<p>I am not sure if BBBY has ANY of these types of leases but due to their size and number of locations there is a decent chance that they do.</p>\n\n<p>Lets say you have a lease with favorable terms, such as:</p>\n\n<ul>\n<li>Low revenue share %. (Yes, Malls will take a % of SALES many times)</li>\n<li>10-20 year lease in an area that has gone up in price with several years left on it.</li>\n<li>Open-ended lease with a set rate for the life of the contract.</li>\n</ul>\n\n<p>Before, we have only considered the ease of transfer of a lease, as a marketable asset. The value of a lease could come from many other factors.</p>\n\n<p>&#x200B;</p>\n\n<p>If you signed a 20 year lease, in NY a few years ago, Your monthly rate could be several times less than what a new lease would cost you. A single lease contract could save a tenant millions over the span of several years.</p>\n\n<p>Or if you have a revenue share lease in a mall, a company selling luxury goods might save millions by taking over the favorable rate of the previous lease. Best Buy, Apple Store, Micro Center, Movie Theater might do $100k+ in sales a day. Saving just 1-2% could be worth $5-10 million in savings a year.</p>\n\n<p>Even if you just consider the rate of inflation, you would probably see substantial savings from each and every lease you can sell to another business.</p>\n\n<p>&#x200B;</p>\n\n<p>Multiply this by 400+ stores, you could be looking at another doubling of our current market cap in hidden value.</p>\n\n<p>&#x200B;</p>\n\n<p>Real Estate:</p>\n\n<p>BBBY has many Real Estate Subsidiaries, which leads me to believe that they do own at least 17 of their own stores and rent them back from themselves. They are not used as collateral for the loans of the company according to the Business Structure Matrix in the court filings. I don&#39;t know how that works with BBBY being 100% shareholder in each of these entities but there could be additional value there.</p>\n\n<p>&#x200B;</p>\n\n<p>We keep focusing on a Squeeze or Buyout/Merger but I think when you add it all up whoever the buyer is, is not just some White Knight, they are making out like a bandit.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/137l9m3/shorts_still_going_ham_on_iep_stock/", "time": 1683208199.0, "subreddit": "r/ThePPShow", "title": "Shorts still going HAM on IEP stock", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7f2679t0ktxa1.jpg?width=575&amp;format=pjpg&amp;auto=webp&amp;s=54d633c821cfe5650179d38109a7978c320de5b2\">It just dropped all the way to $28</a></p>\n\n<p>I already put in my next buy order.</p>\n\n<p>Unbelievable how brazen they are in committing these crimes. There are less than 11% of the shares on the open market and they are stupid enough to risk going up against the Godfather of Activist investing.</p>\n\n<p>This reminds me of what happens in those old gangster movies when some punk wants to make a name for himself by going after the Don. It never ends good for them.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Ua1sSLpviCr1aGYGxrZ6z3qyltMlF9RB5mvafaVv2ZU.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/137jnkm/motion_to_have_a_hearing_may_16th_on_bbbyq_day_so/", "time": 1683204543.0, "subreddit": "r/ThePPShow", "title": "Motion to have a hearing MAY 16th on BBBYQ day so they can sell their LEASES.", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NzE5Nw==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NzE5Nw==&amp;id2=-1</a></p>\n\n<p>What a coincidence that they already have a buyer for their leases lined up.</p>\n\n<p>&#x200B;</p>\n\n<p>Shorts are feeling the heat now. They are making them sweat.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/137g7tu/rc_coop_agreement_listed_iss_and_glass_lewis_last/", "time": 1683195033.0, "subreddit": "r/ThePPShow", "title": "RC co-op agreement listed ISS and Glass Lewis LAST YEAR. The vote and proxy switch was planned", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday someone posted a page from the &quot;standstill&quot; agreement with Ryan Cohen.</p>\n\n<p>What I noticed in the text is that BBBY already knew back then that ISS and Glass Lewis would be used as the Proxies, in the near future, and allowed RC to vote with them.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qt68am20fsxa1.jpg?width=1823&amp;format=pjpg&amp;auto=webp&amp;s=956b0630a7322dc9544cd0fdfcd13a0605967d7e\">https://preview.redd.it/qt68am20fsxa1.jpg?width=1823&amp;format=pjpg&amp;auto=webp&amp;s=956b0630a7322dc9544cd0fdfcd13a0605967d7e</a></p>\n\n<p><a href=\"https://www.sec.gov/Archives/edgar/data/886158/000114036122011120/brhc10035704_ex10-1.htm\">https://www.sec.gov/Archives/edgar/data/886158/000114036122011120/brhc10035704_ex10-1.htm</a></p>\n\n<p>&#x200B;</p>\n\n<p>Seems to me that Morrow Sodali was a distraction and they made it seem like they were disorganized and getting kicked out.</p>\n\n<p>&#x200B;</p>\n\n<p>This shows again that the board was not fucking us and that Roach&#39;s unexplainable anti Sue campaign was all staged.</p>\n\n<p>&#x200B;</p>\n\n<p>One of the main Shill manipulation strategies is to turn people against the figureheads of the company. Stop believing the FUD.</p>\n\n<p>&#x200B;</p>\n\n<p>If you don&#39;t think this will squeeze that is fine. But we have enough facts pointing to a buyout being in the works that at the very least you know anyone trying to tell you to sell, is lying. Anyone telling a price, is trying to cap you. NOBODY knows how high this will go. All we know is that the more <strong>GREEDY WE ARE THE HIGHER IT GOES.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>In The BK day 1 hearing, they said they think they will have a deal ready before the judge gets back from vacation. On the 8th of May.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/e_hblMTIn9XQO8CHIWcCykAvEagfRFIB3DHYXzzIQrI.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/137f94e/time_to_think_about_where_you_keep_your_crypto/", "time": 1683191969.0, "subreddit": "r/ThePPShow", "title": "Time to think about where you keep your crypto assets.", "text": "<!-- SC_OFF --><div class=\"md\"><p>When FTX got shut down who got screwed?</p>\n\n<p>YOU did.</p>\n\n<p>If you have assets stashed in crypto exchanges they are using that money to gamble and it is NOT insured like your bank account is.</p>\n\n<p>The most likely places for naked shorts to be stashed is in the crypto exchanges and they will be the hardest to cover during a short squeeze.</p>\n\n<p>We know there is a big play on the investment side in this squeeze and I believe that when there is a margin call we may see big crypto exchanges like BINANCE in trouble.</p>\n\n<p>If I was holding crypto which I am not. I would move that to my own wallet ASAP.</p>\n\n<p>The benefit of crypto is that you can easily move it in and out of different wallets. That means you lose nothing by keeping them in your own wallet over some exchange wallet that may be at risk if they are part of a bankruptcy.</p>\n\n<p>As an unsecured creditor you would be only a step above shareholders when it comes to getting paid out and I would not want to see fellow Apes get screwed in this.</p>\n\n<p>Warn your friends of the risks they face in this uncertain time, before this takes off.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/137evdw/i_hope_aj_has_reassured_you_that_my_price/", "time": 1683190705.0, "subreddit": "r/ThePPShow", "title": "I hope AJ has reassured you that my price estimates are correct. $420,741.69 is not a meme.", "text": "<!-- SC_OFF --><div class=\"md\"><p>They know that they have many times more shorts than there are shares in existence.</p>\n\n<p>Many brokers turned the buy button off, and the price still went up 100% yesterday.</p>\n\n<p>Right now more brokers have removed the buy buttons than during GME squeeze.</p>\n\n<p>If we hold long enough, BBBY could become the most valuable company in history.</p>\n\n<p>$420,741.69 is not a meme.</p>\n\n<p>Just 12 Banks were at risk of $180Billion in losses.</p>\n\n<p>We know they need every last one of our shares multiple times over.</p>\n\n<p>&#x200B;</p>\n\n<p>They are starting slow because they know many people dropped their cost basis. If retail with 40c cost basis sees a dollar, they expect you to sell out of fear of seeing your gains disappear. They only have until june 2nd for the auction. As late as March 28th anyone can put in a bid to keep this company alive and they have no say in it.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/137c2nj/the_sec_is_in_on_this/", "time": 1683181302.0, "subreddit": "r/ThePPShow", "title": "The SEC is in on this", "text": "<!-- SC_OFF --><div class=\"md\"><p>But I think they are on our side.</p>\n\n<p><strong>Why do I think so?</strong></p>\n\n<p>Remember the SEC calling off their conference at the last moment?</p>\n\n<ul>\n<li>Pretty stupid to call off a conference called the SEC Speaks at the last second.</li>\n</ul>\n\n<p>Simple Questions about market mechanics?</p>\n\n<ul>\n<li>Routed to fraud department</li>\n</ul>\n\n<p>Gary Gensler Interview in front of congress? &quot;We lack the laws to go after them in a meaningful way&quot;</p>\n\n<ul>\n<li>Seems like he is telling us something, and now the Hedgefunds are pushing for a replacement. In Hester Pierce, who wants more crypto trading in the finance markets to make it even easier for hedgefunds to control the markets.</li>\n</ul>\n\n<p><a href=\"https://www.theatlantic.com/ideas/archive/2023/05/private-equity-firms-bankruptcies-plunder-book/673896/\">Remember the article about the judge going on vacation during a 363 sale</a>?</p>\n\n<ul>\n<li>A little too convenient if you ask me.</li>\n</ul>\n\n<p>The CEO roundtable discussion last week? All the CEOs are sick of the shorts destroying their businesses and are banding together.</p>\n\n<ul>\n<li>Seems like everyone knows that something big is coming</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>The short traders made it so obvious that they were manipulating this stock there is no denying it. They have grown so big and greedy that the signs of their manipulation are evident across almost all stocks. Almost any stock you look at follows their 3, 6, 9 month cycles in addition to the multiple daily cycles.</p>\n\n<p>Now the SEC has given them 3 days to come clean in private.</p>\n\n<p>There are bigger things at play here and even though I am not sure if the regulators will fuck us again in favor of propping up the system and kicking the can down the road just a few more months. I know that an end is near.</p>\n\n<p>&#x200B;</p>\n\n<p>If it was up to me, I would say let the bad actors fail, that is the point of regulation and licensing after all. An alternative would be to fine each of them 30% of their net worth (companies AND brokers), which will hurt but not BK them, in return for bulletproof guarantees that it will never happen again. Then distribute that money to the affected shareholders and companies.</p>\n\n<p>Only this way can you restore trust in the system. The US government has a choice to make right now, either bailout the rich and punish the poor one LAST time and destroy trust in the US financial system forever. Or bite the bullet and hope it isn&#39;t too late to prevent total collapse.</p>\n\n<p>The emergence of Crypto currencies should have been a sign that people are losing faith in the system and looking for alternatives. Technologies have come a long way and in the not too distant future it will only get easier to replace the US as exchange currency which has allowed it to prosper these last 100 years. Do they really want to be the ones to go down in history as those who destroyed the US.</p>\n\n<p>The Jan 6th riots were not just caused by a group of misled idiots. It was a group of citizens who are sick of constantly getting fucked over. I believe that next time it won&#39;t just be right wing groups or left wing groups, it will be ONE group together fighting for one cause.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/136z8jj/iep_float_is_only_41m_not_much_room_for_the_shorts/", "time": 1683147310.0, "subreddit": "r/ThePPShow", "title": "IEP float is only 41m Not much room for the shorts", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/136ymz8/old_bill_ackermann_hasnt_learned/", "time": 1683145966.0, "subreddit": "r/ThePPShow", "title": "Old Bill Ackermann hasn't learned", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0v6pqugheoxa1.jpg?width=1082&amp;format=pjpg&amp;auto=webp&amp;s=6eba32136e0c9406cdbc8be22570c5efd5547024\">I guess the Herbalife loss wasn&#39;t enough for him</a></p>\n\n<p>Carl specifically warned in his Documentary that you don&#39;t gloat at other&#39;s misfortune when you win.</p>\n\n<p>&#x200B;</p>\n\n<p>Does he really think Carl is worried. He has one of the biggest most dedicated following of any investment banker out there. They made at least 2 movies and several documentaries about him.</p>\n\n<p>Carl aint scared and this kind of taunting is most likely only gonna bite him in the ass.</p>\n\n<p>&#x200B;</p>\n\n<p>Not to mention Hindenberg and Bill have no room to talk about anybody and their ethics.</p>\n\n<p>&#x200B;</p>\n\n<p>I have already started buying IEP, how long does it take until the float is locked from Apes buying in.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/aVuDyNWunjRIhtaS4aWWVGWxu2BafW4T2av7Zc9qwcY.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/136wpbc/icahn_webcast_and_earnings_moved_to_wednesday_may/", "time": 1683141605.0, "subreddit": "r/ThePPShow", "title": "Icahn Webcast and Earnings moved to Wednesday, May 10, 2023 - 10:00 a.m. Eastern Time", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.ielp.com/news-releases/news-release-details/icahn-enterprises-lp-announces-date-change-q1-2023-earnings\">https://www.ielp.com/news-releases/news-release-details/icahn-enterprises-lp-announces-date-change-q1-2023-earnings</a></p>\n\n<p>&#x200B;</p>\n\n<p>I guess we are waiting another week, or they are just trying to build more tension and drop a surprise. Maybe this will give me more time to buy IEP shares before we rip.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/136tjft/now_they_are_pushing_anti_gme_bbby_fud_to_turn/", "time": 1683134374.0, "subreddit": "r/ThePPShow", "title": "Now they are pushing anti GME + BBBY FUD to turn GME against us.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yahoo Finance is a shit show.</p>\n\n<p><a href=\"https://preview.redd.it/oi8jhc9dgnxa1.jpg?width=1051&amp;format=pjpg&amp;auto=webp&amp;s=78baf20e23264ca5422e5d8934961b6ed32a141f\">Seems that whenever it fits the narrative they are pro GME or AMC.</a></p>\n\n<p>They are always trying to drive funds towards those stocks when they need less free funds to be available to buy BBBY. And when they need money to flow out of GME or AMC they drive people towards another stock.</p>\n\n<p>I have a feeling we are about to see some volatility in our favor.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/-bRlOkWOu8K7_TZ8MZm6yx_HEDJqH0M3AcSQwFos8hQ.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/136svth/will_icahn_enterprises_lp_iep_be_our_next_highly/", "time": 1683132909.0, "subreddit": "r/ThePPShow", "title": "Will Icahn Enterprises L.P. (IEP) be our next highly shorted goldmine", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/on6fzijy5nxa1.jpg?width=566&amp;format=pjpg&amp;auto=webp&amp;s=82e40d6e7637d5fd839ecdd7870e74ffac0d51c6\">These shorts want to find out.</a></p>\n\n<p>I just got my first little IEP &quot;ticket&quot; at $32.40 if they bring the price down any more I am buying the next. I will keep buying until they close or the price goes back up.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Almost no liquidity.</li>\n<li>Industry leader</li>\n<li>High dividend yield</li>\n<li>Low risk rating</li>\n<li>WELL KNOWN</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>If they keep shorting this thing, we might have another WAMBO COMBO when the shorts get margin called.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/MN9TnFUH3qLCv31mF2dgpq9woctQ_gjT0bTkgfzWdb8.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/136egnq/yahoo_buy_recommendation_for_bbby_notice_anything/", "time": 1683102153.0, "subreddit": "r/ThePPShow", "title": "Yahoo buy recommendation for BBBY. Notice anything", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><em>Processing img jvcj4ajlamxa1...</em></p>\n\n<p>To the moon and Beyond.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1363gtk/we_go_into_over_time_cunts_bbbyq/", "time": 1683068984.0, "subreddit": "r/ThePPShow", "title": "We Go into Over Time Cunts BBBYQ", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><em>Processing img skv6nytcjjxa1...</em></p>\n\n<p>After seeing the FINRA video of them posting NEGATIVE bids/asks to drive down the price with every purchase, even I was starting to worry that a squeeze was out of the picture and a buyout was our only option.</p>\n\n<p>I wonder what they will try next. I hope you are all still holding your moon tickets for liftoff.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/135o6ri/i_feel_like_i_am_robbing_them_at_these_prices/", "time": 1683039771.0, "subreddit": "r/ThePPShow", "title": "I feel like I am robbing them at these prices.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just picked up 500 shares for $38 and to think a little over a year and a half ago that would have gotten you 1 share.</p>\n\n<p>The shorts havn&#39;t closed, but they are about to, and then they are going to be paying quite the premium.</p>\n\n<p>&#x200B;</p>\n\n<p>Unless we are going into overtime, I think right before the LENDING market closes would be the perfect time for someone to make an announcement. Seems like that is usually when press releases are made.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/135n0wl/i_was_wondering_when_we_would_see_hudson/", "time": 1683038250.0, "subreddit": "r/ThePPShow", "title": "I was wondering when we would see Hudson mentioned in this case", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NjQ4Mg==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NjQ4Mg==&amp;id2=-1</a></p>\n\n<p>Does this mean I was correct?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/135mida/cst_est_or_cst/", "time": 1683037063.0, "subreddit": "r/ThePPShow", "title": "CST, EST, or CST", "text": "<!-- SC_OFF --><div class=\"md\"><p>CST = Central Standard Time</p>\n\n<p>EST = Eastern Standard Time</p>\n\n<p>CST = China Standard Time</p>\n\n<p>&#x200B;</p>\n\n<p>Get it?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/135lbor/beautiful_watching_these_bids_roll_by/", "time": 1683034327.0, "subreddit": "r/ThePPShow", "title": "Beautiful. Watching these bids roll by", "text": "<!-- SC_OFF --><div class=\"md\"><p>I laughed so hard when I saw that 5 share bid cause I knew what was coming.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/135j0hb/the_algos_are_confused/", "time": 1683028704.0, "subreddit": "r/ThePPShow", "title": "The Algos are confused", "text": "<!-- SC_OFF --><div class=\"md\"><p>Look at the trade volume this morning. The algos are so confused they are afraid to make a move.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/135i9aa/keep_in_mind_they_will_try_to_confuse_you/", "time": 1683026604.0, "subreddit": "r/ThePPShow", "title": "Keep in mind they will try to confuse you", "text": "<!-- SC_OFF --><div class=\"md\"><p>Look at previous squeezes and form your strategy accordingly.</p>\n\n<p>My guess is we will see several peaks with the last one being the largest.</p>\n\n<p>We will see the price go parabolic, drop 50% or more and then take off even higher.</p>\n\n<p>Watch the volume, watch the momentum, watch the trends.</p>\n\n<p>They need at least several hundred million MORE buys than sales. If you can keep a rough running total you are a big step ahead.</p>\n\n<p>&#x200B;</p>\n\n<p>Not financial advice, just some tips that MAY be helpful.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/135h4pw/in_just_the_last_week_there_were_over_30m_short/", "time": 1683023231.0, "subreddit": "r/ThePPShow", "title": "In just the last week there were over 30m short exempts. INFINITY and BEYOND", "text": "<!-- SC_OFF --><div class=\"md\"><p>With a short volume over 50% each day they can&#39;t reduce the shorts outstanding, this means over the last several months either the SI has gone up, FTDs have gone up or the naked shorts have gone up.</p>\n\n<p>It is simple math. It takes 1 seller and 1 buyer to complete the transaction. If half of the transactions didn&#39;t have a REAL seller you can&#39;t have bought an excess of shares to close short positions. They never bought more shares than they sold. The number can only have gone up.</p>\n\n<p>The reported SI was over 100m with an official FLOAT of roughly &quot;50m&quot;. There is a good chance they need 200% just to cover the reported shorts.</p>\n\n<p>This is not stopping anywhere near $400 if they start getting margin called.</p>\n\n<p>There are way more naked shares than shares total. They CAN&#39;T close them all.</p>\n\n<p>We are literally going to hit an infinity price.</p>\n\n<p>The current price doesn&#39;t matter. If I go in a grocery store the apples cost $1 but if they are sold out and I need apples or I go to jail how much will I pay for an apple?</p>\n\n<p>Fundementals DO NOT MATTER in a short squeeze.</p>\n\n<p>All that matters is HOW MANY DO THEY NEED. and HOW MUCH ARE YOU GONNA CHARGE to let go of your shares. The greedier we are, the more we make.</p>\n\n<p>Today WE name our price. Today WE are in CONTROL.</p>\n\n<p>$4269.69 is not a meme</p>\n\n<p><strong>To infinity and BEYOND</strong></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1359uqt/the_future_of_bbby_and_why_you_may_want_to_hodl/", "time": 1682997657.0, "subreddit": "r/ThePPShow", "title": "The Future of BBBY and why you may want to HoDL through a squeeze.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I posted a few weeks ago about my mom&#39;s $5k investment in Macromedia and how it would be worth over $500k today. That was barely 100 shares.</p>\n\n<p>If I have interpreted this deal right which I believe I have, it will be similar to the Jefferson Airplane Matrix club deal. They had 3 guys buy 75% of the club for $9k and the founder kept 25% of the shares.</p>\n\n<p>If you use $9B as the buyout price for BBBY and subtract the debt you end up with roughly the buyout price per share I have been predicting for the last few weeks.</p>\n\n<p>So let&#39;s assume someone gave BBBY $9B to pay down debt and buy up 75% of the company, leaving us owning 25%.</p>\n\n<p>That could fund quite a bit of expansion.</p>\n\n<p><strong>BBBY</strong></p>\n\n<p>We have seen lots of posts about international job postings lately, which I believe point to global expansion.</p>\n\n<p>The news of this event will be a marketing campaign worth many billions, and with Apes spread all over the world, you have a customer base that you can only leverage fully if you go international.</p>\n\n<p>My guess would be to first go ecommerce only, leveraging a unified distribution network and marketplace setup to offer many brands while optimizing logistic costs.</p>\n\n<p>However in the EU there are many BBBY competitors that are doing VERY well and could find it hard to keep up with a company with as many advantages as BBBY would enter the market with.</p>\n\n<p><strong>Home Automation</strong></p>\n\n<p>As I have mentioned before, the current state of home automation is a mess of different systems that lack compatibility. </p>\n\n<p>If BBBY used its scale and market penetration to build a unified home automation system they could incentivize brads to use their system to lower costs, while using the higher adoption rates to increase sales, by automating certain task such as reordering consumables. </p>\n\n<p>Every time you use your home automation system will be a chance to make a sale.</p>\n\n<p>Imagine if your fridge could tell you that the light bulb is broken and at the click of a button order a replacement. Or your water system could order replacement filters as needed. This would lock customers to BBBY and their product offerings much more than a rewards membership ever can.</p>\n\n<p>An expansion or partnership into gardening/hydroponic product should definitely be explored since consumables such as potting mixes, fertilizers, seeds and other items could bring a constant stream of revenue in addition to equipment such as lights, pumps, and more.</p>\n\n<p><strong>Baby</strong></p>\n\n<p>Gone are the days of big ugly diaper bags and Baby will be the international leader for baby products. Beyond getting the customers hooked into your ecosystems early and keeping them for life, passing them from subsidiary to subsidiary as they grow older. Young parents spend lots of money on their kids and because they grow quickly, the replacement rate for clothing and other products is measured in months not years.</p>\n\n<p>Not to mention a global brand recognition and wealthier middle class in Asian countries with a huge focus on education will allow baby to bring in revenue from a wide variety of Toys and Educational products.</p>\n\n<p><strong>Teddy Publishing</strong></p>\n\n<p>Teddy Publishing would make a great name for a children&#39;s book/ebook/edutainment company that offers self-publishing for ANIMATED ebooks, normal books, and entertainment/educational products.</p>\n\n<p>CSS animation and audio web APIs have come a long way in recent years, while tablets and phones are everywhere. If you were to offer a platform similar to Flash for quickly and easily publishing animated books, audio books, magazines, etc. You could become the Steam or App store of books and edutainment products. </p>\n\n<ul>\n<li>Educational books with built-in quizzes.</li>\n<li>Animated magazines with integrated mini games.</li>\n<li>Books that come to life.</li>\n</ul>\n\n<p>By offering self-publishing access, you ensure a steady stream of content with big margins and low costs. This could also be offered in partnership or as it&#39;s own company for Teens, and Adults. Think along the lines of a Cookbook with animated recipes, or DIY/Home Improvement magazine with animated guides. Even &quot;How To&quot; books could benefit from animated content and if you already have the systems in place, it is a no brain path to expansion.</p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>What I am trying to say is, BBBY and BABY could have a massive growth potential with the recapitalization and publicity the coming weeks will bring. I believe that they could be the fastest growing company over the next 10+ years.</p>\n\n<p>Most of my suggestions can be implemented with an investment measured in the $10s of millions, but what gives BBBY the big advantage is US because WE ARE THE VALUE.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>I really need to stop writing these book length posts. I hope someone on the inside sees this because when I think about the deep value that BBBY and Baby has and the possibilities, with the right team and capital behind it, I get really excited for what the future holds. If this thing doesn&#39;t squeeze past at least $420.69 I am holding because I am in no rush. Those people who got richest from Microsoft are not those who sold at the IPO, but those who HODLed for the DEEP FUCKING VALUE play.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1354i4n/where_ftd_data/", "time": 1682982839.0, "subreddit": "r/ThePPShow", "title": "Where FTD data?", "text": "<!-- SC_OFF --><div class=\"md\"><p>We are not just missing the data for BBBY but for all stocks.</p>\n\n<p>I just checked the SEC and <a href=\"https://Data.gov\">Data.gov</a> websites and both are missing the first half of April.</p>\n\n<p>The 1st half of march came out before the weekend on march 31st (FRIDAY). Why didn&#39;t we get this months FTDs before the weekend? The 28th was the last trading day of the month. Even if they wanted to wait, why didn&#39;t we get them today?</p>\n\n<p>Something big is happening tomorrow.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/134kxid/the_missing_clue_jefferson_airplane/", "time": 1682943558.0, "subreddit": "r/ThePPShow", "title": "The missing clue. Jefferson Airplane", "text": "<!-- SC_OFF --><div class=\"md\"><p>This was the last clue I needed to make all the numbers match up.</p>\n\n<p>&#x200B;</p>\n\n<p>My previous buyout price prediction all makes sense now.</p>\n\n<p>&#x200B;</p>\n\n<p>We are going WAY over $20 a share based on the number of shorts needing to close, since you would have to be retarded to sell under the buyout price. </p>\n\n<p>&#x200B;</p>\n\n<p>Credit goes to the person who posted about <a href=\"https://en.wikipedia.org/wiki/The_Matrix_(club\">the matrix club</a>#The_Great_Society_tapes).  </p>\n\n<p><a href=\"https://www.reddit.com/user/Frequent-Designer-61/\">u/Frequent-Designer-61</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/134jxrj/what_i_see_happening_to_a_lot_of_you/", "time": 1682940715.0, "subreddit": "r/ThePPShow", "title": "What I see happening to a lot of you.", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rdcmoxg7h7xa1.jpg?width=735&amp;format=pjpg&amp;auto=webp&amp;s=35b18c775b492d49692862193ef08f8516280eb8\">https://preview.redd.it/rdcmoxg7h7xa1.jpg?width=735&amp;format=pjpg&amp;auto=webp&amp;s=35b18c775b492d49692862193ef08f8516280eb8</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ERdNNZQ9it8uQOfodik-vf1QhHLujr7DlAE23-9Qzqw.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/134b971/you_really_think_they_will_get_margin_called_over/", "time": 1682911164.0, "subreddit": "r/ThePPShow", "title": "You really think they will get margin called over $6 a share? GTFO", "text": "<!-- SC_OFF --><div class=\"md\"><p>Anybody pushing these lowball prices like $1.50-$6 is either a shill or missing the boat.</p>\n\n<p>RC, Sue, Icahn and all these people didn&#39;t risk their reputation and freedom and in many cases professional licenses and connections over A couple hundred million.</p>\n\n<p>&#x200B;</p>\n\n<p>That is CHUMP CHANGE for these people. Each and every one of them makes millions a year.</p>\n\n<p>If this thing goes to $6 a share, they barely even cover their wages. let alone the costs.</p>\n\n<p>Just this CH11 costs almost $2 a share.</p>\n\n<p>&#x200B;</p>\n\n<p>During the GME squeeze some of these companies needed $4 Billion ADDITIONAL money before there was even talk of them going broke.</p>\n\n<p>Now we are staring down at least 12 of the biggest investment banks and hedge funds in the world.</p>\n\n<p>These companies have Billions in leverage.</p>\n\n<p>If you pussies fuck this up, after all the work that went into this, you won&#39;t get another chance.</p>\n\n<p>You won&#39;t get another chance not just at a fair market, but at changing your life.</p>\n\n<p>We each need to judge our financial risk tolerance but if you sell for $2 and then it goes to $100, $200, or $420.69 you are going to wish you had done your homework a little better. This stock traded at $80 on similar financials in 2017 and is way more shorted now and has a following worth billions attached to it.</p>\n\n<p>Just the tax credits alone are worth $15 a share.</p>\n\n<p>&#x200B;</p>\n\n<p>Watch the CEO roundtable again and ask yourself if this is going to go to $2 or if you are being price capped by some shills.</p>\n\n<p>&#x200B;</p>\n\n<p>My eToro buys from last year still had a $102 take profit set that I removed yesterday because I like this stock and like what I am seeing. I would rather miss the top than contribute to this thing dying early.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1343xvq/dont_you_feel_like_you_are_talking_to_a/", "time": 1682891120.0, "subreddit": "r/ThePPShow", "title": "Don't you feel like you are talking to a dictionary sometimes?", "text": "<!-- SC_OFF --><div class=\"md\"><p>$username = $randword1.&quot;-&quot;.randword2.RAND(100,999);   and you have your average bobby shill.</p>\n\n<p>These guys have always been low effort as fuck, but it seems like that is all that is left at this point.</p>\n\n<p>The number of shills in these investing board is almost as high as the naked shorts.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/133x2sj/if_this_is_meant_to_f_the_shorts_it_needs_to_get/", "time": 1682873907.0, "subreddit": "r/ThePPShow", "title": "If this is meant to F the Shorts it needs to get BIG.", "text": "<!-- SC_OFF --><div class=\"md\"><p>We know this plan is meant to take them down so hard that they either can&#39;t do it again, or won&#39;t do it again.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li> The top 200 of these companies all have assets over $100B </li>\n<li>100 of them have over $200B. </li>\n<li>14 have over $1T in assets.</li>\n</ul>\n\n<p>Assuming the count goes back to 117m what price do we need for each of them to only lose $1B?</p>\n\n<p>At $400 we are barely hurting them and the guys who gave birth to this baby, are smart enough to know so. </p>\n\n<p>$400 a share is only $40B.  We can all look at the 13F filings and see how many shares they have or don&#39;t have. </p>\n\n<p>I think this will be a marathon and not a sprint. There will be some turtles hoping to hold out until the dust settles. Those will be the biggest losers though because their equals know exactly how big this is and they will seek to profit or reduce losses.</p>\n\n<p>&#x200B;</p>\n\n<p>The word needs to get out that $420.69 is not a meme or this will die and &quot;tomorrow&quot; will be no different from today.</p>\n\n<p>We need the word to get out that there are bigger things at play here and <strong>margin calls come because we hold not because we sell.</strong></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/133v7vp/bahama_bank_420d_chess_or_matrix_is_broken/", "time": 1682869374.0, "subreddit": "r/ThePPShow", "title": "Bahama Bank. 420D Chess or matrix is broken", "text": "<!-- SC_OFF --><div class=\"md\"><p>A Shoal is a sandbank or sandbar where silt has settled and built up, decreasing the water depth.</p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Bahama_Bank\">Bahama Bank in this case is not a Bank but a sandbank or a SHOAL off the Isle of Man.</a></p>\n\n<blockquote>\n<p>In the early hours of Tuesday 6 November 1894, whilst making passage from <a href=\"https://en.wikipedia.org/wiki/Belfast_Harbour\">Belfast</a> to <a href=\"https://en.wikipedia.org/wiki/Fleetwood\">Fleetwood</a>, the <a href=\"https://en.wikipedia.org/wiki/SS_Duke_of_Clarence\"><em>Duke of Clarence</em></a> ran down and sank the steam trawler <em>Albatross,</em> whilst the <em>Albatross</em> was engaged trawling on the Bahama Bank resulting in the loss of the lives of five members of the crew of the <em>Albatross</em> </p>\n\n<p>Those drowned were listed as: <strong>Henry Hudson</strong> (49), Richard Gregg (52),  William Daugherty (50), John Leadbeater (24) and Charles Shimmin (<a href=\"https://en.wikipedia.org/wiki/Sea_captain\"><em>Captain</em></a> <em>Edward Shimmin&#39;s son</em>) (18).<a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceA-8\">[8]</a>   </p>\n\n<p>A claim for damages in lieu of the loss of the <em>Albatross</em> was heard at the Admiralty Court in February 1895, the case being heard by <a href=\"https://en.wikipedia.org/wiki/Judiciary_of_England_and_Wales#High_Court\">Mr Justice</a> Bruce and two Elder Brethren of <a href=\"https://en.wikipedia.org/wiki/Trinity_House\">Trinity House</a>.<a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceC-10\">[10]</a><a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceD-11\">[11]</a> The findings were that the <a href=\"https://en.wikipedia.org/wiki/Sea_captain\">Master</a> of the <em>Duke of Clarence</em> was to blame, citing the inadequate posting of <a href=\"https://en.wikipedia.org/wiki/Lookout\">lookouts</a> and a disregard for the numerous fishing vessels in the area of the fishing grounds.<a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceC-10\">[10]</a> The damages was ascertained by the Registrar of Merchants and Knox received an undisclosed sum. The <em>Albatross</em> was valued at £2,000 but was insured for the sum of £12,000.<a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceE-12\">[12]</a>   </p>\n\n<p>The following sums were awarded to the families of those crew members lost: The widows of William Daugherty, Henry Hudson and Richard Gregg (the three married crew members) received £300 each.<a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceE-12\">[12]</a> The families of Hudson and Gregg also received £150 each.<a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceE-12\">[12]</a> The (seven) children of Daugherty received £250.<a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceE-12\">[12]</a> The father of John Leadbeater received £250.<a href=\"https://en.wikipedia.org/wiki/Bahama_Bank#cite_note-ReferenceE-12\">[12]</a> </p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>Now that we have all had our history lesson and put on our tinfoil sailor hats.</p>\n\n<p>&#x200B;</p>\n\n<p>The deal included certain conditions for eventualities in case at no fault of their own they couldn&#39;t deliver the goods.</p>\n\n<p>According to a highly scientific calculator I found online. These guys are getting the shaft and balls.</p>\n\n<p>My tits have just gotten 5 times more jacked.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/133jvlv/everything_is_a_hint_80_options/", "time": 1682844088.0, "subreddit": "r/ThePPShow", "title": "Everything is a hint. $80 options", "text": "<!-- SC_OFF --><div class=\"md\"><p>Last year, RC bought a ton of $60-80 Strike options for January. Those would have been worthless if the price didn&#39;t reach $80. Are you gonna spend almost $1million on options you think will be worthless? GME also went as low as $0.57 before the squeeze.</p>\n\n<p><strong>We know the setup at this point is:</strong></p>\n\n<ul>\n<li>huge numbers of shorts</li>\n<li>massive numbers of naked shorts</li>\n<li>At least 25-50% reduction in share count, increasing the number of naked shorts even more.</li>\n<li>Massive numbers of FTDs</li>\n</ul>\n\n<p>I believe GME went over $400 a share, not just because of retail investors but because of short covering and big investors buying shares.</p>\n\n<p>Retail didn&#39;t spend $40B+ on GME shares in a matter of days. Just like each of the BBBY runs we didn&#39;t buy nearly enough shares to cause that kind of volume. But that didn&#39;t stop the media reporting that it was all retail investors. </p>\n\n<ul>\n<li>January all the runs happened AH</li>\n<li>Feb there was NO news and it ran in hours.</li>\n<li>900m shares in a no news day in April?</li>\n</ul>\n\n<p><strong>GTFO</strong></p>\n\n<p>I think we do however hold a majority of the real shares at this point. Why?</p>\n\n<p><strong>The VOTE.</strong></p>\n\n<p>In order to vote you have to have shares, that are not lent out, held by your broker. We saw some people post that their proxy vote screen showed zero shares, though. Why is that?</p>\n\n<p><strong>They ran out of shares.</strong></p>\n\n<p>This means they ran out of shares even before the reduction in shares. Which leads me to believe we are already talking about an infinity squeeze scenario.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Remember that this is not just a regular squeeze.</strong> </p>\n\n<ul>\n<li>This is at least 3 delayed squeezes rolled into 1. </li>\n<li>All the downward pressure from the last year or more released. </li>\n<li>All the illegal naked shorting undone.</li>\n<li>All the FTDs delivered</li>\n<li>Positive earnings report coming</li>\n<li>Buyout offer coming</li>\n<li>No more CH11, announcement</li>\n<li>The end of the BBBY CUSIP.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>So How high will it go? Who Knows but what I do know is</strong></p>\n\n<ul>\n<li>2017 BBBY traded for $80 a share.</li>\n<li>$60-80 Jan 20th options were worthless unless it goes that high or higher.</li>\n<li>Grail <strong>just so happened</strong> to be bought for $8 Billion. With share prices between $300-400 (10 days prior) in a cash + shares buyout.</li>\n<li>A similar offer makes that the price floor before all the shorting and FTDs etc are accounted for.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>$420.69 is NOT a meme. This is MOASS</strong></p>\n\n<p>I won&#39;t settle for 2 smokes and half a bag of chips. How about you?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/132sx4p/with_all_you_needy_assholes_i_will_be_rich_in_no/", "time": 1682774851, "subreddit": "r/ThePPShow", "title": "With all you needy assholes I will be rich in no time", "text": "&#x200B;\n\nhttps://preview.redd.it/akikadcurtwa1.png?width=1350&format=png&auto=webp&v=enabled&s=790bd2ba2ce06b2a5a97d5d109f2e7b619b13247", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/7t-XV5XyLEJlSUmcNmQTW6QjXhyZeg9_-AfDCy1tdn4.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/132sx4p/with_all_you_needy_assholes_i_will_be_rich_in_no/", "time": 1682774851.0, "subreddit": "r/ThePPShow", "title": "With all you needy assholes I will be rich in no time", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/132of0k/creating_insiders_by_canceling_the_s1/", "time": 1682760713.0, "subreddit": "r/ThePPShow", "title": "Creating \"insiders\" by canceling the S1", "text": "<!-- SC_OFF --><div class=\"md\"><p>Remember that RC became a &quot;Insider&quot; or 10%+ shareholder because of the stock buyback?</p>\n\n<p>Well what if the canceling of the S1 is how they are forcing people to become insiders or at minimum 4.5% shareholders?</p>\n\n<p>Remember they are doing everything BY THE BOOK to cover themselves.</p>\n\n<p>If RC and Ichan and maybe even some others were hiding their ownership by staying just below that limit, the canceling of the S1 just upped their ownership stake by a massive margin.</p>\n\n<p>This would force them to file a SEC disclosure within the next few days. While also having to be named in the court documents.</p>\n\n<p>This means nobody can sue them for increasing their stake in the company, because it wasn&#39;t their own doing. How could they have known the company was about to reduce their share count by 30%.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PS. Still Verifying the below theory.</strong></p>\n\n<ol>\n<li>The lawsuit about RC making swing profits also seems highly suspect. I imagine this could also work in reverse, forcing Hudson or any of the equity buyers who bought into the offering to give up profits from their share sales paying off the entire ABL.</li>\n<li>There is also a filing about large share transfers. If BBBY never delivered the shares to Hudson (there is a clause about paying interest until they deliver) and they are now no longer ALLOWED to deliver those shares. Then Hudson shorted millions of shares under the assumption they would hit the market but never actually gets those shares delivered. This would make all dilution over the 117m shares disappear instantly.</li>\n<li>If either of the above is correct the only dilution I havn&#39;t figured out how it will be reversed is the 300m ATM from the S3. I imagine that those are the shares sold to allies or maybe were actually sold into the market who knows.</li>\n</ol>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/132ncc7/algos_dont_understand_memes_ready_for_monday/", "time": 1682756917.0, "subreddit": "r/ThePPShow", "title": "Algos don't understand memes. Ready for monday", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/doz49kipaswa1.png?width=900&amp;format=png&amp;auto=webp&amp;s=7632d0559f139f88a22f65e6a62775d962d68498\">https://preview.redd.it/doz49kipaswa1.png?width=900&amp;format=png&amp;auto=webp&amp;s=7632d0559f139f88a22f65e6a62775d962d68498</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/KUaw_lxNT6E3K_J5ZEpzqB_XGMTd3TcYuWOpzZhz5_s.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/132a2jj/supply_reduction_has_started_s1_withdrawn/", "time": 1682716617.0, "subreddit": "r/ThePPShow", "title": "Supply Reduction has started S1 withdrawn.", "text": "<!-- SC_OFF --><div class=\"md\"><p>BBBY just withdrew the post RS S-1 Filing</p>\n\n<p><a href=\"https://www.sec.gov/files/form1-n.pdf\">https://www.sec.gov/files/form1-n.pdf</a></p>\n\n<p>&#x200B;</p>\n\n<p>As I already predicted last week or so. First, make the shorts think there will be a massive amount of shortable shares coming in the future to keep them from closing. The short volume last month was in the billions. If you thought the company was dumping infinite shares onto the market, why would you close?</p>\n\n<p>&#x200B;</p>\n\n<p>Then make those shares disappear. Let&#39;s see that FTD count come out later tonight.</p>\n\n<p>TIK TOK</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/131ul49/newell_def_made_it_clear_they_are_hiding_something/", "time": 1682692990.0, "subreddit": "r/ThePPShow", "title": "Newell def made it clear they are hiding something.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Newell made it very clear especially with that last question in the webcast, that they are working on something they are not telling yet.</p>\n\n<p>I wouldn&#39;t be surprised if someone in the know is about to post a news story.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/131sd23/check_your_twitter_sessions_someone_is_looking/", "time": 1682689866.0, "subreddit": "r/ThePPShow", "title": "Check your Twitter Sessions. Someone is looking into our accounts.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/131sd23/check_your_twitter_sessions_someone_is_looking/", "time": 1682689866, "subreddit": "r/ThePPShow", "title": "Check your Twitter Sessions. Someone is looking into our accounts.", "text": "These 3 IPs logged into my twitter account last night.\n\nI do not use twitter on any Iphone and I don't live in the US.\n\nThey seem to be VPN addresses. I am still working on figuring out what is going on. \n\nTwitter for iPhone  \nApr 28, 2023, 2:45:43 AM  \n96.9.206.103 (United States)\n\nTwitter for iPhone  \nApr 28, 2023, 2:45:10 AM  \n89.208.183.177 (United States)\n\nTwitter for iPhone  \nApr 28, 2023, 2:44:03 AM  \n64.44.104.187 (United States)", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/131qlox/i_hope_you_all_have_your_hype_memes_warmed_up_and/", "time": 1682685653.0, "subreddit": "r/ThePPShow", "title": "I hope you all have your hype memes warmed up and ready to go.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Once this shit kicks off, we will need plenty of memes to fuel our rockets to the moon and beyond.</p>\n\n<p>Today we have a chance to go down in history.</p>\n\n<p>Today we HODL because when that announcement drops.</p>\n\n<p>They NEED those shares at ANY COST.</p>\n\n<p>$420.69 is not a meme</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/131njkq/lazard_earnings_report_at_8am/", "time": 1682676922.0, "subreddit": "r/ThePPShow", "title": "Lazard Earnings report at 8am", "text": "<!-- SC_OFF --><div class=\"md\"><p>Lazard was another one of the buyers that went unnoticed during the Equity raise in February.</p>\n\n<p>They are announcing earnings at 8am EDT.</p>\n\n<p>Could we have another surprise announcement?</p>\n\n<p><a href=\"https://lazardltd.gcs-web.com/events-and-presentations\">https://lazardltd.gcs-web.com/events-and-presentations</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/131kfbw/top_financial_group_went_from_350_to_223_in_the/", "time": 1682665881.0, "subreddit": "r/ThePPShow", "title": "TOP Financial Group went from $3.50 to $223 in the last week", "text": "<!-- SC_OFF --><div class=\"md\"><p>They are up over 3500% in the last week</p>\n\n<p>Fuck anybody that claims that BBBY can&#39;t do it. We have been held down with the shorts building as we buy more and more.</p>\n\n<p>I bought 7500 shares for $900 yesterday. How many regards does it take to buy 1 Billion shares?</p>\n\n<p>We spent billions last year in 2 weeks. We have all been trying to get our averages down. I actually increased my position almost 30x since last year.</p>\n\n<ul>\n<li>how many of us do you think put at least $1000 in in the last week?</li>\n<li>how many put at least $2000 in in the last 2 weeks?</li>\n<li>Do you think it is at least 100k people? That would be at least 1BILLION shares.</li>\n</ul>\n\n<p>BUT we already know that at least 100m shares were already being held by retailers and institutional investors.</p>\n\n<p>We know 111m shares were held by B Riley. I doubt those have been put in the market yet.</p>\n\n<p>lets say 200m shares are locked up before the price went below 50 cents.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>So do you think 50k people bought 10k shares?</li>\n<li>I own over 30k shares.</li>\n<li>So do you think there are 10k people like me?</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>WE OWN the float multiple times over. They are about to get FUUUUUCKKED.</p>\n\n<p>If we hold, they will get liquidated.</p>\n\n<p>Archegos alone left 12 banks with $180B in loss exposure. How many more Archegos are there?</p>\n\n<p>&#x200B;</p>\n\n<p><strong>$420.69 is not a meme.</strong></p>\n\n<p>Don&#39;t let them lowball you. look how previous squeezes moved. it is almost always a &quot;pre squeeze&quot; before the real profits are made.</p>\n\n<p>&#x200B;</p>\n\n<p>THIS is how a squeeze moves. The first peak is to shake the paperhands.</p>\n\n<p><a href=\"https://preview.redd.it/1nbo8xoytkwa1.png?width=942&amp;format=png&amp;auto=webp&amp;s=2b3598f201835264d6c3e7156af7eabd44bd3b0a\">This was TOP Financial group YESTERDAY They are getting their money ready</a></p>\n\n<p>VW had it&#39;s first peak around $100 before going to $900</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/loyJ8uGHadAml7W7FcQZq4smwt6s7cPDQOwdbwRVTbI.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/131iunc/42069_is_not_a_meme/", "time": 1682660446.0, "subreddit": "r/ThePPShow", "title": "$420.69 is not a meme", "text": "<!-- SC_OFF --><div class=\"md\"><p>We need to keep in mind that GME went to $420 a share way before they shorted the stock as hard as BBBY is shorted now.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>We have seen 3 consecutive squeezes suppressed and adding additional pressure.</li>\n<li>Crypto markets and ETFs have grown in size and have been used to add naked shorts to this stock.</li>\n<li>The reported shorts have increased 30m shares 2 weeks ago.</li>\n<li>Since then, we have seen MASSIVE short volume of almost 2B shares, with no reason for the shorts to close.</li>\n<li>GME didn&#39;t have the eyes on it from the start as BBBY does.</li>\n<li>Once the announcement comes, the FOMO is going to be insane with people hoping to get into GME 2.0.</li>\n<li>I think the shorts are going to eat each other alive in hopes to beat each other to the exit.</li>\n</ul>\n\n<p>We are seeing everything line up for the perfect storm. $420.69 is not a meme.</p>\n\n<p>&#x200B;</p>\n\n<p>Fuck the shills Anyone trying to warn you to get out or doubt the board, RC or Icahn is a fake.</p>\n\n<p>The number of lies from people pretending to be on our side is unreal. Everything down to that guy last night on PPshow claiming you can&#39;t be in 2 lawsuits at once is BULLSHIT. They prey on your ignorance.</p>\n\n<p>&#x200B;</p>\n\n<p>Trust your board, Trust your instinct, Fuck the shorts.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>This is how a squeeze moves. TOP went over 3200% YESTERDAY. </p>\n\n<p><a href=\"https://preview.redd.it/ylmb3vjgtkwa1.png?width=942&amp;format=png&amp;auto=webp&amp;s=111629a9a0fab6df618d97c4e276de3e8a369f97\">After the big drop comes the real rip.</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/g281WrC58x2ascwH9Tg7C6ZgIzD5UJrD3RrC40VqRr4.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1311mb5/no_fucking_way_do_you_see_what_they_are_doing/", "time": 1682620624.0, "subreddit": "r/ThePPShow", "title": "No fucking way. Do you see what they are doing", "text": "<!-- SC_OFF --><div class=\"md\"><p>Edit: Fixed link</p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NTUzOQ==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NTUzOQ==&amp;id2=-1</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/130nb5w/short_exempt_volume_almost_40mil_this_week/", "time": 1682604499.0, "subreddit": "r/ThePPShow", "title": "Short exempt volume almost 40mil this week", "text": "<!-- SC_OFF --><div class=\"md\"><p>If you think they are covering all these short exempts they have been creating, you are crazy. If they did we would see all that price movement that OUR buying would have caused.</p>\n\n<p>Fidelity 90%+ buys</p>\n\n<p>eToro 0.78% of 2 million users invest in BBBY with 80%+ Buys</p>\n\n<p>Interactive broker and others won&#39;t be any different.</p>\n\n<p>&#x200B;</p>\n\n<p>We own the float.</p>\n\n<p>&#x200B;</p>\n\n<p>The ortex data has shown a few hundred k to a few mil excess downward pressure each day, but we saw the extra shorts being created in the 10s of millions.</p>\n\n<p>Between the 30th-14th they added almost 30m SI on the reported shorts. Barely 600m short volume on reported. At that rate the reported SI should have grown by almost 60m since then based on the last 2 weeks trading.</p>\n\n<p>By my estimate the reported SI sits at almost 200m shares.</p>\n\n<p>It could be much higher though.</p>\n\n<p>Regulation S allows them to hide FTDs on EU exchanges. That is why we keep seeing funky after hours and AM drops. As long as they short them on the EU markets which close at 11-12 EST they don&#39;t have to report them.</p>\n\n<p>The 2 weeks before the 31st we saw every night up almost 30% and red at market open. This was them hiding/closing short positions on EU and AH markets. We DIDN&#39;t see that this last week. We saw it go lower in AH meaning they never closed.</p>\n\n<p>My guess is they have billions of naked shorts sitting offshore. In addition to the ETF and CFD shorts on crypto markets.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/130mdqd/last_night_i_posted_on_facebook_and_the_fomo_is/", "time": 1682602513.0, "subreddit": "r/ThePPShow", "title": "Last night I posted on Facebook and the FOMO is real.", "text": "<!-- SC_OFF --><div class=\"md\"><p>So last night I posted on facebook saying that at these prices throwing $10 bucks at BBBY was a cheap yolo bet, I was willing to take and if it goes back to last year&#39;s price of $30 is worth $30k. I ended it with today I bought 7500 shares for $900 and if this becomes GME 2.0 I am retiring.</p>\n\n<p>2 of my friends picked up $100 and $110 worth of shares, and I rarely even use FB.</p>\n\n<p>&#x200B;</p>\n\n<p>I think that the FOMO is gonna be real once word gets out to those who are not in the loop. At these prices and with the shorts infinitely shorting the stock, I think there really are billions of shares out there.</p>\n\n<p>&#x200B;</p>\n\n<p>GME took off once the word got out to the masses and I think this is what is gonna happen here. I wouldn&#39;t be surprised if we see some news stories soon about certain people buying in.</p>\n\n<p>&#x200B;</p>\n\n<p>The VW, Hertz, and a couple other squeezes were really short and quick spikes. If the last listed price for BBBY is in the $10-100s before delisting, the shorts could get stuck paying huge interest rates, FOREVER.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/130aonh/buck_bunny_gamestopnft_28th_2pm_launch/", "time": 1682572439.0, "subreddit": "r/ThePPShow", "title": "Buck Bunny, GameStopNFT, 28th, 2pm, launch?", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/11ial8zt1dwa1.png?width=500&amp;format=png&amp;auto=webp&amp;s=2537118ea24955d1ed625468a6b122c80360ffee\">https://preview.redd.it/11ial8zt1dwa1.png?width=500&amp;format=png&amp;auto=webp&amp;s=2537118ea24955d1ed625468a6b122c80360ffee</a></p>\n\n<p>Lots of words we have heard recently. What does it mean?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Dl3JpwXr2ywC3_-v-De9Yqk6lya5BOmbHASo_zpQt1A.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1302huq/twitter_has_450_million_active_users_a_month_sold/", "time": 1682549911.0, "subreddit": "r/ThePPShow", "title": "Twitter has 450 Million active users a month sold for $40B", "text": "<!-- SC_OFF --><div class=\"md\"><p>Most of twitter is bots and doesn&#39;t generate nearly as much revenue. And has projected $4.5B ad revenue 2023, yet sold for $40B.</p>\n\n<p>BBBY has 20m PAYING customers and a large percentage paying $30 a year for membership. BBBY has ~$5-6B Revenue a year.</p>\n\n<p>Amazon has 200m Prime members world wide and $500b market cap.  $356 billion in US sales in 2022 and roughly $500B world wide.</p>\n\n<p>BBBY should have a market cap closer to $25-10B depending on if you value it like Twitter or Amazon. And this is while BBBY has been beaten down to a low point, financially and operationally.</p>\n\n<p>With some proper investment, this company would thrive in a year or 2 simply based on the media coverage it would receive.</p>\n\n<p>That is why Kmart was able to buy Sears just 2 years after it came out of BK for $12B. </p>\n\n<p>&#x200B;</p>\n\n<p>The value is there, you just have to set it in motion. We are the value.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/1301v3i/bbby_always_good_for_a_chuckle/", "time": 1682548398.0, "subreddit": "r/ThePPShow", "title": "BBBY Always good for a chuckle", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xgk89ifj2bwa1.png?width=484&amp;format=png&amp;auto=webp&amp;s=6ea8ad8ce4b5650586210fe49f4d9103cfb0a935\">$10k Ask. $9999.89 Spread</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/YRaBPLEX2zT4e3U3bBtX8iaMGcj_ZPrE14njLkO8v7U.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12zz5c0/bed_bath_and_beyond_made_it_into_the_win_10/", "time": 1682541931.0, "subreddit": "r/ThePPShow", "title": "Bed Bath and Beyond made it into the Win 10 Desktop trending searches.", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/msdwzbo5jawa1.png?width=394&amp;format=png&amp;auto=webp&amp;s=330a2c340e45b237111763d822b50b826eceef89\">That was unexpected. But People like Bed Bath Beyond</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/yoDwNB6lle-AesjWqdzwD6RLM49aJm1fgrF5mlUKRbI.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12zsikg/you_thought_i_was_kidding/", "time": 1682533204.0, "subreddit": "r/ThePPShow", "title": "You thought I was kidding", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nu4l67y2t9wa1.jpg?width=425&amp;format=pjpg&amp;auto=webp&amp;s=f3d4ff1497ce97d443a2d35010ab0b5761cabb5e\">More to come. </a></p>\n\n<p>Gotta Pace yourself. </p>\n\n<p>Don&#39;t want to be the guy passed out in the corner by 11pm with sharpie all over your face.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/7nTYcNTqqaakJX_sxNnlBwDAyvmBSfdR416rSEerNdw.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12zef1e/we_told_them_we_would_diamond_hand_and_hodl/", "time": 1682508076.0, "subreddit": "r/ThePPShow", "title": "We told them we would Diamond Hand and Hodl through everything till the WIN.", "text": "<!-- SC_OFF --><div class=\"md\"><p>To make a big play you gotta stick to the plan.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>We said we were down.</li>\n<li>We said We would buy</li>\n<li>We said we would HODL</li>\n<li>DIAMOND HANDS remember?</li>\n</ul>\n\n<p>The board took us at our word, to maximize shareholder value. Now buckle up and strap in.</p>\n\n<p>This has always been the play. Anyone taking a loss at the end of this DIDNT STICK TO THE PLAN.</p>\n\n<p>We asked for this and they delivered.</p>\n\n<p>We know they had 2 buyers in January that JP didn&#39;t approve. Now it isn&#39;t up to JP anymore. The January financials showed the turnaround plan was working. </p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>My math showed neutral to positive earnings either on THIS or NEXT quarter. </li>\n<li>Revenue didn&#39;t go down but costs sure did after closing 400 stores that weren&#39;t contributing.</li>\n</ul>\n\n<p>Those 2 buyers would have to be stupid not to bid now.</p>\n\n<ul>\n<li>Why do you think JP got scared? </li>\n<li>Why do you think we still don&#39;t have Q4 earnings?</li>\n<li>Why do you think there are still positions under NDA?</li>\n</ul>\n\n<p>I will tell you what I think.</p>\n\n<ul>\n<li>Nordstrom stock went up 28% after RC tweet. Just testing if he still has the following?</li>\n<li>Si numbers were up 30% 2 WEEKS AGO.</li>\n<li>Shorts never closed after the 2 BILLION shares sold since then.</li>\n<li>Didn&#39;t you wonder why the Judge asked for 4.5% shareholders? NO SEC FILING under 4.9%</li>\n<li>RC lift, Ichan lift, how many 4.5% shareholders can you hide with 600m shares? Enough to raise us to the moon.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>I know what I am doing. What are you going to do?</p>\n\n<p>I LIKE THIS STOCK.</p>\n\n<p>&#x200B;</p>\n\n<p>As a nerdy German kid who moved to the US in the 90s, I grew up in a small suburb and have thousands of fond memories of this company. From hiding on the construction site as they built the shopping center to avoid the high school&#39;s administrators when we snuck off to smoke a cig. To enjoying the nice cold air of the AC on hot summer days, after smoking a fatty by the dumpsters with friends. BBBY was always there for me during our teenage years. This company has deep fucking value, just like GME, not all of it is monetary and I believe there are people who see that and people who just want to make a buck at other&#39;s expense. But I like this company and I like this stock.</p>\n\n<p>&#x200B;</p>\n\n<p>None of this is financial advice. You do you, I am bullish.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12yx409/what_happens_with_cfd_short_positions_at_delisting/", "time": 1682459034.0, "subreddit": "r/ThePPShow", "title": "What happens with CFD short positions at delisting?", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I was just checking what Etoro does when a stock is delisted.</p>\n\n<p>Stocks that are traded on OTC should be kept open but CFD positions are closed at current market value according to their help guide.</p>\n\n<p>So does this mean that CFD SHORT positions also get closed?</p>\n\n<p>&#x200B;</p>\n\n<p>We may see that trigger a squeeze if all the shit brokers who ONLY offer CFD trading close people&#39;s positions at once and trigger mass buying. I predict that there are quite a few international short traders using CFDs to short BBBY.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12ywd44/new_short_interest_103770796_up_until_the_15th/", "time": 1682457404.0, "subreddit": "r/ThePPShow", "title": "New Short interest 103,770,796 up until the 15th.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Like I said. They started the mass short 2 days before the end of the month to hide these until now.</p>\n\n<p><a href=\"https://preview.redd.it/xwff1gh3j3wa1.png?width=916&amp;format=png&amp;auto=webp&amp;s=3497239a6b610d168422eebbf4802499fc5c7c9c\">It will be much higher now</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ug7900twj3wa1.png?width=1365&amp;format=png&amp;auto=webp&amp;s=ef946a71684f533a145a477f80b342e8d540aa15\">This SI report only includes these days</a></p>\n\n<p>See how the trading volume goes 5X on the 17th.</p>\n\n<p>&#x200B;</p>\n\n<p>TIK TOK mother fucker.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/53Ui8DioTX1rDYhVyVo-xOlBO-5GTJ_T8359qQWOpOY.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12ymr14/look_at_zales_turnaround_closest_i_can_think_of/", "time": 1682436644.0, "subreddit": "r/ThePPShow", "title": "Look at Zales turnaround. Closest I can think of to BBBY", "text": "<!-- SC_OFF --><div class=\"md\"><p>Zales share price dropped hard 2007 during the recession and hovered between $1-3 and spiked to $7.50 every few months for several years. 2013 they do a turnaround and right as they reach profitability (after 3Q) they declare CH11 BANKRUPTCY after getting private equity funding from Golden Gate Capital.</p>\n\n<p>Shareholders got $21 a share CASH money.</p>\n\n<p>They also sold the business in 2 parts.</p>\n\n<p>&#x200B;</p>\n\n<p>I have said months ago, DCA down below $20. Ideally below $15. It is harder to say how much dilution has an effect on the buyout price depending on how much our buyer already owns of the diluted shares. If he owns 50% it may be worth it to pay $10B for the other 50%.</p>\n\n<p>&#x200B;</p>\n\n<p>RC valued the company a $5-30B if it managed to reach profitability. At 30B even post dilution that is $30 a share.</p>\n\n<p>It all comes down to the Revenue multiple we can achieve. $6B Revenue x6 (Like Etsy) puts us at $36B.</p>\n\n<p>&#x200B;</p>\n\n<p>THIS IS NOT OVER.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>PS. I may be wrong, BBBY seems to still control the leases on many of the stores they already closed. If this is the case, then there is tremendous value there to a potential buyer in the real estate subsidiaries. Opening a new store usually takes 18–24 months, of negotiations, etc. and if you can cut that time by 3-6 months x 400 by taking over the lease free and clear, someone like Wallmart, TJX or Target could be willing to throw you a couple million. We know Tritton renovated 600 stores, and depending on which stores were kept and for how long, we could be looking at several hundred million in value.</p>\n\n<p>When you are talking about parting out a company, THESE are the types of things that bring big value that is not accounted for in a balance sheet.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>None of this is financial advice.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12xf9qu/just_noticed_etoro_limits_your_max_take_profit/", "time": 1682341816.0, "subreddit": "r/ThePPShow", "title": "Just Noticed Etoro limits your max take profit", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I just wanted to lock in my squeeze fail safe on some shares I still have on eToro. Since sometimes it is just 1 candle or 2 that meet a certain high I figured I would set some positions to $100 TP in case I miss it I would at least break even on this play.</p>\n\n<p>Well according to Etoro you can only set a TP of 1,000% of your investment +/- 1,000% of your CURRENT P/L. In most cases that would be more than sufficient. </p>\n\n<p>In this case it is only 200% of our buy in price though.</p>\n\n<p>&#x200B;</p>\n\n<p>What does this mean? </p>\n\n<ul>\n<li>IF you buy more set a TP at the max right away.</li>\n<li>IF you already set a TP on a position, it may be better to leave it just in case.</li>\n<li>As the price goes up you can increase the TP, but you should always do the math first.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>IE. I have shares I bought at $5 that I set a TP of $50 on at that time and it still stands. If I were to change that TP now I would only be able to set it at $10.</p>\n\n<p>&#x200B;</p>\n\n<p>Seems pretty retarded to set an arbitrary limitation like that, as it directly affects your trading during high volatility moments. I am getting tired of these limitations that are designed to force us into bad decisions.</p>\n\n<p>Day trading limits keep us from selling because we don&#39;t want to get strikes, TP limits keep you from setting a TP out of fear of getting closed out. Not to mention that EToro can close your position whenever and keeps any shares you are given in a corporate action.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12wjxb3/a_crazy_thought_chapter_11_to_avoid_rs/", "time": 1682272395.0, "subreddit": "r/ThePPShow", "title": "A crazy thought. Chapter 11 to avoid RS", "text": "<!-- SC_OFF --><div class=\"md\"><p>Many people called that we wouldn&#39;t need to do an RS.</p>\n\n<p>Seems they were right.</p>\n\n<p>&#x200B;</p>\n\n<p>BK means BBBY is protected from creditors, they no longer need to dilute the shares and raise equity because the creditors can&#39;t touch our assets while we buy a couple more weeks.</p>\n\n<p>&#x200B;</p>\n\n<p>How long does that last? Who knows, but my bet is that it is long enough to SELL BuyBuyBABY. Isn&#39;t that what we have fought for all this time?</p>\n\n<p>&#x200B;</p>\n\n<p>Buckle up buttercup, it is gonna be a bumpy ride.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12w5tc2/who_files_bankruptcy_2_days_before_releasing/", "time": 1682250416.0, "subreddit": "r/ThePPShow", "title": "Who files bankruptcy 2 days before releasing earning?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Something doesn&#39;t add up.</p>\n\n<p>Either the board wants to spend years in court and get their reputations utterly annihilated. Along with the 12 Banks we already know from the Archegos swaps.</p>\n\n<p>OR this is a final ploy to push the sale through.</p>\n\n<ul>\n<li>This will make getting FTC approval for a sale much easier if it hasn&#39;t been given yet.</li>\n<li>Shorts are going to pile in like a mother on Monday and on the 25th SI numbers are released for 1st half of the month.</li>\n<li>They listed assets and liabilities between 1-10 Billion on the filing. Leaving lots of wiggle room.</li>\n<li>&quot;Pursuing asset sales&quot; to get out of bankruptcy seems like a way of saying we are selling, BABY but had no idea a sale was gonna happen at the time of the Etoro interview.</li>\n<li>The unusual large calls that sold last week were for NOV12th and Bullish as F.</li>\n</ul>\n\n<p>I am Bullish.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: PS why is the $240M ~ same as what BBBY was supposed to raise in excess equity?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12vlk25/people_need_to_be_reminded_of_the_true_value_of/", "time": 1682202000.0, "subreddit": "r/ThePPShow", "title": "People need to be reminded of the TRUE value of this company and what the play is here.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The current dilution was planned from the start. We saw those shares listed on filings as early as LAST year.</p>\n\n<p><a href=\"https://preview.redd.it/ybvztv808iva1.png?width=1020&amp;format=png&amp;auto=webp&amp;s=f8a75f6016454bdb56a05982b1b5810c09b9f13a\">David Simpson https://twitter.com/pirateportfo/status/1649431185456775168</a></p>\n\n<p>Ryan Cohan&#39;s letter outlined what BABY would be worth with the CURRENT financials ($1.5b) or if BBBY managed profitability ($5-$30 BILLION). BABY is the Ultimate Destination for Baby products, and that is what RC does. Not only that BBBY could be turned into the Ultimate destination for COLLEGE. They already own the trademark &quot;College and BEYOND&quot;. Havn&#39;t we heard that phrase &quot;and BEYOND&quot; all week? 😉</p>\n\n<p>At a share price in the mid $200s it is unreasonable for retail investors to buy lots of shares, and it is much more realistic to divide that price by 5,10,20 to bring that price into the $10-20 range per share and leave room for future growth.</p>\n\n<p>&#x200B;</p>\n\n<p>I believe they will do the RS to get a new CUSIP and kill old naked. Either they close or rot with them, who cares. Then do a SPLIVIDEND (Like GME did) using the 5 million post RS shares to satisfy our hero with a 19% stake and using the warrants they bought from him with those shares to reward shareholders.</p>\n\n<p>&#x200B;</p>\n\n<p>If you vote NO you FUCK THE ENTIRE DEAL. The board is telling us with 2 proxy companies that this is in our best interest and that we lose it all if RS doesn&#39;t happen.</p>\n\n<p>Nobody EVER showed ANY evidence BBBY was turned down by ANY proxy company. The first one was AST owned and could be seen as a conflict of interest. Morrow Sodali and ISS are 2 leading companies in the field, advising us that it is in our interest. They wouldn&#39;t toss their reputation for a proxy vote pay out in the 10s of thousands.</p>\n\n<p>&#x200B;</p>\n\n<p>The claim that they were turned down was MADE UP by people like Roach who have ZERO proof. I actually really liked Roach&#39;s DD until recently, but ever since he &quot;flipped&quot; he has been pushing nothing but WRONG dates, and misinformation, and made up claims. I am not ready to say I am certain he is a shill, but I am not basing any decision on what he says either.</p>\n\n<p>RS is no more dilution power than their original 1B share charter, which they didn&#39;t use for 50 YEARS. Until nowhere in my opinion it is needed to complete this deal in our favor.</p>\n\n<p>&#x200B;</p>\n\n<p>I am gonna stop here before I start ranting again 😉. I just hope that they have already stacked the vote so hard against the shills with the warrant deal that they can&#39;t flip enough votes against us. I have ZERO confidence in Apes to make the right decision when the time comes.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>$19.11</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/cB5qranGKsTyrHry6qqhfpF_d7aJnhhZcDyqZ4AUXtQ.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12vj6u2/first_post_dilution_short_interest_25th/", "time": 1682197348.0, "subreddit": "r/ThePPShow", "title": "First POST dilution Short Interest 25th", "text": "<!-- SC_OFF --><div class=\"md\"><p>Up until the 29th of last month we saw the daily short volume and the SI match the OLD float.</p>\n\n<p>Then the shares outstanding was updated and on the 30th and 31st the flood gates opened. WHY?</p>\n\n<p>&#x200B;</p>\n\n<p>I will tell you why. 2 days settlement window. The cut off for the old SI numbers was the 31st but because of the settlement window they could start 2 days early.</p>\n\n<p>&#x200B;</p>\n\n<p>This gave them almost a full month before we would see any of their increased SI numbers. Meaning they could trick us into thinking we were only 20-30% short for most of the month.</p>\n\n<p>If you look at the trading volume, the days after March 30th. That is the FIRST day we started trading as if there were more shares in the market. Short volume that week was over 300M shares.</p>\n\n<p>&#x200B;</p>\n\n<p>I saw them moving lots of FTDs which were hidden in the EU due to Regulation S the week before then. That is why we saw a nightly spike of 20% and morning hammer.</p>\n\n<p>&#x200B;</p>\n\n<p>If I am correct, we are in for quite the surprise when the new SI comes out on the 25th. It will also prove once and for all, a lot of the theories we have had.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12v4s8d/cointelpro_methods_used_to_manipulate_and_disrupt/", "time": 1682167218.0, "subreddit": "r/ThePPShow", "title": "COINTELPRO Methods used to manipulate and disrupt communities.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I mentioned this text in a post yesterday, and after last night&#39;s PPshow I thought everyone needs to read this and think long and hard about some of the people we all THINK we know pretty well. Maybe we should even pin this?</p>\n\n<p>Thanks to those who took the time to post this. This is a copy/paste of  <a href=\"https://www.reddit.com/user/jakob_xavier/\">u/jakob_xavier</a>&#39;s post on superstonk.</p>\n\n<p>&#x200B;</p>\n\n<p>You may remember that a few days back, <a href=\"https://www.reddit.com/u/TheGoombler/\">u/TheGoombler</a> put up this post about shills infiltrating /BIZ/ <a href=\"https://www.reddit.com/r/Superstonk/comments/mscsb5/putting_shills_on_blast_a_concerned_biznessman/\">https://www.reddit.com/r/Superstonk/comments/mscsb5/putting_shills_on_blast_a_concerned_biznessman/</a></p>\n\n<p>&#x200B;</p>\n\n<p>COINTELPRO Techniques for dilution, misdirection and control of a internet forum</p>\n\n<p>Twenty-Five Rules of Disinformation</p>\n\n<p>Eight Traits of the Disinformationalist</p>\n\n<p>How to Spot a Spy (Cointelpro Agent)</p>\n\n<p>Seventeen Techniques for Truth Suppression</p>\n\n<p>______________</p>\n\n<p>COINTELPRO Techniques for dilution, misdirection and control of a internet forum..</p>\n\n<p>There  are several techniques for the control and manipulation of a internet  forum no matter what, or who is on it. We will go over each technique  and demonstrate that only a minimal number of operatives can be used to  eventually and effectively gain a control of a &#39;uncontrolled forum.&#39;</p>\n\n<p><strong>Technique #1 - &#39;FORUM SLIDING&#39;</strong></p>\n\n<p>If  a very sensitive posting of a critical nature has been posted on a  forum - it can be quickly removed from public view by &#39;forum sliding.&#39;  In this technique a number of unrelated posts are quietly prepositioned  on the forum and allowed to &#39;age.&#39; Each of these misdirectional forum  postings can then be called upon at will to trigger a &#39;forum slide.&#39; The  second requirement is that several fake accounts exist, which can be  called upon, to ensure that this technique is not exposed to the public.  To trigger a &#39;forum slide&#39; and &#39;flush&#39; the critical post out of public  view it is simply a matter of logging into each account both real and  fake and then &#39;replying&#39; to prepositined postings with a simple 1 or 2  line comment. This brings the unrelated postings to the top of the forum  list, and the critical posting &#39;slides&#39; down the front page, and  quickly out of public view. Although it is difficult or impossible to  censor the posting it is now lost in a sea of unrelated and unuseful  postings. By this means it becomes effective to keep the readers of the  forum reading unrelated and non-issue items.</p>\n\n<p><strong>Technique #2 - &#39;CONSENSUS CRACKING&#39;</strong></p>\n\n<p>A second highly effective technique (which you can see in operation all the time at <a href=\"http://www.abovetopsecret.com/\">www.abovetopsecret.com</a>)  is &#39;consensus cracking.&#39; To develop a consensus crack, the following  technique is used. Under the guise of a fake account a posting is made  which looks legitimate and is towards the truth is made - but the  critical point is that it has a VERY WEAK PREMISE without substantive  proof to back the posting. Once this is done then under alternative fake  accounts a very strong position in your favour is slowly introduced  over the life of the posting. It is IMPERATIVE that both sides are  initially presented, so the uninformed reader cannot determine which  side is the truth. As postings and replies are made the stronger  &#39;evidence&#39; or disinformation in your favour is slowly &#39;seeded in.&#39; Thus  the uninformed reader will most like develop the same position as you,  and if their position is against you their opposition to your posting  will be most likely dropped. However in some cases where the forum  members are highly educated and can counter your disinformation with  real facts and linked postings, you can then &#39;abort&#39; the consensus  cracking by initiating a &#39;forum slide.&#39;</p>\n\n<p><strong>Technique #3 - &#39;TOPIC DILUTION&#39;</strong></p>\n\n<p>Topic  dilution is not only effective in forum sliding it is also very useful  in keeping the forum readers on unrelated and non-productive issues.  This is a critical and useful technique to cause a &#39;RESOURCE BURN.&#39; By  implementing continual and non-related postings that distract and  disrupt (trolling ) the forum readers they are more effectively stopped  from anything of any real productivity. If the intensity of gradual  dilution is intense enough, the readers will effectively stop  researching and simply slip into a &#39;gossip mode.&#39; In this state they can  be more easily misdirected away from facts towards uninformed  conjecture and opinion. The less informed they are the more effective  and easy it becomes to control the entire group in the direction that  you would desire the group to go in. It must be stressed that a proper  assessment of the psychological capabilities and levels of education is  first determined of the group to determine at what level to &#39;drive in  the wedge.&#39; By being too far off topic too quickly it may trigger  censorship by a forum moderator.</p>\n\n<p><strong>Technique #4 - &#39;INFORMATION COLLECTION&#39;</strong></p>\n\n<p>Information  collection is also a very effective method to determine the  psychological level of the forum members, and to gather intelligence  that can be used against them. In this technique in a light and positive  environment a &#39;show you mine so me yours&#39; posting is initiated. From  the number of replies and the answers that are provided much statistical  information can be gathered. An example is to post your &#39;favourite  weapon&#39; and then encourage other members of the forum to showcase what  they have. In this matter it can be determined by reverse proration what  percentage of the forum community owns a firearm, and or a illegal  weapon. This same method can be used by posing as one of the form  members and posting your favourite &#39;technique of operation.&#39; From the  replies various methods that the group utilizes can be studied and  effective methods developed to stop them from their activities.</p>\n\n<p><strong>Technique #5 - &#39;ANGER TROLLING&#39;</strong></p>\n\n<p>Statistically,  there is always a percentage of the forum posters who are more inclined  to violence. In order to determine who these individuals are, it is a  requirement to present a image to the forum to deliberately incite a  strong psychological reaction. From this the most violent in the group  can be effectively singled out for reverse IP location and possibly  local enforcement tracking. To accomplish this only requires posting a  link to a video depicting a local police officer massively abusing his  power against a very innocent individual. Statistically of the million  or so police officers in America there is always one or two being caught  abusing there powers and the taping of the activity can be then used  for intelligence gathering purposes - without the requirement to &#39;stage&#39;  a fake abuse video. This method is extremely effective, and the more so  the more abusive the video can be made to look. Sometimes it is useful  to &#39;lead&#39; the forum by replying to your own posting with your own  statement of violent intent, and that you &#39;do not care what the  authorities think!!&#39; inflammation. By doing this and showing no fear it  may be more effective in getting the more silent and self-disciplined  violent intent members of the forum to slip and post their real  intentions. This can be used later in a court of law during prosecution.</p>\n\n<p><strong>Technique #6 - &#39;GAINING FULL CONTROL&#39;</strong></p>\n\n<p>It  is important to also be harvesting and continually maneuvering for a  forum moderator position. Once this position is obtained, the forum can  then be effectively and quietly controlled by deleting unfavourable  postings - and one can eventually steer the forum into complete failure  and lack of interest by the general public. This is the &#39;ultimate  victory&#39; as the forum is no longer participated with by the general  public and no longer useful in maintaining their freedoms. Depending on  the level of control you can obtain, you can deliberately steer a forum  into defeat by censoring postings, deleting memberships, flooding, and  or accidentally taking the forum offline. By this method the forum can  be quickly killed. However it is not always in the interest to kill a  forum as it can be converted into a &#39;honey pot&#39; gathering center to  collect and misdirect newcomers and from this point be completely used  for your control for your agenda purposes.</p>\n\n<p><strong>CONCLUSION</strong></p>\n\n<p><strong>Remember these techniques are only effective if the forum participants DO NOT KNOW ABOUT THEM.</strong>  Once they are aware of these techniques the operation can completely  fail, and the forum can become uncontrolled. At this point other avenues  must be considered such as initiating a false legal precidence to  simply have the forum shut down and taken offline. This is not desirable  as it then leaves the enforcement agencies unable to track the  percentage of those in the population who always resist attempts for  control against them. Many other techniques can be utilized and  developed by the individual and as you develop further techniques of  infiltration and control it is imperative to share then with HQ.</p>\n\n<p>____________________</p>\n\n<p>Twenty-Five Rules of Disinformation</p>\n\n<p><em>Note:  The first rule and last five (or six, depending on situation) rules are  generally not directly within the ability of the traditional disinfo  artist to apply. These rules are generally used more directly by those  at the leadership, key players, or planning level of the criminal  conspiracy or conspiracy to cover up.</em></p>\n\n<p><strong>1.</strong> Hear no evil, see no evil, speak no evil. <strong>Regardless of what you know, don&#39;t discuss it</strong>  -- especially if you are a public figure, news anchor, etc. If it&#39;s not  reported, it didn&#39;t happen, and you never have to deal with the issues.</p>\n\n<p><strong>2. Become incredulous and indignant.</strong>  Avoid discussing key issues and instead focus on side issues which can  be used show the topic as being critical of some otherwise sacrosanct  group or theme. This is also known as the &#39;How dare you!&#39; gambit.</p>\n\n<p><strong>3.</strong> Create rumor mongers. <strong>Avoid discussing issues by describing all charges, regardless of venue or evidence, as mere rumors and wild accusations.</strong>  Other derogatory terms mutually exclusive of truth may work as well.  This method which works especially well with a silent press, because the  only way the public can learn of the facts are through such &#39;arguable  rumors&#39;. If you can associate the material with the Internet, use this  fact to certify it a &#39;wild rumor&#39; from a &#39;bunch of kids on the Internet&#39;  which can have no basis in fact.</p>\n\n<p><strong>4. Use a straw man.</strong>  Find or create a seeming element of your opponent&#39;s argument which you  can easily knock down to make yourself look good and the opponent to  look bad. Either make up an issue you may safely imply exists based on  your interpretation of the opponent/opponent arguments/situation, or  select the weakest aspect of the weakest charges. Amplify their  significance and destroy them in a way which appears to debunk all the  charges, real and fabricated alike, while actually avoiding discussion  of the real issues.</p>\n\n<p><strong>5. Sidetrack opponents with name calling and ridicule.</strong>  This is also known as the primary &#39;attack the messenger&#39; ploy, though  other methods qualify as variants of that approach. Associate opponents  with unpopular titles such as &#39;kooks&#39;, &#39;right-wing&#39;, &#39;liberal&#39;,  &#39;left-wing&#39;, &#39;terrorists&#39;, &#39;conspiracy buffs&#39;, &#39;radicals&#39;, &#39;militia&#39;,  &#39;racists&#39;, &#39;religious fanatics&#39;, &#39;sexual deviates&#39;, and so forth. This  makes others shrink from support out of fear of gaining the same label,  and you avoid dealing with issues.</p>\n\n<p><strong>6.</strong> Hit and Run. In any public forum, <strong>make a brief attack of your opponent or the opponent position and then scamper off before an answer can be fielded</strong>,  or simply ignore any answer. This works extremely well in Internet and  letters-to-the-editor environments where a steady stream of new  identities can be called upon without having to explain criticism,  reasoning -- simply make an accusation or other attack, never discussing  issues, and never answering any subsequent response, for that would  dignify the opponent&#39;s viewpoint.</p>\n\n<p><strong>7.</strong> Question motives. <strong>Twist  or amplify any fact which could be taken to imply that the opponent  operates out of a hidden personal agenda or other bias.</strong> This avoids discussing issues and forces the accuser on the defensive.</p>\n\n<p><strong>8.</strong> Invoke authority. <strong>Claim  for yourself or associate yourself with authority and present your  argument with enough &#39;jargon&#39; and &#39;minutia&#39; to illustrate you are &#39;one  who knows&#39;</strong>, and simply say it isn&#39;t so without discussing issues or demonstrating concretely why or citing sources.</p>\n\n<p><strong>9.</strong> Play Dumb. No matter what evidence or logical argument is offered, <strong>avoid discussing issues except with denials they have any credibility</strong>, make any sense, provide any proof, contain or make a point, have logic, or support a conclusion. Mix well for maximum effect.</p>\n\n<p><strong>10. Associate opponent charges with old news.</strong>  A derivative of the straw man -- usually, in any large-scale matter of  high visibility, someone will make charges early on which can be or were  already easily dealt with - a kind of investment for the future should  the matter not be so easily contained.) Where it can be foreseen, have  your own side raise a straw man issue and have it dealt with early on as  part of the initial contingency plans. Subsequent charges, regardless  of validity or new ground uncovered, can usually then be associated with  the original charge and dismissed as simply being a rehash without need  to address current issues -- so much the better where the opponent is  or was involved with the original source.</p>\n\n<p><strong>11.</strong> Establish and rely upon fall-back positions. <strong>Using  a minor matter or element of the facts, take the &#39;high road&#39; and  &#39;confess&#39; with candor that some innocent mistake, in hindsight, was made</strong>  -- but that opponents have seized on the opportunity to blow it all out  of proportion and imply greater criminalities which, &#39;just isn&#39;t so.&#39;  Others can reinforce this on your behalf, later, and even publicly &#39;call  for an end to the nonsense&#39; because you have already &#39;done the right  thing.&#39; Done properly, this can garner sympathy and respect for &#39;coming  clean&#39; and &#39;owning up&#39; to your mistakes without addressing more serious  issues.</p>\n\n<p><strong>12.</strong>  Enigmas have no solution. Drawing upon the overall umbrella of events  surrounding the crime and the multitude of players and events, <strong>paint the entire affair as too complex to solve</strong>.  This causes those otherwise following the matter to begin to lose  interest more quickly without having to address the actual issues.</p>\n\n<p><strong>13.</strong> Alice in Wonderland Logic. <strong>Avoid discussion of the issues by reasoning backwards or with an apparent deductive logic</strong> which forbears any actual material fact.</p>\n\n<p><strong>14.</strong> Demand complete solutions. <strong>Avoid the issues by requiring opponents to solve the crime at hand completely</strong>, a ploy which works best with issues qualifying for rule 10.</p>\n\n<p><strong>15. Fit the facts to alternate conclusions.</strong> This requires creative thinking unless the crime was planned with contingency conclusions in place.</p>\n\n<p><strong>16. Vanish evidence and witnesses.</strong> If it does not exist, it is not fact, and you won&#39;t have to address the issue.</p>\n\n<p><strong>17. Change the subject.</strong>  Usually in connection with one of the other ploys listed here, find a  way to side-track the discussion with abrasive or controversial comments  in hopes of turning attention to a new, more manageable topic. This  works especially well with companions who can &#39;argue&#39; with you over the  new topic and polarize the discussion arena in order to avoid discussing  more key issues.</p>\n\n<p><strong>18. Emotionalize, Antagonize, and Goad Opponents.</strong>  If you can&#39;t do anything else, chide and taunt your opponents and draw  them into emotional responses which will tend to make them look foolish  and overly motivated, and generally render their material somewhat less  coherent. Not only will you avoid discussing the issues in the first  instance, but even if their emotional response addresses the issue, you  can further avoid the issues by then focusing on how &#39;sensitive they are  to criticism.&#39;</p>\n\n<p><strong>19. Ignore proof presented, demand impossible proofs.</strong>  This is perhaps a variant of the &#39;play dumb&#39; rule. Regardless of what  material may be presented by an opponent in public forums, claim the  material irrelevant and demand proof that is impossible for the opponent  to come by (it may exist, but not be at his disposal, or it may be  something which is known to be safely destroyed or withheld, such as a  murder weapon.) In order to completely avoid discussing issues, it may  be required that you to categorically deny and be critical of media or  books as valid sources, deny that witnesses are acceptable, or even deny  that statements made by government or other authorities have any  meaning or relevance.</p>\n\n<p><strong>20.</strong> False evidence. <strong>Whenever possible, introduce new facts or clues designed and manufactured to conflict with opponent presentations</strong>  -- as useful tools to neutralize sensitive issues or impede resolution.  This works best when the crime was designed with contingencies for the  purpose, and the facts cannot be easily separated from the fabrications.</p>\n\n<p><strong>21.</strong> Call a Grand Jury, Special Prosecutor, or other empowered investigative body. <strong>Subvert the (process) to your benefit and effectively neutralize all sensitive issues without open discussion.</strong>  Once convened, the evidence and testimony are required to be secret  when properly handled. For instance, if you own the prosecuting  attorney, it can insure a Grand Jury hears no useful evidence and that  the evidence is sealed and unavailable to subsequent investigators. Once  a favorable verdict is achieved, the matter can be considered  officially closed. Usually, this technique is applied to find the guilty  innocent, but it can also be used to obtain charges when seeking to  frame a victim.</p>\n\n<p><strong>22. Manufacture a new truth.</strong>  Create your own expert(s), group(s), author(s), leader(s) or influence  existing ones willing to forge new ground via scientific, investigative,  or social research or testimony which concludes favorably. In this way,  if you must actually address issues, you can do so authoritatively.</p>\n\n<p><strong>23. Create bigger distractions.</strong>  If the above does not seem to be working to distract from sensitive  issues, or to prevent unwanted media coverage of unstoppable events such  as trials, create bigger news stories (or treat them as such) to  distract the multitudes.</p>\n\n<p><strong>24. Silence critics.</strong>  If the above methods do not prevail, consider removing opponents from  circulation by some definitive solution so that the need to address  issues is removed entirely. This can be by their death, arrest and  detention, blackmail or destruction of their character by release of  blackmail information, or merely by destroying them financially,  emotionally, or severely damaging their health.</p>\n\n<p><strong>25. Vanish.</strong>  If you are a key holder of secrets or otherwise overly illuminated and  you think the heat is getting too hot, to avoid the issues, vacate the  kitchen.</p>\n\n<p>_________________________</p>\n\n<p>Eight Traits of the Disinformationalist</p>\n\n<p><strong>1) Avoidance.</strong>  They never actually discuss issues head-on or provide constructive  input, generally avoiding citation of references or credentials. Rather,  they merely imply this, that, and the other. Virtually everything about  their presentation implies their authority and expert knowledge in the  matter without any further justification for credibility.</p>\n\n<p><strong>2) Selectivity.</strong>  They tend to pick and choose opponents carefully, either applying the  hit-and-run approach against mere commentators supportive of opponents,  or focusing heavier attacks on key opponents who are known to directly  address issues. Should a commentator become argumentative with any  success, the focus will shift to include the commentator as well.</p>\n\n<p><strong>3) Coincidental.</strong>  They tend to surface suddenly and somewhat coincidentally with a new  controversial topic with no clear prior record of participation in  general discussions in the particular public arena involved. They  likewise tend to vanish once the topic is no longer of general concern.  They were likely directed or elected to be there for a reason, and  vanish with the reason.</p>\n\n<p><strong>4) Teamwork.</strong>  They tend to operate in self-congratulatory and complementary packs or  teams. Of course, this can happen naturally in any public forum, but  there will likely be an ongoing pattern of frequent exchanges of this  sort where professionals are involved. Sometimes one of the players will  infiltrate the opponent camp to become a source for straw man or other  tactics designed to dilute opponent presentation strength.</p>\n\n<p><strong>5) Anti-conspiratorial.</strong>  They almost always have disdain for &#39;conspiracy theorists&#39; and,  usually, for those who in any way believe JFK was not killed by LHO. Ask  yourself why, if they hold such disdain for conspiracy theorists, do  they focus on defending a single topic discussed in a NG focusing on  conspiracies? One might think they would either be trying to make fools  of everyone on every topic, or simply ignore the group they hold in such  disdain.Or, one might more rightly conclude they have an ulterior  motive for their actions in going out of their way to focus as they do.</p>\n\n<p><strong>6) Artificial Emotions.</strong>  An odd kind of &#39;artificial&#39; emotionalism and an unusually thick skin --  an ability to persevere and persist even in the face of overwhelming  criticism and unacceptance. This likely stems from intelligence  community training that, no matter how condemning the evidence, deny  everything, and never become emotionally involved or reactive. The net  result for a disinfo artist is that emotions can seem artificial.</p>\n\n<p>Most  people, if responding in anger, for instance, will express their  animosity throughout their rebuttal. But disinfo types usually have  trouble maintaining the &#39;image&#39; and are hot and cold with respect to  pretended emotions and their usually more calm or unemotional  communications style. It&#39;s just a job, and they often seem unable to  &#39;act their role in character&#39; as well in a communications medium as they  might be able in a real face-to-face conversation/confrontation. You  might have outright rage and indignation one moment, ho-hum the next,  and more anger later -- an emotional yo-yo.</p>\n\n<p>With  respect to being thick-skinned, no amount of criticism will deter them  from doing their job, and they will generally continue their old disinfo  patterns without any adjustments to criticisms of how obvious it is  that they play that game -- where a more rational individual who truly  cares what others think might seek to improve their communications  style, substance, and so forth, or simply give up.</p>\n\n<p><strong>7) Inconsistent.</strong>  There is also a tendency to make mistakes which betray their true  self/motives. This may stem from not really knowing their topic, or it  may be somewhat &#39;freudian&#39;, so to speak, in that perhaps they really  root for the side of truth deep within.</p>\n\n<p>I  have noted that often, they will simply cite contradictory information  which neutralizes itself and the author. For instance, one such player  claimed to be a Navy pilot, but blamed his poor communicating skills  (spelling, grammar, incoherent style) on having only a grade-school  education. I&#39;m not aware of too many Navy pilots who don&#39;t have a  college degree. Another claimed no knowledge of a particular  topic/situation but later claimed first-hand knowledge of it.</p>\n\n<p><strong>8) Time Constant.</strong>  Recently discovered, with respect to News Groups, is the response time  factor. There are three ways this can be seen to work, especially when  the government or other empowered player is involved in a cover up  operation:</p>\n\n<p>a) ANY NG posting by a  targeted proponent for truth can result in an IMMEDIATE response. The  government and other empowered players can afford to pay people to sit  there and watch for an opportunity to do some damage. SINCE DISINFO IN A  NG ONLY WORKS IF THE READER SEES IT - FAST RESPONSE IS CALLED FOR, or  the visitor may be swayed towards truth.</p>\n\n<p>b)  When dealing in more direct ways with a disinformationalist, such as  email, DELAY IS CALLED FOR - there will usually be a minimum of a 48-72  hour delay. This allows a sit-down team discussion on response strategy  for best effect, and even enough time to &#39;get permission&#39; or instruction  from a formal chain of command.</p>\n\n<p>c)  In the NG example 1) above, it will often ALSO be seen that bigger guns  are drawn and fired after the same 48-72 hours delay - the team  approach in play. This is especially true when the targeted truth seeker  or their comments are considered more important with respect to  potential to reveal truth. Thus, a serious truth sayer will be attacked  twice for the same sin.</p>\n\n<p>______________________</p>\n\n<p>How to Spot a Spy (Cointelpro Agent)</p>\n\n<p>One way to neutralize a potential activist is to get them to be in a group that does all the wrong things. Why?</p>\n\n<p><strong>1)</strong> The message doesn&#39;t get out.</p>\n\n<p><strong>2)</strong> A lot of time is wasted</p>\n\n<p><strong>3)</strong> The activist is frustrated and discouraged</p>\n\n<p><strong>4)</strong> Nothing good is accomplished.</p>\n\n<p>FBI and Police Informers and Infiltrators will infest any group and they have phoney activist organizations established.</p>\n\n<p>Their purpose is to prevent any real movement for justice or eco-peace from developing in this country.</p>\n\n<p>Agents come in small, medium or large. They can be of any ethnic background. They can be male or female.</p>\n\n<p>The  actual size of the group or movement being infiltrated is irrelevant.  It is the potential the movement has for becoming large which brings on  the spies and saboteurs.</p>\n\n<p>This booklet lists tactics agents use to slow things down, foul things up, destroy the movement and keep tabs on activists.</p>\n\n<p>It is the agent&#39;s job to keep the activist from quitting such a group, thus keeping him/her under control.</p>\n\n<p>In some situations, to get control, the agent will tell the activist:</p>\n\n<p>&quot;You&#39;re dividing the movement.&quot;</p>\n\n<p>[Here, I have added the psychological reasons as to WHY this maneuver works to control people]</p>\n\n<p>This  invites guilty feelings. Many people can be controlled by guilt. The  agents begin relationships with activists behind a well-developed mask  of &quot;dedication to the cause.&quot; Because of their often declared  dedication, (and actions designed to prove this), when they criticize  the activist, he or she - being truly dedicated to the movement -  becomes convinced that somehow, any issues are THEIR fault. This is  because a truly dedicated person tends to believe that everyone has a  conscience and that nobody would dissimulate and lie like that &quot;on  purpose.&quot; It&#39;s amazing how far agents can go in manipulating an activist  because the activist will constantly make excuses for the agent who  regularly declares their dedication to the cause. Even if they do,  occasionally, suspect the agent, they will pull the wool over their own  eyes by rationalizing: &quot;they did that unconsciously... they didn&#39;t  really mean it... I can help them by being forgiving and accepting &quot; and  so on and so forth.</p>\n\n<p>The agent will tell the activist:</p>\n\n<p>&quot;You&#39;re a leader!&quot;</p>\n\n<p>This  is designed to enhance the activist&#39;s self-esteem. His or her  narcissistic admiration of his/her own activist/altruistic intentions  increase as he or she identifies with and consciously admires the  altruistic declarations of the agent which are deliberately set up to  mirror those of the activist.</p>\n\n<p>This  is &quot;malignant pseudoidentification.&quot; It is the process by which the  agent consciously imitates or simulates a certain behavior to foster the  activist&#39;s identification with him/her, thus increasing the activist&#39;s  vulnerability to exploitation. The agent will simulate the more subtle  self-concepts of the activist.</p>\n\n<p>Activists  and those who have altruistic self-concepts are most vulnerable to  malignant pseudoidentification especially during work with the agent  when the interaction includes matter relating to their competency,  autonomy, or knowledge.</p>\n\n<p>The goal  of the agent is to increase the activist&#39;s general empathy for the agent  through pseudo-identification with the activist&#39;s self-concepts.</p>\n\n<p>The  most common example of this is the agent who will compliment the  activist for his competency or knowledge or value to the movement. On a  more subtle level, the agent will simulate affects and mannerisms of the  activist which promotes identification via mirroring and feelings of  &quot;twinship&quot;. It is not unheard of for activists, enamored by the  perceived helpfulness and competence of a good agent, to find themselves  considering ethical violations and perhaps, even illegal behavior, in  the service of their agent/handler.</p>\n\n<p>The  activist&#39;s &quot;felt quality of perfection&quot; [self-concept] is enhanced, and  a strong empathic bond is developed with the agent through his/her  imitation and simulation of the victim&#39;s own narcissistic investments.  [self-concepts] That is, if the activist knows, deep inside, their own  dedication to the cause, they will project that onto the agent who is  &quot;mirroring&quot; them.</p>\n\n<p>The activist  will be deluded into thinking that the agent shares this feeling of  identification and bonding. In an activist/social movement setting, the  adversarial roles that activists naturally play vis a vis the  establishment/government, fosters ongoing processes of intrapsychic  splitting so that &quot;twinship alliances&quot; between activist and agent may  render whole sectors or reality testing unavailable to the activist.  They literally &quot;lose touch with reality.&quot;</p>\n\n<p>Activists  who deny their own narcissistic investments [do not have a good idea of  their own self-concepts and that they ARE concepts] and consciously  perceive themselves (accurately, as it were) to be &quot;helpers&quot; endowed  with a special amount of altruism are exceedingly vulnerable to the  affective (emotional) simulation of the accomplished agent.</p>\n\n<p>Empathy  is fostered in the activist through the expression of quite visible  affects. The presentation of tearfulness, sadness, longing, fear,  remorse, and guilt, may induce in the helper-oriented activist a strong  sense of compassion, while unconsciously enhancing the activist&#39;s  narcissistic investment in self as the embodiment of goodness.</p>\n\n<p>The  agent&#39;s expresssion of such simulated affects may be quite compelling  to the observer and difficult to distinguish from deep emotion.</p>\n\n<p>It can usually be identified by two events, however:</p>\n\n<p>First,  the activist who has analyzed his/her own narcissistic roots and is  aware of his/her own potential for being &quot;emotionally hooked,&quot; will be  able to remain cool and unaffected by such emotional outpourings by the  agent.</p>\n\n<p>As a result of this  unaffected, cool, attitude, the Second event will occur: The agent will  recompensate much too quickly following such an affective expression  leaving the activist with the impression that &quot;the play has ended, the  curtain has fallen,&quot; and the imposture, for the moment, has finished.  The agent will then move quickly to another activist/victim.</p>\n\n<p>The fact is, the movement doesn&#39;t need leaders, it needs MOVERS. &quot;Follow the leader&quot; is a waste of time.</p>\n\n<p>A  good agent will want to meet as often as possible. He or she will talk a  lot and say little. One can expect an onslaught of long, unresolved  discussions.</p>\n\n<p><strong>Some agents take on a pushy, arrogant, or defensive manner: (-&gt;</strong> <a href=\"/u/moonshot_69\">u/moonshot_69</a><strong>)</strong></p>\n\n<p><strong>1)</strong> To disrupt the agenda</p>\n\n<p><strong>2)</strong> To side-track the discussion</p>\n\n<p><strong>3)</strong> To interrupt repeatedly</p>\n\n<p><strong>4)</strong> To feign ignorance</p>\n\n<p><strong>5)</strong> To make an unfounded accusation against a person.</p>\n\n<p>Calling someone a racist, for example. This tactic is used to discredit a person in the eyes of all other group members.</p>\n\n<p><strong>Saboteurs</strong></p>\n\n<p>Some saboteurs pretend to be activists. She or he will ....</p>\n\n<p><strong>1)</strong> Write encyclopedic flyers (in the present day, websites)</p>\n\n<p><strong>2)</strong> Print flyers in English only.</p>\n\n<p><strong>3)</strong> Have demonstrations in places where no one cares.</p>\n\n<p><strong>4)</strong> Solicit funding from rich people instead of grass roots support</p>\n\n<p><strong>5)</strong> Display banners with too many words that are confusing.</p>\n\n<p><strong>6)</strong> Confuse issues.</p>\n\n<p><strong>7)</strong> Make the wrong demands.</p>\n\n<p><strong>8)</strong> Compromise the goal.</p>\n\n<p><strong>9)</strong>  Have endless discussions that waste everyone&#39;s time. The agent may  accompany the endless discussions with drinking, pot smoking or other  amusement to slow down the activist&#39;s work.</p>\n\n<p><strong>Provocateurs</strong></p>\n\n<p><strong>1)</strong> Want to establish &quot;leaders&quot; to set them up for a fall in order to stop the movement.</p>\n\n<p><strong>2)</strong> Suggest doing foolish, illegal things to get the activists in trouble.</p>\n\n<p><strong>3)</strong> Encourage militancy.</p>\n\n<p><strong>4)</strong> Want to taunt the authorities.</p>\n\n<p><strong>5)</strong> Attempt to make the activist compromise their values.</p>\n\n<p><strong>6)</strong> Attempt to instigate violence. Activisim ought to always be non-violent.</p>\n\n<p><strong>7)</strong> Attempt to provoke revolt among people who are ill-prepared to deal with the reaction of the authorities to such violence.</p>\n\n<p><strong>Informants</strong></p>\n\n<p><strong>1)</strong> Want everyone to sign up and sing in and sign everything.</p>\n\n<p><strong>2)</strong> Ask a lot of questions (gathering data).</p>\n\n<p><strong>3)</strong> Want to know what events the activist is planning to attend.</p>\n\n<p><strong>4)</strong> Attempt to make the activist defend him or herself to identify his or her beliefs, goals, and level of committment.</p>\n\n<p><strong>Recruiting</strong></p>\n\n<p>Legitimate  activists do not subject people to hours of persuasive dialog. Their  actions, beliefs, and goals speak for themselves.</p>\n\n<p>Groups that DO recruit are missionaries, military, and fake political parties or movements set up by agents.</p>\n\n<p><strong>Surveillance</strong></p>\n\n<p><strong>ALWAYS</strong> assume that you are under surveillance.</p>\n\n<p>At this point, if you are NOT under surveillance, you are not a very good activist!</p>\n\n<p><strong>Scare Tactics</strong></p>\n\n<p>They use them.</p>\n\n<p>Such  tactics include slander, defamation, threats, getting close to  disaffected or minimally committed fellow activists to persuade them  (via psychological tactics described above) to turn against the movement  and give false testimony against their former compatriots. They will  plant illegal substances on the activist and set up an arrest; they will  plant false information and set up &quot;exposure,&quot; they will send  incriminating letters [emails] in the name of the activist; and more;  they will do whatever society will allow.</p>\n\n<p>This booklet in no way covers all the ways agents use to sabotage the lives of sincere an dedicated activists.</p>\n\n<p>If an agent is &quot;exposed,&quot; he or she will be transferred or replaced.</p>\n\n<p>COINTELPRO  is still in operation today under a different code name. It is no  longer placed on paper where it can be discovered through the freedom of  information act.</p>\n\n<p>The FBI counterintelligence program&#39;s stated purpose: <em>To  expose, disrupt, misdirect, discredit, and otherwise neutralize  individuals who the FBI categorize as opposed to the National Interests</em>.  &quot;National Security&quot; means the FBI&#39;s security from the people ever  finding out the vicious things it does in violation of people&#39;s civil  liberties.</p>\n\n<p>___________________________</p>\n\n<p>Seventeen Techniques for Truth Suppression</p>\n\n<p><em>Strong,  credible allegations of high-level criminal activity can bring down a  government. When the government lacks an effective, fact-based defense,  other techniques must be employed. The success of these techniques  depends heavily upon a cooperative, compliant press and a mere token  opposition party.</em></p>\n\n<p><strong>1. Dummy up.</strong> If it&#39;s not reported, if it&#39;s not news, it didn&#39;t happen.</p>\n\n<p><strong>2. Wax indignant.</strong> This is also known as the &quot;How dare you?&quot; gambit.</p>\n\n<p><strong>3. Characterize the charges as &quot;rumors&quot; or, better yet, &quot;wild rumors.&quot;</strong>  If, in spite of the news blackout, the public is still able to learn  about the suspicious facts, it can only be through &quot;rumors.&quot; (If they  tend to believe the &quot;rumors&quot; it must be because they are simply  &quot;paranoid&quot; or &quot;hysterical.&quot;)</p>\n\n<p><strong>4.</strong> Knock down straw men. <strong>Deal only with the weakest aspects of the weakest charges.</strong>  Even better, create your own straw men. Make up wild rumors (or plant  false stories) and give them lead play when you appear to debunk all the  charges, real and fanciful alike.</p>\n\n<p><strong>5. Call the skeptics names like &quot;conspiracy theorist,&quot; &quot;nutcase,&quot; &quot;ranter,&quot; &quot;kook,&quot; &quot;crackpot,&quot; and, of course, &quot;rumor monger.&quot;</strong>  Be sure, too, to use heavily loaded verbs and adjectives when  characterizing their charges and defending the &quot;more reasonable&quot;  government and its defenders. You must then carefully avoid fair and  open debate with any of the people you have thus maligned. For  insurance, set up your own &quot;skeptics&quot; to shoot down.</p>\n\n<p><strong>6.</strong> Impugn motives. <strong>Attempt to marginalize the critics by suggesting strongly that they are not really interested in the truth</strong>  but are simply pursuing a partisan political agenda or are out to make  money (compared to over-compensated adherents to the government line  who, presumably, are not).</p>\n\n<p><strong>7. Invoke authority.</strong> Here the controlled press and the sham opposition can be very useful.</p>\n\n<p><strong>8. Dismiss the charges as &quot;old news.&quot;</strong></p>\n\n<p><strong>9. Come half-clean.</strong>  This is also known as &quot;confession and avoidance&quot; or &quot;taking the limited  hangout route.&quot; This way, you create the impression of candor and  honesty while you admit only to relatively harmless, less-than-criminal  &quot;mistakes.&quot; This stratagem often requires the embrace of a fall-back  position quite different from the one originally taken. With effective  damage control, the fall-back position need only be peddled by stooge  skeptics to carefully limited markets.</p>\n\n<p><strong>10. Characterize the crimes as impossibly complex</strong> and the truth as ultimately unknowable.</p>\n\n<p><strong>11. Reason backward</strong>,  using the deductive method with a vengeance. With thoroughly rigorous  deduction, troublesome evidence is irrelevant. E.g. We have a completely  free press. If evidence exists that the Vince Foster &quot;suicide&quot; note was  forged, they would have reported it. They haven&#39;t reported it so there  is no such evidence. Another variation on this theme involves the  likelihood of a conspiracy leaker and a press who would report the leak.</p>\n\n<p><strong>12. Require the skeptics to solve the crime completely.</strong> E.g. If Foster was murdered, who did it and why?</p>\n\n<p><strong>13. Change the subject.</strong> This technique includes creating and/or publicizing distractions.</p>\n\n<p><strong>14. Lightly report incriminating facts, and then make nothing of them.</strong> This is sometimes referred to as &quot;bump and run&quot; reporting.</p>\n\n<p><strong>15. Baldly and brazenly lie.</strong> A favorite way of doing this is to attribute the &quot;facts&quot; furnished the public to a plausible-sounding, but anonymous, source.</p>\n\n<p><strong>16.</strong> Expanding further on numbers 4 and 5, <strong>have your own stooges &quot;expose&quot; scandals and champion popular causes.</strong>  Their job is to pre-empt real opponents and to play 99-yard football. A  variation is to pay rich people for the job who will pretend to spend  their own money.</p>\n\n<p><strong>17. Flood the Internet with agents.</strong>  This is the answer to the question, &quot;What could possibly motivate a  person to spend hour upon hour on Internet news groups defending the  government and/or the press and harassing genuine critics?&quot; Don t the  authorities have defenders enough in all the newspapers, magazines,  radio, and television? One would think refusing to print critical  letters and screening out serious callers or dumping them from radio  talk shows would be control enough, but, obviously, it is not.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12ul7yf/rbbby_and_rbbby_remastered_are_completely/", "time": 1682116826.0, "subreddit": "r/ThePPShow", "title": "R/bbby and r/bbby_remastered are completely compromised by shills", "text": "<!-- SC_OFF --><div class=\"md\"><p>A few weeks ago they started banning more and more pro bbby accounts and now <a href=\"/r/bbby\">r/bbby</a> has all posts mod approved</p>\n\n<p>Their favorite tactic is to pretend to be pro bbby and ask innocent questions while ignoring or twisting facts. Then there will be a second person pretending to be refuting their negativity but then quickly starts agreeing with op.</p>\n\n<p>Read the cointel pro guide about manipulating communities and think back to what you have been reading these last few weeks.</p>\n\n<p>Im not asking you to believe me. I am asking you not to believe me or anyone. I know it is difficult to confirm everything but anyone claiming the board hasn’t done anything 2 quarters into the turnaround, days before earnings are announced is not to be trusted.</p>\n\n<p>The board has literally only had 1 earnings announcement to report so far after 3 years of Tritton. Take 10min Rewatch that meeting and ask yourself did they really not deliver anything?</p>\n\n<p>2 very suspect users are be-zen and moonshot but there are thousands more.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12u3xtz/so_who_is_gonna_sue_benzinga/", "time": 1682087706, "subreddit": "r/ThePPShow", "title": "So who is gonna sue BENZINGA?", "text": "Media is not liable for publishing false information as long as they can prove it wasn't done for personal gain. This is the loophole that Tucker Carlson relies on heavily.\n\nThe fact that we found the BBBY bankruptcy article as a sample to show how they manipulate the markets before it was published is pretty damning evidence of knowingly publishing false information for personal gain.\n\nSadly, I am European and can't really file a lawsuit in the US, but if any one of you Apes from the states wants to talk to a lawyer, I am pretty sure there could be a massive payday if not for us, for BBBY at least.\n\nTuker Carlson, Fox, Giuliani and Trump are about to be fined BILLIONS for slandering that voting machine company. If we can prove that these articles affected the BBBY run this week, not only is there smoking gun evidence, but also presidents for holding a company responsible for losses caused by their slander.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12u3xtz/so_who_is_gonna_sue_benzinga/", "time": 1682087706.0, "subreddit": "r/ThePPShow", "title": "So who is gonna sue BENZINGA?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12s5d3q/dont_let_them_punk_you_a_history_lesson/", "time": 1681928528.0, "subreddit": "r/ThePPShow", "title": "Don't let them Punk you. A history lesson.", "text": "<!-- SC_OFF --><div class=\"md\"><p>My mom invested into Macromedia early 2000s, because she was a fan of their products. Nothing big, only $5k. Shortly after her investment, the price dropped hard and not knowing anything about investing.</p>\n\n<p>The price dropped lower and lower and eventually she sold her shares for less than $200. </p>\n\n<p>Not too long after the Adobe $3.4B ALL STOCK buy out was announced. Each macromedia share was valued over $30 in the deal which would have earned her a healthy profit at the time. </p>\n\n<p>Today (15 years later) that investment would have been worth over HALF A MILLION.</p>\n\n<p>&#x200B;</p>\n\n<p>I literally found out about this last night after I told her what was going on with BBBY and I facepalmed so hard my head almost exploded.</p>\n\n<p>Macromedia was the same story as BBBY, wildly popular company, with massive value, targeted by the shorts, so they could shake out the real investors and buy at bargain prices and profit from their loss.</p>\n\n<p>&#x200B;</p>\n\n<p>I am not saying you should buy more, but don&#39;t be an idiot and sell at a loss. 1-2 weeks before earnings are released.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12rzj4q/is_roach_stupid_or_shill/", "time": 1681919688.0, "subreddit": "r/ThePPShow", "title": "Is Roach stupid or shill?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I am going to get some hate for his but I am going to say it anyway.</p>\n\n<p>The last PPshow the price had already started to go up and he was more bullish than ever. Ok he is down a lot of money I get it.</p>\n\n<p>What really triggered my suspicion was that he kept saying the wrong date for the vote.</p>\n\n<p>Your vote has to be in by MAY 8th not April 25th like he kept claiming during the show.</p>\n\n<p>For someone who has been pushing very high level DD all this time, that is a pretty glaring mistake to make.</p>\n\n<p>&#x200B;</p>\n\n<p>So I have been asking myself these last 2 days, what kind of person has the skills and access for DD of his caliber and suddenly turns bullish right as things turn to the positive. AND Then starts pushing wrong information.</p>\n\n<p>&#x200B;</p>\n\n<p>Not to mention we have gotten more and more proof that the board and RC ARE STILL IN THIS. But NOW these diehards turn soft?</p>\n\n<p>&#x200B;</p>\n\n<p>How many people will think it is too late to vote if the financials are released AFTER his fake date?</p>\n\n<p>&#x200B;</p>\n\n<p>The list of people who have been diehard pro BBBY through all this time has grown massively this last week or two. This makes me think there are many more shills in highly regarded positions in the community.</p>\n\n<p>&#x200B;</p>\n\n<p>We literally just passed $0.51 as I type this. That is an additional 8 MILLION shares about to be bought up and taken off the market for the next few days as we go parabolic and liquidity dries up. A 50% increase at this point is a 150% increase last Friday. The price jumps are about to hit the multi cent range just as FOMO kicks in and people refuse to sell, while buying increases.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12rifm7/i_have_been_thinking_about_the_etoro_twitter/", "time": 1681882845.0, "subreddit": "r/ThePPShow", "title": "I have been thinking about the Etoro Twitter connection.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Remember my post from yesterday. WE ARE THE VALUE.</p>\n\n<p>A big part of the financial world has been IPOs and early stage capital. The IPOing company even gets to ring the Opening Bell at the stock exchange as a sort of hype/advertisement/celebration.</p>\n\n<p>Who has been left out of these investments forever? RETAIL.</p>\n\n<p>Retail investors were not even ALLOWED to invest into pre IPO companies until the crypto ICO days BY LAW unless you had a high net worth, capital requirements, etc. etc.</p>\n\n<p>There have been many new trends in investing these last few years such as SPACs as a way of going public instead of standard IPOs</p>\n\n<p>&#x200B;</p>\n\n<p>Now here comes a CRYPTO broker partnering with the world&#39;s largest SOCIAL NETWORK to offer RETAIL INVESTORS better trading access. How do you kick that off? Who would be the best company to IPO/SPAC on your platform FIRST in the current environment?</p>\n\n<p>GME and BBBY forming a merger between TEDDY and BABY would bring in the Apes who are the WALL ST. bankers of MAIN ST.</p>\n\n<p>&#x200B;</p>\n\n<p>Look at the time the SpaceX launch clock is about to hit 00. I hope my internet connection won&#39;t shit out during the stream.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12qyzbx/we_are_the_value/", "time": 1681841840.0, "subreddit": "r/ThePPShow", "title": "We ARE the Value", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>Not financial advice. I am high on crayon dust.</strong></p>\n\n<p>Laws are constantly changing and like the Tweet says &quot;Only the YOUNG&quot; Survive</p>\n\n<p>These guys have long careers ahead of them and how do you secure your career in the age of Social Media?</p>\n\n<p>You get retail investors to believe in you.</p>\n\n<p>RC has said that you can not buy the following the GME squeeze created but the buy button and BBBY &quot;rug pull&quot; has created lots of doubt in the community.</p>\n\n<p>They need a solidifying event in order to cement their legacy for the rest of their careers. After GME people piled into BBBY simply because of RC&#39;s name being attached. Many people still had doubts, though. How many people will doubt him after 2-3 more such plays turn to gold?</p>\n\n<p>&#x200B;</p>\n\n<p>No matter what you believe. A Baby Merger/Spin Off, Secret Bear Trap, EToro/Twitter stock platform partnership. Anyone or all of these could be true. They ALL depend on the RETAIL INVESTOR though, for them to make their payday.</p>\n\n<p>WE ARE THE VALUE</p>\n\n<p>&#x200B;</p>\n\n<p>Let&#39;s assume for a minute that the powers at the top screwed retail with the buy button removal to save their own asses and that they did the same with BBBY.</p>\n\n<p>How do you help those who have a $29 Cost basis? You push the price down to nothing so that they can average down for 1/100th of their original buy in. That would get you a lot of credibility and CONFIDENCE with retail that you won&#39;t leave them hanging.</p>\n\n<p>How do you make sure that the squeeze is big enough for everyone to profit? You keep setting trap after trap, after trap, making it look like absolute incompetence to the point even the hardcore believers start to doubt you.</p>\n\n<p>WE ARE THE VALUE</p>\n\n<p>&#x200B;</p>\n\n<p>Elon Musk paid $40 Billion for Twitter without ever making a profit. EToro isn&#39;t just a shit broker, they are a CRYPTO broker, and much regulation doesn&#39;t apply to them. How much is the NYSE or NASDAQ worth? NOTHING if nobody uses them.</p>\n\n<p>How much is an Amazon competitor worth is nobody uses it? NOTHING.</p>\n\n<p>WE ARE THE VALUE.</p>\n\n<p>&#x200B;</p>\n\n<p>Someone converted BBBY warrants at $6.15 even though the stock price was way below that.</p>\n\n<p>Sue filed the Interview with the SEC because that makes it official info and she can&#39;t get sued for her Rumor comment like RC did for his tweets.</p>\n\n<p>&#x200B;</p>\n\n<p>I believe there are multiple reasons for the Proxy Co switch. The least likely being that they wanted to avoid liability or didn&#39;t feel comfortable. One it bought them time between the date of record and the vote. During that time they could convert warrants and all kinds of things without having to announce or file them or the cash they raised through those conversions.</p>\n\n<p>They actually didn&#39;t create more shares in order to dilute, they simply moved shares around. Those shares existed in Nov, and Jan, They were put into reserve for those warrants and BBBY bought back pref warrants for a lump sum payment of 10mil shares + 5 mil shares post split (if it happens). That means BBBY OWNS 100 mil shares worth of warrants. </p>\n\n<p>We didn&#39;t see the influx of trading and shorting until after the march reporting period was over. March 30th, T+2 for settlement allowed them to start early. They sold 300Mil shares short in 5 Days. With 80mil shorts already on the SI.</p>\n\n<p>Let&#39;s keep in mind this deal was made so confusing that even the shills said they had never seen such a deal before. </p>\n\n<p>&#x200B;</p>\n\n<p>I believe we will get the first sign TOMORROW. </p>\n\n<p>The 25th we will see new SI numbers and I believe around then we will also get our Q4 Financials.</p>\n\n<p>I believe the financials will be much better than expected.</p>\n\n<ul>\n<li>$1.2B in Rev with 1/2 the stores</li>\n<li>20m Rewards Members &lt; -- WE ARE THE VALUE</li>\n<li>Modest cash usages.</li>\n<li>Many ONE TIME store closing costs to absorb.</li>\n</ul>\n\n<p>Anyone claiming the board hasn&#39;t done shit, should be viewed with suspicion. January we saw they were moving in the right direction, it is less than 2 WEEKS BEFORE Q4 data comes out. Triton took 3 years to sink this ship and they havn&#39;t even had 3 full QUARTERS yet.</p>\n\n<p>All I know is that Retail investors being on your side and believing in YOU is worth more than 5 BBBYs and Babys. We spent BILLIONS on shares and moved markets. </p>\n\n<p>Elon saw the power of Retail when building Tesla (which was also short attacked), and RC saw the value of Retail Investors with GME/BBBY.</p>\n\n<p>I think that no matter what the play is, <strong>WE ARE THE VALUE</strong>.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12mql74/i_like_those_odds/", "time": 1681534655.0, "subreddit": "r/ThePPShow", "title": "I like those odds", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3qe8weii9zta1.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=0f7eab2e15f7036349273059709e9d5702a60ae9\">No different than the RC tweet</a></p>\n\n<p>After looking at everything that has happened this week I am more certain than ever.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Cryptic RC tweet on the 12th</li>\n<li>BBBY buying back bonds</li>\n<li>Earnings coming up</li>\n<li>Huge call volume</li>\n<li>Sue Gove claiming not to have heard about M&amp;A Rumors</li>\n<li>Lots of short squeeze FOMO warnings in the recent filings.</li>\n<li>Sky High short volume since end of last month</li>\n</ul>\n\n<p>RC has said that you can&#39;t buy that kind of exposure the GME squeeze delivered but doing it once and people will still question your intentions. If you deliver TWICE and any investment you touch for the rest of your career will instantly trigger a run.</p>\n\n<p>RC would have to be stupid not to utilize this following, even if that wasn&#39;t his original intention. He could pick up any highly shorted stock after, and the news of his involvement would make the shorts shit himself as retail runs to pile in before it kicks off.</p>\n\n<p>&#x200B;</p>\n\n<p>I am more bullish than ever after that RC tweet. They brought in a top notch team and everything we have seen would require utmost incompetence if it wasn&#39;t planned or malicious. I think they were giving us a chance to get our numbers up, to MAXIMIZE Value for the shareholders. If you invest $10k into AMD and it runs few $ you make a couple hundred. If you buy $10k worth of BBBY, and it runs a few $ you are buying a house. My only regret is buying in too early.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/RCioR0flCgStqHd6IThD7RqNfU0PgKNbzVkVuQH6P8U.jpg\"/></div>"},
{"username": "Excitedbox", "url": "https://www.reddit.com/r/ThePPShow/comments/12m8z8u/bbby_stock_lending_revenue_almost_8mil_in_march/", "time": 1681498848.0, "subreddit": "r/ThePPShow", "title": "BBBY Stock Lending Revenue - Almost $8Mil in march", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://cdn.ihsmarkit.com/www/images/0423/americas-top-10.jpg\">https://cdn.ihsmarkit.com/www/images/0423/americas-top-10.jpg</a></p>\n\n<p>Let that number sink in for a minute. This companies stock is worth almost it&#39;s ENTIRE market cap in yearly CTB fees. March has been a month with substantially lower CTB and even if we are not getting rich somebody is. Just think of all those months with 100% CTB and a price of $6-12 per share. </p>\n\n<p>&#x200B;</p>\n\n<p>This also leads me to believe there has been lots of naked shorts. IE. brokers lending more shares than they own or lending synthetic shares. At $40-80m Market cap you wouldn&#39;t reach $8 mil a month with over 200% CTB and 100% utilization. We never went over 127% of float shorted and that was pre dilution. Since end of Feb there supposedly were many more shares and much lower fees. Either the short term borrowing is really bringing in the money or we are at least 2x more shorted.</p>\n\n<p>&#x200B;</p>\n\n<p>Source:</p>\n\n<p><a href=\"https://www.spglobal.com/marketintelligence/en/mi/research-analysis/securities-finance-march-snapshot-2023.html\">https://www.spglobal.com/marketintelligence/en/mi/research-analysis/securities-finance-march-snapshot-2023.html</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]