[{"username": "exkasy", "url": "https://www.reddit.com/r/ThePPShow/comments/17clbht/even_if_the_shares_are_going_to_be_deleted_for_a/", "time": 1697835569.0, "subreddit": "r/ThePPShow", "title": "Even if the shares are going to be “deleted” for a long time there’s nothing to worry about", "text": "<!-- SC_OFF --><div class=\"md\"><p>It seems that the shares were removed from brokers due to the transfer agent’s instructions. This is incredibly bullish since the shares might be held at the transfer agent/the trust account of the plan administrator/or a custodian (Teddy is registered as a bank 👀)</p>\n\n<p>We don’t know how long the shares are held but:\n1. The transfer agent and the broker has to keep a record of the shares and who it’s owned by\n2. If we do get new shares distributed, brokers legally have to distribute them to you because if they don’t it’ll be like taking cash out of your chequing account and they can get into A LOT of trouble </p>\n\n<p>Personally, I think because the Neelay Das hearing is on Oct 31, we probably wouldn’t get our shares until it is settled and there is an amendment of the plan on paper. Even if the shares are gone for a long time I am totally confident about the play because:</p>\n\n<p>There are 3.5 bn NOLs to be exploited, even Pulte had mentioned the NOLs</p>\n\n<p>The JPM lien is gone, it was the main setback for any M&amp;A transaction to take place, that was the reason why they had to undergo chapter 11, to remove the predatory lien through the bankruptcy courts. If the company wanted to fully liquidate, why pay off the JPM loan?</p>\n\n<p>RC is 200% involved, he was listed as a creditor, and interested party and Pulte has been spending a lot of time out of his busy schedule running businesses and charities to interact with the BBBYQ community. His reputation is at stake here because when you are that rich, the two most valuable things to you is time and reputation. Furthermore, RC had liked Pulte’s tweets about BBBY and Pulte had asked people to donate to PP’s stream in order to meet him in November. If something positive was not going to happen, a LOT of people who donated will be really mad. Why risk his reputation like that? </p>\n\n<p>I’m really excited to see how things go. I have half a mil in this play and my biggest regret is that I didn’t take out another loan and put 7 figures in this. One of the most important factors in success is the ability to take in pain. Following this stock is a traumatic experience but this is a highly risky play and even though it’s easy making 2% yearly gains investing in an ETF, only by investing in the underdog that everybody overlooks is there potential to make REAL money.</p>\n\n<p>It’s super scary to see the shares out of our accounts but just trust the process.</p>\n\n<p>I hope you all have a great weekend! The next couple of weeks will be wild ❤️</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "exkasy", "url": "https://www.reddit.com/r/ThePPShow/comments/17b1d9c/some_thoughts/", "time": 1697663147.0, "subreddit": "r/ThePPShow", "title": "Some thoughts", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m not a bankruptcy lawyer (yet) but out of curiosity I wanted to see where the disappeared shares will go and found this on <a href=\"https://www.investopedia.com/ask/answers/05/retiredstock.asp\">investopedia</a></p>\n\n<blockquote>\n<p>Shares that have been bought back can be retired, or nullified—unable to be re-issued or transferred. Securities that have been retired, or canceled, must be clearly marked with the word &quot;canceled.&quot; Canceled securities must be kept in a dedicated, secure storage area. Transfer agents must keep a retrievable database of all canceled or destroyed stock.</p>\n</blockquote>\n\n<p>If it’s really true that the shares are going to be cancelled (I have half a mil at RBC and so far it seems fine) then there is still a record of the previous owners of the shares. If the company wants to preserve the NOLs then if they do distribute new equity they have a database of the brokers/clients who had owned shares. Plus, unless a broker wants to be sued for millions or more, the broker is legally obligated to give out any distributions of new equity.</p>\n\n<p>So even if new shares aren’t issued on Friday or next Monday (I feel like it’s likely since the Neely Das objection is on Oct 31) then the records of your shares are safe.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "exkasy", "url": "https://i.redd.it/dzbgacjfx0nb1.jpg", "time": 1694175453.0, "subreddit": "r/ThePPShow", "title": "Can a wrinkle brain please explain what this means?", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dzbgacjfx0nb1.jpg\"/></div>"},
{"username": "exkasy", "url": "/r/BBBY/comments/13y1p5y/i_swear_nobody_reads_anymore/", "time": 1685678564.0, "subreddit": "r/ThePPShow", "title": "Deadline delayed due to new indications of interest", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": ""},
{"username": "exkasy", "url": "https://www.reddit.com/r/ThePPShow/comments/13hzg5d/when_this_moons_im_donating_30_of_my_proceeds_to/", "time": 1684130681.0, "subreddit": "r/ThePPShow", "title": "When this moons I’m donating 30% of my proceeds to Pulte’s Charity Foundation", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been doing a lot of calculations and I’ll have to pay a substantial amount of taxes if the stock even reaches $10. I already have a huuuuuuuge tax credit I can apply for but why not do pay it forward and help people.</p>\n\n<p>I might also donate 15% to the local animal shelter.</p>\n\n<p>All of my tax money will be used to bail hedge funds and banks anyways so I’d rather pulte it to good use</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "exkasy", "url": "/r/BBBY/comments/13beyj3/a_theory_for_how_the_extra_shares_reported_by/", "time": 1683528325.0, "subreddit": "r/ThePPShow", "title": "A theory for how the extra shares reported by Cede &amp; Co. came to be...", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "exkasy", "url": "https://i.redd.it/68mmuczcajxa1.jpg", "time": 1683065674.0, "subreddit": "r/ThePPShow", "title": "(Original u/educated_bro) The IEP Bear Raid is Crazy", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/68mmuczcajxa1.jpg\"/></div>"},
{"username": "exkasy", "url": "https://i.redd.it/uln59mnz4xwa1.jpg", "time": 1682798067.0, "subreddit": "r/ThePPShow", "title": "Recall this post speculating on total shares issued vs. total shares available to public market, market activity based on the perception of available shares.", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/uln59mnz4xwa1.jpg\"/></div>"},
{"username": "exkasy", "url": "https://www.reddit.com/r/ThePPShow/comments/131yyjb/even_after_we_go_otc_we_can_still_get_compensated/", "time": 1682697956.0, "subreddit": "r/ThePPShow", "title": "Even after we go OTC, we can still get compensated if there is a buyout", "text": "<!-- SC_OFF --><div class=\"md\"><p>Lots of people had be theorizing that Newell will announce that they will bid for BBBY this morning during their earnings call. I knew this would not happen because it is not within the auction timeframe (Apr 30 is first day of bidding and May 29th is bid deadline). </p>\n\n<p>There is another scheduled court hearing at May 16th. Icahn and RC are 200% the buyers (there’s tons of DD in this sub that prove it) and they don’t want to rush things to seem suspicious, everything must look perfectly fine on paper so that the Judge wouldn’t find objections with it. Plus it will keep SHFs on their toes for a bit.</p>\n\n<p>I think a lot of people are scared that if they trade OTC, once the company gets bought out, shareholders will get nothing. But you have to remember that originally, if the company was able to pay off the JPM ABL, then they would do a 1/10 or 1/20 reverse split and then there would be a 1 billion dollar offering from B Riley. The S-1 mentioned a fundamental transaction taking place before the offering (perhaps buyout or spinoff) and B Riley underwritten the IPO for <a href=\"https://www.globenewswire.com/news-release/2020/10/15/2109355/0/en/Spartacus-Acquisition-Corporation-Announces-Pricing-of-200-000-000-Initial-Public-Offering.html\">Spartacus Acquisition, where Shelly Lombard (a board RC had appointed and is still there,</a>  was the board of directors. B Riley is a relatively unknown investment bank, not even in the top 100 rankings when I searched only, I doubt it’s a coincidence the same person used B Riley for two large IPOs.</p>\n\n<p>In the original standstill agreement between RC and BBBY, there was a clause that says Ben and Marjorie are in charge of the acquisition parts but Shelly’s role was not specified. Shelly was the only director appointed by RC left probably because due to the JPM M/A restrictions, there was no way Ben or Marjorie could do an MA through normal means (which was why Carol and Holly joined the team)</p>\n\n<p>Even if we start trading OTC, if there is a successful buyout then there would be an IPO underwritten by B Riley for the company’s new subsidiary Baby though I think it would be renamed as TEDDY. Unfortunately because the float is so diluted, I think we would get 1/10 or 1/20 new shares, which was also kind of the reason for the RS to take place.</p>\n\n<p>Chill, enjoy your weekend and this month would be funny in hindsight when you think about it in your Ferraris.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "exkasy", "url": "https://www.reddit.com/r/ThePPShow/comments/13149gl/clearing_up_the_docket_123_lawsuit_nonsense/", "time": 1682625198.0, "subreddit": "r/ThePPShow", "title": "Clearing up the docket 123 lawsuit nonsense", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is an <a href=\"https://dockets.justia.com/docket/new-york/nysdce/1:2022cv09733/589523\">old case</a> from third party plaintiff Judith Cohen against defendant Ryan Cohen. </p>\n\n<p>Bed bath is the “nominal party”</p>\n\n<p>“A plaintiff or defendant who has no real interest in the result of the suit, or no actual interest or control over the subject matter of the litigation, but is solely joined because a technical rule of practice requires their presence in the record.”</p>\n\n<p>Shills have been spreading misinformation that Judith is HR at BBBY and that the lawsuit is on behalf of BBBY. </p>\n\n<p>I’ve been gaslighted from people in the main sub to make me misjudge what I had read. Shills have been working in full force.</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "exkasy", "url": "https://www.reddit.com/r/BBBY/comments/12z89pl/hopium_for_the_tinfoilers/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf", "time": 1682489629.0, "subreddit": "r/ThePPShow", "title": "r/BBBY on Reddit: Hopium for the Tinfoilers", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://preview.redd.it/hopium-for-the-tinfoilers-v0-s5camz2966wa1.jpg?width=640&crop=smart&auto=webp&s=a1ca5b60dc06b495196e85a4d1838c12a18fee64\"/></div>"},
{"username": "exkasy", "url": "https://www.reddit.com/r/ThePPShow/comments/12z1t2x/trust_the_process_the_board_and_rc_icahn_are/", "time": 1682470819.0, "subreddit": "r/ThePPShow", "title": "Trust the Process -- The Board and RC/ Icahn are working together", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;d love to write a super long essay about it but I&#39;m really busy so here are a couple of examples that show that the board and RC/Icahn are working together to strengthen the thesis that chapter 11 bk was a plan to sell the company without the restrictions imposed by JPM (who has been actively sabotaging the company) by legally selling it through court.</p>\n\n<p><a href=\"https://preview.redd.it/varl3jmsj4wa1.jpg?width=1283&amp;format=pjpg&amp;auto=webp&amp;s=e558b3f138d542830f5ceac7e063a213fb297edf\"> https://casetext.com/case/augenbaum-v-rc-ventures-llc </a></p>\n\n<p>The company denied that RC beneficially owned more than 10% of the company&#39;s stock and therefore would have to pay the profits back to the company due to the &quot;short-swing rule&quot;. Even though BBBY operates on a billion-dollar scale, 68 million is nothing to laugh about. This shows that the part in court where the company was talking about RC as a meme-stocker who caused the company&#39;s price when he sold was more like a fact and the board does not have any animosity towards him.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/k8rie5d5l4wa1.jpg?width=1284&amp;format=pjpg&amp;auto=webp&amp;s=5d9b507170f9ef53306ee27d5c9c9528b8c72921\"> https://casetext.com/case/augenbaum-v-rc-ventures-llc </a></p>\n\n<p>Bed Bath and RC Ventures are both defendants in the lawsuit. There was a post that stated Sue Gove personally was also a defendant but I could not see it in the lawsuit files.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0k4bwxyil4wa1.jpg?width=1283&amp;format=pjpg&amp;auto=webp&amp;s=081e20c544a0ebd006a2ecf810fbe06b0796afb8\">https://www.spglobal.com/marketintelligence/en/news-insights/trending/grvz4sMNyqZACY1wTbQ7wA2</a></p>\n\n<p>&#x200B;</p>\n\n<p>This is why even though I have half a million put in this stock I&#39;m not worried at all. Carol Flaton was appointed as a director after the company had defaulted in January. The other new hire was Holly Etlin,  both of them have managing experience in Alixpartners (<a href=\"https://www.reddit.com/r/BBBY/comments/108sv2o/icahn_alixpartners_and_bbby_are_all_connected_and/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">who has ties to Icahn Enterprises</a>) It&#39;s always been a bullish mystery why two people affiliated with Icahn were put into the company and maybe it&#39;s a way for RC to assert power within. But since the chapter 11 filing, Flaton is the disinterested director overseeing the operation and Etlin is the company&#39;s CFO and CRO in charge of the financials of the case everything suddenly clicked. The purpose of these two joining the board was to bypass a way to sell the company outside of JPM&#39;s permission through chapter 11!</p>\n\n<p>There&#39;s also the timing of RC&#39;s tweets that coincide with every BBBY filing, the references to the Titanic in RC&#39;s tweets and the way Sue referred to the company in court, the Protocol Gemini Tweet, the IG stories of Teddy and Ryan or Carl. I&#39;d love to list them all out and dissect but I don&#39;t have the time today and I&#39;ve been clean off of amphetamines for years now.</p>\n\n<p>It kind of makes sense why there were two separate plans, r/S and B Riley deal would&#39;ve occurred if the company was able to pay off JPM to free Baby and spin it off. The chapter 11 was if they couldn&#39;t be able to pay off JPM. But the results would still be the same.</p>\n\n<p>Or, I could be totally wrong and will get a fat tax credit hehe</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/y8uG6fUqj3MAiU3Z2iTTUBML1oE3pNF77LWMOohghnU.jpg\"/></div>"},
{"username": "exkasy", "url": "https://www.reddit.com/r/ThePPShow/comments/12xy9rr/tinfoil_on_the_timeline/", "time": 1682373916.0, "subreddit": "r/ThePPShow", "title": "Tinfoil on the timeline", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is tinfoil but RC had calls for 1/20, RSAs were cancelled and then cancelled, JPM loan default was on 1/13, (maybe for change of control?) the M/A might’ve been originally planned at this date, that’s why none of the 150 mil ATM offering was used. Court stated that there were two interested buyers in Jan but were blocked by JPM</p>\n\n<p>Flaton and Holly (both related to Icahn and are both for seeing the chapter 11 process, Flaton was appointed under the cooperation agreement with RC as said in one of the BK files) joined the company after JPM default. The BK documents were first drafted in Jan. </p>\n\n<p>It could be that there were two major problems with a successful M/A:</p>\n\n<ol>\n<li><p>SEC regulatory requirements, sitting on too many boards and having stocks that may cause conflict of interest, why Brett had to sell at a lot and RC and his squad had to resign from dragonfly </p></li>\n<li><p>JPM had a negative covenant that did not allow M/A since the company’s assets were tied up as collateral</p></li>\n</ol>\n\n<p>The HBC deal might’ve been used to buy time and manage daily operations while problems 1 and 2 were being sorted </p>\n\n<p>The 300 mil ATM seemed to be to repay the JPM loan and since it failed chapter 11 seems to be plan B</p>\n\n<p>I think Carol and Holly were hired specifically for this process, and both Holly and David had experience dealing with M/A while undergoing chapter 11</p>\n\n<p>I could be completely wrong though but after hearing the trial I felt way more bullish and will buy 20k stocks at open because the stock is super diluted and if there was an all cash offer we would be getting very little</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]