[{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/17hriqo/hello_neo_famous_here_ever_feel_something_deep/", "time": 1698424326.0, "subreddit": "r/ThePPShow", "title": "Hello, Neo - Famous here. Ever feel something deep inside you just isn't right? That's because it's not. Neo, it is time to wake up from the Matrix. Today I hand you the key to your dreams. When you walk through the door, you must help others also find their way to the way. 🥰🦋", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello, my friends. What a journey, this has been and will continue to be. I&#39;m honored to be here with you, and I&#39;m excited that the forces that be have placed me here and now writing this post. For, this means we are close, and it is time for the final preparations. So here we are. This post will take you about 20 minutes to &quot;complete correctly.&quot;</p>\n\n<p>A few ground rules before we start. First, you must have a very very open mind. Second, shills are gonna swarm this post and your only job is to ignore them and immediately move on with your life. Third, you should reserve judgement either way until you are able to do the things that I am about to tell you.   </p>\n\n<p>And fourth, likely most importantly, you need to clear your mind before you continue. As a mental exercise that you need to start practicing in this moment, I want you to take a few minutes and meditate. However long it takes to clear your mind and quiet it. If you&#39;re not familiar with meditation, there are many guided YouTube videos out there that are great places to start. The key is to empty your mind. One of my favorite ways to do this is to picture a perfectly still lake. When a thought comes through, that ripples this lake. It is your job to keep the lake peaceful, and free of disturbance. When a thought comes in, simply acknowledge it, send it away, and go back to making the lake still. </p>\n\n<p>You, from here forward, must be that Lake. But don&#39;t worry, I have the Konami code for this and I will give it to you today. I will try to keep this short, but sometimes these things are exactly as long as they need to be - as that is the way of things. </p>\n\n<p>Let&#39;s talk about me for a minute, by talking about you. See you, like me, have felt over the years that something wasn&#39;t... quite right. As if you are lost, but do not know how to return or where you&#39;re even lost from. As if you&#39;ve forgotten something that is important, and due to this, your life is out of balance. Out of sync. Out of harmony. Out of order.</p>\n\n<p>We feel the same thing. However now, I only feel that way in moments, whereas prior I only had moments where I didn&#39;t feel like something was wrong. Then, I found the way. The way has led me to you, again, possibly for the last time for awhile. I am here to give you the tools. It is up to you to dedicate yourself to them. </p>\n\n<p>What I am about to tell you is astonishingly simple. Just like E=MC squared, this will be simple - yet complex - but again back to simple. You will see, if you decide to follow. Indeed, this is something that exists in all of us. Right now. However, the world of distractions that seeks to fill your mind with non-sense, doubt, fear, and every negative emotion in-between. The fill your mind in order to poison you, while ensnaring you, unbeknownst to you.  And they have, for many, many years. The dark has taken hold for too long, however, in a very short amount of time that pendulum will start it&#39;s swing back. </p>\n\n<p><a href=\"https://preview.redd.it/fms4lomuvqwb1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=8402e9c6ba17bae97c736111ca2c07593ccaf823\">This is you, the universe, every atom interaction quantum particle and thing. It is visible on the largest and smallest of all scales. Once you realize this, like other anachronistic things, you will see that it has been there the whole time and you have just been blind to it. </a></p>\n\n<p>This post aims to kick-start that swing right out of the gate. The money that is coming to you later today will only be a means of execution for what we must do. I have been sent to help &quot;quarterback&quot; this transition, however, that is not to say that I am any more important than you, the tree in your yard, the rock in the grass, or the air you breathe. This is simply where my path has taken me, and I am no longer resisting it&#39;s direction. </p>\n\n<p>You see, we are all part of the unfolding of nature. It is simply that. We occupy these meat bags as observers with the ability to think. The actions that led you into this play, to me, to this moment are simply the way of nature playing out. The Chinese referred to this as the Tao. The tao is everywhere, and everything. It is nature. Is you, it is me, you are me, I am you, and we are all buddha and gods in our own right. </p>\n\n<p>When we meet, and we will, we will look across at each other and we will smile gently. It will be the same smile of knowing that we will give to others as well, as long as we follow the way. What I am about to tell you is freedom. Freedom from your angst, worldly desires, pain that doesn&#39;t serve you, and that negative voice inside &quot;they&quot; intend keep as loud as possible. I am here to tell that you can fix this, today. When this post gives you chills later, that will be your gentle reminder that you are on the right path. This is the MOASS, but talk is cheap - it takes money to buy whiskey. In order to fully utilize gifts I am about to show you are all around you, you must first escape the Matrix. </p>\n\n<p>No worries, Neo, I have come to you today as the key-master. My presence here today is no more important than the blade of glass you stepped on years ago, or that thing that happened to you that keeps you up at night, or the water that fills your cup. I have been simply been shown the path to the river and am allowing it carry me without resistance where I must go. To travel this river, you first must learn how to float. In addition to this, you must understand the river. First, if you try to swim against it you will drown. If you over-exert yourself trying to affect the direction you float, you will exhaust yourself and you will loathe the river. However, if you let it take you gently, you can appreciate the way it flows, the peace it offers, the beauty within, around, and down below. You cannot do this until you learn how to float. </p>\n\n<p>Let us do that now.   </p>\n\n<p><a href=\"https://preview.redd.it/b2qdabt12rwb1.png?width=275&amp;format=png&amp;auto=webp&amp;s=e41797ec31c9d6a50896f6c14cf6135b6de93e87\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/b2qdabt12rwb1.png?width=275&amp;format=png&amp;auto=webp&amp;s=e41797ec31c9d6a50896f6c14cf6135b6de93e87\"></a></p>\n\n<p>What I am about to tell you is true. This is what I now know to be true, and it differs greatly from what I&#39;ve been told to be true. </p>\n\n<p>You must understand that water is pure energy. Water, is the giver of life. It is also an excellent metaphor for following the way. Imagine water flowing down the mountain. When it hits an obstacle in its path, what does it do? Does it stop? Does it pause, forgetting that it is water, and cease to flow with the course of nature? Of course not. It finds a way. Sometimes it&#39;s moving, sometimes it is still. There is a time to flow, and a time for stillness. Nature, in its eternal wisdom and unfolding knows this, water is nature and knows this, you are also water as well as nature and know this. You have simply been caught by The Matrix, but don&#39;t worry Neo, today you will be presented with the red and blue pill. You have already decided what you are going to do, and I can only show you the door. </p>\n\n<h1>You have to walk through it.</h1>\n\n<p>Or rather, keep your mind clear as your body walks through it. </p>\n\n<p>Alas, but how down does one decide to follow the path? To be like water is infinitely simple, however, that doesn&#39;t make it easy. The good news is, it gets easier every day. The practices and cheat codes I intend to give you today are cumulative as far as their benefits, and largely permanent. You just have to follow the path that it shows you. You have to tap into what I lovingly call &quot;observer mode.&quot; You likely have another name for it, but it is the mode where you understand that you are not in the driver&#39;s seat. Just like this play, you are only able to take in the things that happen around you and allow yourself to absorb them. Simple, right? </p>\n\n<p>We are all made entirely of energy. As are all things that are in this world, and not. The most bleeding edge science in quantum electrodynamics confirms this. Energy only exists in states. Everything has a frequency. Everything vibrates, resonates, pulses, and constantly is both in and out of existence. You, the real you that isn&#39;t this meat bag you&#39;re temporarily piloting, is pure energy. Your conscience is the real you, which is your energy force from all lives, plus the inputs of this world combined with your thoughts. Even your meat bag is pure energy, in a state on constant existing and not existing, phasing in and out of existence. The you that woke up in bed this morning is not the same you that is sitting and reading this post. There has been an infinite number of yous since then, before then, after then, and also all at once in this moment which is now gone. </p>\n\n<p>The sentence before this one, outside of the moment you were reading it, doesn&#39;t exist. Nor do the things outside your window that you cannot see, they only become real once you observe them. As a vibrating, infinite pulse of energy, you occupy this meat bag with organs that give your consciousnesses the human experience as it plays out in the tao. Just as you understand you are human, the squirrel understands that it is a squirrel, just as the fruit fly understands it is a fruit fly and knows exactly what to do as one. </p>\n\n<p>Whereas the tao&#39;s unfolding looped a consciousness into a squirrel to live the experience of a squirrel, you have been put into consciousness of a human as part of this natural unfolding of things. Ultimately, you are a witness that has independent thought. That is the beauty and the crux of the situation, as your thoughts are a tool. When yielded appropriately with the tao, you will see that your thoughts are a wonderful tool - but a very poor master. Indeed, the tao is playing out all around us and is simply going to do what is going to do. It has been decided, has happened, will happen, and is happening. You are simply along for the ride. Your thoughts, in conjunction with the tao&#39;s unfolding, dictate how much you elevate your consciousness. More you elevate, the closer you come to remembering who you are and your place in the universe and connecting to it. </p>\n\n<p>When you understand this, you see that your angst ultimately comes from a place of fear/doubt/ as well as man-made distractions designed to enslave you by keeping you in this mindset and away from the path. There is a deliberate destruction of our ancestry by a very small number of people, affecting a great amount of pain. They do this through many means. The main one is through infecting your mind with things that are against the tao/natural order of things. They hide your powerful abilities from you, shrouding you with lies and repetitive destructive behaviors until you&#39;re locked in the Matrix forever. Make no mistake. Those that are doing this understand what they&#39;re doing. They also understand the power within them, and use it to their advantage to keep you enslaved. </p>\n\n<h1>To exit the Matrix, you must first know what it is.</h1>\n\n<p><a href=\"https://preview.redd.it/p3ru1m90arwb1.png?width=1391&amp;format=png&amp;auto=webp&amp;s=87aed42055a43b986fb3037009b5d22924708511\">It is and isn&#39;t what you think.</a></p>\n\n<p>When we discuss the matrix, we have to look at it from a couple of angles. First, there&#39;s the good side. Earth is a realm, this experience is a realm for our consciousness. The further you decide to go in the way of the tao, the further you expand your consciousness. The further you expand this consciousness and live in the way, the better and more fulfilled your life will be. Your perception of this realm is delivered to you through your organs, which were delivered by the tao. Within you exists immense power, greater than any force you are aware of. It is able to break our laws of physics, as well as your understanding of what you think you know. </p>\n\n<p>We, as humans, and divine beings in the tao have lost our place within this nature. We have have been enslaved to suit the interest of the few. They manipulate the universe, as well as our realm here, to infiltrate our consciousness with the aim of spinning up our thoughts to imprison us. They actively destroy the nature of existence through various means including destruction of family values, pornography (this is why there&#39;s so much fucking incest porn, btw), war and beating the drums of war, intentional induction of suffering (mass shootings constantly, maui, covid vaccines, homelessness, intentional division, propaganda in many many many many forms etc.)</p>\n\n<p>Just like this play has told us that things aren&#39;t always what they seem, this is also true with our larger existence. The yin and yang are present both in this &quot;play&quot; as a stock, but also in the way the experiences we&#39;ve had as a collective consciousness. The botnets, the manipulation, propaganda, psychological abuse, etc is very very real. It is in this play, and it is everywhere in this world as well. Now, I know you&#39;ve always felt it was about control, but something just didn&#39;t click. You couldn&#39;t quite make sense of it, as if there is a piece missing. Because, honestly, how could people even be like that?</p>\n\n<p>They control you, because they know the power within you. They also know that if you know of these powers, you will be able to understand them, and wield them to your benefit which will break you out of the prison they have created for you and you will usurp their power.  Once this post gets out there, we will have the tools to uproot their control from the comfort of your own home. There is no defense to this, as it is our right as our place as beings in the universe. The birds know this, the trees and the squirrels know this, and by the end of this post you too will know this. When you do know it, I humbly request you share with every human you know and encourage them to do the same. This, truly, is how we&#39;re going to change the world.</p>\n\n<p>The love of material things is against the way of nature. These things do not exist, really. They are not part of you. When you put these things before the inner-workings of nature, this works against the tao and will affect your life. In addition to this, the tao prescribes a certain rhythm to all things. Familial relationships are sacred. The bond between husband and wife, father and son, and so on is the natural way of things. When you get caught up in the ego of this realm, you stray from the path. When you stray from the path, your energy darkens along with your life. </p>\n\n<p>It manifests physically, mentally, and in your experiences. It causes a chain reaction that is meant to keep you in this place of despair, ruining your hope by keeping you away from the path and so in your own head you cannot listen to what it is trying to tell you. And that is okay. All of this is okay, as it is all part of this cosmic balancing act. You cannot have light without darkness, happiness without sad, yin without yang. </p>\n\n<p>To discover your true self, and true power you must submit to the way of the tao. The universe has flown the jolly roger flag for us here because it&#39;s hilariously appropriate. You can either surrender, or be taken by force. I was shown this a few weeks ago, surrendered, and my life has deeply improved in every measurable way since then. When you tap in later today or tomorrow, you will understand more. The longer you stay on the way, the more you understand. Talk is cheap - you will see for yourself if you choose to. For all of you that have felt something and couldn&#39;t quite explain it, like those chills you just got, just know I&#39;m telling enough of the truth to jump-start your own path. It is as simple as forcing out the noise, and returning to your true roots through the guidelines herein. </p>\n\n<p>In addition to this, you will learn how to give yourself good energy, push away bad ones, heal yourself and others, and completely break away from the confines of time, space, and this earthly body. It is already inside you, you just have to wake it up. </p>\n\n<p>You will learn more on your journey - but understand that the real matrix is a manipulation of your mind and therefore your soul - to keep you away from your true power. Your true power is found easily by submitting to the way, and you will be rewarded in all true ways. It is free. It is already there. It is something you can access today. </p>\n\n<h1>Let&#39;s just crack that third eye open, shall we?</h1>\n\n<p><a href=\"https://preview.redd.it/8ttcc5pjhrwb1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=59ee6879f7c37469d120b905ac3a8b68d686c48e\">This is you.</a></p>\n\n<p>My whole life, I&#39;ve been a very, shall we say suspicious person. Organized religions never clicked with me and I had extreme doubts about the validity of them. And as it turns out, those were justified. All of these religions, if followed properly, will lead to the way. Different paths to the same destination. The problem with this is the unjustness of it. Like, if the christian god is the real god and I&#39;m born on a mountaintop in China and don&#39;t know about christianity it&#39;s pretty fucked up to send me to eternal suffering based on geolocation. </p>\n\n<p>However, aside from the eternal damnation bit, if you were to follow the true teachings of Christ you&#39;d find yourself on the way. But that&#39;s not what most people in Christianity (and other religions) do, is it? Generally they do SOME good, but they certainly do not live for it, as Christ did. </p>\n\n<p>But if they did give people the shirt off their backs, house the homeless, serve others without personal benefit, they would find themselves on the way. This is true with many religions, and allows access to this enlightenment through many paths. I have learned very clearly that the tao is not only gentle, but hilarious as well. The synchronicities that we have seen in this  are the exact kind of flavor you can expect in your Earthly life when you&#39;re on the path. My path lead me out of town on a 9 hour drive, and taught me so so so much about what I needed to do next. This post was part of that experience, as well as the way I must conduct the healing that needs to occur in the destination I arrived at. Had I toiled over it, I wouldn&#39;t have seen the answers. By submitting to the tao, I was given the answers and shown exactly what I needed to see. I laughed, I cried, and I learned about myself. </p>\n\n<p>I have cried tears of joy and relief every day for weeks now. I have successfully put the oxygen mask on myself for now, so it is time to assist anyone else that needs it. </p>\n\n<h1>Be the wave</h1>\n\n<p>Energies exist everywhere, as everything is energy. Tesla knew this, and it is how he was able to manipulate power wirelessly through the earth over great distance. The material interests of man (matrix) has kept this, and many other innate technologies, from us to feed their own egos. </p>\n\n<p>Energies exist on frequencies. As you elevate your energy, you elevate your frequency. The more you live in the tao, the more intense your resonation. As you reach higher and higher frequencies, your understanding and consciousness compounds. Our ancestors knew this. Buddhist chants elevate these frequencies, throat singing, among many others. They knew to tap into our true selfs, and exit this plane of existence a couple of things had to happen. First, you need your brain to forget about your body. Monks, buddhas, etc know this. Typically it takes years of deep meditation to be able to unlock this state. </p>\n\n<p>But what is this state, exactly? Scientifically speaking, this state exists when your brain waves reach a state where when measured the line appears perfectly flat. If you can maintain your connection with the tao during this stage, there is a reaction of energy that happens in your brain that is more powerful than the same surface area on the surface of the sun. Read that again. </p>\n\n<p>This reaction breaks the &quot;laws&quot; of physics, as well as our understanding of nearly everything. But you honestly don&#39;t have to take it from me, the <a href=\"https://www.cia.gov/readingroom/docs/CIA-RDP96-00788R001700210016-5.pdf\">CIA knows about it</a>, has measured it and studied it. It is scientifically reproducible. It is real. It is powerful. And again, you can access it today. Here&#39;s a teaser. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/bcqurfdymrwb1.png?width=1878&amp;format=png&amp;auto=webp&amp;s=4c0552170fdc73972f3b6b3bde71bb1c9227a149\">The Monroe \\&quot;Gateway Experience\\&quot; tapes are your Konami code to accessing yourself</a></p>\n\n<p>That whole link is required reading to understand this. Take your time with it. Look up terms that don&#39;t make sense. Digest it. For anyone that doesn&#39;t &quot;have time&quot; to understand this, just know you are ignoring this to the detriment of your soul and you are actively putting your best-self and best-life on pause. The tao will wait if that is your path, but if your path is telling you to learn more, you should follow it. </p>\n\n<p>You see, the CIA found that once you&#39;re able to sync up both your left and right hemispheres in your brain, you can get them to work together. Your left side works as your &quot;reality&quot; ensurer, processing the info and delivering it to your experience. It is also the gatekeeper to the right side of your brain. Anything that doesn&#39;t fit the earthly reality doesn&#39;t pass through to the right side at all or very little to the point of being insignificant. Your right side is your antenna to the universe. If you can quiet your left side and bring the right side into harmony, you can access the universe. The &quot;other side&quot; knows this, which is why they fill it with pain and noise. The Gateway tapes allow you to enter this state almost immediately by playing one frequency in one ear, and another in the other. Your brain, trying to make sense of the difference, syncs up at a new frequency made by the two. </p>\n\n<p>These tapes are about 40 minutes for each session. There are about 6 sessions per section, and 7 sections. They will give you access to the universe, and yourself. Listen to the instructions given, read the accompanying PDFs, and go into with an open mind. You can change your life in two hours tonight, and I&#39;m serious about that. Feel free to be skeptical, you will see if you put the time in. </p>\n\n<p>These Gateway Experience tapes are available for download in many places. You can find them  by searching &quot;Gateway experience reddit&quot;. There are several posts with download links. There are lossless FLAC versions that I would recommend. There are tips on how to proceed with your journey, make sure you read those PDF instructions before you start. If your link doesn&#39;t have them, find one that does. In addition, as you progress you may not move as quick as you&#39;d like. Patience is a tenet of this process, and you may not get what you &quot;want&quot;, but you find you continually get what you need. </p>\n\n<p>And when you start to get those things, it&#39;ll make you laugh, cry, and be filled with the energy of the universe. Again, I could say so much more about this stuff, but this isn&#39;t my path. It&#39;s yours. My path is this post that shows you the door. You decide what color you want it to be, the type of doorknob, where it leads and everything in-between. </p>\n\n<h1>One last thing...</h1>\n\n<p>When we speak about the natural order of things, this is having a family &amp; having kids so the cycle of death and rebirth can continue. Nature has it&#39;s roles, and understanding of this. The squirrel doesn&#39;t worry about where their next nut is coming from, as the universe shall provide. You, like the squirrel, need to not think about where your next nut is coming from. </p>\n\n<p>I have said a few times that the PP-show has to be &quot;just so&quot; for what has transpired to work. Yesterday, when I was thinking about sharing this knowledge with you, I realized that the dildo is the perfect yin-yang metaphor for what we must do to be our happiest selves. </p>\n\n<p>With life being energies, there are certain things that are sacred, and when used for their unintended purpose you suffer. Masturbation is the willful spilling of this sacred life-force, which is against the tao. The matrix has conditioned us to do this at every turn, because again, they know what I am about to tell you.</p>\n\n<p>Up until the late 1800s, it was common knowledge that the man&#39;s seed has a direct bearing on everything in their existence. When you spill your seed, you literally are killing yourself. Your energy darkens, your life becomes bleak, and you cannot figure out what the fuck is going on. Nobody would ever think that doing a little jizzle here and there would fuck your world up, right? RIGHT?</p>\n\n<p>Turns out it does. It affects your frequency, your ability to heal, your energy, your appearance, your everything. It is your fucking life-force, and will limit your ability to connect to the tao as a man. In addition to this, the sacred bonds between man and woman are broken here - so your misdeeds will also bring darkness upon your relationship quite literally. </p>\n\n<p>Since starting this I can tell you I&#39;ve turned into a machine. My brain works better, my body is stronger, my relationship is improving, on and on. This is with me still in the early stages where a lot of benefits don&#39;t exist, but you don&#39;t have to believe me - <a href=\"https://www.reddit.com/r/Semenretention/comments/j86cek/key_quotes_from_books_and_deeper_research/\">do your own research.</a></p>\n\n<p>The dildo is the perfect representation of our dicks other side. The dildo is used exclusively for pleasure, but cannot reproduce. If you&#39;re following the way of the tao, your dick is only used for reproduction and not pleasure. The yin, and the yang. </p>\n\n<p>Like I said, the tao is very funny. Truly has the best jokes; the wit is truly astounding at times. </p>\n\n<h1>In closing...</h1>\n\n<p><a href=\"https://preview.redd.it/7o44lzp1trwb1.png?width=2100&amp;format=png&amp;auto=webp&amp;s=3231a3395420f3f45e34e555f2c8fcf412aa8611\">Are you not entertained?</a></p>\n\n<p>This is just a piece of your path. Your path will be uniquely yours if you choose to embrace it. The tao loves cooperation, helping of others, giving freely without attachment of any kind (even just the ego wanting to brag), and trusting of the unfolding of nature. You are on the ride. You will continue to be on the ride. You already know what you&#39;re going to do, it&#39;s just whether or not you&#39;re going to continue to talk through the whole movie or absorb it with intention. No fucking up the theater, either, because we all have our place in shaping this universe and if you will fuck it up for everyone around you too. </p>\n\n<p>The universe has abundance. It is okay to want to have some of that abundance. You can be your best and truest self with the methods here, that I know to be true. When you speak with the universe, it answers. I&#39;ve got tons of experiences in the last few weeks that are scientifically tantamount to that fact. But those experiences are my own, and they will not convince you, you have to have your own experiences on this journey just as you&#39;ve had to learn the hard lessons in your life to enjoy the great times and know the difference. </p>\n\n<p>In section two of the Gateway Tapes, you learn how to ask the universe for anything. Believe it or not, once you have the ability to ask, you can actually get exactly what you want. The tapes will guide you through this. When you ask for things, since the universe has a funny sense of humor, so you need to be specific. I&#39;ve already patterned out what I want my life to look like, and guess what? It&#39;s delivering. Already. In ways that simply cannot be ignored. </p>\n\n<p>You have this power inside you too, and you can unlock it whenever you &quot;choose.&quot; When you start to ask the universe to create the world you want to live in, you need to set a time. It can be immediate, but it can also be a time in the future. Might I suggest November 5th, 2023 as a rough date ask for? If we ask, we will receive. They have been hiding your ability to speak, ala Neo having his mouth sealed shut by Smith. Smith is the real &quot;men in black&quot;, and you are Neo / V / me / you / everything. </p>\n\n<p>More to come, this is enough for now. It&#39;s time to call your mom. If this &quot;feels right&quot; to you, I only ask that you share this knowledge with everyone you meet through good acts, love, and teaching of the way and how to access it. The universe will show you the path through many means, just open your heart, clear your mind, and listen.</p>\n\n<p>You can kill a man, but you cannot kill an idea. Ideas are powerful, and so are you. We have the power to change the world, to save our brothers / sisters / the earth, and it is infinitely more elegant than we could have ever imagined. We will talk more soon, but until then - enjoy the ride. It&#39;s a beautiful thing if you allow it to be. Do not force anything, just flow and you will see. </p>\n\n<p><a href=\"https://preview.redd.it/yc8uuc6nurwb1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=c89aa0686fa17bff8c44622cd92d102c6b671de6\">This is the way.</a></p>\n\n<p>- Famous</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍉 Watermelon Lover 🍉 ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/YZP7IMgXTbHEEpTP0qSAYW4Q9PMUxf5jW3fUne52fa0.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16tyht9/howdy_baggies_famous_here_one_of_our_own_needs_a/", "time": 1695854235.0, "subreddit": "r/ThePPShow", "title": "Howdy baggies, Famous here. One of our own needs a little help this month. Care about change? Today is an excellent day to put your money where your mouth is.", "text": "<!-- SC_OFF --><div class=\"md\"><p>What&#39;s up my fellow baggies? Y&#39;all doin&#39; alright? Staying hydrated? Sleeping? </p>\n\n<p>Thinking big picture and cutting out the noise / negative thoughts that don&#39;t serve you? </p>\n\n<p>Touching grass and unplugging enough? </p>\n\n<p>Not letting shills get you down in the final hour, are ya? I sure hope not. You didn&#39;t come this far to not stick to your convictions, did you? I know I didn&#39;t. Which brings me to my next point. </p>\n\n<p>One of the beautiful things about this community is that we have an opportunity every day to fight negativity with positivity. Certain parties want to paint this community in a disgusting light. And you know what? Fuck that. I&#39;ve received so much love and positivity from this community that I can&#39;t even begin to repay you all. I KNOW that you guys are good people. I&#39;ve seen it. </p>\n\n<p>We&#39;ve <strong>all</strong> been through the absolute ringer with this play. The psychological warfare is <strong>REAL</strong> <strong>AF</strong> and it affects <strong>everyone</strong>. Certain &quot;more influential&quot; players, like PP, have been attacked consistently and mercilessly. Everyone here has been subject to it to some degree, some certainly have been more than others.</p>\n\n<p>Aside from this, <em>life is on hard mode for almost everyone.</em> Similarly, some have it harder than others. One <a href=\"https://x.com/TeddyPublishing/status/1707099428786422245?s=20\">of our own needs a little help this month.</a> If you can give a little, please consider it. RyanCohenParody is currently matching all donations for 24 hours. In addition to this, a lot of you have said you&#39;d love to buy me a beer or hookers and blow. If you can, lets forgo that in favor of this. </p>\n\n<p>You can show your love through helping this fellow PP. And if he decides to spend it on hookers and blow, well, you can rest assured you did something good. If you don&#39;t want to give to this particular cause, <em>find one you do.</em> You could also send Teddy books to a longtime friend on here - the possibilities are truly endless. You&#39;ll be happy you did, too. </p>\n\n<p><strong>Like almost all of you, I&#39;m fucking broke right now.</strong> However, the money I&#39;ve given today certainly is not going to be my undoing - but it certainly may prevent someone else&#39;s. Let&#39;s start putting our money where our mouths are. We&#39;ve had time to talk about it, now it&#39;s time to be about it. ❤️</p>\n\n<p><em>You say you want powerful change? You gotta start small.</em></p>\n\n<p><strong>A single drop of water never feels responsible for the flood.</strong> </p>\n\n<p>- Famous ❤️</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍉 Watermelon Lover 🍉 ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16qm9m3/ii_keiretsu_the_tree_of_life_the_trunk_branches/", "time": 1695522861.0, "subreddit": "r/ThePPShow", "title": "II : KEIRETSU : The Tree of Life : The Trunk &amp; Branches pt.1", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is fanfic. Not of it is real. It&#39;s all fiction. </p>\n\n<p>-------</p>\n\n<p>With the thesis being that RC and many others are building a modern keiretsu, we can establish criteria and start looking for target companies to become members. </p>\n\n<p>These companies need to have the following (in no particular order):</p>\n\n<ul>\n<li>strong financials, or a pathway to them within the keiretsu</li>\n<li>share the core values and principles of other members</li>\n<li>be able to undergo joint partnerships / M&amp;A activity</li>\n<li>support the keiretsu through interlocking partnerships in various categories (sharing tech, supply chains, resources, etc)</li>\n<li>ideally operate in the same markets to maximize the benefits</li>\n<li>ideally have offices in close proximity to other members in the keiretsu</li>\n<li>are positioned to form lasting partnerships</li>\n</ul>\n\n<p>As stated previously, some of these member companies will be larger, publicly traded companies that <em>could</em> end up more in the “core” of the keiretsu. Other public companies will simply be members in the keiretsu. The core businesses are likely to have a strong cash-position, and will be in diverse industries. Public companies would also be well-positioned to enter a keiretsu structure under-the-radar, as they already have shares that can be exchanged and are likely in a financial position to enter such partnerships when the time comes. </p>\n\n<p>Non-public or less well-capitalized companies may have a harder time entering a the keiretsu partnership. These companies would likely have to take on debt in order to enter the keiretsu agreement if they distressed/performing poorly. Other private companies, like LEGO, may not need to go through such lengths to invest due to having the cash on hand. Since the holding company for the keiretsu is currently private as well (we’ll get to that), there’s really no public reporting necessary that I’ve aware of. </p>\n\n<p>If the multiple distressed private companies wanted in at any scale, it would make sense for these companies to all go through the same lender. These would be high-risk loans, as the possibility of a massive keiretsu not happening are indeed very high therefore risky. They would want to keep them under one roof, and they would likely attach a high &amp; variable interest rate (along with other stipulations) to the loan in order to make sure they, as the lender, are protected. This lender would also want control of all the debt issued in regards to this keiretsu, period. Anything else opens them to risk. </p>\n\n<h1>FINDING POSSIBLE MEMBER COMPANIES</h1>\n\n<p>Let’s jump into that Sixth Street 10-Q</p>\n\n<p>Among other things, they detail their current investments/loans are current as of August, 2023. Since I believe that it would make sense to house any loans to private companies for the keiretsu (including BBBY) under one roof, this seems like a good place to start. I started by looking for privately held companies that are possible fits in our structure (core values, interlocking industries, complimentary services/goods, etc), have taken on high-interest debt, along with other certain aspects loan structures that would be beneficial to the keiretsu member while protecting the lender. </p>\n\n<p>Here’s a list of the company categories Sixth Street is currently invested in, in the form of debt in various structures. </p>\n\n<p><a href=\"https://preview.redd.it/2zlogrn954qb1.png?width=1822&amp;format=png&amp;auto=webp&amp;s=86f785050dac8a486a0eb6cd10f692cbed7e8a95\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/2zlogrn954qb1.png?width=1822&amp;format=png&amp;auto=webp&amp;s=86f785050dac8a486a0eb6cd10f692cbed7e8a95\"></a></p>\n\n<p>Immediately I see several complimentary industries. When you couple these things with suspected members of the keiretsu it paints a certain picture… maybe? We’ll get to more of that soon. </p>\n\n<p>Aside from the broad categories, they dive into more detail on the consolidated schedule of investments, a snippet of which is below. But first, it’s important to know that these particular investments are part of the Sixth Street TAO program. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/zr2ygqhe54qb1.png?width=2864&amp;format=png&amp;auto=webp&amp;s=54f3f7edbdb1b038e0da24e346d98cc04bf660df\">“between-the-box strategies and adjacent opportunities” Adjacent is just a fun word for horizontal. </a></p>\n\n<p>&#x200B;</p>\n\n<p>RC&#39;s thoughts on the matter:</p>\n\n<p><a href=\"https://preview.redd.it/7e46xbgk54qb1.png?width=1214&amp;format=png&amp;auto=webp&amp;s=0f16ae3fb239fdfa0aa96ec0fc8b43065c09ca76\">My bad, homie. </a></p>\n\n<p>&#x200B;</p>\n\n<p>A bit more on Sixth Street TAO..</p>\n\n<p><a href=\"https://preview.redd.it/mre327vu54qb1.png?width=1828&amp;format=png&amp;auto=webp&amp;s=88546402a8f033afa2cc6024f6953ae83b845450\">Fits pretty nicely, don’t it?</a></p>\n\n<p>Seems like this is perfectly geared for the creation of a horizontal keiretsu. Knowing that, we can dig a bit more.</p>\n\n<p>Here’s an example snippet from the Sixth Street 10-Q, detailing the loans given. The full list is a few pages. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qz9lu3b064qb1.png?width=2690&amp;format=png&amp;auto=webp&amp;s=2916667c698c4819554a299972594244b2980f1a\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/qz9lu3b064qb1.png?width=2690&amp;format=png&amp;auto=webp&amp;s=2916667c698c4819554a299972594244b2980f1a\"></a></p>\n\n<p>This details the category, company name, investment type, date of initial loan, interest rate, percentage of net assets, among other things. The columns I just listed though are the ones I’d be looking into. </p>\n\n<p>To narrow this list of possible members, I proceeded by looking for <strong>debt investments by Sixth Street that fit the following criteria:</strong></p>\n\n<ul>\n<li>investments made into companies that fit all the aspects of the keiretsu</li>\n<li>initial loan date, most likely members would have had an initial acquisition (loan) date within the last two years</li>\n<li>companies that utilized loans that are higher weighted investments by Sixth Street by percentage of net assets</li>\n<li>high-interest loans w/ complex structures favorable to distressed companies as well as Sixth Street</li>\n<li>companies with similar loan structures like the following that allow for flexibility if their credit situation improves, but also reflect uncertainty through a variable rate structure that Sixth Street can effectively hedge against through variable rate swaps <strong>and other means</strong></li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/qkq3o0v364qb1.png?width=1948&amp;format=png&amp;auto=webp&amp;s=5f4029f883114d47a0d2bd2bccffcc92b0e25a50\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/qkq3o0v364qb1.png?width=1948&amp;format=png&amp;auto=webp&amp;s=5f4029f883114d47a0d2bd2bccffcc92b0e25a50\"></a></p>\n\n<ul>\n<li><strong>any significant statistical outliers that fit this above criteria</strong></li>\n</ul>\n\n<p>In regards to these being high risk loans, the reasonable bank is going to want to make sure they’re hedged as well as possible. And considering the “big picture” horizontal focused mission of Sixth Street’s TAO fund - the idea that these companies can have some interconnectivity that Sixth Street is aware of that will greatly mitigate the risk. Hence, the larger investment allocation per % of their fund as a whole. While these are sizable investments in many cases for these distressed companies, they are not large enough for Sixth Street to be the controlling entity through ownership %. </p>\n\n<p>The investment size / structure between companies is different depending on many factors, I believe it’s possible that some of those factors are directly related to their positioning within the keiretsu. I also believe that within this agreement it’s <em>possible</em> there are several investment vehicles that are designed to fund acquisitions, either partially or fully, for certain investment groups. Any company that you’d want to acquire outright or hide from these reports could be utilized through this method. I believe these groups could include Pulte, RC Ventures, Cheng, and other friendlies such as Ignition Capital. Pulte / Cheng would be funded elsewhere, so their specific activity wouldn’t be on these reports. However, Ignition Capital, which seems to have a lot of overlapping interests / values is. We also know that other white-hats have been buying companies, or expressing intent to. We’ll dive more into that later. </p>\n\n<p>Let’s go back to that last line in the criteria, in regards to statistical outliers. There was one. Hunting this specific company down started in the previous year’s 10-Q with this little snippet. </p>\n\n<p><a href=\"https://preview.redd.it/6h4i3gda64qb1.png?width=1588&amp;format=png&amp;auto=webp&amp;s=faaf1347312b9b2a0791f8dce21a396e014c2a9a\">The company I&#39;m about to go into wasn&#39;t controlled by Sixth Street last year</a></p>\n\n<p>At the time, I was looking into something else. I was curious if that had changed as of the latest 10-Q. It had.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3h69hjzh64qb1.png?width=2794&amp;format=png&amp;auto=webp&amp;s=3f0555aca130d6ca60bde77b8f961cddc26f9007\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/3h69hjzh64qb1.png?width=2794&amp;format=png&amp;auto=webp&amp;s=3f0555aca130d6ca60bde77b8f961cddc26f9007\"></a></p>\n\n<p>Huh, well, that’s interesting. IRGSE Holding, sounds fun, right? Well, let’s look a bit into what debt vehicle they’re workin’ with. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tb0hszdj64qb1.png?width=2584&amp;format=png&amp;auto=webp&amp;s=45efa0f043648fbacd1d3cd07a206b050b679b0d\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/tb0hszdj64qb1.png?width=2584&amp;format=png&amp;auto=webp&amp;s=45efa0f043648fbacd1d3cd07a206b050b679b0d\"></a></p>\n\n<p>So Sixth Street has purchased 33 million Class A units of IRGSE Holding Corp, and 8.8 million of the Class C-1 units. So what the fuck is IRGSE?</p>\n\n<p>Well, it stood for IRG Sports + Entertainment, and went to bankruptcy court in late(ish) 2022. They owned a few race tracks, and would broadcast races and events as well. Eventually they went to BK, and were bought by a fund called TPG Global. It would seem however now, it’s owned by Sixth Street. </p>\n\n<p><a href=\"https://preview.redd.it/gx8jnuyo64qb1.png?width=1874&amp;format=png&amp;auto=webp&amp;s=1ae11f63588caed904f2be5d7d405682b988a592\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/gx8jnuyo64qb1.png?width=1874&amp;format=png&amp;auto=webp&amp;s=1ae11f63588caed904f2be5d7d405682b988a592\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/u82p882n64qb1.png?width=1824&amp;format=png&amp;auto=webp&amp;s=2145108c4aae424a2291dc512b384d4e9192afc2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/u82p882n64qb1.png?width=1824&amp;format=png&amp;auto=webp&amp;s=2145108c4aae424a2291dc512b384d4e9192afc2\"></a></p>\n\n<p>It had been a struggle for awhile, with them questioning the business model eventually. </p>\n\n<p><a href=\"https://preview.redd.it/5w0ht2cu64qb1.png?width=1514&amp;format=png&amp;auto=webp&amp;s=c4f64c2e9ceb98c331d4fe6c8e91a21d321684e0\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5w0ht2cu64qb1.png?width=1514&amp;format=png&amp;auto=webp&amp;s=c4f64c2e9ceb98c331d4fe6c8e91a21d321684e0\"></a></p>\n\n<p><a href=\"https://preview.redd.it/r7iaic1w64qb1.png?width=1556&amp;format=png&amp;auto=webp&amp;s=76824b1286c956ee202c3a7490a461b5952299de\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/r7iaic1w64qb1.png?width=1556&amp;format=png&amp;auto=webp&amp;s=76824b1286c956ee202c3a7490a461b5952299de\"></a></p>\n\n<p>That property would be incredibly valuable in the right developers hands. Especially if you are partnered with a full suite of other amazing businesses that are members of your keiretsu - but we can talk more about that later when we introduce other players. </p>\n\n<p>Here’s some pertinent additional info. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/a60tilo174qb1.png?width=2634&amp;format=png&amp;auto=webp&amp;s=150388ae83d12e5cb394468b7ec1225f975134b9\">They also owned the International Hot Rod Association</a></p>\n\n<p>Hmm. You don’t say. Where have seen this recently? Hot rods &amp; Sixth Street? Oh, yeah. </p>\n\n<p>Here in a tweet from someone. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ri2xovl574qb1.png?width=592&amp;format=png&amp;auto=webp&amp;s=37524631b632b09c971eecf55ca3563ce23e0f52\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ri2xovl574qb1.png?width=592&amp;format=png&amp;auto=webp&amp;s=37524631b632b09c971eecf55ca3563ce23e0f52\"></a></p>\n\n<p>And here’s Mr. Beast’s recent video, where they play with all kinds of cars - but specifically drive the hotrods over Sixth Street bridge. Couple that with Pulte’s nudges in his direction, and there seems to be a coincidence too big to ignore. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0ciysi8a74qb1.png?width=2250&amp;format=png&amp;auto=webp&amp;s=60e93aeb9afa760e1bf17c69be5e5f18d45afe50\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/0ciysi8a74qb1.png?width=2250&amp;format=png&amp;auto=webp&amp;s=60e93aeb9afa760e1bf17c69be5e5f18d45afe50\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/r3rkqu3e74qb1.png?width=2870&amp;format=png&amp;auto=webp&amp;s=cdffecb037fcdfcfb41326ada6c8cbf01452d813\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/r3rkqu3e74qb1.png?width=2870&amp;format=png&amp;auto=webp&amp;s=cdffecb037fcdfcfb41326ada6c8cbf01452d813\"></a></p>\n\n<p>So Sixth Street owns this former Hotrod Racin’ Track having company. But it’s listed as a holding company in multiple places. </p>\n\n<p>Specifically engaging in the following:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/suw1v2fh74qb1.png?width=860&amp;format=png&amp;auto=webp&amp;s=5307e5720abee37efbead3a62d07ef3033b4f0ac\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/suw1v2fh74qb1.png?width=860&amp;format=png&amp;auto=webp&amp;s=5307e5720abee37efbead3a62d07ef3033b4f0ac\"></a></p>\n\n<p><a href=\"https://preview.redd.it/q43dy2fh74qb1.png?width=1646&amp;format=png&amp;auto=webp&amp;s=7377e4cf4572aaba162b5cef8b31ea29e5cfcea4\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/q43dy2fh74qb1.png?width=1646&amp;format=png&amp;auto=webp&amp;s=7377e4cf4572aaba162b5cef8b31ea29e5cfcea4\"></a></p>\n\n<p>So, my theory is this. This is the holding company that holds the shares of the bank required to enter the keiretsu. Since these are entirely owned by Sixth Street, they can use debt to lend debt in the form of security exchanges with potential member companies. Not all member companies will need to take on debt to enter the exchange, but certain distressed ones will. Some of those companies are here in this 10-Q, which I will dive into later. </p>\n\n<p>So it could (I think) work like this. Sixth Street takes control of IRGSE through the investment in their Series A and Series C shares. They then lend money to other companies to buy the shares in IRGSE that Sixth Street owns. When this thing is ready to go, they will merge the holding company with Sixth Street (and maybe others) to create the bank at the center of the keiretsu which will be the center of the whole sha-bang.</p>\n\n<p>Through using their holdings to lend money with favorable debt terms to the potential member companies, they incur very little risk while maintaining full control.</p>\n\n<p>IF this theory is correct - then we can start looking at these individual companies and start tying them in. I have already started this process, and part III will include that - but I’ve been at this for the last 20ish hours straight building this out. </p>\n\n<p>THERE’S SO MUCH TO TALK ABOUT I will likely spill the beans on X before I’m able to make cohesive posts covering everything. There is also more supporting evidence to these theories that I may get into later - but man - I’m exhausted. </p>\n\n<p>There&#39;s much more to discover - but my brain is about to revolt even harder than it is. The next part will be live tomorrow afternoonish. </p>\n\n<p>- Famous</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍉 Watermelon Lover 🍉 ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/oIn-N9AbyGxR7Txha53fhtci6jLAGjOFZAI5sZb0qKs.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16qlw82/i_keiretsu_the_tree_of_life_intro_outline/", "time": 1695521722.0, "subreddit": "r/ThePPShow", "title": "I : KEIRETSU : The Tree of Life : Intro &amp; Outline", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>I : KEIRETSU : The Tree of Life : Intro &amp; Outline</strong></p>\n\n<p>Oh, howdy, y’all. It’s your least favorite shill, Famous. </p>\n\n<p>I didn’t see you come… in. </p>\n\n<p><em>Wow.</em> </p>\n\n<p>Sorry, I know this is a little odd of me but I just have to say something’s different about you. Your vibrational energy is… radiant? Is that a good word for it? You just seem <em>good, healthy, and happy</em>. I know things have been stressful lately for you, way to fuckin’ hang through the shit. Not everyone can do what you’ve done lately. Many failed. Not you though, and you know what? I’m really proud of you and maybe you should be too. Aside from all that, your color looks great - and have you been working out? You have to tell me your secret - because <em>damn baggy</em> you is doin’ something right. </p>\n\n<p>But it’s more than that. Can you feel it? That slight buzz in the air - as if both those in the know and those not are collectively holding their breaths. You are too, but not in the same way. I swear, it’s like I can feel your vibrational energy right now. Starting as small pulses in a once calm ocean, you and others like you began making waves. Starting small at first, they’ve grown steadily, in both size and distance covered. Recently joining with other rogue waves to create a truly unstoppable tsunami. It’s inspiring.. dare I say infectious? </p>\n\n<p>Now that we’ve got the true DD out in the open, everything else that follows is fiction. Fanfic, if you will. None of this is real. None of the people here are real - especially the real ones - but the fake ones I say are real aren’t either. Any resemblance to “real” people is because my AI generated stock-fanfic-fantasies got boring, they don’t work anymore. I need the real shit so I got photos of fake real real fake people. This is true for every part in this series. </p>\n\n<p>I’m an idiot, like, I’m categorizing crushed gravel right now on different scales depending on how much they look like ducks. In order to stay objective in my rock-duck sorting activities, I make sure to check them at different lights - as well as against different backgrounds - just in case one makes the other look more or less ducky. Gotta be objective, you know?</p>\n\n<p>I have had limited time to work on this, so this is incomplete and should not be treated as gospel. </p>\n\n<h1>PREFACE</h1>\n\n<p><strong>Big ups to Spidey</strong> for sending me the ’22 Sixth Street 10-Q. There were specifics in that 10-Q that wormed their way into my brain, and like the FTX shit that I haven’t had time to get to, I couldn’t shake them. So, around 7pm I started digging. Starting with the 6th Street 2022 10-Q, and then onto the 2023 10-Q from the same quarter a year later. </p>\n\n<p>This DD will reference both the ’22 &amp; ’23 10-Q - but without that little push I may have not dug in when I did - or at all. Thanks again, Spidey ❤️ In retrospect, it seems so clear now to have been digging into 6th Street financials sooner. Alas, the best time to plant a tree is 20 years ago - the second best time is today. Like many of my DDs, I know there is more to find / learn here. I have done enough work with enough supporting evidence to create a thesis. I will lay that before you today, but I do have a request. If you have the time / energy and are digging into things already - please take this work and build upon it. Looking at you, <a href=\"/u/jake2b\">/u/jake2b</a> , <a href=\"/u/travis_b13\">/u/travis_b13</a> , <a href=\"/u/theorico\">/u/theorico</a> , <a href=\"/u/Region-Formal\">/u/Region-Formal</a>. </p>\n\n<p>However, there is one person specifically that I really need help from. They read a lot of stuff, and their engagement varies, but I’d really like to see them get more engaged if they can. They are one of the best/smartest people in this saga, and I believe they’re going to do killer shit regardless of it they decide to jump in. If you don’t follow this person - you’re missing out. If you’re out there, I’d love to work with you. If you’re not sure who I’m talking about <a href=\"https://www.reddit.com/user/me/\">here’s a link to their profile.</a> </p>\n\n<p>There is a solid possibility that I’ve messed up aspects of this DD. If I’m wrong in any aspect here, I genuinely appreciate being corrected. If you can help flesh out the overall picture by either correcting, or adding to the thesis that would be amazing. There are simply too many rabbits to chase. If we’re going to start catching them, we need to find ways to up the efficiency of our collective DD gathering efforts. I will be noodling on the latter, in the meantime - we can find comfort in the chaos and y’all know how to reach me. There’s a good chance I just fantasized a lot of these connections, but in my eyes, there’s a small chance maybe I didn’t. I leave it to you, my dear reader, to decide. </p>\n\n<p>This DD ties into previous works of mine. Specifically the M&amp;A activity DD’s “horizontal keiretsu” structure. I intend to build upon the reasoning for why the keiretsu structure, and further explain how it works / why I believe It applies here. This DD includes Bobby and GME, but in general, it is going to greatly zoom out your focus if you’re willing to really run it through the ol’ noggin. This series is going to be long. It may very well be fruitless. We’re going to cover a lot of ground here, so buckle up. </p>\n\n<p>Context is important so we’re going to go over keiretsu a bit more in-depth. With this understanding in mind, we’ll evaluate 6th Street Financials within the context of the keiretsu, the thesis as a whole, among other factors. Eventually, we will speculate on which companies the overall keiretsu structure is comprised of, including distressed private companies as well as more well-capitalized public &amp; private companies. We will tie their involvement back to why this structure is a good fit for their business, as well as other synergistic opportunities that the horizontal keiretsu could provide. We’re going to cover a lot of different industries and a lot of names you’ve never heard of, but I intend to tie it all together - or at least attempt to.</p>\n\n<p>We will examine these company&#39;s</p>\n\n<ul>\n<li>industries</li>\n<li>culture / core values</li>\n<li>possible synergies within the keiretsu</li>\n<li>proximity to other members</li>\n<li>their potential target markets</li>\n</ul>\n\n<p>We will go over the holding company that is currently organizing this through 6th street - and how the investment works as I can understand it. I believe there is one company that is being used as the investment vehicle for the keiretsu - and I also believe now that it’s possible that 6th Street will be the bank in the middle - in many ways at least. </p>\n\n<p>THE KEIRETSU - what it is and why it’s used</p>\n\n<p><a href=\"https://preview.redd.it/jwqyt6f944qb1.png?width=1582&amp;format=png&amp;auto=webp&amp;s=b5e959d4c523726a6650efa6438833843d552cc8\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/jwqyt6f944qb1.png?width=1582&amp;format=png&amp;auto=webp&amp;s=b5e959d4c523726a6650efa6438833843d552cc8\"></a></p>\n\n<p>The word keiretsu translates to “system” in Japanese. There are two main types, vertical and horizontal. There are similarities, but we will be covering the horizontal keiretsu - “<em>Kigyō shūdan” -</em> which are horizontally connected system of diverse business groups. Typically there is a bank at the center that supports all the other members, and then the members are comprised of a diverse group of companies from varying industries. In addition, there are other members in the “core group” that can play a larger role in fortifying the keiretsu - due to being in very different sectors/industries.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9qr5v24d44qb1.png?width=1298&amp;format=png&amp;auto=webp&amp;s=1639f59eeb547cc95c77741492a35005d539aa5b\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/9qr5v24d44qb1.png?width=1298&amp;format=png&amp;auto=webp&amp;s=1639f59eeb547cc95c77741492a35005d539aa5b\"></a></p>\n\n<p><a href=\"https://preview.redd.it/3dlgak4l34qb1.png?width=1278&amp;format=png&amp;auto=webp&amp;s=a368ebe147884fb7efe9c74c658cbcda862d94ff\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/3dlgak4l34qb1.png?width=1278&amp;format=png&amp;auto=webp&amp;s=a368ebe147884fb7efe9c74c658cbcda862d94ff\"></a></p>\n\n<p>This interconnectedness of businesses within the keiretsu opens up a lot of doors for businesses that are complementary suppliers / buyers. It also creates strong partnerships that can allow the sharing of technology, human capital, resources, and more. The level of involvement / investment in other members of the keiretsu depends on the scope of the partnership. </p>\n\n<p>There is typically an exchange of shares between the companies within the keiretsu that have direct partnerships with one another, along with the bank at the center of the keiretsu. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/upfgxuxm34qb1.png?width=1270&amp;format=png&amp;auto=webp&amp;s=a1688660e33b7a6fa1d112e7c49bced51569f3c7\">Board of directors from inside the keiretsu, you say? We&#39;ve seen some board seats getting shuffled around lately, haven&#39;t we?</a></p>\n\n<p>The company structure looks a little something like this:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/pmcapmyo34qb1.png?width=714&amp;format=png&amp;auto=webp&amp;s=6a14ffbd67f1551993f416dd2d658f771cc697fc\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/pmcapmyo34qb1.png?width=714&amp;format=png&amp;auto=webp&amp;s=6a14ffbd67f1551993f416dd2d658f771cc697fc\"></a></p>\n\n<p>Or even this… </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wv9ajhxw34qb1.png?width=287&amp;format=png&amp;auto=webp&amp;s=0ad81b9ce9db2090fd9121465ca3317fca4382e2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/wv9ajhxw34qb1.png?width=287&amp;format=png&amp;auto=webp&amp;s=0ad81b9ce9db2090fd9121465ca3317fca4382e2\"></a></p>\n\n<p>So to recap, we know that it’s a bunch of different companies entering essentially joint partnerships, with a bank supporting them in the middle. We know what kind of benefits these provide as well as how they’re structured. If you’re still unclear, please do some Google-fu until you understand the concept - we’ve gotta keep moving. </p>\n\n<p>So, next, we need to build our keiretsu. </p>\n\n<p>We will need to break these down into categories, and then subcategories. In order to be considered for the keiretsu, candidate companies need to have related core values / principles in order to form meaningful partnerships that will last. They also must have complimentary aspects to other members of the keiretsu in order for it to be beneficial. We also will need a diverse mix of companies, ranging different industries in order to fortify / maximize the strength of the keiretsu.</p>\n\n<p>Some of these will be larger, publicly traded companies that could end up more in the “core” of the keiretsu. Other public companies will simply be members in the keiretsu. The core businesses are likely to have a strong cash-position, and will be in diverse industries. </p>\n\n<p>Other members will be less well-capitalized private companies that are looking to drive revenue, and scale effectively. An investment into the keiretsu, especially at the ground level, could turn a distressed company around overnight. </p>\n\n<p>Considering this, along with everything else we know, it’s time to try to build our keiretsu - starting with the bank in the middle. </p>\n\n<p>- Famous</p>\n\n<p>Part II link coming</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍉 Watermelon Lover 🍉 ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/saNzbXVJDxd6bjMU2UuwYq_HNQacm6PwIuZ5_Dd-GEo.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16flsde/vii_the_theory_of_everything_teddy_buys_kingston/", "time": 1694406391.0, "subreddit": "r/ThePPShow", "title": "VII : THE THEORY OF EVERYTHING : TEDDY BUYS KINGSTON &amp; WINSTON ALL THE ICE CREAM IN THE BAHAMAS / HOW SUPERMAN TRULY LIVES FOREVER", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>VII</strong></p>\n\n<p>I am not a forensic detective or accountant. This is all pure speculation and only my opinion. Almost all of it, certainly, is delusional baggie-brain thinking. None of this is financial advice, and none of the people here are real - especially the real ones - but the fake ones I say are real aren’t either. Any resemblance to “real” people is because my AI generated stock-fanfic-fantasies got boring, they don’t work anymore. I need the real shit so I got photos of fake real real fake people. </p>\n\n<p>Well, fuck me fam. This has been quite a ride. Unless I&#39;ve just fucked something obvious up in my research, this is about to be one of those moments in your life. The ol&#39; where were you when you found out kind of moments. This will be the last official post in the series. </p>\n\n<p>If you&#39;ve read my previous work, you know I have an obsession with the big picture. Just in the few weeks we have been able to form a conclusive theory as a group. Working hard, together, pushing towards a particular purpose. There has been amazing discussion that has answered a lot of long standing questions. I fuck up a lot, and there are certainly errors over these series of posts. I started this on Friday around 5pm, where I went in blind to figure out what I possibly could. </p>\n\n<p>The finale you&#39;re reading now is why I&#39;ve slept roughly four hours, haven&#39;t spoken with my girlfriend (sorry again my love), and have pushed non-stop to get this out there. In an effort to be done, and hopefully in less pain, this post will be less in depth than I had intended. However, I intend to expand on some of the points in the series as a whole, as well as what comes next. </p>\n\n<p>However. I must rest and approach with a fresh brain tomorrow. This final post will be less detailed than I’d typically like, and I will likely add to this post tomorrow as well.</p>\n\n<p>Lets get started. </p>\n\n<p><strong>Jan 2023, FTX goes to BK court</strong></p>\n\n<p>If you’re in BBBY, you surely know all about the what happens in bankruptcy court. </p>\n\n<p>With FTX from the start, it’s a fucking shitshow. First off, the amount of subsidiaries they have is gross. I honestly started here in BK court, and saw so much shit that made my ass pucker so hard the neighbors heard it. I’m not going to go further into the criminal proceedings. I think at this point, we can posit what SBF does when he’s out on bail. I’m sure it’s not the exact same shit he was doing before. </p>\n\n<p>As the court proceedings for FTX’s bankruptcy were ongoing in Jan, 2023, the FTT token springs back to life on the Binance chain. </p>\n\n<p><a href=\"https://preview.redd.it/v9508sektjnb1.png?width=3288&amp;format=png&amp;auto=webp&amp;s=b72d4158e2403ec5d5d919877d672ecb51cae692\">what a surprise</a></p>\n\n<p>FTT is the is orange line. Knowing what we know so far, what does this tell you? Those runs that were stopped by “bad news” were also deeply manipulated with tokenized shares. I’d posit that our team of all-stars knew this would be the strategy, or, we are about to witness a controlled demolition of sorts with all the white hats that I suspect may be involved. This would explain certain moves in several different circles per se that don’t seem connected, until all of the sudden, they are. </p>\n\n<p>------</p>\n\n<p>In bankruptcy court, whenever you file for bankruptcy protection, you naturally have to list all of your assets &amp; liabilities, any claims against you, properties, etc. </p>\n\n<p>Oh, speaking of properties. FTX bought at least 250 milly worth for themselves in the Bahamas. Because that’s what real businesses do. These houses, bought with money from the aforementioned deeply intertwined &amp; complex scams / schemes, was bought with company money for people like SBF’s parents, himself, executives, etc. Even though the homes are under their names, they get clawed back. </p>\n\n<p><a href=\"https://preview.redd.it/sqykz3f8ujnb1.png?width=1444&amp;format=png&amp;auto=webp&amp;s=e9a2f9670254bc94ad5de608c9a3442308eb5a43\">classic Sam</a></p>\n\n<p>So, if the debtor’s (FTX) assets don’t outweigh their liabilities, they, or another responsible party has to pay. In this case, there are over 10 million claims against FTX by users, and many others. These people are creditors if their claims have merit. When you consider the FTX / Binance / Citadel criminal empire - you figure they all pretty much have merit. Those properties, will immediately go to the creditors. In addition to this, if you’re a willing counterparty to the fraud, you may be liable for damages as well. </p>\n\n<p>Again, a lot of these docs are still missing info, and I believe things will become clearer as more info comes out in due time. Right Brett?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/u08oh1rbzjnb1.png?width=1160&amp;format=png&amp;auto=webp&amp;s=6bccac544ece8c11b60c7b801c85c94eeb2f571d\">ok</a></p>\n\n<p>Anyway, along with assets, creditors are listed on the Schedule D that have claims secured by property. Secured claim basically means they have right to the property if you default on the loan. For example, you buy a house, you don’t pay the bank, bank takes your house. In BK, they are kind enough to give us a list of creditors with claims that are secured by property. </p>\n\n<p>Here’s the full list. Some interesting names. </p>\n\n<p><a href=\"https://preview.redd.it/itd3z9dhujnb1.png?width=2320&amp;format=png&amp;auto=webp&amp;s=62c3dccee7fa33579794bc7d9095d0d426464f57\">\\&quot;So you&#39;re telling all of centralized crypto was a scam?\\&quot; </a></p>\n\n<p>Yup. </p>\n\n<p>In addition to this info, we get a list of debtors. This is anyone that may be on the hook with the company - and have to pay in case there&#39;s not enough assets to meet creditors claims. If you&#39;re in IBKR, you may want study the rest of this post carefully. </p>\n\n<p><a href=\"https://preview.redd.it/t20cf8grujnb1.png?width=2480&amp;format=png&amp;auto=webp&amp;s=09aad019853ebac0f17fa3eeb9de01bd3f578d06\">See any familiar names there? </a></p>\n\n<p>Remember when Thomas Petterfy started on about how Gamestop had to go to zero? Well, it seems he put his money where his mouth is - quite possibly in all the wrong ways. In addition to this, the banks on this list have a certain little something in common. They all collapsed around the same time, with Silicon Valley Bank being the first. FDIC agents were in there in less than 48 hours. However, it’s not here on this list.</p>\n\n<p><a href=\"https://preview.redd.it/iv9cptp0vjnb1.png?width=1196&amp;format=png&amp;auto=webp&amp;s=0f84189a7f5f6c89180a80539a7543ac2793b83a\">Oh, I get it now.</a></p>\n\n<p>One thing debtors are required to record is any inter-company transfer in the last year that could have possibly benefited an insider. In this case, there’s like 20 pages of them. With really small print. With really big numbers. There’s a fuckton of them, and it certainly paints a grisly picture. Here’s one page as an example. I recommend checking it out. It really drives home the crypto-slushie thesis. </p>\n\n<p><a href=\"https://preview.redd.it/ba5t0yopvjnb1.png?width=1378&amp;format=png&amp;auto=webp&amp;s=f95c7bdfd0fc1d58b22569e139d67a967de5cf11\">Yikes. Their books are so fucked up they essentially had to say we don&#39;t know what kind of risk we&#39;re looking at. </a></p>\n\n<p>You see that Alameda transaction to... uh... Alameda? Lemme help you. </p>\n\n<p><a href=\"https://preview.redd.it/gv907zhxvjnb1.png?width=2054&amp;format=png&amp;auto=webp&amp;s=57caf0fafba6ad71d18731dbc713a45787692875\">Bottom line. Jesus. </a></p>\n\n<p>Looks like a slush fund to me, with FTT / Alameda feeding everything. </p>\n\n<p>There’s more in here, but I’ll have to save it for another day. </p>\n\n<p>Lets break away for a moment. We discussed the possibility of this being a controlled demolition for some good reasons by certain powers that be. We also discussed how you would need to be able to break through as an unstoppable force, as you only get one chance with this. </p>\n\n<p>So, how can you do this? Well, a few things can definitely help. </p>\n\n<p>I propose that the OTC market was a strategic move in order to best increase the chances of success. I actually posted a complete write-up about this back in the day, and then I deleted it because I felt I was a bit too close, and didn’t want to telegraph strategy to the “other side” as it were. However, now, I see they are unequivocally fucked. There are no haults, so no fuckery and repositioning when others can’t trade. It IS the dark pool so you don’t have a way to reroute shares off-exchange. And lastly, a possible one that I considered with this research, is that if you’re a Sith Lord holding billions of BBBY tokens - how many BBBYQ tokens do you have? I’d venture to say none. Maybe you were ballsy enough to make some with the SEC / DOJ watching - but I have a feeling - anyone involved in this is feeling mighty hobbled. Hell, some of them may be in custody for all we know. </p>\n\n<p>In addition to this, you’d need something that unequivocally causes a domino effect - to ensure you take out all the small players as well. Keep this in mind as we near the finish line. </p>\n\n<p>-----</p>\n\n<p>Back to bankruptcy court and the role of creditors. Reminder, when you liquidate assets, they go to your creditors. If it’s in the case of international securities fraud, they’re going to come after the assets of anyone that participated. In addition, these claims don’t necessarily represent the final value. They say early on that it’s too hard to estimate, and a lot of the claims, as well as asset and liabilities, are incalculable. All that to say, remember these coins were not trading necessarily at the value of the stock. Many of them were trading for less than a penny. Depending on how the liabilities are calculated; there’s a chance that the number could be much, much bigger. In addition, remember that when you’re doing these joint ch 11 cases they file together - but still list the subsidiary the claim is against. </p>\n\n<p><a href=\"https://preview.redd.it/44flei0kyjnb1.png?width=2130&amp;format=png&amp;auto=webp&amp;s=bf95adc846170a38d008b5d260d9179b42f9f43a\">They can&#39;t calculate the damages</a></p>\n\n<p>Flashback to Jan ’21 during the sneeze. Now, remember FTX subsidiary Blockfolio coming onto the scene over-night, deploying insane amounts of Gamestopfinance coin? Here&#39;s a reminder, in case you forgot. </p>\n\n<p><a href=\"https://preview.redd.it/c2flzb62xjnb1.png?width=1546&amp;format=png&amp;auto=webp&amp;s=67927f7f71950148d81e30527241fefa95accb66\">We know that the vast majority of \\&quot;shares\\&quot; traded were GamestopFinance tokens</a></p>\n\n<p>If liquidated, hedge funds own an inordinate amount of property in the Bahamas. If the MOASS were to occur, they went bankrupt, those real property assets would then go to pay the creditors. FTX owned an insane amount property. That property is secured by some firms that very well could be involved in this, and end up getting liquidated themselves. Especially if creditors have much higher claims. </p>\n\n<p>Which leads me here. It&#39;s bittersweet, honestly. It&#39;s been amazing shit-posting with you all. Big ups to RC / team for getting us to this point. It couldn&#39;t have been easy for them. When this changes your life, please make sure that you take care of yourself and love your neighbor. If you&#39;ve read my work, I&#39;ve likely shoved this down your throat a lot. If you haven&#39;t pulled your phone out to call your mom yet, you may want to do that now. </p>\n\n<p>Understanding the info I&#39;m about to tell you, I believe that dad got a bank (SVB), BBBY with merge with GME to maximize the squeeze in both tickers, whatever SVB becomes will be the bank at the center of the Keiretsu, lastly - any assets that RC wants from FTX he will have. </p>\n\n<p><strong>Have a seat, on the couch or in a comfortable chair.</strong> </p>\n\n<p>First, I&#39;ve gotta edge you a bit. The IRS is big mad, and are seeking roughly 36 billion in taxes and such. </p>\n\n<p><a href=\"https://preview.redd.it/8x72px6nxjnb1.png?width=1118&amp;format=png&amp;auto=webp&amp;s=2e58b90576fc29a44dc7f72e2fb7349f7599274c\">Jesus Christ. What the fuck did they do? </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/oklvl70uxjnb1.png?width=2076&amp;format=png&amp;auto=webp&amp;s=ab1ddb9ebd77bed580e639dae5b98028d7155675\">Oh, that. Thank you for having me. It&#39;s been an honor, truly.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/2vnbj1vdyjnb1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=a1ccc684adcf6079f168ecad6299766dbf7e5553\">Superman lives forever.</a></p>\n\n<p>- Famous</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/mUzIQD-gRnwz6zoCKXcNPmDH5-_l-nzgm7Bx0CDNYN8.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16fiz52/vi_the_theory_of_everything_dark_side_plan/", "time": 1694397978.0, "subreddit": "r/ThePPShow", "title": "VI : THE THEORY OF EVERYTHING : DARK SIDE PLAN STUMBLES : REBEL ALLIANCE STUDIES THE DEATH STAR", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>VI</strong></p>\n\n<p><strong>DARK SIDE PLAN STUMBLES</strong></p>\n\n<p>Shortly after his mid-air turnaround, Vader gets some more bad news just a couple of weeks later. </p>\n\n<p><a href=\"https://preview.redd.it/5kur2qav4jnb1.png?width=1372&amp;format=png&amp;auto=webp&amp;s=7ff0e01c365d44bf1a7ccec6b72d64fc7281a4eb\">Not a good look</a></p>\n\n<p>And, of course there’s a Kendicator to make me think he’s guilty, because there always is, it seems. </p>\n\n<p><a href=\"https://preview.redd.it/l3nsvxs15jnb1.png?width=1480&amp;format=png&amp;auto=webp&amp;s=e35bd056885e99401226a7f88de66862adc948dc\">they plastered this shit everywhere</a></p>\n\n<p>One thing that I’ve touched on lightly, is the SEC pressure on these crypto firms. To fully encapsulate what I’m about to tell you, this context is important. Again, I do not believe in coincidences past a certain point. I believe that what we’re about to see unfold, has been in the works for a long time. </p>\n\n<p>I believe it is the result of the mutual interest, not only for the victims, but also for the Govt. to take this network down. I didn’t even get into the stuff regarding sketchy moves centered around a certain conflict that we’re engaged in. There’s plenty of flight logs and Kendicators to support a pretty fucking bleak picture. Then, there’s these very questionable moves by Binance to to keep that particular tap open - which seems like an odd thing to push for given the context. in early 2022, essentially refusing to shut down Russia operations as MayoForce is jetting back and forth. </p>\n\n<p>Oh, and that move from Binance?</p>\n\n<p>Not only were they keeping the tap open, but they were doing some pretty wild shit that sounds a whole lot like bribery. Both passages here are relevant though. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8vd414gq5jnb1.png?width=1984&amp;format=png&amp;auto=webp&amp;s=ea6610fc08a70c66a5f75f40b833ae14fd404e99\">So he takes a fat stake in Forbes before doing sketchy shit with Russia? Hm. </a></p>\n\n<p>They had been adamant about not leaving the Russian market. Again, liquidity requirements, among other things. Naturally, this little bit of conflict probably wasn’t good for Ken’s image. So they take a fat stake in Forbes. It’s &quot;unclear&quot; whether or not the deal went through, but I think that we both all know it did. Possibly, even to be able to steer the narrative when the inevitable happens. </p>\n\n<p>Two months later, we get this gem to confirm they did, indeed pay off Forbes.</p>\n\n<p><a href=\"https://preview.redd.it/x9j2a6156jnb1.png?width=2902&amp;format=png&amp;auto=webp&amp;s=da0bae393c15c8d824ae7e77573c0b8a2ebd9fe4\">fucking tosser</a></p>\n\n<p><a href=\"https://preview.redd.it/9zkl9xl86jnb1.png?width=954&amp;format=png&amp;auto=webp&amp;s=198565d590eeb0710dad2a1aeade3d1a5b6c7500\">gives me the fucking creeps</a></p>\n\n<p>Through the year in 22, they continue to short using whatever coins are available. However, the tap is starting to dry. Regulators are closing in, and things are not looking good. In early November, 2022, FTX was about to collapse. They did so, officially, on the 11th of November. This was a chess move, orchestrated by who, I’m not sure. Just a few days before the collapse someone secured the bag. </p>\n\n<p>BBBY116</p>\n\n<p><a href=\"https://preview.redd.it/1hq18tpe6jnb1.png?width=2792&amp;format=png&amp;auto=webp&amp;s=0dc7eeca5610de86467c7f4659f06eb2810752f3\">how shocking, i&#39;m shocked. you shocked?</a></p>\n\n<p>So they took the coins, and what did they do with them? I can&#39;t even begin to imagine. Six days after the coins were moved, this gem comes out. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/m3tj3izs6jnb1.png?width=1682&amp;format=png&amp;auto=webp&amp;s=6184e0ae70e38fd4ce2b3ece7fbeeeeace103609\">am I painting an effective picture yet?</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>REBEL ALLIANCE STUDIES THE DEATH STAR</strong></p>\n\n<p>After the Gamestop saga, possibly before, the SEC was going all out trying to track down these crypto firms. Meanwhile, parties-in-interest did everything in their power to oust Gary Gensler. The’ve been using the same media machine they use to discredit us to destroy anyone they want. If you want to know if you’re on the right track, just look for the amount of vitriol coming your way. If you’re the government, and you know this is going on you need a robust plan to stop it. </p>\n\n<p>SEC opened their investigation into short selling in 2021, and immediately turned it over to the Justice Department, who has been doing their thing for two years. In addition to this, the US DOJ said a couple of months ago that they would be making arrests in few months. Vader has aged eighty-four years in the last two, he knows the walls are closing in. We know that the govt also always gets theres, and they’re not going to just let something like this happen if it doesn’t benefit them too. </p>\n\n<p><a href=\"https://preview.redd.it/imskiv5x6jnb1.png?width=2226&amp;format=png&amp;auto=webp&amp;s=beb517165dc291c6a4d41f14a8f380fa4a023815\">oh, okay then</a></p>\n\n<p>Gotta make sure you can enforce though, amirite?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/q3sq5dp07jnb1.png?width=1930&amp;format=png&amp;auto=webp&amp;s=86853807a040c8194b37d23e2b8307fffdaa3468\">okay, have a nice day</a></p>\n\n<p>The SEC, and DOJ has been building a case for over two years now. You do this with small fish first. Hwang. Then, you expand the reach. Since we know that <em>just about</em> every crypto exchange is dirty (which I will further show in the next post) you can start with the small fish and work your way up. It’s the same way you do things in organized crime. You start with the street level runners, then you go for the dealers. FTX was the main thing that made this work. They’ve been systematically cutting off the other share printers / reserves. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/6g6sb9gd9jnb1.png?width=1482&amp;format=png&amp;auto=webp&amp;s=5e0ac858c4dc1e0365df79ee8f4f9daddec5cf55\">FTX tries to buy Voyager, but can&#39;t. Wonder why. </a></p>\n\n<p><a href=\"https://preview.redd.it/k2df20p68jnb1.png?width=1492&amp;format=png&amp;auto=webp&amp;s=bc17272b1275c9b35e766aa70e1f74b4b3095306\">Then Binance tries, again, failed. What&#39;s in there that they need?</a></p>\n\n<p><a href=\"https://preview.redd.it/w3ok23969jnb1.png?width=1396&amp;format=png&amp;auto=webp&amp;s=a0466718d147fe1a44475f2a0587e3cf70760c02\">Kraken folds, they keep saying securities but never elaborate. The reason they don&#39;t is because they can&#39;t at this time. </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/be753qrp9jnb1.png?width=1398&amp;format=png&amp;auto=webp&amp;s=93e1dc4ab1873916d1ae1a980ac133ceeb3f26fa\">Then, finally, in June of this year they charged Binance.</a></p>\n\n<p>These are just some of them. It never made sense to me why they were classifying all these random coins as securities. Well, it makes sense if you’re using them obfuscate swaps to provide tokenized securites. </p>\n\n<p>I believe that the Govt knows that if this is allowed to continue that it will destroy. They, like the SEC, are somewhat powerless to really unfuck this thing. If they try to litigate it’s going to have mixed results, especially considering the scope of this and that many of our govt are bought. Further, with the possibility of a lengthy trial, that opens up the door for so much manipulation from guilty parties. In addition, since 2021 there are hundred of thousands of pissed off investors that are feverishly learning about the market. </p>\n\n<p>Couple all of this with everyone being so ready for blood in the streets, especially after 2008, that leaves them with one option. First, you need rules to not bring down the entire system - which they have implemented. During the time it takes implement new rules, you build your criminal case. Once enough of the street rats have squealed, you can move to the next step. </p>\n\n<p><strong>Force the trade to unwind.</strong> </p>\n\n<p>To do that, though, you need a catalyst that will ultimately be so unstoppable that regardless of whether they pool all their resources they’re still fucked. Americans, and others around the world, get rich from holding any stock that’s been destroyed by these parasitic fucks. Justice is done cosmically, and there’s no question whether a crime has been committed due to the relative shit-show that unfolds. The best part is, everyone that deserves to get paid does, and those that have been stealing for years lose everything. </p>\n\n<p>Chef&#39;s kiss, if it&#39;s done right. </p>\n\n<p>You look at the billionaire divorces recently. Mayo’s move to FL. The Gates. Plotkins. There are more, I believe that the people “in the know” know what I’m going to tell you soon. However, if you&#39;re going to force the trade to unwind - you need an impossibly perfect plan. You need to turn of the free-share spigot, and also make sure everyone knows that they&#39;re going to jail if they fuck around. </p>\n\n<p>This, of course, doesn&#39;t focus on our non-authority &quot;white-hat&quot; actors. I&#39;ve posted on them and their intentions plenty, but I think that it&#39;s possible that they are working with the SEC / Gov, and some of them may very well be under protective custody. I believe our white hat(s) met with the SEC, and agreed collectively to help with all the homework - so long as they let their shareholders that were wronged get their proper due. </p>\n\n<p>To prime you for the next post, here&#39;s the one of the lists of dockets in FTX&#39;s bankruptcy court proceedings that were entered into the system on 7/31. There is a lot of redacted info in these, and this will make a bit more sense soon. In short, these are all the assets / liabilities for the FTX umbrella. Including lots of fun info relevant to our situation.</p>\n\n<p><a href=\"https://preview.redd.it/wyz8az1n8jnb1.png?width=2092&amp;format=png&amp;auto=webp&amp;s=72214028aa0731f9ca3fddd5250db7f70afc110a\">Note the dates on the right, and the words (Redacted) in most of the dockets</a></p>\n\n<p>All this time since the sneeze, even after FTX collapsed, GMEfinance coin had been trading. And then, the very next day... it stopped.</p>\n\n<p><a href=\"https://preview.redd.it/1gakeeof8jnb1.png?width=2732&amp;format=png&amp;auto=webp&amp;s=a7db05176889211385ddc2599e2667c49bee2205\">rut roh raggy</a></p>\n\n<p>We&#39;ll go to court next. Two more posts. Best is still coming. I know I&#39;ve been hyping, and I promise to deliver. You can either share the shit out of this now, or wait until I fuck you with what&#39;s happening. I&#39;m good with either.</p>\n\n<p>- Famous</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/tew3NMl6GoELsTCHdzvuhYWosqXL33dc6hs3ygIiZXA.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16fglee/v_the_theory_of_everything_the_dark_side_hatches/", "time": 1694391649.0, "subreddit": "r/ThePPShow", "title": "V : THE THEORY OF EVERYTHING | THE DARK SIDE HATCHES A PLAN pt.3", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>V</strong></p>\n\n<p>In the last post, we discussed some odd timing in regards to Binance’s offering of tokenized stocks. I believe that it’s possible that Binance started the program and knew it was going to be problematic with the SEC, but that’s what they wanted. They only needed to have plausible deniability long enough to mint the the fake share tokens, before shutting the whole op down with the regulatory pressures as the reasoning. </p>\n\n<p>Remember when our friend exited the Japanese, Hong Kong, and Chinese markets in favor of Europe? Famous Farms remembers. </p>\n\n<p>Let’s dig deeper into what happened with their tokenized share program. </p>\n\n<p><a href=\"https://preview.redd.it/mkj4g4n5ninb1.png?width=2164&amp;format=png&amp;auto=webp&amp;s=9996e41b4465811c40b1f6daab8be2dd83127bea\">Oh, that’s fun. Those are totally real™️ shares. And you can&#39;t get them right away, because they need to hold on to them, for reasons.</a></p>\n\n<p>In short, this states that all of their totally-real-and-verified shares will eventually be moving to CM-Equity. I propose, that the purpose of these moves was to create these shares, and for no other purpose. FTX was already under scrutiny at the time, and any official trades could be scrutinized. It had to be under the table, per se. </p>\n\n<p>Now, I haven’t even talked about Alameda Research. We’ll dive a bit deeper into them in the next post. We learned earlier, this was a “crypto research” company founded by SBF many moons ago after he left Jane Street. Yes, that Jane Street. Without going too deep here, I believe that Alameda was the hive where all the money and fake shares flowed through - to be divvied up and converted as needed / required by their own HFT algos - or - the algos of the group. One little tidbit to set the stage further though. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/07hm27ooninb1.png?width=1586&amp;format=png&amp;auto=webp&amp;s=c15f409b6254ee6b1197460f95654296637e5c8e\">love it, totally not a scam</a></p>\n\n<p>Back to how Binance creating shares helps if nobody can hold the actual shares. In this case, it goes something like this. </p>\n\n<p>- Binance creates the shares as they shut down their tokenized trading, their buddies at CM-Equity - Europe get their palms greased</p>\n\n<p>- They totally certify the shares and hold them on their books, the shares are further verified by FTX’s in house gmbh services both in Europe and the Bahamas,</p>\n\n<p>- EM-Equity NYC vouches for it the shares because they’re totally real - CM-E EU said so, and then hard-wallet(s) are used to store the billions of shares as locates. </p>\n\n<p>- Obfuscate the shares movements</p>\n\n<p>Binance can claim that it was just part of the process of winding down their tokenized stocks division, and look, they totally haven’t moved. So what’s the problem? </p>\n\n<p>So, how do you get shares without getting shares? </p>\n\n<p>You use your HFT expertise to further intertwine your own in-house token, that you completely control the supply and demand of. This will work as long as you have steady inflows, the downside of this is, if you stop expanding scam you&#39;re fucked. </p>\n\n<p>This is why FTX exploded onto the scene seemingly overnight out of nowhere, they were trying to rope as many more people as they could into the scam to save themselves. They even had a press arm called West Realm Shires that would publish articles, and other publications would pick them up. They have since been scrubbed from the net, but there are remnants out there. They, of course, also traded in crypto, like just about all of the FTX sub companies. It makes it harder to track, and if you don’t keep records or fudge your books, it becomes quite hard to track. </p>\n\n<p>The Dark Side now has unlimited FTT, through Alameda &amp; FTX + FTXs 50+ subsidiaries. We’ll go over the complex company structure in the next post. But how does unlimited FTT = GME or BBBY shares? I’m glad you asked. Again. These fuckbois are possibly the best in the world at HFT algos. We’ve already discussed all the things that crypto technology can provide for a ponzi that really wants to get going. They also have to keep these crypto shares off their books, or they risk being taken down by regulators. Here’s what I think they did. </p>\n\n<p>First, in July 21, just a few days before these shares were created, FTT was moved to trade on Binance’s chain. </p>\n\n<p><strong>HOW THE SCAM WORKS UNDER THE HOOD - PLUMBING &amp; TECHNICALS</strong></p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Shorts would open crypto derivative swaps, swapping FTT for BBBY/GME/whatever tokens. In these arrangements you don’t need to actually need to move the illicit shares to your account, but you can show you have a right to the swap.</li>\n<li>Buy FTT collateral required to enter the swap. </li>\n<li>Use the swap to give you a “locate” that is a “totally real share” because their homies at CM-E NYC talked to their homies at CM-E EU, and they totally vouched for it bro. By the way, EU regulations are dogshit - that’s a post for another day though. </li>\n<li>Once your goals are accomplished, dump the token. You know this shit is essentially hedgie-bullshit-monopoly money and it could eventually link you to the crime, you don’t exactly want to hold these swaps for long. </li>\n</ol>\n\n<p>You just need to hold them long enough, and use just enough of them, to accomplish your goals. Reminder, the other .finance tokens are still trading at this time - but it doesn’t seem to be enough. Other stocks, like BBBY, were putting too much pressure on the basket because they’re heavily shorted as well - and still trading well above their short entry price. They’re fucked if this keeps going. </p>\n\n<p>Let’s scope some chart-y bois really quick. The yellow area is when the billions of extra GME / BBBY shares were minted. Also note, that CZ during this time sold a large chunk of his FTT tokens that he got from his “investment” into FTX. It’s hard to nail down a date, but apparently it was either late July or early August. And he didn’t disclose the sale until years later, so who the fuck knows. I have some guesses, though. </p>\n\n<p><a href=\"https://preview.redd.it/j0i39ofioinb1.png?width=2770&amp;format=png&amp;auto=webp&amp;s=8e8c123d849b421a41b5cf903b6c3ea102722f05\">Note the lack of history prior to July. These shares were created for the soul purpose of laundering through Binance, using FTT</a></p>\n\n<p>Again, this saga has been marred by some awfully interesting timing, don’t you think. But that doesn’t <em>exactly</em> mean they’re correlated. Maybe it could just be another silly coincidence. Here’s another chart from the same time period. GME is the red line, BBBY is the blue, FTT token are the candles (duh). </p>\n\n<p><a href=\"https://preview.redd.it/l2alcc7voinb1.png?width=3288&amp;format=png&amp;auto=webp&amp;s=a7f7d8ac52b718a1cac819aae5227c23d5272d78\">this was the moment I knew I wasn&#39;t going to be sleeping at all this weekend</a></p>\n\n<p>FTT pumps either just before, or during any upswing on GME or BBBY. There&#39;s a clear pattern of loading to suppress, and unloading. </p>\n\n<ul>\n<li>Check out that crater on the blue line for BBBY starting around October, 21 - and then look at the FTT price action in the weeks prior. Almost as if someone was building a position in synthetics to crash the price, eh? </li>\n<li>Look how violently GME corrects to FTT when there is a price diversion for too long. </li>\n<li>Look how FTT pumps as downside accelerates. </li>\n<li>That dump at the end of the FTX chart? Oh, that’s CZ cashing out his entire stake of FTT just days before FTX imploded. Couldn&#39;t have possibly been related, could it? </li>\n</ul>\n\n<p><strong>This is exactly what HFT crypto based swaps would look like. You bring your boy Brett in to program the algos that run Alameda / the FTT swaps / the FTT token. You program the HFT algo to also utilize the unique token characteristics encoded into FTT (likely for this very purpose), in order to keep the swaps in a certain range for certain counterparties. Things like burning tokens, adding liquidity, and swapping your native fun-money for less-shady BTC or ETH allows you to keep the ratio for the swaps. . And you do it thousands of times per second.</strong> </p>\n\n<p>For example, maybe for every FTT coin you have, you can get 1 GME. Maybe you get two BBBY for each FTT. They can then utilize their interconnected algos / liquidity slush in the form of tokens / convertible crypto to manage these ranges, and keep them in the parameters necessary to not introduce counterparty risk on either side of the trade. If the algos are good enough, you might even be able to do it for a really long time. </p>\n\n<p>These swaps can also, likely, be used as locates. This allows them to flood the “available” shares to short at any time of their choosing. We’ve all wondered where the fuck these all of these shares could be coming from. I think this is our answer. </p>\n\n<p>I think at this time went on, our Vader knows he’s fucked, and he’s about to take down a lot of people with him. A lot of people are singing, and the FEDs are swarming. Everyone involved in this knows their goose is likely cooked. But you know who knows the mostest? You guessed it. Lord Vader. </p>\n\n<p><a href=\"https://preview.redd.it/24fc6tx3qinb1.png?width=716&amp;format=png&amp;auto=webp&amp;s=392158d766e790e9b956e7280b84c02f9449870a\">not suspicious, no sir</a></p>\n\n<p>Not shortly long after this, things continued to get sketchy. The SEC is looking for fuckery for everywhere, and everyone in the ponzi is trying to offload risk. CZ may be smart, but he doesn&#39;t seem loyal. To be fair, none of these fucks are. </p>\n\n<p><a href=\"https://preview.redd.it/5h8j2xogrinb1.png?width=1548&amp;format=png&amp;auto=webp&amp;s=ea5609fb0a022646b8f76ab2c4db38945e16a0b0\">Note that trading volume. Our coins that we use for swaps don&#39;t trade, and even if they did, they&#39;re for less than a penny each officially. Because as the scam works, they pay full share price for false locates, and then get to dump the FTX token. </a></p>\n\n<p>If this were allowed to happen, then it would fuck up the whole ponzi. I&#39;m guessing that Ken got the news the day before it was announced, on the 18th. </p>\n\n<p><a href=\"https://preview.redd.it/gete9632sinb1.png?width=1612&amp;format=png&amp;auto=webp&amp;s=353f9a7122e4565a9c164acc19aaaaa22a435c3f\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/gete9632sinb1.png?width=1612&amp;format=png&amp;auto=webp&amp;s=353f9a7122e4565a9c164acc19aaaaa22a435c3f\"></a></p>\n\n<p>- Famous</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/fjBzD_XukqPNLQEe5N3qx7GWvOix57kFmBtmnCDiSU0.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16fcd7a/iv_the_theory_of_everything_the_dark_side_hatches/", "time": 1694381393.0, "subreddit": "r/ThePPShow", "title": "IV : THE THEORY OF EVERYTHING | THE DARK SIDE HATCHES A PLAN pt.2", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>IV</strong></p>\n\n<p>I am not a forensic detective or accountant. This is all pure speculation and only my opinion. Almost all of it, certainly, is delusional baggie-brain thinking. None of this is financial advice, and none of the people here are real - especially the real ones - but the fake ones I say are real aren’t either. Any resemblance to “real” people is because my AI generated stock-fanfic-fantasies got boring, they don’t work anymore. I need the real shit so I got photos of fake real real fake people. </p>\n\n<p><strong>Please forgive me for syntax and grammar errors. I&#39;ve been researching and writing all weekend to get this news out and starting to shut down. However, you&#39;re worth it so I press forward.</strong> </p>\n\n<p>Welcome back, baggies. In this section, we’re going to detail the events around the sneeze. We’re going to discuss what they did in order to save their asses one more time, how it worked, and for how long until the scam needed to be modified.  After that, either at the end of this post or the next one, we will cover the events up to the collapse and after - and relate it back to the story so far. Again, even after these posts, we’re still just getting started. There will be between three to five heavily involved posts to finish this. I intend to work all day with no breaks to get this out there. </p>\n\n<p>rIf you haven’t read parts 1-3, do that now. They’re pinned to my profile on X Ahshootfire1, and I will link them here as well after I get all parts out and go clean them up. </p>\n\n<p><strong>While I’m sure there are many other significant events between 2019 and the sneeze if I were to dig further, I’m going to try to keep this short. AGAIN, I’m leaving out a lot of research here in order to get this info out. There are certainly many connections that can be drawn still that are not listed here.</strong>  </p>\n\n<p>Lets start with FTX’s investment round in 2019, and see if we recognize any familiar names. </p>\n\n<p><a href=\"https://preview.redd.it/60brb16aghnb1.png?width=2524&amp;format=png&amp;auto=webp&amp;s=2c3a8a8125395978719dafe9f01ab8d27379d301\">Tiger Global (Archegos / Bill Hwang) and Binance are some of the big players on this list. I don&#39;t even want to know what bullshit I&#39;d find if I systematically went through all of them. </a></p>\n\n<p>Yikes, there&#39;s our boy Binance - and little tiger cub Bill Hwang&#39;s daddy - Tiger Global. That’s interesting. Maybe it’s just part of the normal bits of doing business. It couldn’t possibly be related to continuing the ponzi, could it?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/mxmc6zxqghnb1.png?width=1524&amp;format=png&amp;auto=webp&amp;s=33d133649ed96a242a46470a2be9b2b8fe01041e\">Strategic partnership is one way to put it. Also note \\&quot;undisclosed amount.\\&quot;</a></p>\n\n<p><strong>The majority of this investment was funded through Binance purchasing an</strong> <strong><em>undisclosed amount</em></strong> <strong>FTX’s native token, FTT. This is important to remember.</strong> </p>\n\n<p><a href=\"https://preview.redd.it/wlgq21gvghnb1.png?width=1596&amp;format=png&amp;auto=webp&amp;s=394d832c4cee683f034b1730005f2467051fbe51\">That&#39;s one way to launder your dirty FTX money offshore, I guess. More on this shortly. </a></p>\n\n<p>So, they have a &quot;strategic partnership&quot; through buying a token that FTX has control over. FTT essentially will work as their money printer with &quot;infinite liquidity.&quot; Three months later, Binance reincorporates in Malta. Once again, to avoid regulatory oversight. </p>\n\n<p><a href=\"https://preview.redd.it/414zlpprhhnb1.png?width=2072&amp;format=png&amp;auto=webp&amp;s=59a1753ea9c8102669acc6eb46fda689d0e8fab2\"> This move comes just three months after this \\&quot;strategic investment\\&quot; in FTX, through their native coin, FTT. </a></p>\n\n<p>August, 2020, FTX acquires Blockfolio for 150mm. They pay for most of the transaction in their in house coin, FTT / FTX Token. You seeing a pattern yet? If not, hang on. Again, I&#39;m not suicidal. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/yza15acsjhnb1.png?width=1606&amp;format=png&amp;auto=webp&amp;s=4eedd2c6f45a4600d7ba239dbe331b7dbc72636c\">We having fun yet, cowboys?</a></p>\n\n<p>Again, this transaction was done with FTT, FTX&#39;s native coin. </p>\n\n<p><a href=\"https://preview.redd.it/1i35fw54khnb1.png?width=1294&amp;format=png&amp;auto=webp&amp;s=a78d2143e01b6cea16ea514903128d0f6f4262ea\">Not sketchy at all.</a></p>\n\n<p>Starting in November-December 2020, GME starts its steady rise, reaching great heights compared to months prior. It was just beginning, however, and would get much worse for shorts and ponzi pals a month later in January ’21. When... something happened. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cyg706xflhnb1.png?width=3288&amp;format=png&amp;auto=webp&amp;s=1d00ad1b8e8f93dc19f9bc136df3a297131733ba\">Take a note of our peaks and valleys here, this pattern will continue</a></p>\n\n<p>I believe, that the shorts that Citadel and others opened in &#39;19 &amp; prior, were already becoming too much at this point. They had expected the company(s) to die, and it’s just weekend at Bernies with a bunch of mouth-breathers throwing their life savings at it in the hopes they get rich and make bad people’s lives difficult. Some stimulus money was also coming into the market, and maybe worst of all, thousands of people took the time away from their job to learn about the market. That&#39;s when things start to get really hairy, really fast. </p>\n\n<p>In early 2021, less than a year after FTX hits the scene officially, GME is now an untenable position. Citadel, among other players, including Tiger global &amp; Archegos are underwater.  Due to a series of swaps, among other things, other stocks in the basket start to move “in sympathy.” This threatens to unravel the entire global ponzi. They need to do something, fast. They collude with other major players in the industry, almost certainly telling them it will destroy them, too, if it’s left to continue. They turn off the buy button, but not all of them. In addition, people are still able to exercise their contracts - and there’s a ton of those. </p>\n\n<p>Lastly, there’s already a rabid group of investors that are not going to sell, and shares are already in short supply. Removing the buy button may not prove to be enough. They need a share printer, fast. </p>\n\n<h1>Phase 3:</h1>\n\n<p><strong>They need &quot;clean&quot; or &quot;hidden&quot; tokenized shares immediately in order to feed the HFT algos they have</strong> <strong><em>now found themselves beholden to</em></strong><strong>. You have to continually offer the beast shares and cash / convertible crypto liquidity or it rips you and all of your co-conspirators faces off. That list of coconspirators is very likely very vast. Comprising of &quot;small&quot; family offices and hedge-funds, but also many household names as well.</strong> </p>\n\n<p><strong>I also posit that it&#39;s possible that CZ&#39;s involvement has been coerced by large players, possibly resultant from HFT software that he created fucking their books up during irregular market events, like 2008. And Gamestop.</strong> </p>\n\n<p>Now, let&#39;s get into the strategic moves made to facilitate this. They are fucked without this tokenized share liquidity. The chain of liquidations would nuke the system. Thankfully, they&#39;re super criminals so we just got to hang out and wait for our tendies. Enter recently purchased FTX subsidiary, Blockfolio. Coming onto the scene just as GME is hitting ATHs. </p>\n\n<p><a href=\"https://preview.redd.it/ymt2iznrkhnb1.png?width=1546&amp;format=png&amp;auto=webp&amp;s=3ae1b66426457bb7d274e3419aa80436b545fcde\">Nice timing, not suspicious. GG</a></p>\n\n<p>Now, one thing that I want to note about these tokens. I am NOT an expert on ERC-20 tokens, but I believe through swaps, wrapping, and other complex methods - I posit that each one of these “tokens”, especially the Binance ones, represent more than 1 share each. </p>\n\n<p><strong>While there were many tokenized stocks, GME is by far the one that I suspect to be the most abused through these methods, due to presenting the largest amount of risk. Remember this, it will be important when I absolutely destroy your worldview later today.</strong> </p>\n\n<p>The next day, the first GME.finance tokens hit the blockchain. Note that these are not the GMEcx tokens we discussed earlier. Don&#39;t worry, though. We&#39;ll be coming back to those here in a bit. </p>\n\n<p><a href=\"https://preview.redd.it/f77kmnprnhnb1.png?width=2726&amp;format=png&amp;auto=webp&amp;s=34517976d23dd6afe12704acdec74f53ec470de9\">GMEFinance coin explodes onto the scene on the 30th, first minting and distributing in big chunks - likely to our largest parties.</a></p>\n\n<p>Ah but the medium fish need nummies too, right? They&#39;re all fucked if one medium player goes down. They continue to blast out tokens in very large chunks.</p>\n\n<p><a href=\"https://preview.redd.it/kq6jq1z2ohnb1.png?width=2692&amp;format=png&amp;auto=webp&amp;s=b65342834d65d173cfbde20ecac42df6db712acf\">Remember, the peak of GME was just days earlier. This is the first mass deployment and these transactions eat up the page for awhile, then there&#39;s a flurry of activity</a></p>\n\n<p>Immediately after they are on the blockchain, they start getting deployed in mass. There are THOUSANDS  transactions in a very short amount of time. It’s clear these tokens are also algo-traded, due to repeating odd amounts and other tells that reek of HFT. </p>\n\n<p>A lot of these pictures are filtered by certain amounts, but there&#39;s plenty of activity in small amounts as well. Those could be purchases by users - who&#39;s funds are then taken and used for the continuation of the ponzi, and they never get a token but rather a swap that can be converted to a token upon redemption. Considering the players in this so far, with the companies interconnectedness, anything is possible as far as how they obfuscate and move their money around. </p>\n\n<p><strong><em>Again, the kicker here, is that this global machine needs constant liquidity in every form to survive. A sudden liquidity event could unravel the whole thing.</em></strong> </p>\n\n<p>Here’s the chart from that period. We all know it very well at this point. We’ll break it down and relate back to it, but just take a moment to remember a few key events - specifically the, the days surrounding the 27th of January where the big first drops happened, and then accelerated, around the 30th. Then, there’s the flash crashes in mid-Feb and March 10. Ah, March 10, the most expensive shower I ever took. </p>\n\n<p><strong>I highly recommend you pull up whatever chart software you like to correlate certain dates. Due to the timescale here, and my laziness, it’s going to come in handy for this post and likely the next one.</strong> </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/b5ta5qrqphnb1.png?width=3288&amp;format=png&amp;auto=webp&amp;s=a7303a066f265b44d2fe500127947cdc37033e00\">just in case you refuse to bring it up on your phone</a></p>\n\n<p>On February 22nd, we started to rise hard and fast again, only to be smacked down by the invisible hand of go fuck yourself. </p>\n\n<p><a href=\"https://preview.redd.it/n8irakc6qhnb1.png?width=2776&amp;format=png&amp;auto=webp&amp;s=2d5cb15258558a8eebacde173cbafebdff1f31cb\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/n8irakc6qhnb1.png?width=2776&amp;format=png&amp;auto=webp&amp;s=2d5cb15258558a8eebacde173cbafebdff1f31cb\"></a></p>\n\n<p>And then, in early March, it was clear we were about to go on another run. It&#39;s possible someone was having to buy in, or a small fund got out. Either way, the run was starting - and it was about to go hard. And then, out of nowhere comes the invisible hand of fuck you with a steel chair. </p>\n\n<p>Well, let&#39;s take a look at what was happening in the days prior to that flash-crash. </p>\n\n<p>5 days before the flash crash, large players start moving / swapping positions / adding &amp; removing liquidity. I don&#39;t want to get too hard into the weeds on the specifics here, but I believe that all of this done with the sole purpose of maximizing the manipulation and therefore, the ponzi. Here&#39;s that chain data from March 5, 2021. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wsauhomqrhnb1.png?width=2714&amp;format=png&amp;auto=webp&amp;s=1ef836c4ecb511f48a8886ecec45a2da2e52a44e\">This is filtered for large transactions, and only represents big moves. There thousands of various other smaller moves. I believe these small moves, at least a lot of them, could be HFT automatically balancing risk, etc.</a></p>\n\n<p>Every day, there are tons of transactions swapping these tokens, shuffling them around, etc. It’s very hard to track. However, there’s a clear picture here. GME.finance tokens get distributed, price gets destroyed. Throughout time, it’s clear they can manipulate this however they want - likely with multiple coins that are converted to GME.finance on a whim - in order to mask their moves and intentions. </p>\n\n<p>This doesn&#39;t even get into all the other GME tokens out there, there are well over 100 of them I&#39;d estimate. Possibly far more. I think it&#39;s very possible, through the interconnectedness of this ponzi, that every other token could be swapped for the &quot;right&quot; one. I also believe that a HFT manages it, automagically balancing things when they need a locate or to facilitate a baby short-sale. </p>\n\n<p>But we’re not here to dive too deep on every token out there. We’re specifically talking about FTX, Binance, and worldwide traditional finance “big” players. </p>\n\n<p>Shortly after Blockfolio (owned by FTX) launched their tokenized stock platform, the SEC started poking around. Understanding that this scam would unravel if they continue to rely on one option, the next stage of the plan is hatched to control the price once and for all - and hide everything from regulators. </p>\n\n<p>GME earnings was coming up on 6/9/21. They needed to do SOMETHING, and fast, before the SEC unwinds this whole scam. If RC comes in and lays his dick on the table, causing everyone invested to buy more, they could very well be fucked - or at least be forced to make such large moves that it raises red flags. Thankfully for them, RC used the high share price (around $220 pre-split at the time of earnings) to issue shares to raise capital. They still used their tokenized shares to accelerate the decline. They truly can&#39;t help themselves, because they&#39;re truly fucked. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nqwz1uj4thnb1.png?width=2724&amp;format=png&amp;auto=webp&amp;s=d000400fda814ff45445f33c950873cfc2f8c69f\">Several days before earnings, they started building their position. This has the added effect of minimizing the amount that GME can raise through their offering. I believe this is why GME completed that offering lightning fast. </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/h4qqzgs2uhnb1.png?width=2730&amp;format=png&amp;auto=webp&amp;s=0070e7806a7e54705a2dca06a6242d3c683260e0\">High activity up around the earnings date</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/iwdtcvnbuhnb1.png?width=2728&amp;format=png&amp;auto=webp&amp;s=bf4e735f915589371dc35ed5d75e9af15e65b994\">Earnings + day after</a></p>\n\n<p>The shorts were saved this time, but this scared them enough to rush into the Remix phase of the plan. They also were happy to use tokenized shares to short the share price immediately after earnings, accelerating the decline. I posit, that through every method available to them, they algorithmically laundered their “assets” including GMEfinance tokens in order to short the stock, provide locates, and strategically manipulate borrow-fees through the same loose enforcement on real locates. </p>\n\n<p>Some of these methods are advantages that are specific to crypto, due to the nature of the technology. It’s also largely a legal gray area. Specifically with these coins I believe they added / removed liquidity, swapped tokens to stablecoins and other tokenized stocks, and <strong>engage in complex crypto derivative based swaps in order to keep them off their books</strong>. More on that bold one shortly, but keep it in your mind. </p>\n\n<p>The Dark Side knows this won&#39;t last forever. The SEC is already on to Blockfolio, and FTX is based in the US which creates a lot of extra scrutiny.  What do, raggy?</p>\n\n<h1>Phase 3.5 : The Remix</h1>\n\n<p>Well, you have to invent a new scam. </p>\n\n<p>On April, 14 Binance starts offering tokenized securities <em>officially</em> two years after the tokens were created in 2019 as we discussed in the last post. However, this creates a new problem. Binance is already a bit suspicious. Hedge funds are not going to be able to claim the tokenized stocks from Binance as locates. I also believe the planning for this started around when Blockfolio added tokenized stock.</p>\n\n<p><a href=\"https://preview.redd.it/kjn99yjfvhnb1.png?width=1610&amp;format=png&amp;auto=webp&amp;s=51b0eee767652cb51be917be8b413e03f3ea824d\">Seems their Tessy position might be fuk, too</a></p>\n\n<p>From my research thus far, I’ve concluded that likely EVERY major crypto exchange was involved in one way or another at some point. The breadth of this scam is huge - and all will come out soon - but for the sake of this post we’re keeping our scope on our major players. </p>\n\n<p><strong>BRETT SAVES THE DAY</strong></p>\n\n<p>Brett Harrison takes over as FTX CEO in May, 2021 one month after Binance starts offering tokenized shares. Remember, he’s one of the best HFT programmers in the world. He also has the added benefit of NOT being CZ, as that would raise far too many flags. He’s not the best option due to coming from Citadel, but likely the only one they have. I can only speculate on the conversations that surrounded his involvment. </p>\n\n<p>Now, if you’re a Sith Lord or Vader, you do not want this guy to have to leave Citadel to go un-fuck FTX &amp; prepare for the next thing. It ties you directly to FTX. It’s not a good look. However, I have a feeling that these people can be quite coercive. One month later, GME earnings is set to occur. There’s still a ton of activity around this time, and in general, but there’s a notable uptick in large transfers around this time. Keep in mind, there are many tokens, and I theorize they represent more than 1 share. There’s activity like this around every drop in the chart. </p>\n\n<p>However, with all the things working against them mentioned so far, I don’t believe this was enough. I believe that the added pressure from the basket with GME exhibiting insane risk due to it’s high price. They’re very close to imploding, and every day they’re at risk. BBBY at this time is still mirroring GME’s elevated price, and there are certainly many other stocks that have them in compromising positions. </p>\n\n<p>They also need to hide from regulators, because if not, they’re still fucked. Just a few short months after offering tokenized trading of stocks, Binance abruptly moves to shut down the program. This is strategic, and not due to any listed reason publicly. </p>\n\n<p>Two months after Bretts arrival in May, the program that just started in April, is disbanded. </p>\n\n<p><a href=\"https://preview.redd.it/7akxe842whnb1.png?width=2020&amp;format=png&amp;auto=webp&amp;s=0e412b96549406ee778db01b5c2b29c3c0d6a752\">....or is it?</a></p>\n\n<p>One week later, just shy of 2,000,000,000 more GMEcx tokens are minted to the chain. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gpas24vzwhnb1.png?width=2698&amp;format=png&amp;auto=webp&amp;s=d489f17c262891e3126abc453c671ba56a0e0164\">Don&#39;t worry, Jimmy is going to bring his friend Bobby too...</a></p>\n\n<p>The day after that, just shy of two billion more of the BBBYcx coins are minted.</p>\n\n<p><a href=\"https://preview.redd.it/wmfugt2kwhnb1.png?width=2734&amp;format=png&amp;auto=webp&amp;s=ed9fd59b9277b1db18156a4f0bbfc7be4f6451a4\">I am not suicidal</a></p>\n\n<p>We&#39;ll dive deeper into how the scam works from a technical view, as well as cover some of the members of the Rebel Alliance. Then, eventually, I&#39;m going to fuck your world up. I&#39;m compiling these posts on X, the post that has every post is pinned to my profile. Again, Ahshootfire1 on X. </p>\n\n<p>Likely 3-4 more posts coming. </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/4kV90prLkmXsUGPi1xYNE1-Na2cRpuExpki2wCBK5k0.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16eujwq/iii_the_theory_of_everything_the_dark_side/", "time": 1694333175.0, "subreddit": "r/ThePPShow", "title": "III : THE THEORY OF EVERYTHING | THE DARK SIDE HATCHES A PLAN pt.1: BIRTH OF THE INFINITE SHARE PRINTER", "text": "<!-- SC_OFF --><div class=\"md\"><p>I am not a forensic detective. This is all pure speculation and only my opinion. Almost all of it, certainly, is delusional baggie-brain thinking. None of this is financial advice, and none of the people here are real - especially the real ones - but the fake ones I say are real aren’t either. Any resemblance to “real” people is because my AI generated stock-fanfic-fantasies got boring, they don’t work anymore. I need the real shit so I got photos of fake real real fake people. </p>\n\n<p>Welcome back, fuckers. It&#39;s gonna get weird from here. And the intensity is going to build until I drop a fucking atom bomb on all of you at the end of this. I&#39;m going to write as long as I can tonight, but eventually will have to sleep. I promise that I will start again in the morning after a quick nap. It&#39;s about to get real interesting. </p>\n\n<p>Alright, quick recap. </p>\n\n<p>We have our players. We have part of our motive. Ken wants to survive, Sam wants to get paid and fuck off playing League, CZ is a bit like Ken yet not in so deep he’s still got some risk tolerance for a little crime and also likes fucking off, and Brett very well may have just wanted to stay where he was. I honestly don’t know, and it doesn’t matter in regards to the case I’m about to make. </p>\n\n<p>At the end of the day, considering what I now know, none of them are innocent. It&#39;s likely some are less evil than others. </p>\n\n<p><strong>Phase 1: The Setup</strong></p>\n\n<p>In 2008, Citadel almost went bust. </p>\n\n<p><a href=\"https://preview.redd.it/ampylyvhmdnb1.png?width=1262&amp;format=png&amp;auto=webp&amp;s=4e36acf67fada3173706079e554e5027b0aedcfe\">rut roh raggy</a></p>\n\n<p>I believe that even maybe after they barely survived 2008 things weren’t actual okay in Wonderland for Citadel, which caused the move even further into HFT algos circa 2011-2014. I think that it’s possible that during this time, Citadel engaged in illegal short-selling, creating a position that couldn’t be maintained. I believe that the HFT algos put them in a position that would eventually put them in a situation where they faced liquidation unless something was done. Citadel, Binance would do late, started to enter a series of complex business structures aimed at rapid expansion to keep the ponzi going. Eventually, that wasn’t enough - and they had to start doing shady shit with HFT algos. </p>\n\n<p>By 2014, they we&#39;re majority HFT algo-based.</p>\n\n<p>I posit that years before Binance’s official inception in 2017, that CZ &amp; Ken (among others) hatched a plan to create a cryptocurrency exchange possibly with the main purpose of feeding Citadel&#39;s / other HFT firms algos, first with liquidity, both in cash and in the forms of convertible crypto. Then, eventually creating a share printer in 2019, with a stealth deployment. Possibly via Alameda research, or simply through their own devices. </p>\n\n<p>Later we&#39;ll talk about how, Binance used a back-up share printer machine in 2021 until FTX could relaunch theirs. Similar to FTX, their strategy would rely on rapid-expansion, heavy marketing, and a proprietary coin to be used to obfuscate their moves &amp; launder dirty money. The big boys call the shots and those “in-the-know” are kept quiet through being allowed to use company funds as their slush funds. Something that the SEC has just recently charged Binance&#39;s CZ with. </p>\n\n<p>Not to get in the weeds here, but I posit that basically any kind of fraud you’d want to hide from every regulator out there, and could accomplish through deep pockets w/ HFT algos &amp; liquidity, Binance was doing. From Binance’s inception, it’s been as if they’ve been running from something. Like a ponzi, that runs the risk of running out of liquidity - or being found out. </p>\n\n<p>Binance launches in July, 2017 in China. By late 2017, they had exited mainland China in favor of Singapore due to regulatory pressures. </p>\n\n<p><a href=\"https://preview.redd.it/pmtt2veyodnb1.png?width=1532&amp;format=png&amp;auto=webp&amp;s=629bc42381a260ab6aa43a6af0c6489911e42e2b\">Well that escalated quickly.</a></p>\n\n<p>Shortly after that, in 2018 after rapid expansion they left more markets in favor of European ones. Once again, to escape regulatory scrutiny. Rut ruh, raggy. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5p1sc7d1pdnb1.png?width=2820&amp;format=png&amp;auto=webp&amp;s=fd0430de6cae3cce21340315ffa3fd08f72c5d42\">Why Europe, though? That&#39;ll be explained later. </a></p>\n\n<p>After shuffling the board around in 2018 escape regulators, they had to continue with rapid expansion. Because every good ponzi needs new suckers constantly, else the jig is up.</p>\n\n<p><a href=\"https://preview.redd.it/g546sdorqdnb1.png?width=2016&amp;format=png&amp;auto=webp&amp;s=6f9fe381b3547c70a2b55142ceb55d2787393de9\">Every single one of these things is something a ponzi running out of money would do</a></p>\n\n<p>Their expansion stops, somewhat abruptly in January 2019. There&#39;s no new news of partnerships or acquisitions until September, where they announce futures trading. I posit, that at this point, the ponzi had a achieved a complicated enough structure to obfuscate their moves, which would then allow them to move to the next phase. </p>\n\n<p><strong>Phase 2: Activate the Share Printer</strong></p>\n\n<p>On January 4,  the first on-chain activity of GMEcx tokenized stock, minted by Binance. 2B supply.</p>\n\n<p><a href=\"https://preview.redd.it/p4is7b0xrdnb1.png?width=2698&amp;format=png&amp;auto=webp&amp;s=17e15752449b8edee1d09cd44ca98da2e1a1774d\">Well, look at that. There&#39;s certainly many, many more stocks that were naked shorted like this. Remember though: this is before FTX exists, and before Binance offers tokenized trading. This is a money printing machine for a ponzi, and I&#39;ve aready speculated who&#39;s behind it. </a></p>\n\n<p>The very next day on the NYSE, volume shot up on real $GME shares by over 800% and maintained much higher than average volume from there on out. There are also notable volume spikes around the 2nd transfer time (1.14.21). Less than a month later on January 29, the stock traded 131 million volume. </p>\n\n<p><a href=\"https://preview.redd.it/h8gxtdh6tdnb1.png?width=1816&amp;format=png&amp;auto=webp&amp;s=b644804c39285ffb7d5afcc71a7e8319e2681243\">Coins first move on the 4th, volume spikes to 47.6 million. A few days later, more coins are moved and the volume increases roughly 50&#37;. </a></p>\n\n<p><a href=\"https://preview.redd.it/75jxh2cotdnb1.png?width=1802&amp;format=png&amp;auto=webp&amp;s=257587810a804d85428e0cc190b631ca0dbda666\">High volume spikes continue, with131 million on 1.29.19</a></p>\n\n<p>Well, maybe it&#39;s a one off?</p>\n\n<p>April 4th, 2019, BBBYcx first appears on the blockchain. It&#39;s another coin minted by Binance, and again, 2,000,000,000 supply. </p>\n\n<p><a href=\"https://preview.redd.it/onc3cyu4udnb1.png?width=2794&amp;format=png&amp;auto=webp&amp;s=a8cea3f31994bdb9b061fa5073cd97813da634ea\">This is one of many tokenized share coins . They have them for hundreds of stocks, some have stopped trading and some still have on-chain activity currently.. </a></p>\n\n<p>So what happened around and after the coin onchain appearance day? Oh, I see. </p>\n\n<p><a href=\"https://preview.redd.it/897to0brudnb1.png?width=1836&amp;format=png&amp;auto=webp&amp;s=909b9ba3eadf155761bc49c1f462b286aede4869\">Oh, 50&#37; up, then 100&#37; up the next day, and so on. In 6 days, the volume will have increased by 700&#37;. </a></p>\n\n<p>The same day the tokens show up, the volume in BBBY publicly traded stock increases by 50%. A few days later, volume had increased 7 fold to 28 million. Maintaining much higher than average volume the whole time. </p>\n\n<p><strong>Now, there are 100s of these tokens. They exist for every stock just about. When this unwinds, many, many stocks will squeeze. Some will squeeze higher than others, but many will squeeze hard.</strong> </p>\n\n<p>Still with me? We&#39;re almost done with this one. </p>\n\n<p>Just a month or two after deploying the tokenized shares, Binance is “hacked” on May 7, 2019.</p>\n\n<p><a href=\"https://preview.redd.it/mxuqx07swdnb1.png?width=1964&amp;format=png&amp;auto=webp&amp;s=78610170b7c450d5724caeeca13d85b0a2b02a7b\">7,000 BTC, worth 40mm dollars, \\&quot;hacked\\&quot;</a></p>\n\n<p>And wouldn&#39;t you know it, the funniest thing happened just a couple days later...</p>\n\n<p><strong>On May 9th,</strong> <strong><em>two days later</em></strong><strong>, FTX is incorporated in Bermuda by SBF.</strong></p>\n\n<p>Buckle up, buckaroos. We&#39;re still just getting started. </p>\n\n<p>Part IV coming later, I&#39;m trying to have the whole series done before market open Monday. </p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/bcEottGnecGsBPShDw_oUBiir3ajbV5gAJEgGc61LQ8.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16enzak/ii_the_theory_of_everything_the_dark_side_contd/", "time": 1694311922.0, "subreddit": "r/ThePPShow", "title": "II : THE THEORY OF EVERYTHING | THE DARK SIDE Cont’d | THE SITH LORDS &amp; DUMB STORMTROOPERS", "text": "<!-- SC_OFF --><div class=\"md\"><p>Thankfully, this one likely won’t have to be as long. I didn’t dive as deep into these players, but it doesn’t take too long to draw meaningful conclusions from the information that we do have. Especially, if we suspect what I do.</p>\n\n<p><strong>Reminder: I am not a forensic detective. This is all pure speculation and only my opinion. Almost all of it, certainly, is delusional baggie-brain thinking. None of this is financial advice, and none of the people here are real - especially the real ones - but the fake ones I say are real aren’t either. Any resemblance to “real” people is because my AI generated stock-fanfic-fantasies got boring, they don’t work anymore. I need the real shit so I got photos of fake real real fake people.</strong></p>\n\n<p><strong>Binance’s Changpeng Zhao: The Able &amp; Willing Participant</strong></p>\n\n<p>So, I don’t know this guy personally. I do, however, suspect that he’s using his exchange for the same nefarious purposes that SBF was with FTX. This includes personally using company funds to enrich yourself, engaging in various types of regulatory “grey-areas” as well as outright fraud. Again, I judge people for their actions, and when a bunch of really shady shit happens that those same people benefit from - I begin to ask why, how, and who else is involved.</p>\n\n<p>CZ was born in China. When he was 12, his family moved to Canada. worked in Canada at the Bloomberg trading desk, programming Future’s trading software. In 2005, he moved back to China to start his technology startup, Fusion Systems, which was known for having the fastest HFT software available to and stockbroker or HF that wanted it.</p>\n\n<p>Here’s a little more, per Forbes.</p>\n\n<p><a href=\"https://preview.redd.it/u1v9vkui6cnb1.png?width=974&amp;format=png&amp;auto=webp&amp;s=c028e3ef57e7fa4bff7c151080a70c20770cb8d6\">It&#39;s a big club, but not that big</a></p>\n\n<p>Citadel is formed in 2002. CZ is looking for upward momentum and he wants it fast. Whether that’s true, or it’s just a cover story to follow the will of the Dark Side, I do not know. He’s ambitious, driven, and seems likely to suffer from the Wallstreet Disease that turns you into a cunt and robs you of your empathy.</p>\n\n<p>I feel it’s reasonable to at least consider that CZ knew Ken. Ken launched Citadel in 2002 and was looking for world domination after already having spent years as a relatively big player in the market. This is the same time that CZ was up-and-coming, and if you’re looking for certain HFT software - you’re looking for a guy like CZ. It might be a big club, but at the top of that level exists another level, where wanna-be-winners know a guy if you’re on the right side. News travels fast in these small communities, and there is very little specific news in these circles about groundbreaking HFT software in 2005ish.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lvr3g9nl6cnb1.png?width=1490&amp;format=png&amp;auto=webp&amp;s=a59f759baec7f6c66cee0af74f2c2b63aa15477b\">\\&quot;Who? You must be confused with my CEO. Right?\\&quot; *gritting teeth*</a></p>\n\n<p>Another indicator for seeing what Ken wants to hide, is what I’ll lovingly call the <strong>Kendicator</strong>.</p>\n\n<p>When researching the content for this theory, and subsequent posts, it was very hard to get info on possible ties with these two.</p>\n\n<p>So far, the <strong>Kendicator</strong> has shown up a lot, here are a few of many examples:</p>\n\n<ul>\n<li>In general, when Ken makes the news for being useless, it’s published everywhere. Maybe it’s just in relation to certain key terms, or maybe that’s what he does all the time to stroke his ego. I do not know. There is an inordinate amount of big names repeating the same dribble though.</li>\n<li>When searching for crypto and Ken, you’re flooding with articles about how he thought it’d be cool to outbid the DAO for the constitution. Dick.</li>\n<li>FTX searches bring up very strongly worded condemnations to FTX, pushing how they undermine the integrity of the capital markets. Projection.</li>\n<li>In addition, it appears there has been an effort to scrub the information from the web in many cases.</li>\n<li>Then there’s his recently appointed CEO near enough to the FTX collapse. I think he was afraid that someone like me was about to do what I’m doing right now.</li>\n<li>Then there&#39;s this fresh incidence of the Kendicator tonight. Hopefully it was just a misunderstanding. </li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/kzsk8tx96cnb1.png?width=1712&amp;format=png&amp;auto=webp&amp;s=e1c75a1c07603370b56518e027ea2a0d6acf2b04\">Timely.</a></p>\n\n<p>In case you didn’t catch it in the last post, here he is again. The possibilities of all of these things being coincidences is almost impossible, especially if you already suspect what I suspect in regards to the Kendicator. <strong>He’s hiding something.</strong></p>\n\n<p><a href=\"https://preview.redd.it/y4zwrkep6cnb1.png?width=1740&amp;format=png&amp;auto=webp&amp;s=18dc6cd1c04afdeb4547002e68a86c0b0d38c967\">I mean, what&#39;re the chances?</a></p>\n\n<p>In addition to this, Citadel switched their full focus to HFT around 2011. In 2017, CZ leaves Fusion Systems and starts Binance. Again, it would be harder to believe that Citadel didn’t purchase software from them. They recruit the best of the best in mathematics from all over the world, it would make sense they would take this approach with all of their systems.</p>\n\n<p>What indeed. Unfortunately for Vader, the Sith Lords, and Dumb Stormtroopers I’m like the monster from it follows.</p>\n\n<p><a href=\"https://preview.redd.it/x4w20yms6cnb1.png?width=643&amp;format=png&amp;auto=webp&amp;s=c8530cb553c92842d62a8024d4aac0fe9ce35e7e\">I&#39;m not falling for it Kenny</a></p>\n\n<h1>Dumb Stormtroopers</h1>\n\n<p><strong>Sam Bankman Fried: Sociopath Willing to do Anything for Money and Power</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/aq92dgtu6cnb1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=3333f2bb7111a98f79d9389bcec142b4c7b51926\">Does this look like a guy with a plan?</a></p>\n\n<p>I believe that Sam is a willing participant, helped set up the con, and was possibly the fall-guy from the scam, which was masterminded by the aforementioned. I also believe that FTX was created by players that are trapped, and need the goods that Binance has been providing them for a bit longer now.</p>\n\n<p>Specifically, tokenized shares that can be used as locates, to greatly manipulate markets wherever you please. More on that later.</p>\n\n<p>I believe that Sam was told by the real masterminds of FTX that he could essentially rob the coffers as long as he wasn’t going to give up the con, or do so to the point where the con would fall apart. I believe that he was a front man, and a fall guy. The repeated reports in regards to the chaotic company structure in FTX furthers my feelings on this. Key positions not getting hired, no oversight, rapid expansion, insane marketing budget. This screams money laundering and fraud, and I’m about to present the case for that in the next post.</p>\n\n<p><strong>Brett Harrison: The HFT Fixer of Last Resort</strong></p>\n\n<p><a href=\"https://preview.redd.it/w4rmg7w07cnb1.png?width=990&amp;format=png&amp;auto=webp&amp;s=cc1b3385c68da1dc8f1b04753e077964ed69072c\">Does he look happy to be there?</a></p>\n\n<p>I have not done enough research on Brett to postulate a thesis on his character, however, the timing of his entry and exit based around the thesis is significant. I also know that he’s one of the best in the world in HFT algos. In the next post, I will lay out how I <em>think</em> the scam worked. Once you understand that, it should help understand why Brett’s timing was so significant - among many other things.</p>\n\n<p>I believe that CZ &amp; Ken knew each other, and that shortly after Ken almost went bust in 2008 he turned to HFT and cheated his way to survival.</p>\n\n<p>I believe CZ created tokenized shares for Ken/other big players using the ERC-20 platform. With regulatory scrutiny starting to pick up, and with CZ being based in China US regulators would at least likely do a double take.</p>\n\n<p>That’s why you need a US counterpart with a good public image to continue the scam. Enter FTX and SBF. Nobody knew who they were, and overnight they’re doing ads with Tom Brady during the Superbowl. Not only was FTX a way to wash crypto shares, but it was also a liquidity slush fund for SBF &amp; likely other major players through multiple means of manipulation.</p>\n\n<p>Things started to go south in early 2021 due to GME, so Brett was sent in to write the program for the next phase of the same scam after regulatory pressure heated up in 2021 after Gamestop. I believe that at the time Brett was called in, the position was becoming untenable in conjunction with other positions in the basket. They needed something new, so he agreed to go write the code / HFT algos to handle the new scam, and then left shortly after.</p>\n\n<p>I also believe that Binance, like FTX, was set up for this main purpose. Financed by big players, the lack of regulation in the crypto industries in general is a great vehicle for fraud. Especially if you create the “securities” before the incorporation of the crypto exchange where they’re housed. After the GME sneeze, the basket was about to break. They needed another, better solution.</p>\n\n<p>We’ll detail how the scam worked next. This one may take a bit longer to get up (heh) because of the depth. However, I think it’ll be worth it. </p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/9tSN20tNP0Skqxkkw7IpmipKEAoGSHV9TCbH-Sr_FbY.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16enp0w/i_a_theory_of_the_history_immediate_future_intro/", "time": 1694311116.0, "subreddit": "r/ThePPShow", "title": "I : A THEORY OF THE HISTORY &amp; IMMEDIATE FUTURE | INTRO | THE DARK SIDE | THE KINGPIN OF THE BUCKET OF RATS", "text": "<!-- SC_OFF --><div class=\"md\"><p>What up, baggies? It’s Famous again, the worst thing to happen to you since the last time we crossed paths. Since we’re both obviously having a bad day at this point - let’s try to fix that. Let’s go ahead and commit to downvote (and not respond to) and toxicity in the comments, and use those upvotes and rewards on the positive ones before reddit rugs all of you on the 12th. Also look for the Gish Gallop, it’s one of the silly-shilly-willy favorites.</p>\n\n<p>You may know me from my DD here the other day, where I speculated around GME’s possible upcoming M&amp;A activity, the Horizontal Keiretsu, and fun ways certain people can be <em>creditors</em> and there’s no other logical explanation as to why they would be. And I didn’t get banned! I felt we had some good conversation and I really enjoyed posting here. I also feel like there were a lot of comments saying how sweet the DD nectar was, so I&#39;ve come back for more. Just bigger this time. Thank you for having me.</p>\n\n<p>Before I lay my nuts on the table again for shills to try to smash with hammer, a few disclaimers. It’s a reflection on them, not me anyway, so I keep just telling them to have a good day. To all the hammer fans out there - I hope your day gets better.</p>\n\n<p><strong>I am an idiot. Nobody should read this. If you believe what follows then lol have a nice time in my delusions, baggie.</strong></p>\n\n<p>I am not a forensic detective. This is all pure speculation and only my opinion. Almost all of it, certainly, is delusional baggie-brain thinking. None of this is financial advice. None of the people here are real - especially the real ones - but the fake ones I say are real aren’t either. Any resemblance to “real” people is because my AI generated stock-fanfic-fantasies got boring, they don’t work anymore. I need the real shit so I got photos of fake real real fake people. Got it?</p>\n\n<p>This thesis is a combination of all I’ve accrued over this saga, including lots of work done before me by many other people. Some of these things have been speculated heavily on in the past, and a lot of the ideas I build upon here are commonly held in this community and others. I do not claim all of these things to be novel. To my knowledge, there is no DD that covers the breadth of what I’m about to attempt to successfully lay before you.</p>\n\n<p>Today, hopefully, my work will open a lot more doors in this saga - and give you everything that you need to get through the weekend. This is going to be VERY LONG and I’m sorry. However, the more I dug, the more important I realized it was to get out there. At least, I think it’s important. Either way, at this point, you’re stuck in here with me - and though my amazing girlfriend might leave me after the last week of DD marathons - I think she’ll come back around. I&#39;m not stopping until I achieve what I came here for.</p>\n\n<p><a href=\"https://preview.redd.it/p6kzpgv84cnb1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=f2e7b65af5b9a38070647164eb8c85e77a722709\">That little gem right there is going to be yours, I&#39;ll explain later</a></p>\n\n<p>Buckle up, buckaroos.</p>\n\n<p><strong>This DD will be a LONG, MULTI-PART SLOG. I’m writing these as I go, and still drawing connections as well.</strong></p>\n\n<p>Thanks to all the DD writers before me, and my current “funemployed” status w/ a decent severance. I truly wouldn’t be here without you. ❤️</p>\n\n<p>In this stock fanfic, I’m going to paint a very large picture. It’s going to involve a lot of names you recognize. It’s going to (maybe) answer some questions. Please let this be a breathing document that we can add to and detract away from. I want any thesis we as a community make to be strong, and rooted in reality. THIS IS MUCH BIGGER THAN WHAT I AM ABOUT TO PRESENT. I feel that it’s important to get the early</p>\n\n<p>This is speculation based heavily in reality and real history, and due to the speculative nature we cannot have all the facts. I tried to answer a lot of questions that the community has had in the past in regards to what the fuck is happening. Through my research, if something didn’t fit well, I may have omitted it from this post and may follow up in the future.</p>\n\n<p>To get started. We first must introduce the players in this saga, their motivations, and what’s at stake for them.</p>\n\n<p><em>“If you know the enemy and know yourself, you need not fear the result of a hundred battles. If you know yourself but not the enemy, for every victory gained you will also suffer a defeat. If you know neither the enemy nor yourself, you will succumb in every battle.”</em></p>\n\n<p>― <strong>Ryan “Sun-Tzu” Cohen</strong></p>\n\n<p><strong>THE DARK SIDE</strong></p>\n\n<p><strong>In this first likely multi-part section, I will highlight the major bad actors. I will cover their motivations, using publicly available information to draw conclusions about their character and capabilities. Reminder, this is fanfic. The people described here ARE NOT REAL.</strong></p>\n\n<p><strong>KEN VADER</strong></p>\n\n<p><strong>Citadel founder &amp; CEO.</strong></p>\n\n<p><strong>Sociopath. Guarded/Defensive. Careful but Sloppy. Master of Projection. Manipulator. HFT (High Frequency Trading) Algo Enthusiast. Rat in a Bucket. Control Freak. Desperate.</strong></p>\n\n<p>Ken is an empire builder, and I don’t mean that as a compliment. What he has built and tried to maintain is equivalent to the Death Star, but worse. I posit that his “best at any cost” attitude, and early success at rapid expansion, encouraged him to employ HFT algorithms to manipulate the market as a whole. Stealing from individual investors, and anyone or anything that gets in his way. He doesn’t care about the outcome to others, he just wants to win.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=5KOT0_I4Fvw\">https://www.youtube.com/watch?v=5KOT0_I4Fvw</a></p>\n\n<p>Watch the above video. In this interview, at 3:09 Ken Griffin talks about how they deploy HFT algorithms in order to manipulate traders emotions. He states that it allows them to “better position their portfolios” through utilizing HFT algorithms and their knowledge of human biases. He goes on to say that through this process “use computers in new and innovative ways to better drive the pricing of assets in financial markets.”</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ep8x15mb4cnb1.png?width=1016&amp;format=png&amp;auto=webp&amp;s=9d065e82deb14954ab45bb1fe5a0fe3017792cce\">turns out it was a dick thing to brag about</a></p>\n\n<p>Here, with Kenny though, as you look into those dead eyes, what do you see?</p>\n\n<p>I see someone that is trying everything in their power to maintain and project an image. Notice the stiff, non-genuine body language. The forced eyed contact, lack of blinking, and the fact that he’s not confessing. He’s bragging. He uses certain buzzwords, and always steers any discussion point to paint the culture of Citadel in a positive light. He clearly thinks very highly of himself, ands wants a certain image out there regarding not only him as a person, but Citadel as well.</p>\n\n<p>However, as a leader, Ken should know that you are not what you say. <strong>You are what you do.</strong> To all my homies out there that have mental health struggles at times (<em>raises both hands for some reason)</em>, you are what you do. Not what you think. Your words, do define you as well, so slow it down as needed and lets just let our work do the talking. Ken may be evil, and foolish, but he’s not necessarily stupid. I believe that through his HFT, he has put himself in a desperate position.</p>\n\n<p>He wasn’t always <em>this terrible</em> though, and that’s not to say that he was ever good either. He knows what he’s doing is wrong, but his ego won’t allow himself to take the L and move forward. Through the years, his already weak moral fiber was further eroded by the position he created for himself through his own greed, vast connections, and sprawling empire. His self-worth is so tied to his vision of success that he doesn’t care how many others end up as collateral damage. He lives in a billionaire’s bubble, beholden to the HFT algos that once served him, attempting to unload dirt from a pit of gold as dump-trucks arrive with increasing frequency.</p>\n\n<p>Ken has previously referred to Citadel as essentially a money factory. But what happens when one money machine breaks and blows up a few others? Don’t worry, we’ll get to that.</p>\n\n<p>Every public-facing decision he makes is highly calculated. They are chess moves to accomplish a specific goal, depending on the nature of the appearance. However, they are a strategy of a desperate party. Sloppy. Nonsensical. He’s bad at chess, and I’d bet he’s the type of guy has no problem flipping the table when he’s losing. Further, he doesn’t care if it hits your dog or knocks your grandmothers ashes off of the mantle when he does it.</p>\n\n<p>He’ll send you a check to pay for cleaners that the lawyers will happily hand over after you sign an NDA.</p>\n\n<p><a href=\"https://preview.redd.it/x90brexd4cnb1.png?width=1288&amp;format=png&amp;auto=webp&amp;s=3c912f02e5ba71189753986fc42191f790d94ea3\">Those eyes tell a story, and it&#39;s not a pretty one on either side</a></p>\n\n<p>Oh. So he hires lawyers to represent his single digit age havin&#39; kids when hanging their mom out to dry. I&#39;m certain it was only for their benefit, and not his. Maybe she was abusive and didn&#39;t deserve any money?</p>\n\n<p><a href=\"https://preview.redd.it/5i7s75pg4cnb1.png?width=1290&amp;format=png&amp;auto=webp&amp;s=3ccbb972298e45de25f8cd52ed7aef739b7a354d\">Oh.</a></p>\n\n<p>Safe say my delusions, if nothing else, have a leg to stand on. But, personal matters are complicated. There&#39;s always two sides to a story, and the media does spin shit at the end of the day. We know the market is rife with financial crime that&#39;s incredibly hard to detect.</p>\n\n<p>Every day Citadel is in the market, people’s pensions and well-being are stake, yet, in his self-aggrandizing web of bullshit he has the gall to accuse of the very thing he knows he’s doing. That’s called projection, for everyone following along at home.</p>\n\n<p><strong>Citadel Advisors:</strong></p>\n\n<ul>\n<li>2014: Fined $800,000 by FINRA for violating short-selling rules.</li>\n<li>2017: Fined $22.6 million by the SEC for allegedly misleading investors about the fund&#39;s market timing practices.</li>\n</ul>\n\n<p><strong>Citadel Securities United States Regulatory Fines:</strong></p>\n\n<ul>\n<li>2007: Fined $22,500 by FINRA for failing to properly report short interest positions.</li>\n<li>2009: Fined $3 million by the SEC for allegedly engaging in improper trading practices that artificially impacted the price of securities.</li>\n<li>2014: Fined $800,000 by the SEC for allegedly violating the market access rule.</li>\n<li>2015: Fined $800,000 by the SEC for violating the Market Access Rule.</li>\n<li>2015: Fined $1.5 million by FINRA for violating various rules related to trading activities.</li>\n<li>2016: Fined $3.5 million by the SEC for violating the National Market System Plan governing the consolidated data feeds.</li>\n<li>2017: Fined $22.6 million by the SEC for misleading customers about the quality of its pricing and execution.</li>\n<li>2017: Fined $1.5 million by FINRA for providing inaccurate information to customers and for failing to report trades to the appropriate regulatory entities.</li>\n<li>2018: Fined $3.5 million by the SEC for failing to provide customers with accurate trade data.</li>\n<li>2019: Fined $100,000 by the CFTC for exceeding speculative position limits in wheat futures.</li>\n<li>2020: Fined $97,000 by FINRA for failing to properly report certain equity trades.</li>\n<li>2020: Fined $700,000 by the CFTC for allegedly violating swap data reporting requirements.</li>\n<li>2021: Fined $700,000 by FINRA for failing to report a significant number of trades to FINRA&#39;s Trade Reporting and Compliance Engine (TRACE).</li>\n</ul>\n\n<p><strong>Citadel Securities International Regulatory Fines:</strong></p>\n\n<ul>\n<li>2017: Fined €1.1 million by ESMA for breaching market-making obligations and engaging in algo-trading activity.</li>\n<li>2017: Fined €5 million by AMF in France for allegedly manipulating French government bond futures.</li>\n<li>2018: Fined €1.6 million by CONSOB in Italy for market manipulation and insider trading.</li>\n<li>2018: Fined AUD 360,000 by ASIC in Australia for alleged trading violations related to market integrity.</li>\n<li>2018: Fined $230,000 by MAS in Singapore for market manipulation related to its trading activities on the Singapore Exchange (SGX).</li>\n<li>2020: Fined €2 million by AMF in France for allegedly manipulating the bond market and breaching its best execution obligations.</li>\n<li>2020: Fined £1.2 million by PRA in the UK for failing to provide accurate and timely transaction reports to the regulator.</li>\n<li>2020: Fined CHF 1.12 million by FINMA in Switzerland for violating trading rules and engaging in market manipulation.</li>\n<li>2020: Fined £1,445,000 by FCA in the UK for inaccurate transaction reporting and failing to take reasonable care to organize and control its affairs.</li>\n<li>2021: Fined £1.4 million by FCA in the UK for failing to adequately report certain trades to the regulator.</li>\n<li>2021: Fined $97,000,000 in China for alleged &quot;malicious&quot; short-selling practices.</li>\n<li>2021: Fined 175 million won by KFIA in Korea for allegedly engaging in high-frequency trading activities that violated local laws.</li>\n</ul>\n\n<p>Well, from his actions, both in his personal and business life. It doesn’t look like he’s a very good guy. From my research going into this post, it’s clear that Ken Griffin, or someone under his direction, has spent an inordinate amount of time and energy to manipulate search results. These are not the actions of a man with nothing to hide. Through the course of this investigation, I was forced to track down leads on specific connections with others, among other things. They didn’t make it easy on me, and I posit that a lot of the moves they’ve made have been in order to obfuscate his involvement with FTX. His little mayo fingers are all over this, as I will illustrate continually as I build my case behind the motives, methodologies, and human capital deployed in order to avoid the empire crumbling.</p>\n\n<p>I believe the following theory is a direct result of Ken seeing how fucked he was, and what we’ve seen since GME in 2021 was a last ditch attempt to survive - while only making the problem worse.</p>\n\n<p>Among other things, in this series I will lay a case out on how through Ken’s involvement in FTX, he helped steer the infinite share printers that were located at BlockFi, a FTX subsidiary. There are others, likely in the crypto and traditional finance world. We will also postulate on what swaps and algos made this possible, what other exchanges were involved, how these tokens were created without US oversight, how these positions hidden from authorities, and more. He’s not the only player though. There are a few big bad ones, some surprising good ones, and some good ones you knew were good since the beginning - even if you need to be reminded from time to time.</p>\n\n<p>I will draw conclusions around timelines and the known facts based around what I know of market mechanics including swaps, complex derivatives, HFT algos, how share locates are vetted, and more. We will also explore the bankruptcy case, and through the combination of these things we will have, possibly, a more complete history and a clearer vision of where we’re going. We will also use the FTX company structure to further understand how the scam worked.</p>\n\n<p>We’ve got charts and graphs and lines and all kinds of fun stuff. I feel I make a complete argument here based around my knowledge. There will certainly be mistakes.</p>\n\n<p>In the next post, we will discuss <strong>Binance’s Changpeng Zhao: The Willing Participant.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wu4n5vok4cnb1.png?width=1740&amp;format=png&amp;auto=webp&amp;s=8ef6358935e2ef08e5b482a3477efd82c2309d6a\">God damn it, Ken</a></p>\n\n<p>Not that guy. That guy just gets payed for his Search Engine Optimization skills and qualities.</p>\n\n<p>Sorry, this guy is the one the next post is about.</p>\n\n<p><strong>Binance’s Changpeng Zhao: The Willing Participant</strong></p>\n\n<p><a href=\"https://preview.redd.it/ubcnvezm4cnb1.png?width=2429&amp;format=png&amp;auto=webp&amp;s=ac622515f9cda945e603ca2534a414d4401e5acf\">And his little dogs, too!</a></p>\n\n<p>See you soon, sweeties. </p>\n\n<p>Next post coming as soon as possible. Hang in there, it&#39;ll all make sense at the end.</p>\n\n<p>- Famous</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/9hwzF_6g0lSpdjYZXSGZdJQyPsPi6BPysP90qNQ4aT8.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16dgso4/plan_around_2pm_today/", "time": 1694194464.0, "subreddit": "r/ThePPShow", "title": "Plan around 2pm today?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Full speculation here, but if you wanted to fuck up some hedge funds days, you’d drop the plan in the middle of the afternoon on a Friday. In my opinion. </p>\n\n<p>Reason being, there’s very little time to stop the gamma ramp, and then everything that goes ITM or is bought today will have to be delivered on Tuesday. Which is our confirmation day. Which means even more powerful uppies. </p>\n\n<p>Not saying it IS going to happen, but there’s some reasons why it MIGHT.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16d2zqi/extinguished_i_dont_think_so_we_were_right/", "time": 1694155097.0, "subreddit": "r/ThePPShow", "title": "Extinguished? I don't think so. We were right.", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/vvny96xb8zmb1.png?width=1168&amp;format=png&amp;auto=webp&amp;s=736001091707b99a9bf45f9f81b5d8d435a759c1\">well well well fellow baggies</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gen5y8sh8zmb1.png?width=1102&amp;format=png&amp;auto=webp&amp;s=699d6ee553defad98c19830a6320fb28bd267612\">1129(a)(7) in the BK code is often referred to as the \\&quot;best interests of creditors\\&quot; test\\&quot;</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/b6j0g5kdqkdtRf3vwQe5tg61i1xbftJv6WgtIIZ4Bj8.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://i.redd.it/79i7arr5rymb1.jpg", "time": 1694149127.0, "subreddit": "r/ThePPShow", "title": "Y’all know anyone that’s a creditor?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Whoever could they be referencing? 🏴‍☠️🥂</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/79i7arr5rymb1.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16cyj2f/if_you_are_confident_all_you_have_to_do_is_nothing/", "time": 1694140975.0, "subreddit": "r/ThePPShow", "title": "If you are confident, all you have to do is nothing.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey y&#39;all, it&#39;s me Shill Variety.</p>\n\n<p>Before I attempt unsuccessfully to &quot;unplug&quot; for a bit; subsequently deluding myself that the effort was worth something - secretly knowing I was going to crack. Why does the universe challenge us so?</p>\n\n<p>Quick bedtime story for you cuties. </p>\n\n<p>I took a big loss early when I was new to the market, many moons ago now. I had (what I thought) was a reasonable thesis. So, I over levered myself beyond my risk tolerance. The stock moved against me in high volatility, and I panicked and sold - taking a big loss. Well, the next day, my thesis played out. </p>\n\n<p>Fuck me, right? It happens. The cost of tuition, as it were. That, ideally, is a one-time mistake. I should have remembered my thesis, it&#39;s what got me into the play to begin with after-all. I&#39;ve got posts in my bio, giving shit fanfic fantasies on exit plans and MOASS mindset, to get you to consider things. Mostly why you&#39;re reading another Shill Variety post, but I digress. </p>\n\n<p>That day I took that loss, had I instead opted to cook my girlfriend breakfast and then to an afternoon ICP Carnival show with extra carnies, I would have also been a few grand richer for the experience. The rich consistency of sweat &amp; clown make up creates a musk that you&#39;ve got to experience to believe. </p>\n\n<p>If you have conviction in your thesis, and words can&#39;t hurt you, sometimes all you have to do is nothing. </p>\n</div><!-- SC_ON -->", "flair": {"text": "MISLEADING", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16cgc11/proof_gamestop_is_gearing_up_for_ma_activity_per/", "time": 1694094470.0, "subreddit": "r/ThePPShow", "title": "Proof Gamestop is gearing up for M&amp;A activity per their Credit Agreement, and how it fits into our collective thesis. Guess what? It's almost time.", "text": "<!-- SC_OFF --><div class=\"md\"><p>This DD details the findings of the Gamestop 10-Q, and speculates what the merger target is based around the terms of the credit agreement. I was going to post tomorrow, but it’s come together enough for now to get started. </p>\n\n<p><a href=\"/u/travis_b13\">/u/travis_b13</a> , <a href=\"/u/jake2b\">/u/jake2b</a> , <a href=\"/u/theorico\">/u/theorico</a> , <a href=\"/u/region-formal\">/u/region-formal</a> I’m not sure how much you guys dug into this, but maybe this post will give you a head start. I know I&#39;ve missed a lot. </p>\n\n<p>EVERYONE PLEASE HELP VET THIS - I will fix any inaccuracies.</p>\n\n<p>Link to document:</p>\n\n<p><a href=\"https://www.sec.gov/Archives/edgar/data/1326380/000132638023000047/creditagreementwellsgamest.htm\">https://www.sec.gov/Archives/edgar/data/1326380/000132638023000047/creditagreementwellsgamest.htm</a></p>\n\n<h1></h1>\n\n<p>Gamestop filed their updated Credit Agreement today as part of their 10-Q. A Credit Agreement details the terms of a loan. This one happens to be 206</p>\n\n<p>This details the terms of the loan, agreed upon by lenders (Wells Fargo giving the lending the money, and WF, JPM, &amp; BoA are helping administrate) to Gamestop (lead plan administrators/holders of the loan). A few GS subsidiaries are being used as collateral to guarantee the loan. </p>\n\n<p>This is the first page in the Credit Agreement outlining the big players that are cited above. </p>\n\n<p><a href=\"https://preview.redd.it/uiqd5vig4umb1.jpg?width=1938&amp;format=pjpg&amp;auto=webp&amp;s=3936f59a82c9c0084be63d266407067e6454a318\">Gamestop decides where the money is used for assuming certain conditions are met. </a></p>\n\n<p>Now, in these Credit Agreements there are all kinds of stipulations on what you can and can’t do with the money. I don’t usually spend all day reading Credit Agreements, so I’m not speaking from experience here, but this seems like it’s tailored specifically for a very complex merger / acquisition or SERIES of them.</p>\n\n<p>Using this as my baseline, I then wanted to figure out if Gamestop would be acquired - or they were the ones doing the acquiring. </p>\n\n<p>You don’t have to read this following image, I’ll summarize for you, but here it is for reference.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lxnkccjr4umb1.png?width=2940&amp;format=png&amp;auto=webp&amp;s=f4e87971e8d9cfbfe1a6f8678ff657a7b901cc94\">Summary below</a></p>\n\n<p>A &quot;Permitted Acquisition&quot; in this credit agreement refers to a purchase or acquisition by Gamestop or its subsidiaries. For Gamestop to be allowed to go through with the acquisition certain conditions must be met by Gamestop, including having no defaults, meeting collateral and guarantee requirements, complying with financial conditions, and obtaining board approval for the acquisition.</p>\n\n<p>No biggy, seems good. </p>\n\n<p><strong>Negative Covenants - Article 9</strong></p>\n\n<p>Article 9 is about what circumstances are not allowed for the loan to be used, as well as exceptions to the rules depending on the categories. It’s huge, so I’m not going to post it here. </p>\n\n<p>9.1 goes into Limitations based around Liens. </p>\n\n<p><strong>Section 9.2</strong>: This section outlines the types of investments that GameStop and its Restricted Subsidiaries are permitted to make with the money from the agreement. These include investments in cash and cash equivalents, loans to officers and employees, intercompany loans, and extensions of credit in the ordinary course of business. The section also allows for investments related to swap contracts, promissory notes, and other specific circumstances. Investment limits based on certain financial metrics and conditions are also defined.</p>\n\n<p>It’s a very big section - but there’s certainly a standout. In case you already forgot, this is the section stating what Gamestop can use the money on. </p>\n\n<p><strong>9.2(l) Joint Ventures &amp; Joint Venture Investments</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qs8qn7cd5umb1.png?width=2186&amp;format=png&amp;auto=webp&amp;s=8c4ff11cb8b655b7672f9557a8feb142716bc5c8\">I like that.</a></p>\n\n<p>&#x200B;</p>\n\n<p>Since this is a legal document, we have to define both Joint Ventures, and Joint Venture Investments per the terms of the Credit Agreement.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7d94uky45umb1.png?width=2924&amp;format=png&amp;auto=webp&amp;s=75cda2ee703cb681734b1ac4c8e3f9cedbca427e\">I try to make sense of it below</a></p>\n\n<p>&#x200B;</p>\n\n<p>&quot;Joint Venture Investments,&quot; are defined as investments in any Joint Venture or Unrestricted Subsidiary. A &quot;Joint Venture&quot; is any entity in which a Loan Party (GME) or a Restricted Subsidiary has significant influence but not full control. This is often characterized by ownership of between 20% and 50% of the voting stock. Additionally, a Joint Venture can also be any entity in which GameStop or its Restricted Subsidiaries have an Equity Interest but which is not categorized as a Restricted Subsidiary (other than an Unrestricted Subsidiary).</p>\n\n<p>The agreement specifies that the aggregate amount for such Joint Venture Investments cannot exceed the greater of (a) $25,000,000 or (b) 15% of the Consolidated EBITDA as of the most recently ended Test Period, calculated on a Pro Forma Basis.</p>\n\n<p>For example, let&#39;s say GameStop wants to invest in IEP. If GameStop acquires between 20% and 50% of IEP&#39;s voting stock, they would have a Joint Venture with IEP, and this investment would fall under the category of &quot;Joint Venture Investments.&quot; The amount GameStop could invest in IEP would then be subject to the financial limitations specified in the agreement, such as not exceeding $25,000,000 or 15% of their most recent Consolidated EBITDA.</p>\n\n<p>Additionally, if GameStop already owns an Equity Interest in IEP but does not have Joint Venture status (i.e., they own less than 20% of the voting stock), they could still make additional investments in IEP to either maintain their Equity Interest or potentially reach Joint Venture status, provided they stay within the financial constraints of the Loan Agreement. Now, we don’t know if they hold IEP or even if this is their strategy. </p>\n\n<p>But, here’s what I think is going on, and how specifically the Joint Ventures are going to work in the long run, and what they’re building structurally here. It fits in with every part of the thesis, and explains a lot of these tangental connections. We have all speculated about companies being under the Teddy umbrella, I’m not trying to claim that as my idea, but rather give it structure with a bit more context. Again, this is extrapolation from the information provided. Enter, the Japanese business structure of the horizontal keiretsu.</p>\n\n<p><a href=\"https://preview.redd.it/2osp26yw5umb1.png?width=1578&amp;format=png&amp;auto=webp&amp;s=b9051ef3096fd6155f120521c4b13c89a3f6515c\">Love me a good sunrise 💜</a></p>\n\n<p><strong>Horizontal Keiretsu</strong></p>\n\n<p>A Keiretsu is a set of companies with interlocking business relationships and shareholdings. It is a type of business group. There are two types, Horizontal and Vertical. I believe we are about to see a Horizontal Keiretsu once Teddy is born. But before we get to how we get Teddy, let’s go over what a Horizontal Keiretsu is. </p>\n\n<p>A bank (Teddy) is usually at the center, providing financial support. Companies in a horizontal Keiretsu often own small percentages of shares in each other, strengthening mutual relationships and discouraging hostile takeovers. I theorize that Larry Cheng, Pulte, Icahn, Brett Icahn, Kevin Plank, and many more, are working alongside RC - hoovering up companies to add to the keiretsu, along with their own established companies. </p>\n\n<p>Structure of a Horizontal Keiretsu</p>\n\n<ul>\n<li><strong>Centered Around a Bank</strong>: A major bank often sits at the center of a horizontal Keiretsu, providing financial services and support to all member companies. The bank essentially acts as the backbone of the group, ensuring liquidity and credit availability.</li>\n<li><strong>Cross-Ownership</strong>: Companies in the group usually own small stakes in each other. This shareholding structure reinforces mutual trust and discourages hostile takeovers.</li>\n</ul>\n\n<p>Industries and Sectors</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Diverse Portfolio</strong>: Companies in a horizontal Keiretsu typically come from a wide range of industries. Think very, very big. The diversification adds resilience to the group as a whole. Not just Amazon categories but manufacturing, electronics, etc. Like if Newell, Canon, L Catterton, Apple, Nike, Sears, Macys, LEGO, Nordstrom, IEP, Flexport, Gamestop, &amp; Overstock / Bed Bath &amp; Beyond all centered around a BANK / financial holding company called Teddy. </li>\n</ul>\n\n<p>Key Features</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Collaboration</strong>: Member companies often collaborate on joint ventures, R&amp;D projects, and other initiatives. The tight-knit network makes it easier to coordinate these efforts.</li>\n<li><strong>Information Sharing</strong>: Inside the Keiretsu, there is often a free flow of information, helping companies anticipate market trends or economic downturns more accurately.</li>\n<li><strong>Supply Chain</strong>: While not as tightly integrated as in a vertical Keiretsu, member companies do prefer to do business with each other, further strengthening the ties.</li>\n<li><strong>Risk Mitigation</strong>: The cross-shareholding and mutual business interests allow for risks to be distributed more evenly across the group, making each company more resilient to market fluctuations.</li>\n</ul>\n\n<p>This vibing with you? Through series of complex M&amp;A activity, including the launch of Teddy, we will have our Amazon competitor in the form of a Horizontal Keiretsu.</p>\n\n<p><strong>Lets jump back to the Credit Agreement in GME’s 10-Q - Section 9.8</strong> </p>\n\n<p>First off, there’s lots of good stuff in here. Lots to go over, and I’ll likely add to this post as I find more things after I sleep. There’s one section in particular that I feel is applicable, to the situation with towel, that is. Remember, we’re still in the Negative Covenants aka thanks you can’t do unless there’s an exception, so here’s the thing we can’t do, and then there’s a bunch of exceptions that will allow you to do it. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fk8muumq6umb1.png?width=1944&amp;format=png&amp;auto=webp&amp;s=bbf4b25ba4e20ad2ef23eb722f35b657b05cab5f\">Affiliates in this case are anyone the Loan Party knows on a first name basis essentially. </a></p>\n\n<p>So, you can’t use the money for any acquisition over $5,000,000 with any Affiliate unless you meet one of the exceptions they list. The reason the Affiliates bit here is important, is because Affiliates <em>also include yourself if you happen to control multiple companies</em> which would stop Gamestop RC from acquiring something from another company he owns - say Teddy. There’s possibly several more exceptions here that would apply, but these are the ones that struck me. The highlighted bits are summarized below.</p>\n\n<p><a href=\"https://preview.redd.it/h735bmig7umb1.png?width=2448&amp;format=png&amp;auto=webp&amp;s=fa3bf80981b5f7ffb8121cac66924a74894ebc19\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/h735bmig7umb1.png?width=2448&amp;format=png&amp;auto=webp&amp;s=fa3bf80981b5f7ffb8121cac66924a74894ebc19\"></a></p>\n\n<p>Take note of all the [reserved] placeholders. That leaves a lot of flexibility to add in whatever you’d like down the line. I’m sure more of these apply, but I’m v tired and just chose a couple.</p>\n\n<p>Section 9.8(i) in the restricted covenants allows transactions with affiliates if they were already in place as of a certain date (the Closing Date) and are listed in a specific schedule. Amendments to those existing agreements are also allowed, as long as they don&#39;t materially harm the lenders compared to the original terms. This, IMO, leaves the door open to slide in whatever you want before the Closing Date. </p>\n\n<p>Section 9.8(r) allows transactions with affiliates if those transactions are approved by a majority of the board members who have no personal interest in the transaction. These are known as &quot;disinterested members&quot; of the Board of Directors. As long as the majority of the Board of Directors in Gamestop approves of the transaction, it’s good to go. </p>\n\n<p><strong>If Gamestop wanted to acquire Loopring, Elixer, or some other well-priced complimentary company, they now have everything they need to do so.</strong></p>\n\n<p>We can only speculate on what companies Gamestop is looking to merge with. I have a few thoughts, but this post is already punishing enough. The point is, they’re ready. This feels like the launchpad - you do not go through all this trouble just to sit on your hands and waste time. If we’re going to have our Horizontal Keiretsu, we need a bank.</p>\n\n<p><strong>Teddy</strong></p>\n\n<p>Teddy is currently registered as a financial holding company / a bank. They are currently a private company. We know that RC had interest in that baby company many moons ago that was tied to that towel stock that went bankrupt and now is a shell of a company. What if I told you, that the best way for Teddy to go public, was through the carcass of towel - which has stripped away all assets and “has nothing left to sell?” In a reverse-triangle merger, you do exactly this. You use the shell of a public company in order to launch a private company public. It allows you to skip a bunch of hoops that you typically need to jump through to go public via IPO. In addition to this, if you play your cards right, you can use any Net Operating Losses as a tax credit over the course of a few years.</p>\n\n<p>Before this part starts up, you have to be on the same page with me on something. First, this is only my opinion, but it’s rooted in pretty solid facts that are somewhat undeniable. There is a ton of noise around this subject. It has been censored somewhat relentlessly. However, considering the contents of this 10-Q, I feel it’s important to discuss the facts here - as I know them. I’m up to constructive discussion on any of these points, and am happy to clarify anything. Please also know that a certain group has been targeting me and my posts recently; take that for what it’s worth.</p>\n\n<p>First, RC is listed as both a creditor &amp; a codebtor in bankruptcy documents of that company. To become a creditor, the company has to owe you money. To be a codebtor, you have to be on the hook to some degree as well. Sometimes it means you cosigned as a guarantor on something. Like, if you have you dad cosign for a car, then you are codebtors with your dad. Word?</p>\n\n<p>Before bankruptcy, this company issued stacks of Series A Convertible Preferred shares, that you could exercise into warrants, which you could then either exercise the warrants for Common Stock or cash. Still with me? These also had a “Bankruptcy Triggering Provision” via the Redemption Rights via the 10-K that was filed months late in June.</p>\n\n<p><a href=\"https://preview.redd.it/1ezefr3r7umb1.jpg?width=2080&amp;format=pjpg&amp;auto=webp&amp;s=63b00abce28dc4c284333ab61064e57fdf9100f9\">Mezzanine financing is a hybrid between traditional cash lending and equity. It often involves the issuance of warrants, and can be used to provide financing where traditional means have failed. For an acquirer, it can be a great way to hide true ownership while maintaining certain levers of control. It can also be a perfect method for a private company to go public through the shell company and works as a way to finance the process while obfuscating ownership.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/o0x7w55t7umb1.jpg?width=2054&amp;format=pjpg&amp;auto=webp&amp;s=7581685f8eaf9a20a08c0289642c891e0f683507\">Note the triggering provisions / redemption upon bankruptcy</a></p>\n\n<p>We know from filings that the vast majority of these were exercised to Common Stock. ~23,365 There were 180 of the Series A shares that were not exercised. Keep in mind, these were $10,000 each at the time of sale. Per the Redemption Rights above, the holder when going into bankruptcy has the option to exercise the Series A shares for 115% of the original purchase price. In short, they could have made 15% risk free and gone home. </p>\n\n<p>But they didn’t. They exercised all of them for Stock A. Well, all of them but 180 of them. 180 shares of Series A entitles the holder to choose either cash or common stock. However, the company has no say when that happens. Due to these Series A shares in limbo, the company is required to retain both the number of shares &amp; the cash - because they don’t know what the holder will choose, and they can’t make them exercise. Not only this, but from the 13,543 Series A shares that were sold - Towel took a $3.1 billion dollar reduction to retained earnings on their consolidated balance sheet. That loss will be part of the carry-forward equity - which will offset tax burdens via NOLs over the course of years. </p>\n\n<p>Visit my profile for more info - I can’t get too bogged down here. That explains RC as a creditor. Nothing else really does. </p>\n\n<p>Now, why is he the codebtor? In short, he cosigned for the DIP facility, which not only gives him supermajority creditor position through 6th street, but also the rights of a debtor, because his dick is on the line if towel dies and 6th street doesn’t get paid. The big right here is being the only one to submit a plan in ch 11. That exclusivity period doesn’t end until November. Through Common Stock ownership, creditor rights through Series A, supermajority creditor rights via the DIP provided through 6th street, and he’s in exclusive control over the plans that get submitted.</p>\n\n<p>“bUt YoU dOnT hAvE pRoOf FoR tHaT” - <strong>THERE IS NO OTHER LOGICAL EXPLANATION.</strong></p>\n\n<p>We know RC puts his money where his mouth is. The idea that he just sold, left a bunch of his loyal followers holding the bag, only to continue to get eviscerated and eventually wiped out, without saying a single word… is also not logical. Not on any level. He has nothing to gain. It’s not in his character. He’s not going to just lay down and take, even if option a didn’t work. He’s principled and this is about more than money - and he wouldn’t hang you out to dry. Not with his, and his father’s, legacy on the line. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>A lot of ways this could go</strong></p>\n\n<p>Again, I’m not here to tell you I’m right. The way this is set up though, we just don’t know the scope of it. I personally believe we’re going to lose our minds once those bricks start clickin’.</p>\n\n<p>I’m not here to tell you that Gamestop is going to acquire Dream on Me who bought the baby IP. I really don’t know, there’s provisions in docket 1314 Section 2.7(a) that allow for all the contracts to be transferred back to the seller - in this case towel - which I speculate to be teddy. Maybe Gamestop is going to buy just gaming companies, and then Teddy is going to launch and buy Dream On Me. Again, I can only speculate - but this feels big. There’s been a ton of DD done on the other stock that is worth reading. The DD on GME shouldn’t be done either, and I hope this post helped you understand some of the possibilities. </p>\n\n<p>Moon soon, but actually.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>TLDR</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Gamestop filed their updated Credit Agreement today as part of their 10-Q. This details the terms of the loan, agreed upon by lenders (Wells Fargo giving the lending the money, and WF, JPM, &amp; BoA are helping administrate) to Gamestop (lead plan administrators/holders of the loan). I.e., Gamestop decides where the money goes assuming certain conditions are met.</li>\n<li>According to the terms of the agreement, it appears that Gamestop is gearing up to be part of at least one - possibly multiple - joint ventures. You take this against what has been speculated in the past and things start to fit better.</li>\n<li>There are many paths to successful mergers listed in this agreement. It doesn’t have specifics for now, we can only speculate. However, there is plenty of room for them to fill in the blanks whenever they’re ready. Everything else here is good to go, they just need to pull the trigger.</li>\n<li>If Teddy is going to be a financial holding company, I speculate based around facts from filings with some drawing conclusions, how Teddy could go public and how it fits in with GME’s M&amp;A activity.</li>\n<li>It’s 9:30 in the morning. I literally haven’t slept and will update this TLDR to be more robust tomorrow, plus add / fix anything y’all drop in the comments. </li>\n</ul>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/kQvZGN1OUk99n2CSnEfjwjsMVKuhi9N3VmL5bzogmRY.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16b4mc2/if_your_plan_is_to_have_no_plan_do_you_have_a/", "time": 1693958115.0, "subreddit": "r/ThePPShow", "title": "If your plan is to have no plan, do you have a plan? Plans within plans that aren't plans until they're plans, and how the real plan was the friends we made along the way. Spoiler: everything is going according to the terms of the plan.", "text": "<!-- SC_OFF --><div class=\"md\"><p>What up baggies? It’s you least favorite shill, FV. I’m here to waste more of your time so we can both feel the pain that I feel every day I eat tree bark. Like, it’s not going to kill you, but in general it’s a terrible life choice that most people won’t repeat. Yet here you are. My sweet little gluttons for punishment. Well lets get started, and don’t open those gimp zippys in front of your mouth until we’re done. I’m not going to proof-read this because we’d be here all night. </p>\n\n<p>First off, this bitch opens with a banger.</p>\n\n<p><a href=\"https://preview.redd.it/b87cmdq3ximb1.png?width=1848&amp;format=png&amp;auto=webp&amp;s=9060a5437e9d308ae460e70d78b5a8eb772ef213\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/b87cmdq3ximb1.png?width=1848&amp;format=png&amp;auto=webp&amp;s=9060a5437e9d308ae460e70d78b5a8eb772ef213\"></a></p>\n\n<p>Now, if you’re like me at all, you systematically kill and capture insects in your house before dehydrating them, turning them into powder, only to be rolled up into a… you guessed it… a joint. But enough about all this stuff we have in common, what the fuck is a Joint Plan in the sense of Ch 11? Well, we’ll get to that. But before we get too hyped, there’s several reasons why someone would file a joint plan. Since I’m always looking to confirm my bias, I did that first. Then I need to be able to drink the blood of anyone that disagrees with me, so I try to disprove the shit that doesn’t fit my delusional baggie-brain worldview. </p>\n\n<p>So, the biggest argument against the argument that I’m about to make is that it’s due to the multiple entities under the BBBY umbrella (Harmon, Baby, etc). This is a completely valid thought, and I applaud you for your investigative skills before decapitating you for your insolence. I had a similar thought, and again, good idea you had. So I figured I’d throw up the ol’ itsy bitsy spider (that’s what I call search engines). Unfortunately for me - and through extension you - it just got worse. It was clear that wasn’t the case and I was going to have to write this fucking post.</p>\n\n<p>The first time “Joint” appears in any docket is on 8/1. Easy to miss. Sneaky hobits.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/k7ir3epbximb1.png?width=2110&amp;format=png&amp;auto=webp&amp;s=0d348ba89b204f48fa08f0c22773278e08d68668\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/k7ir3epbximb1.png?width=2110&amp;format=png&amp;auto=webp&amp;s=0d348ba89b204f48fa08f0c22773278e08d68668\"></a></p>\n\n<p>Alright. So this is some new shit. This new shit also came after the sale of these dirty little sub-companies. Who’s wearing the gimp mask now, Harmon? Oh shit that reminds me, you can open your zipper. </p>\n\n<p>So since the former argument is dead, let’s pop those boner &amp; stupid pills. Ladies, you too. </p>\n\n<p>So a chapter 11 joint reorganization plan would pop up all jointy if you&#39;re having a change of ownership, or you were going to do things like change shareholders terms according to the plan, among other things. I get into a few below.</p>\n\n<p>One reason that you’d file a <em>joint</em> chapter 11 plan of <em>reorganization</em> is if you’re a co-debtor that doesn’t want to be fuk. Remember in the original warrant post where I held your hand ever so softly and we broached the subject of mezzanine financing? Well, in that tender moment, we learned that mezzanine financing is a mix of cash and equity financing. We already have a strong suspicion someone with a plan (heh), holds a position in warrants that were converted to commons worth hundreds of millions. We’ve also postulated that this party could, just like us, love hoovering up idiot slips worth roughly about fuck you.</p>\n\n<p>But, one of these makes sense and the other doesn’t. So, let’s relate it back to how this confirms our biases and allows us to continue to sprint headfirst towards evisceration. I hate it here anyways.</p>\n\n<p>We’ve already established that RC is listed as BOTH a creditor and a debtor. We figured out the creditor connection last week. We’ve also speculated that RC was behind the DIP facility. Well, I’m here to give you my theory on what we’re seeing. Now, some of this is “connecting the dots” sort of speculation. And all of it is packaged in the idea that this is a reverse-triangle merger to use the carcass of BBBY once it’s stripped clean to launch a private company public. The rest of the post is within that context, so if you need some refreshers or don’t know what any of those words mean please check my posts from the last week. This is going to be a lot of reading and is a collation of what I’ve learned over the past hour of research and self-loathing. But first, we gotta Bob Ross in some more big picture. You can be the happy tree, I’ll be The Rock. </p>\n\n<p>Take a break if you need to. I need you with me here because it gets wordy. </p>\n\n<p>You see, from my understanding, when two or more individuals or entities jointly borrow money or obtain credit, they are typically considered co-debtors for the resulting debt. Each co-debtor is equally responsible for repaying the entire debt. For example, if two people cosign a loan, they are co-debtors. Get it? Now. Back to RC the debtor and the DIP facility. For you knuckle draggers that haven’t kept up, a DIP facility is a specialized form of financing that allows a bankrupt company (the debtor(s)) to obtain financing to continue its operations during the bankruptcy process. Due to the nature of these loans you need a loan guarantor - a cosigner - to ensure that when the logical thing happens and BBBY is Thanos-snapped and your towels at home turn to dust, that <em>the lender of the DIP facility gets paid by someone that isn’t so fucking useless.</em> </p>\n\n<p>Read first few sentences in the paragraph above again. So, we can now speculate that RC is behind the DIP facility. This is the only thing that makes sense in the context of what’s real and what’s not. I can hear the shit-flingers gearing up the bUt ThE lAwSuIt is why he’s listed as a debtor. I’m here to tell you that argument is so stupid it hurts. Zip your mask back up and sit down. </p>\n\n<p>Anyway, I digress. So now our mans has control over the DIP, as well as a shiny co-debtor title. He also has a shiny creditor title that comes with shiny gold-puppeteering strings. Like how many puppets does one need? All of them. That’s why he’s a creditor as well, more control &amp; failsafes. Also more breadcrumbs for us baggies, whether or not they were intentional. </p>\n\n<p>Remember when I told you this docket opened spicy? Here it is again. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/dqmo46p0yimb1.png?width=1848&amp;format=png&amp;auto=webp&amp;s=c9633c47fcbf3be2ec9ba2cb7cb48783c342a67b\">Read it again, but slowly.</a></p>\n\n<p>DEBTOR. AFFILIATES. We getting anywhere with this? Is this thing on? We know this is NOT any former company owned by BBBY because those have all been stripped away. This leaves one possibility. RC is a debtor because he co-signed for the DIP. This is his play, because he&#39;s going to want the people that made his work necessary and our squeeze possible that it was him that fucked them from every angle mercilessly. </p>\n\n<p>Now, I’m about to make a case that answers a lot of things that we have speculated back and forth. I don’t claim to be right, I’m just calling it like I see. I spent my whole morning huffing chloroform while running which always leads to me hurting the people I love. Me. Anyway, given this information, if you proceed to hang your hat on this stock fanfic I’m about to lay at your feet, it sucks to be you, but not as bad as it is to be me. None of this shit is real life, and you are now aware of your breathing patterns. </p>\n\n<p>Here’s what I think is going on. This whole thing, all the Icahn connections that seemed to be there, all the speculation with the companies, etc. I think I have an answer that fits who these people are, and what our stocky bits and not stocky bits. You see, Ryan has always owned his shit. He puts his money where his mouth is. He’s never broken his word to us, despite all the noise, it hasn’t happened once. As Pulte said, he’s a fighter - and you either trust him or you don’t. </p>\n\n<p>A little background on me to explain my deep rooted mental illness. See, I was hospitalized between the ages of 6-14, until I had a much needed medical procedure that at least kept me out of the rooms with the sky beds. I come from a broken home. I suffer from depression, and self-doubt among other things. My household was abusive at times. Shit got real for a long time. I may be a piece of shit, but I’m also a fighter. Professionally speaking, I worked as hard as I possibly could and excellent. Up until recently, I’ve been in the restaurant industry. My last job, I was both the Executive Chef and General Manager - and we were a avant garde seasonally changing restaurant. My food is in the New York Times, Southern Living, Bon Appetite, etc. </p>\n\n<p>But I don’t give a shit about that. I’m proud of the work that I did specifically in forming a culture that I could be proud of. If you’ve never worked in restaurants, first off, congrats. Second, they typically are breeding grounds for toxicity and substance abuse. When we were conceptualizing the restaurant, we literally made a list of our favorite restaurants and listed the pros and cons. Everything in the cons list we dropped, everything in the pros list we kept. I always tried to “do what a good manager would do” in the context of the situation while trying to take the needs of the employee, the business, and the owner’s wishes into account. I was happy to fall on the sword if needed to make the employees request a reality - often to the detriment of myself. </p>\n\n<p>My point is - it’s harder to do the right thing. When you’re the lightning rod in-between such great pressure, you really have to want to do the right thing in order to wake up every day and push for it. I believe RC is that type of person. For better or worse, I’m a dreamer with the gift of being good at shit if I eat enough nails but I’ve read enough philosophy and consumed enough DMT to think it’s the door to inter-dimensional aliens. I also believe that since we know he’s not a coward, this is 100% his play. <strong>This is his magnum opus</strong>. Anyone else that has any stake is in the passenger seat per the cooperation agreement. They could still hold a sizable position under reporting limits just to root for that tenacious bastard.</p>\n\n<p>To want to fight like this though, you have to have values instilled in you from somewhere. Whenever I would be asked about my food, I would honor the chefs that wrote the cook books that inspired me. In a way, we all stand on the shoulders of giants. In RC’s case, his father Ted gave him the ethics and life lessons in order to lead a just and fulfilling life as a person. I believe that this play, is In part, an homage to his father. He’s launching Teddy, while actively managing his ambassadors to the brand as well. </p>\n\n<p>Some of you complain that this has taken so long, but I argue these last two years were required to separate the wheat from the chaff, and to instill some important values. Just like Ted did to RC, RC and other friendlies are choosing to associate with the ones doing the work - and leading with love and good intentions. RC wrote children’s books, you’re the fucking child in this scenario. If GameStop had gone parabolic in 2021, not only would the system have collapsed but it would have been fucking chaos. Even if you got rich, you were likely to do stupid and insane shit with your newfound wealth. It would have been a shitshow on every fucking level. </p>\n\n<p>But lets say you’ve got a penchant for doing badass shit and honoring the ones you love. Well, if you’re a slavvy daddy like RC - you know it’s foolish to waste time when there are more parts that could be moving towards the goal - especially in our unique case. Us truly loyal shareholders are the ones that have done the work. In regards to our situation specifically, you’ve trusted RC, DONE THE WORK, and didn’t let words hurt you. This is similarly how you filter candidates; I let a lot of people go for not being a good fit culturally, and would never bring on someone that I didn’t think could be a good fit. This has been your training, grasshopper. </p>\n\n<p>We’ve established RC’s dad as a huge source of values that RC continues to carry. These values include his basic work ethic, but it doesn’t include one thing. How to be a good activist investor. That’s where Uncle Carl comes in. We’ve seen so connections, and I DO believe that Icahn is in the play as a whole through companies eventually that will be under the Teddy umbrella. This is NOT an Icahn play, it’s a fucking homage to him. Just like it’s an homage to his dad. </p>\n\n<p>It’s all of Carl’s people and you know he’s talking through this with RC &amp; Brett. This is a passing of the torch. RC, using Icahn’s playbook and people (this is important), is going to pull off the play of century due to lessons and wisdom imbued in him by Carl’s history of hard fucking work for the right fucking reasons. He fucking put his money where his mouth is. Brett will take over IEP and is helping steer the grand vision of this thing alongside RC - which is another passing of the torch by Carl to a new generation that’s just now ready for the responsibility. </p>\n\n<p>To further this, when Daddy tells me to do something I do it. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/obndiuanyimb1.png?width=2032&amp;format=png&amp;auto=webp&amp;s=fa43383533004cd6b542140b840a394334298050\">I haven&#39;t even looked into the others</a></p>\n\n<p>Here’s a little snippet from that case. I haven’t looked into other links because this one thing was enough to start with. </p>\n\n<p><a href=\"https://preview.redd.it/iqnwa92jyimb1.png?width=1708&amp;format=png&amp;auto=webp&amp;s=e173e69f17f48bb44a6ec739873925c2ce478fae\">Carl&#39;s people, strategy, and now precedent from past victories. </a></p>\n\n<p>This took longer than I had hoped this time. I spent less time digging than I did writing this time, so I believe there is more to come - either from me, the community, or both. I hope it&#39;s both. </p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/KQa_Gq6U1LzACkcbk0XKHQRvWflZaHqAg2YQw2i95QE.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/16b4mc2/if_your_plan_is_to_have_no_plan_do_you_have_a/", "time": 1693958115.0, "subreddit": "r/ThePPShow", "title": "If your plan is to have no plan, do you have a plan? Plans within plans that aren't plans until they're plans, and how the real plan was the friends we made along the way. Spoiler: everything is going according to the terms of the plan.", "text": "<!-- SC_OFF --><div class=\"md\"><p>What up baggies? It’s you least favorite shill, FV. I’m here to waste more of your time so we can both feel the pain that I feel every day I eat tree bark. Like, it’s not going to kill you, but in general it’s a terrible life choice that most people won’t repeat. Yet here you are. My sweet little gluttons for punishment. Well lets get started, and don’t open those gimp zippys in front of your mouth until we’re done. I’m not going to proof-read this because we’d be here all night. </p>\n\n<p>First off, this bitch opens with a banger.</p>\n\n<p><a href=\"https://preview.redd.it/b87cmdq3ximb1.png?width=1848&amp;format=png&amp;auto=webp&amp;s=9060a5437e9d308ae460e70d78b5a8eb772ef213\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/b87cmdq3ximb1.png?width=1848&amp;format=png&amp;auto=webp&amp;s=9060a5437e9d308ae460e70d78b5a8eb772ef213\"></a></p>\n\n<p>Now, if you’re like me at all, you systematically kill and capture insects in your house before dehydrating them, turning them into powder, only to be rolled up into a… you guessed it… a joint. But enough about all this stuff we have in common, what the fuck is a Joint Plan in the sense of Ch 11? Well, we’ll get to that. But before we get too hyped, there’s several reasons why someone would file a joint plan. Since I’m always looking to confirm my bias, I did that first. Then I need to be able to drink the blood of anyone that disagrees with me, so I try to disprove the shit that doesn’t fit my delusional baggie-brain worldview. </p>\n\n<p>So, the biggest argument against the argument that I’m about to make is that it’s due to the multiple entities under the BBBY umbrella (Harmon, Baby, etc). This is a completely valid thought, and I applaud you for your investigative skills before decapitating you for your insolence. I had a similar thought, and again, good idea you had. So I figured I’d throw up the ol’ itsy bitsy spider (that’s what I call search engines). Unfortunately for me - and through extension you - it just got worse. It was clear that wasn’t the case and I was going to have to write this fucking post.</p>\n\n<p>The first time “Joint” appears in any docket is on 8/1. Easy to miss. Sneaky hobits.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/k7ir3epbximb1.png?width=2110&amp;format=png&amp;auto=webp&amp;s=0d348ba89b204f48fa08f0c22773278e08d68668\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/k7ir3epbximb1.png?width=2110&amp;format=png&amp;auto=webp&amp;s=0d348ba89b204f48fa08f0c22773278e08d68668\"></a></p>\n\n<p>Alright. So this is some new shit. This new shit also came after the sale of these dirty little sub-companies. Who’s wearing the gimp mask now, Harmon? Oh shit that reminds me, you can open your zipper. </p>\n\n<p>So since the former argument is dead, let’s pop those boner &amp; stupid pills. Ladies, you too. </p>\n\n<p>So a chapter 11 joint reorganization plan would pop up all jointy if you&#39;re having a change of ownership, or you were going to do things like change shareholders terms according to the plan, among other things. I get into a few below.</p>\n\n<p>One reason that you’d file a <em>joint</em> chapter 11 plan of <em>reorganization</em> is if you’re a co-debtor that doesn’t want to be fuk. Remember in the original warrant post where I held your hand ever so softly and we broached the subject of mezzanine financing? Well, in that tender moment, we learned that mezzanine financing is a mix of cash and equity financing. We already have a strong suspicion someone with a plan (heh), holds a position in warrants that were converted to commons worth hundreds of millions. We’ve also postulated that this party could, just like us, love hoovering up idiot slips worth roughly about fuck you.</p>\n\n<p>But, one of these makes sense and the other doesn’t. So, let’s relate it back to how this confirms our biases and allows us to continue to sprint headfirst towards evisceration. I hate it here anyways.</p>\n\n<p>We’ve already established that RC is listed as BOTH a creditor and a debtor. We figured out the creditor connection last week. We’ve also speculated that RC was behind the DIP facility. Well, I’m here to give you my theory on what we’re seeing. Now, some of this is “connecting the dots” sort of speculation. And all of it is packaged in the idea that this is a reverse-triangle merger to use the carcass of BBBY once it’s stripped clean to launch a private company public. The rest of the post is within that context, so if you need some refreshers or don’t know what any of those words mean please check my posts from the last week. This is going to be a lot of reading and is a collation of what I’ve learned over the past hour of research and self-loathing. But first, we gotta Bob Ross in some more big picture. You can be the happy tree, I’ll be The Rock. </p>\n\n<p>Take a break if you need to. I need you with me here because it gets wordy. </p>\n\n<p>You see, from my understanding, when two or more individuals or entities jointly borrow money or obtain credit, they are typically considered co-debtors for the resulting debt. Each co-debtor is equally responsible for repaying the entire debt. For example, if two people cosign a loan, they are co-debtors. Get it? Now. Back to RC the debtor and the DIP facility. For you knuckle draggers that haven’t kept up, a DIP facility is a specialized form of financing that allows a bankrupt company (the debtor(s)) to obtain financing to continue its operations during the bankruptcy process. Due to the nature of these loans you need a loan guarantor - a cosigner - to ensure that when the logical thing happens and BBBY is Thanos-snapped and your towels at home turn to dust, that <em>the lender of the DIP facility gets paid by someone that isn’t so fucking useless.</em> </p>\n\n<p>Read first few sentences in the paragraph above again. So, we can now speculate that RC is behind the DIP facility. This is the only thing that makes sense in the context of what’s real and what’s not. I can hear the shit-flingers gearing up the bUt ThE lAwSuIt is why he’s listed as a debtor. I’m here to tell you that argument is so stupid it hurts. Zip your mask back up and sit down. </p>\n\n<p>Anyway, I digress. So now our mans has control over the DIP, as well as a shiny co-debtor title. He also has a shiny creditor title that comes with shiny gold-puppeteering strings. Like how many puppets does one need? All of them. That’s why he’s a creditor as well, more control &amp; failsafes. Also more breadcrumbs for us baggies, whether or not they were intentional. </p>\n\n<p>Remember when I told you this docket opened spicy? Here it is again. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/dqmo46p0yimb1.png?width=1848&amp;format=png&amp;auto=webp&amp;s=c9633c47fcbf3be2ec9ba2cb7cb48783c342a67b\">Read it again, but slowly.</a></p>\n\n<p>DEBTOR. AFFILIATES. We getting anywhere with this? Is this thing on? We know this is NOT any former company owned by BBBY because those have all been stripped away. This leaves one possibility. RC is a debtor because he co-signed for the DIP. This is his play, because he&#39;s going to want the people that made his work necessary and our squeeze possible that it was him that fucked them from every angle mercilessly. </p>\n\n<p>Now, I’m about to make a case that answers a lot of things that we have speculated back and forth. I don’t claim to be right, I’m just calling it like I see. I spent my whole morning huffing chloroform while running which always leads to me hurting the people I love. Me. Anyway, given this information, if you proceed to hang your hat on this stock fanfic I’m about to lay at your feet, it sucks to be you, but not as bad as it is to be me. None of this shit is real life, and you are now aware of your breathing patterns. </p>\n\n<p>Here’s what I think is going on. This whole thing, all the Icahn connections that seemed to be there, all the speculation with the companies, etc. I think I have an answer that fits who these people are, and what our stocky bits and not stocky bits. You see, Ryan has always owned his shit. He puts his money where his mouth is. He’s never broken his word to us, despite all the noise, it hasn’t happened once. As Pulte said, he’s a fighter - and you either trust him or you don’t. </p>\n\n<p>A little background on me to explain my deep rooted mental illness. See, I was hospitalized between the ages of 6-14, until I had a much needed medical procedure that at least kept me out of the rooms with the sky beds. I come from a broken home. I suffer from depression, and self-doubt among other things. My household was abusive at times. Shit got real for a long time. I may be a piece of shit, but I’m also a fighter. Professionally speaking, I worked as hard as I possibly could and excellent. Up until recently, I’ve been in the restaurant industry. My last job, I was both the Executive Chef and General Manager - and we were a avant garde seasonally changing restaurant. My food is in the New York Times, Southern Living, Bon Appetite, etc. </p>\n\n<p>But I don’t give a shit about that. I’m proud of the work that I did specifically in forming a culture that I could be proud of. If you’ve never worked in restaurants, first off, congrats. Second, they typically are breeding grounds for toxicity and substance abuse. When we were conceptualizing the restaurant, we literally made a list of our favorite restaurants and listed the pros and cons. Everything in the cons list we dropped, everything in the pros list we kept. I always tried to “do what a good manager would do” in the context of the situation while trying to take the needs of the employee, the business, and the owner’s wishes into account. I was happy to fall on the sword if needed to make the employees request a reality - often to the detriment of myself. </p>\n\n<p>My point is - it’s harder to do the right thing. When you’re the lightning rod in-between such great pressure, you really have to want to do the right thing in order to wake up every day and push for it. I believe RC is that type of person. For better or worse, I’m a dreamer with the gift of being good at shit if I eat enough nails but I’ve read enough philosophy and consumed enough DMT to think it’s the door to inter-dimensional aliens. I also believe that since we know he’s not a coward, this is 100% his play. <strong>This is his magnum opus</strong>. Anyone else that has any stake is in the passenger seat per the cooperation agreement. They could still hold a sizable position under reporting limits just to root for that tenacious bastard.</p>\n\n<p>To want to fight like this though, you have to have values instilled in you from somewhere. Whenever I would be asked about my food, I would honor the chefs that wrote the cook books that inspired me. In a way, we all stand on the shoulders of giants. In RC’s case, his father Ted gave him the ethics and life lessons in order to lead a just and fulfilling life as a person. I believe that this play, is In part, an homage to his father. He’s launching Teddy, while actively managing his ambassadors to the brand as well. </p>\n\n<p>Some of you complain that this has taken so long, but I argue these last two years were required to separate the wheat from the chaff, and to instill some important values. Just like Ted did to RC, RC and other friendlies are choosing to associate with the ones doing the work - and leading with love and good intentions. RC wrote children’s books, you’re the fucking child in this scenario. If GameStop had gone parabolic in 2021, not only would the system have collapsed but it would have been fucking chaos. Even if you got rich, you were likely to do stupid and insane shit with your newfound wealth. It would have been a shitshow on every fucking level. </p>\n\n<p>But lets say you’ve got a penchant for doing badass shit and honoring the ones you love. Well, if you’re a slavvy daddy like RC - you know it’s foolish to waste time when there are more parts that could be moving towards the goal - especially in our unique case. Us truly loyal shareholders are the ones that have done the work. In regards to our situation specifically, you’ve trusted RC, DONE THE WORK, and didn’t let words hurt you. This is similarly how you filter candidates; I let a lot of people go for not being a good fit culturally, and would never bring on someone that I didn’t think could be a good fit. This has been your training, grasshopper. </p>\n\n<p>We’ve established RC’s dad as a huge source of values that RC continues to carry. These values include his basic work ethic, but it doesn’t include one thing. How to be a good activist investor. That’s where Uncle Carl comes in. We’ve seen so connections, and I DO believe that Icahn is in the play as a whole through companies eventually that will be under the Teddy umbrella. This is NOT an Icahn play, it’s a fucking homage to him. Just like it’s an homage to his dad. </p>\n\n<p>It’s all of Carl’s people and you know he’s talking through this with RC &amp; Brett. This is a passing of the torch. RC, using Icahn’s playbook and people (this is important), is going to pull off the play of century due to lessons and wisdom imbued in him by Carl’s history of hard fucking work for the right fucking reasons. He fucking put his money where his mouth is. Brett will take over IEP and is helping steer the grand vision of this thing alongside RC - which is another passing of the torch by Carl to a new generation that’s just now ready for the responsibility. </p>\n\n<p>To further this, when Daddy tells me to do something I do it. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/obndiuanyimb1.png?width=2032&amp;format=png&amp;auto=webp&amp;s=fa43383533004cd6b542140b840a394334298050\">I haven&#39;t even looked into the others</a></p>\n\n<p>Here’s a little snippet from that case. I haven’t looked into other links because this one thing was enough to start with. </p>\n\n<p><a href=\"https://preview.redd.it/iqnwa92jyimb1.png?width=1708&amp;format=png&amp;auto=webp&amp;s=e173e69f17f48bb44a6ec739873925c2ce478fae\">Carl&#39;s people, strategy, and now precedent from past victories. </a></p>\n\n<p>This took longer than I had hoped this time. I spent less time digging than I did writing this time, so I believe there is more to come - either from me, the community, or both. I hope it&#39;s both. </p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/KQa_Gq6U1LzACkcbk0XKHQRvWflZaHqAg2YQw2i95QE.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/169fuo1/lysol_wipes_moass_lessons_in_leadership_and_how/", "time": 1693795186.0, "subreddit": "r/ThePPShow", "title": "Lysol wipes, MOASS, lessons in leadership, and how to not fuck this up. Insane ramblings by an idiot you certainly shouldn’t listen to about anything ever.", "text": "<!-- SC_OFF --><div class=\"md\"><p>As ABC (sorry dude, I don’t know your reddit name) said on the PPShow, I ate my wheaties this morning. I hate wheaties, so my loss is your loss too and I’m going to punish all of you with a wall of text. </p>\n\n<p>Like many of you, I’ve been in this play for a long time. Hell, I remember how excited I was when I posted (what I think was) the first mention of GME as an “idiosyncratic” stock buried deep in some bullshit two years ago. Every once in awhile, a blind squirrel gets a nut.</p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/15sgf8k/drs_is_an_extremely_compelling_proposition_for/\">Not too long ago, I encouraged you wizards to put at least some of your shit in Gringotts. Again, furthering your very logical reasoning for never listening to me about anything.</a> Yer a wizard, or, maybe at least consider being one. </p>\n\n<p>Then, last week, after a particular vicious cannabis and Lysol bender, <a href=\"https://www.reddit.com/r/beyond_uranus/comments/166f1rz/rc_and_pals_have_control_through_the_series_a/\">I posted the DD that has allowed me personally to sleep at night. It has also caused me to triple my position in this bankrupt company.</a>The excellent work from <a href=\"/u/travis_b13\">/u/travis_b13</a> , <a href=\"/u/jake2b\">/u/jake2b</a> , and <a href=\"/u/theorico\">/u/theorico</a> has furthered my resolve leading to my only worry being that there will be more uppies before I can buy more Tuesday morning. </p>\n\n<p>If you haven’t taken time to digest that, along with it’s relative subsequent findings, then you are operating with incomplete information regardless of what “side” you’re on. This stuff can be hard to follow, but if you’ve stuck on this long I’m sure you’ve formed enough wrinkles to digest it. I’m proud of you and believe in you - and I know I don’t tell you that enough.</p>\n\n<p>I feel these recent findings / extrapolations of their impact on our situation logically shows that we’re fucking right. Considering this, and the non-zero chance there’s an announcement in the next couple of days, I believe it’s important to get yourself ready mentally for what’s to come. </p>\n\n<p>Again, I don’t care what the fuck you do. None of this shit is advice, this whole post is literally stock fanfic. None of the people referenced here are real, even the real ones. They are all characters in my delusion. This post is about me, you always do this, stop making it about you. By reading this post you agree that time is a flat circle and the meaning of life is to give meaning to life. </p>\n\n<p>Fanfic or not, I do have a penchant for the truth and real world accuracy - and nothing has come forward to invalidate recent discoveries. Considering the information available, my idiot brain says this is as conclusive as proof can get. But, there’s always the chance we’re wrong. Never listen to any mouth-breather that speaks their half-witted opinions as fact. They are always dangerous, equally when they’re telling you want to hear or “shilling” at you. </p>\n\n<h1>There’s a chance we’re wrong…</h1>\n\n<p>Facts are that there’s a non-zero chance the holder of hundreds of millions of shares from the conversion of Series A convertibles, and then their respective warrants, decided post BK to further their position in Common Stock instead of cash +15% bonus of the original price. Maybe they hate money and logic as much as we apparently do to hoover up idiot slips with no voting rights that are to be extinguished before you can so no uncle it hurts. Understanding this possibility is key to healthy debate and understanding what your risks are. However, since this doesn’t make a bit of god damn sense on any planet this one itty bitty fact makes this argument into a scene from Idiocracy. </p>\n\n<h1>...but if we’re right … (and I think we are)</h1>\n\n<p>Then you immediately need to start thinking about how to not fuck this up. The volatility and sharp rise on Friday partially spurred my writing of this post. If you’re reading this, you’re already likely safely secured, but the rollercoaster has started moving and shit is about to get real. The paragraphs that follow speak to securing and maximizing your returns - not only financially - but also personally and cosmically. </p>\n\n<h1>Leading up to announcement or bust</h1>\n\n<p>Insane volatility. If there is no announcement they ABSOLUTELY will try to shake you off. Expect to be hit from all angles with everyone in their brother trying to affect your emotions. Do not discuss the situation with friends that you wouldn’t trust with your friends. </p>\n\n<p>A lot of you have a lot of shares now from averaging down. That means you’re going to see the effect of compounding gains in real-time. You will likely see larger numbers than you ever thought you’d have. Enough for a house, and to pay off all of your debt, etc. In this fanfic, many of you will be making hundreds / thousands of dollars for every penny the stock moves. If you don’t think this will fuck with you; I’m here to tell you you’re fucking wrong. </p>\n\n<p>Study after study has shown essentially no-one is immune from the effects of market psychology. All you can do is educate yourself, stay within your personal risk tolerance, and have a fucking thesis / exit plan. My risk tolerance is as high as Giraffe pussy and if you’re still reading this I’d reckon yours is too.</p>\n\n<p>We have the thesis - and as Salvator would say, I have “unwavering conviction” at this point due to the collective thesis that has fully crystallized in my baggie-brain. My thesis will not change until there is verifiable information that invalidates my personal thesis. I’ve been confident, but I sure do like to have everything fit into a nice neat little box. I’m there now - and my positioning reflects that fact.</p>\n\n<h1>Secure your investment</h1>\n\n<p>First, I don’t know why anyone wouldn’t do everything they reasonably can to protect their investment - especially in a case as unique as ours. I hate to harp, but i<a href=\"https://www.reddit.com/r/ThePPShow/comments/15sgf8k/drs_is_an_extremely_compelling_proposition_for/\">if you haven’t read my DRS / Gringotts post</a>, it’s a good read if you hate yourself. I read it a lot and have DRSed a lot. From my throne of idiocy I believe that ensuring your investment is protected through whatever means fits your personal risk tolerance is a critical step. </p>\n\n<h1>Do shit with your investment shit based on your own shit / exit plan</h1>\n\n<p>Once your shares are secured, or you’ve convinced yourself “it’ll be fine” you need an exit plan. This is a highly personal thing. Nobody can make your plan but you, but you do need a fucking plan. Just like your thesis, this needs to be toiled over, researched, and tailored to your specific situation in contrast to the situation with the stock. Personally, my plan is to eat handfuls of dirt and gravel in between selling pre-determined batches at pre-determined intervals, assuming certain conditions are met. Those conditions are dependent upon how many times I compulsively scream at birds, share volume, successor share requirements, moon phase, and whether or not Okbet says “sorry that’s my cat” on a space call. Your conditions may vary, and they likely should.</p>\n\n<h1>Secure your stack</h1>\n\n<p>OkBet has done some amazing spaces on X in regards to how to handle your finances post MOASS that are absolutely worth listening to. There’s a lot of great info in there. Others have also written extensive and worth-reviewing post MOASS guides. Regardless, once this thing pops, the same investigative fervor that kept you on the ride into making sure you can protect your newfound wealth so you can successfully move on to the next step. </p>\n\n<h1>Secure yourself</h1>\n\n<p>We all have our shit. I’ve got all kinds of shit that I need to work on. After MOASS, I want to cut back on my battery and screw consumption. It’s simply not conducive to the person that I want to be. You may have another problem. A lot of us have mental shit that we need to work through. A lot of us have substance abuse issues - one conversation with me you’ll smell the Lysol on my breath and see shreds of the wipe sticking out of my rotting incisors. </p>\n\n<p>If you’re like me, and want to fully actualize yourself, now is the time to do that. This is not the time to feed your dark desires. In order to be your most free self, you must eliminate anything that doesn’t serve you or you are beholden to. No, I don’t mean putting your pets in a shelter, I mean being laser focused on turning yourself the person you’ve always wanted to be. </p>\n\n<p>We are blessed to have people like Pulte engaging with us, and I genuinely believe that he, along with RC, are both trying to set positive examples. They are principled, realistic, and very generous. This is what true leadership looks like. You cannot say that you want to change the world for the better, and then call someone a piece of shit because they called you a baggie. </p>\n\n<h1>Secure your future, be good ambassadors</h1>\n\n<p>When (if, amirite) this thing pops off - you’re going to want to rub it in the face of anyone that every made you question your investment. There are a lot of people that have sold because they couldn’t see what you see, or for other reasons. Former longs locked in losses, current longs are still staring at big losses unless you’re like my friend Dan that got in last week due to my DD. Fuck you, Dan. </p>\n\n<p>It doesn’t matter what your personal story or situation is. You will never, ever, regret taking the high road. Understand that a lot of the attacks that we have endured reflect poorly on the ones peddling in hate - and not on us. You will never regret meeting your newfound wealth with humility, love, and purpose. You won’t have to say I-told-you-so, and promise you’ll never wish you had. </p>\n\n<p>When I was a new manager heading up a new business in a very complex operation with a lot of strong personalities I had a litmus test that would help me. When faced with a decision, I would just ask myself “What would a really great manager do in this situation?” And then I’d do my damndest to execute that vision. And you know what? I’m incredibly proud of the work I’ve done. Let your work and actions speak for themselves. You are what you do, not what you think. Learn how to control yourself, and you can move the world.</p>\n\n<p>This money has the potential to give you everything you’ve ever dreamed of, it also has the potential to destroy you. Some of you will let this money ruin your life a la the lottery curse. For most of us, this will be our first taste of the possibility of “real” freedom - unfettered from the stress of worrying about not having enough money. Don’t let it turn you into “one of them.”</p>\n\n<p>This is a once-ever opportunity. If you haven’t considered planning for the journey you’re about to embark on it may be worth a shower thought or two. For me, personally, I have a full plan that includes hopping on a plane to another location in order to get my affairs in order at a petting zoo of my choosing. </p>\n\n<p>If nothing else - remember - our actions from here on out reflect on the community as a whole, RC, Pulte, and the brands that we have chosen to invest in. If their actions make this gift possible and you want to repay them, I can’t speak for them, but I’d bet they’d want you to take care of your fellow person and lead with love. And they’d want you to push. </p>\n\n<p>Let’s get this bread, then let’s fucking push. </p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/166ectl/rc_and_pals_have_control_through_the_series_a/", "time": 1693495918.0, "subreddit": "r/ThePPShow", "title": "RC and pals have control through the Series A Convertible Shares and Warrants", "text": "<!-- SC_OFF --><div class=\"md\"><p>I started digging into this last night, and I encourage everyone to check my work. I was ripping the volcano bag constantly while writing this, so I wouldn&#39;t be surprised if I messed some shit up here. Anyway, enjoy regardless. Remember, I eat Lysol wipes and compulsively pull my own hair out - so I wouldn&#39;t listen to me.  </p>\n\n<p>Let&#39;s get started. </p>\n\n<p>First off, venture to page 57 of the 10-K filed in June. You will see this.</p>\n\n<p><a href=\"https://preview.redd.it/74n40ks0oglb1.png?width=2080&amp;format=png&amp;auto=webp&amp;s=3755e2820b4ef5785df4c9484ab19c0074df746a\">Lots to digest here</a></p>\n\n<p>First, a little bit on Mezzanine financing. Essentially, it&#39;s a hybrid between traditional cash lending and equity. It often involves the issuance of warrants, and can be used to provide financing where traditional means have failed. For an acquirer, it can be a great way to hide true ownership while maintaining certain levers of control. It can also be a perfect method for a <strong>private company to go public through the shell company and works as a way to finance what is needed to make that happen.</strong></p>\n\n<p>Before BK, in the fiscal year ending February 25, 13,543 of those were converted to common share <strong>warrants</strong> at an average cost of $44.27, causing the company a total cost of <strong>$3.1 billion that would be recorded on the consolidated balance sheet.</strong> Did someone say NOLs?</p>\n\n<p><a href=\"https://preview.redd.it/q9v4e6n5oglb1.png?width=1554&amp;format=png&amp;auto=webp&amp;s=ae68c51ad5e7c4c823b555a306def071643d5f9c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/q9v4e6n5oglb1.png?width=1554&amp;format=png&amp;auto=webp&amp;s=ae68c51ad5e7c4c823b555a306def071643d5f9c\"></a></p>\n\n<p>When you convert these common warrants, the number of shares of common stock you get is the conversion price per share divided by the original cost of the Series A share ($10,000). The conversion price is the &quot;strike price&quot; per warrant to convert your warrant into Common Shares. It&#39;s worth noting as well, that even if you have a theoretical controlling stake via warrants - you don&#39;t have to report shit until they&#39;re exercised because they don&#39;t actually become real shares until then. If you used the Series A in conjunction with preferred warrants you can own a dead mans switch to take control of the company without being beholden to reporting requirements. Because warrants aren&#39;t shares until they&#39;re converted.</p>\n\n<p>So what happened to the other 13,xxx Series A shares that weren&#39;t converted to common warrants? In a typical mezzanine financial structure you don&#39;t have a lot of protections if the company goes bust. You&#39;re not considered senior debt and in many cases are fuk. Thankfully, for our suitor, that&#39;s not the case here.</p>\n\n<p><a href=\"https://preview.redd.it/7id54p7koglb1.png?width=2054&amp;format=png&amp;auto=webp&amp;s=45e433e97fa8b16a6d3630b84accdfbb4827f3ee\">Upon bankruptcy, the holder of the Series A shares is owed either CASH or shares</a></p>\n\n<p>Someone is still holding 13,xxx Series A preferred shares that may or may not have been converted yet. If it is RC, he very well could be in full control of the company now due to the bankruptcy triggering provision. Not to mention, if he decided to exercise his warrants post BK, the shares from the conversion would be insanely cheap AND he would have not needed to report the position due to OTC reporting requirement. The holder also has the option to convert to cash, <strong>which in my opinion would be one reason why our boi would be listed as a creditor.</strong></p>\n\n<p>In addition to this, the $3.1 billion dollar cost to the company is why we saw such insane Net Operating Losses for last year. If the holder of these Series A shares are also trying to use the shell company to take a private company public, they just paid themselves through this deal.</p>\n\n<p><a href=\"https://preview.redd.it/visk4fwyrglb1.png?width=2052&amp;format=png&amp;auto=webp&amp;s=8a9ea49d9d49f4311fa9dcfdd577b7ae149d6166\">109 million shares reissued out of treasury. If we use the TSO of 739.1 milly that puts that as 14.7&#37; of the company.</a></p>\n\n<p>Prior to BK, 109 million of those common stock warrants were exercised. If all of those went to one individual, and the shares outstanding is at 739.1 million, that represents <strong>14.7%</strong> (ahem, it&#39;s the number) ownership. Considering this sale was &quot;public&quot;, but with some caveats, it&#39;s not insane to think that multiple people hold these. Once bankruptcy was triggered, the rest of the Series A or warrants can then be converted.</p>\n\n<p>So let&#39;s assume for a moment that RC &amp; pals were trying to stay under the 5% reporting limit, and he / they weren&#39;t the only one exercising these Series A or the warrants. If he wanted to ensure he could take control of the company going into bankruptcy proceedings, he&#39;d have to do something at the last minute. Remember the vote for the reverse split? Remember how they had us vote TWICE for this? </p>\n\n<p><a href=\"https://preview.redd.it/wc7hqn6jpglb1.png?width=2068&amp;format=png&amp;auto=webp&amp;s=9de31c63442e25384809a189a01f5cf8e28bff8c\">Exchanged Preferred Stock Warrants for 10,000,000 shares, and another 5,000,000 shares upon receipt of shareholder approval for the RS</a></p>\n\n<p>Hypothetically let&#39;s say RC, Brett, and Carl all decided to gobble up these Preferred Warrants and Series A shares. In theory, they could exercise just enough to stay under the reporting threshold and hold the rest to be exercised at a later date. Further, if one of them wanted more significant control, they could have entered the deal for the 15,000,000 shares above and if the vote timing for the RS was less than 10 days before the BK filing it would have put them over the reporting threshold but they wouldn&#39;t be required to report it. Further, if they had over a 5% stake going into BK but also just happened to hold thousands of Series A shares that were to be converted going into bankruptcy - well - that sounds like a controlling stake to me. </p>\n\n<p>I very well could be totally off-base here, but if nothing else, I&#39;d love for this to spur a colorful discussion. Please comment and tell me where I&#39;m off-base, as I haven&#39;t spent a ton of time putting this together and wanted to get something to the community to get the discussion going. Thanks for reading and share your thoughts, please!</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/T5h_m4p9Xr328K_0qcz9zqF-rNwrkk7AeWAq-BaJFrA.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/165u4iy/why_a_10k_thats_a_yearly_reporting_requirement/", "time": 1693437652.0, "subreddit": "r/ThePPShow", "title": "Why a 10-K? That's a yearly reporting requirement that BBBY usually filed around February. I think I may have found the answer and it will likely jack your tits.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The 10-K excitement started when we saw the lawyers billing for it. This didn&#39;t make any sense to me - they don&#39;t have to file a 10k until next year. I&#39;ve also heard detractors repeatedly bring it up as a nothing-burger. </p>\n\n<p><a href=\"https://preview.redd.it/61u0gubiwblb1.png?width=1840&amp;format=png&amp;auto=webp&amp;s=3426d5c35b955b311d06189e6fb1500e46d4b592\">There&#39;s the billing in question</a></p>\n\n<p>At first, I thought maybe they meant 8k. But no, there&#39;s a separate line item billing for that below. Also, remember this is a  statement that is submitted to the judge and has to be approved. If there was no logical reason for them to be billing for an unneeded 10K - that&#39;d be bad. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/o824j2ptwblb1.png?width=1828&amp;format=png&amp;auto=webp&amp;s=aa84aa784c4cf0dc9e4e986c5dc54e12646254bb\">So they didn&#39;t mean 8k</a></p>\n\n<p>So, it&#39;s clear this isn&#39;t a mistake. But why would they file a 10-K? Well, they may not be. They&#39;re likely filing a 10-KT - and the charge on the statement is worded that way in order to not give up the game - while still making it clear enough to where everyone knows what they&#39;re referencing. Even if this is NOT the case, there&#39;s still a really great reason to file a 10-K now.. which you&#39;ll see shortly.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/6h3iz3i6xblb1.jpg?width=1179&amp;format=pjpg&amp;auto=webp&amp;s=d71e7306be25cb386e492afc3582810cd9c4a4f4\">So the reporting time changes sometimes due to mergers and acquisitions, and this report is required to filed. </a></p>\n\n<p>So you need to file this 10-KT when your reporting period or timeline changes, commonly as the result of a <em>merger or acquisition.</em> For a second, lets say they actually aren&#39;t going to file this form - and the 10-K line item is correct. Well, how does that make sense?</p>\n\n<p>The 10-K can also be used as a vessel to deliver the terms of the merger or acquisition to the SEC as part of the reporting requirements. They very well may file a 10K to detail the terms of the acquisition, or they may throw that in the 8-K. If they&#39;re changing the reporting period, I&#39;d venture to guess we&#39;d see a 10-KT and an 8K. But even if they meant 10-K, it surely seems there&#39;s a logical reason for that. </p>\n\n<p><a href=\"https://preview.redd.it/ikgx0v4txblb1.jpg?width=1179&amp;format=pjpg&amp;auto=webp&amp;s=5354be2e1fa9c53c53510cf6d4949733fec9c372\">Oh, well would you look at that?</a></p>\n\n<p>Can anyone tell me any other logical reason why this would be created/billed for, other than an upcoming merger or acquisition? I&#39;m not a lawyer, and I eat Lysol wipes and rip my own hair out compulsively so you shouldn&#39;t listen to me. Please poke holes in this, but if nobody can.. well.. 🚀</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/w0jetPkhe1-QfmfNmifdDaw0Bk9ailXl73wQSoER-Js.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/gallery/164yyzg", "time": 1693353749.0, "subreddit": "r/ThePPShow", "title": "Teddy shown in auto-ship preview for Chewy app", "text": "<!-- SC_OFF --><div class=\"md\"><p>Credit to @EvaderDirt on Twitter.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/D6BffFJh6ke3Qnw1gL30y-DHFnFBUaXYOT1lHaU0Xp0.jpg\"/></div>"},
{"username": "Famous_Variety", "url": "https://www.reddit.com/r/ThePPShow/comments/15sgf8k/drs_is_an_extremely_compelling_proposition_for/", "time": 1692163268.0, "subreddit": "r/ThePPShow", "title": "DRS is an extremely compelling proposition for our situation. Hear me out.", "text": "<!-- SC_OFF --><div class=\"md\"><p>First off, let&#39;s get this out of the way. I don&#39;t REALLY care what you do, but I&#39;m going to tell you what I&#39;ve done and why. None of this is financial advice; I&#39;m a terribly stupid person and you shouldn&#39;t listen to me. Seriously do your own research and don&#39;t just wait on someone to tell you what to think.</p>\n\n<p>Alright. So, like many of you, I&#39;ve been in this play for well over a year now. Boy, we&#39;ve seen some insane shit along the way. Haven&#39;t we? If you&#39;ve been in either GME or BBBY and have kept your finger on the pulse, you&#39;ve also seen an incredible amount of fuckery from brokerages. Lawsuits. People jumping off fucking buildings. Insane price action, on and on. Surprise CEO interviews days before bankruptcy that are entered into SEC records. We could keep going.</p>\n\n<p>IF this thing is heavily shorted, and there is to be a conversion of sorts, that means the &quot;real squeeze&quot; lies in the successor shares that will be issued. They COULD issue these as tokenized securities. If real supply and demand laws are implemented overnight, do you REALLY think that your broker won&#39;t fuck you up the ass until you&#39;re bloody? Think about it. They legally have you by the balls. They can give you back your principal and tell you to fuck off because &quot;someone&quot; gave you fake shares and they have no way to honor the dividend.</p>\n\n<p>If we&#39;re correct in the thesis that there is something more going on here, and that this is also heavily naked shorted, your brokerages will have every incentive to fuck you if those &quot;synthetic&quot; shares are about to be extinguished. Now, with the current stability of the market it&#39;s safe to say that if we&#39;re blasting off, so is the basket, along with other baskets as margin calls come in. There&#39;s a decent chance that your brokerages will be dealing with ABSOLUTE HELL and chaos on these days. Again, they will fuck you - or there is at least a non-zero chance that they will.</p>\n\n<p><a href=\"https://preview.redd.it/3d6bmvbkheib1.png?width=1178&amp;format=png&amp;auto=webp&amp;s=d7e46a257f0c51aa2fd6b266590ce68a44a4288e\">Own your shit or you could be fucked when times are fucked.</a></p>\n\n<p>When the &quot;shills&quot; say that your BBBYQ shares are going to be extinguished they are right. Your BBBY shares, if you want to stay on the ride, are tickets. Your tickets are only guaranteed to be good through one method. That method is DRS - regardless of how shitty AST is. Further, I haven&#39;t heard any convincing arguments on why not to do it. The ones I have heard are as follow, and I welcome rebuttals to any of my points.</p>\n\n<p>**I don&#39;t want them to get stuck in transit and &quot;miss the squeeze.&quot;**</p>\n\n<p>First off, if you&#39;re here for successor shares - that&#39;s where the real squeeze will be. If you&#39;re not, and you&#39;re expecting this to play out fully on the OTC market and we&#39;re right about how heavily this shit is shorted the squeeze will take weeks. You will not miss the boat.</p>\n\n<p>Also, you could consider sending a scout, followed by waves of reinforcements. This method gave me peace of mind when I started the process. I started by sending a very small portion of my position to make sure everything went okay, and have been transferring in batches since then.</p>\n\n<p>In my experience, the shares do not leave your brokerage account until they automagically appear at the transfer agent. I&#39;ve had them poof at 4pm and I called before 5 and they were reported there. Very little risk with this approach in my case. Your case, of course, could be different. This post is about me though, I don&#39;t give a fuck what you do.</p>\n\n<p>Most brokerages have these transfers done in 3 days. I was always sure to ask how long it was going to take and if the answer was unsatisfactory I&#39;d move my shares to another brokerage that had a more satisfactory answer. Yes, now you&#39;re moving twice but again, you want this shit or not?</p>\n\n<p>**AST is balls / Difficult selling with no online interface / new signups unavailable online**</p>\n\n<p>Yeah. Again though, I for one, am here to sell a portion of my position while BBBYQ is in OTC which I hold in a brokerage account. Those are my &quot;fast money&quot; accounts, which, if we&#39;re not all just absolutely schizophrenic and there is a squeeze to be had in OTC I will be able to sell those and pay off all my debts, etc. However, if this thing REALLY gets going in conjunction with a steep decline in the broader market I will either move to DRS or sell early before settlement goes tits up.</p>\n\n<p>So yeah, AST isn&#39;t the best. They&#39;ve had their online portal down for months, they&#39;re really making you jump through some hoops to get registered. All moves that would unequivocally show in a court of law that you&#39;re entitled to these fucking successor shares because AST was so ass. I absolutely do not think that&#39;s what&#39;s happening, btw - but it doesn&#39;t hurt.</p>\n\n<p>No good interface. You gotta call in to sell. They charge you 12 cents per share to sell. If it&#39;s squeezing, that&#39;s nothing (assuming you want to sell), but if you wanted to liquidate at *these* prices you&#39;d really eat shit. So maybe don&#39;t do that, or do, I don&#39;t give a shit. You can always transfer your DRSed shares back to your brokerage if you must.</p>\n\n<p>You know what AST **won&#39;t do** though? They won&#39;t go down during a cataclysmic financial event and fuck you out of your shares to save their own asses. AST is like fucking Gringots from Harry Potter and you&#39;re nothing but an aspiring wizard. You gonna let some evil other banker fuck you out of your wizard shit? You can say that it won&#39;t happen, but again, there&#39;s a non-zero chance that it could AND you&#39;ve already told them it&#39;s cool when you signed the terms of service.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/2l276t3okeib1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=0597354839cdf180f5a3f46b089cb927a1d6e5a8\">You may have to talk to this guy to sell</a></p>\n\n<p>We know that the DTCC already reported millions of shares that shouldn&#39;t exist even if using the HIGHEST number in the TOS as the float. If we see the Amazon competitor behemoth unveiled along with a flurry of reverse mergers every one of those stocks will squeeze. Every one of these stocks likely will be issued shares of the companies they&#39;re merging with, along with any applicable holding company. We know VIA COURT FILINGS that there won&#39;t be enough to go around. We also know that it&#39;s find out time for the shorts, there is full precedent for them issuing a ERC20 token on a to-be-unveiled network as the successor shares.</p>\n\n<p>**It&#39;s expensive/a big pain to DRS**</p>\n\n<p>That is fair. I know that many people do not have access to DRS. In my personal situation it was free every time, and there are often work arounds to eventually get them DRSed, but it can be a real pain depending on your particular situation.</p>\n\n<p>**Brokers would never fuck me that hard, they&#39;re well capitalized, have insurance, etc&quot;**</p>\n\n<p>Imagine I hand you a bag of skittles the size of your fucking head. Every skittle in there is normal, with the exception of 1. The different skittle makes zeroes out your brokerage account. How many are you gonna eat?</p>\n\n<p>-----------------</p>\n\n<p>Alright - I&#39;m tired of writing this shit. I&#39;ll leave you with one final thought. When Pulte went on PP-show the VERY first real question he asked you guys were your thoughts on DRS and repeatedly said that it should &quot;be explored.&quot; This was his follow-up question *immediately* after talking about the possibility of an event that would basically kick off the liquidation of these predatory shorts.</p>\n\n<p>Pulte coming on the show was a big deal in my opinion. I personally subscribe that he says what Cohen can&#39;t, and has taken all legal precautions to ensure he&#39;s not saying too much/doesn&#39;t know too much. Cheng does this as well, but he&#39;s more ninja like where Pulte is pooh bear.</p>\n\n<p>He genuinely likes the community and he&#39;s a real one, but I believe that there are subtle nods from him that we&#39;re on the right path. He has nothing to gain otherwise, in fact, it&#39;s quite the opposite. He has said before that he&#39;s just out here engaging with the community but he KNOWS what type of people we are and isn&#39;t just out here promoting homes to people that are about to lose a ton of money.</p>\n\n<p>You simply cannot believe all the tinfoil, including that if we&#39;re right about this we&#39;re going to take a lot of money from a lot of wealthy people. If you don&#39;t think they will do everything in their power (which is immense) to fuck you (even completely legally), then you&#39;re braver than I. Again, they don&#39;t even have to break the law - but we know they likely will anyway if push comes to shove.</p>\n\n<p>I feel positioned for whatever is coming. However, I&#39;m not putting all of my eggs in one basket and I&#39;m watching the fuck out of the basket that isn&#39;t in the magic cage @ Gringots.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/gKMbSIhJgbhKMjgM9TnAILyoPw_-TEt_wrENnGAoFiI.jpg\"/></div>"}]