[{"username": "Far-Butterscotch-255", "url": "https://www.reddit.com/gallery/171ehzd", "time": 1696604281.0, "subreddit": "r/ThePPShow", "title": "Wat doing Larry? Thanks @Real_eyezzz for spitting 🔥 on 🐉Fly to spark this off.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not: Financial advice; mystical zoology/entomology </p>\n\n<p>Ok I’m gonna break this down in a succinct format (bullet point style) because I’m still in the middle of additional digging so feel free contribute or poke holes at this (gently)😎</p>\n\n<p>Note: In order to understand the context, refer to LC’s latest tweet: <a href=\"https://x.com/larryvc/status/1710285171746853372?s=46&amp;t=MDyOhQrup1zanR46adLTyQ\">https://x.com/larryvc/status/1710285171746853372?s=46&amp;t=MDyOhQrup1zanR46adLTyQ</a> \nYes he’s talking specifically about qualities of a desirable CEO 👊</p>\n\n<p>1) LC and RC both dissolved Dragonfly on September 22, 2023 (in Florida)\n2) RC announced he was CEO of GameStop 6 days later \n3) LC tweeted (see screenshot) that he has “No involvement with other PUBLIC companies such as BBBY or BBBYQ” — he was being 💯 truthful \n4) New entity not named BBBY or BBBYQ — private? \n5) New CEO? \nStay tuned. Buckle the F up. 🦋</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/POD2ZlcIXia_qKZ7NImrD526W9HduvlTmfg0uinpYA0.jpg\"/></div>"},
{"username": "Far-Butterscotch-255", "url": "https://www.reddit.com/r/ThePPShow/comments/16wzdbn/motherofallshortsslaughtered_perfectly_planned/", "time": 1696161811.0, "subreddit": "r/ThePPShow", "title": "Mother-of-all-Shorts-Slaughtered. Perfectly planned and propitiously timed - more Jewish tinfoil to get your tits jacked for the coming week", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not: Financial advice; religious rant; divisive rhetoric </p>\n\n<p>As I’d predicted all along on the PP Show, the good guys on this play are all observant Jews who “believe” in doing the right(eous) things. Once again, our heroes behind this unprecedented “mother of all shorts slaughtered” are the venerable RC/CI/HBC/DOM (and potentially a sleuth of other supporting characters). I’d called into the Show just prior to Rosh Hashanah and predicted that the plan will begin to be revealed after Yom Kippur. This is a most auspicious time on the Jewish calendar. Refer to my previous post on the significance of YK:</p>\n\n<p>Sure enough, we’ve all witnessed what transpired on Friday at the close of the market. I cannot emphasize enough just how carefully and meticulously precise the timing of the events on this play, which must have been thought-out painstakingly months (if not years) prior to its implementation.</p>\n\n<p>As far as I’ve been able to track, every significant event thus far has occurred on or coincided with a Jewish event of significance on the Hebrew calendar. For example, let’s examine this past Friday. Aside from being the final trading day for the ticker symbol BBBYQ,  Friday 29 of September is known as Erev Sukkot September 29—Tishrei 14 “The Day Before Sukkot” where “it is traditional to give extra charity, for true joy is sharing with others,” for which we were all given the gift of “hope and renewal” which characterized Sukkot with a series of juicy docket drops just before the beginning of the holiday of Sukkot at sundown. </p>\n\n<p>Why this coming week is the MOST JOYFUL week of all — as our heroes have planned it all along, Sunday night at sundown marks the beginning of the “intermediate days” of Sukkot. Said intermediate days are quasi holidays, known as Chol Hamoed where Jews are “given a free pass” by the Torah to conduct business and mundane activities. </p>\n\n<p>My dear fellow regards, I propose to you as Heaven and Earth as my witness that the upcoming week of intermediate days of Sukkot known as Chol Hamoed (nightfall on October 2 until sundown on October 6 in 2023) as the most monumental days the modern global financial system has ever witnessed. It shall be a period of unprecedented prosperity for those of us who are still here hodling with unwavering conviction in spite of countless hate and vitriolic attempts by those who doubted us. It shall be a period of staggering defeat of financial terrorism and its numerous cohorts at historic proportions. It shall be a period where our collective hopes, dreams and aspirations will finally be answered, and our convictions vigorously vindicated. </p>\n\n<p>I have stated all along that this was more than a money play for the heroes behind it. It is deeply spiritual, esoteric, and altruistic in nature. As such, it will meet the approval from Above. </p>\n\n<p>Semper Fi 🦋</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Far-Butterscotch-255", "url": "https://i.redd.it/ysbpezx48vqb1.jpg", "time": 1695849803.0, "subreddit": "r/ThePPShow", "title": "Make no mistake. He’s the same one who declared boldly that…", "text": "<!-- SC_OFF --><div class=\"md\"><p>“We are trying to do something that nobody in the retail space has ever done, but we believe we are putting the right pieces in place and we have clear goals: delighting customers, and driving shareholder value for the long term.&quot;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ysbpezx48vqb1.jpg\"/></div>"},
{"username": "Far-Butterscotch-255", "url": "https://www.reddit.com/r/ThePPShow/comments/16qw187/whats_an_exit_strategy_for_the_younger_regards/", "time": 1695556870.0, "subreddit": "r/ThePPShow", "title": "What’s an exit strategy? For the younger regards out there, here’s a post I saved two years ago (on GME) that may be useful in the coming days…", "text": "<!-- SC_OFF --><div class=\"md\"><p>🙏 Huge credit and shout out to <a href=\"/u/NHNE\">u/NHNE</a>. NFA. </p>\n\n<p><a href=\"https://reddit.com/r/GME/s/B45vyi4sZx\">https://reddit.com/r/GME/s/B45vyi4sZx</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Far-Butterscotch-255", "url": "https://www.reddit.com/r/ThePPShow/comments/16eoz2n/i_have_a_dream_postmoass_we_team_up_with_pulte_to/", "time": 1694314865.0, "subreddit": "r/ThePPShow", "title": "I have a dream. Post-MOASS. We team up with Pulte to build PUD (Planned Unit Development) homes across America to help the working class. Let’s restore the American Dream.", "text": "<!-- SC_OFF --><div class=\"md\"><p>BlackRock and other financial terror organizations are continuing to gobble up homes in the U.S. at frightening velocity and scale, rendering home ownership a thing of the past for most Americans, while further widening the line of demarcation between the haves and have-nots. Their sinister plans to control the citizenship by exerting dominance over one of humanity’s greatest needs (shelter) must be combatted with everything at our fucking disposal. We need all hands on deck for this fight if we want to ensure that we, and our children, can still have a roof over our heads in the coming days and years. \nIf this isn’t yet another reason to BUY, BURN, BURY, YERK systemic financial terrorism once and for all, I don’t what is. Semper Fi ⚔️</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Far-Butterscotch-255", "url": "https://www.reddit.com/r/ThePPShow/comments/16d9tbr/short_sellers_are_the_dumbest_stormtroopers_of/", "time": 1694177696.0, "subreddit": "r/ThePPShow", "title": "Short sellers are the dumb(est) stormtroopers of the (fraudulent) investing galaxy", "text": "<!-- SC_OFF --><div class=\"md\"><p>These insidious financial terrorists will never learn. They will continue to cheat, distort, intimidate and character assassinate anyone who stands in the way of their nefarious schemes. Armed with the propaganda machine of the MSM, they are more emboldened than ever, especially when their financial (and emancipated) lives are at stake. For far too long, they have crushed the dreams of the working class, crippled the morale of the unsuspecting masses and corrupted every facet of our government. Generations upon generations of hardworking families’ blood and sweat earnings have been wiped out to feed their insatiable appetite for money, power and control. But now their day of retribution has arrived. Against all odds, a group of disenfranchised regards, many of whom (including myself) have been manipulated, abandoned and ridiculed as pawns in senseless warfare abroad to feed the same financial terrorists. Others, having witnessed unspeakable atrocities committed against their forebears, some of whom barely surviving through abject poverty with the measly crumbs left over after a lifetime of back breaking slave labor, are galvanized with unrelenting fervor. </p>\n\n<p>I have said this all along. This isn’t about money. This is justice, the old-fashioned American way. This is for the countless bloodshed and systematic oppression of those we are fighting for. This is my final war, and I ain’t got time to bleed. Semper Fidelis ⚔️⚔️</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Far-Butterscotch-255", "url": "https://www.reddit.com/r/ThePPShow/comments/165hcdc/this_is_personal_now_from_empower/", "time": 1693408169.0, "subreddit": "r/ThePPShow", "title": "This is personal NOW. From Empower 🇺🇸", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have never been vocal on Reddit until now. As a GME OG since 3/2001, I’ve watched in disgust while the entire financial terrorist network joined forces to fuck retail over and over as their SEC cronies watched PornHub and merely postured and offered lip service about creating a fair and equitable capital market for ALL. </p>\n\n<p>I have sat in disbelief all the while thinking that the country I fought and nearly gave up my life for is NOT capable of condoning continuing egregious acts of financial crimes against her own citizenry while corrupt politicians and public officials lined their pockets in secrecy. </p>\n\n<p>I, alongside many of my brethren, have bled for this nation, one which supposedly stood for “One nation under God, indivisible, with liberty and justice for ALL”. While the U.S government continues to reap their ill-gotten gains from orchestrating senseless wars overseas, many of whom are backed by the same financial terrorists fronting Wall Street, the blood of our nation is a price these vile subhumans are all too eager to leverage. </p>\n\n<p>As a combat Marine vet, I am denied adequate healthcare to address a myriad of health issues incurred during the Gulf War’s now infamous “Burn Pits” and Gulf War Syndrome. While the VA has categorically denied my claim for disability citing my health conditions (which still persist some fucking 30 years later!) as “combat-related stress”, my medical bills have piled up and crippled me and my family until the fucking day that I leave this God forsaken earth. So many of our vets suffered similarly, if not far worse. Long before Camp Lejeune, you will recall Agent Orange in Nam and how long the government has tried to hide that horrible secret. I can go on and on. </p>\n\n<p>Still I am one of the fortunate ones. I have a place to called home. A family and two incredible children who still need me. This is why I am in this mother fucking fighting hole. Hunkered down, I will continue to buy, hodl, and shine the light upon the darkness of the corrupt financial terrorists network long after this play and GME. This isn’t about money. This is now personal. It is my private and perpetual war against terrorism of the most insidious kind. It is time we rob the Robber Barons! </p>\n\n<p>And I will not stop until veteran homelessness is ceased in America, and with my winning spoils, I will ensure that every veteran will receive the proper PTSD care he or she deserves. Semper Fidelis!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]