[{"username": "FatDonkJr", "url": "https://www.reddit.com/r/ThePPShow/comments/17vwdxq/who_turned_on_buybuybaby/", "time": 1700062956.0, "subreddit": "r/ThePPShow", "title": "WHO TURNED ON BUYBUYBABY?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Whoever went on the buybuybaby site the other day and clicked that little lock in the top right and put the password in, thank you. My request has been answered, and now I&#39;m going to spend 50k on this site. </p>\n\n<p>My body is ready. So is my wallet.  </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "FatDonkJr", "url": "https://www.reddit.com/r/ThePPShow/comments/17v6yv2/i_said_it_once_and_ill_say_it_again_my_body_is/", "time": 1699981950.0, "subreddit": "r/ThePPShow", "title": "I said it once and I'll say it again... MY BODY IS READY!!!!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>They are out of options. They know it. We know it. </p>\n\n<p>That goofball this morning posting an incomplete version of a certain docket to sow confusion was the last piece for me. If I&#39;m being honest, he got me for a second (I was a sleepy boi). Instead of having a panic attack or getting worked up my brain just calmly went through everything we already knew. I reread it in the proper context, only then to realize THE DOCKET SHOWS THAT THERE WAS A MATERIAL CHANGE IN OWNERSHIP, and that they are so out of moves that some poor bastard had to get up this morning and try their best to bring about fear. And what happened? We all slowly woke up, went through it and realized nothing has changed - get your snacks ready cuz its go time. </p>\n\n<p>For anyone who has ever spoken with me you know I&#39;m very patient. I&#39;ve waited and waited, for this moment to come. I&#39;m holding out for something so great and so world changing that I&#39;m willing to sleep in the mud until we achieve it. I&#39;m an old ape - lucky enough to have gotten into the game in the beginning of this meme mess - only to bleed and bleed and bleed while we wait patiently for our trip to space.  I&#39;ve felt like we were at the end a few times before, but as I sit here writing this now I know its different. They had to let the enemies on the other side hang themselves by their own hands. </p>\n\n<p>One thing I don&#39;t know, and I&#39;d realllly love to know is...</p>\n\n<p>WHO IN THE HOLY HOT HELL OWNS BUY BUY BABY?!?!?! Because the wife and I need to make a baby registry and I refuse to use any other site then ours to do it. Oh and it opens on the 18th. So if anyone knows the password for <a href=\"https://buybuybaby.com\">buybuybaby.com</a> just head on over there, click the lock in the top right and get it opened up and working - cuz my wife needs some ISH FOR THE BABY, BABY!</p>\n\n<p>&#x200B;</p>\n\n<p>MY BODY IS READY. I love you all (even the doomers who try to get me!)</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"nsfw\"/></div>"},
{"username": "FatDonkJr", "url": "https://www.reddit.com/r/ThePPShow/comments/17p3cac/my_body_is_ready/", "time": 1699279190.0, "subreddit": "r/ThePPShow", "title": "My body is ready", "text": "<!-- SC_OFF --><div class=\"md\"><p>I got into crypto early and waited. People told me I was wrong.</p>\n\n<p>Got into GME early and waited. People told me I was wrong.</p>\n\n<p>Got into sweet sweet Bobby early and waited. People told me I was wrong.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m done waiting. CEO of BEYOND/OVERSTOCK/BBBY just quit as they are about to ring the bell?! They gonna merge all this stuff back together in some beautiful 26D chess super forehead move? I WOULD if I was them. </p>\n\n<p>I want a WWF entrance from our new CEO... or maybe a tag team duo?</p>\n\n<p>I love you all. Lets get ready to change the world. &lt;3 </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]