[{"username": "fattstax", "url": "https://www.reddit.com/r/ThePPShow/comments/152ag57/berkshire_hathaway_buys_into_jefferies_does/", "time": 1689619901.0, "subreddit": "r/ThePPShow", "title": "Berkshire Hathaway buys into Jefferies: Does Warren Icahn see future opportunity knocking?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Jefferies: The Newest Financial In Berkshire Hathaway&#39;s Portfolio</p>\n\n<p>Why Warren Buffett Bought Jefferies</p>\n\n<p>Why Warren Buffett Bought Jefferies: Berkshire Hathaway, the investing conglomerate run by billionaire Warren Buffett, recently disclosed that it had bought $16.47 million worth of stock in Jefferies Financial Group.</p>\n\n<p>This move is a bit of a surprise because Berkshire Hathaway has recently eschewed financial service sector stocks. So, why did Buffett make this bet?</p>\n\n<p>Jefferies Financial Groups services</p>\n\n<p>Jefferies Financial Group is an investment bank and asset management firm that specializes in providing a full range of financial services to institutional and private clients.</p>\n\n<p>Its core business focuses on serving clients in the global capital markets, including equity underwriting, debt financing, mergers and acquisitions advisory, securities trading and research, sales and trading execution, structured finance, wealth management solutions and more.</p>\n\n<p>Though it isn’t a household name like Goldman Sachs or JPMorgan, the firm has played a significant role in some of the most high-profile financial transactions of recent years. With revenues of $1.52 billion in the third quarter of 2022, Jefferies Financial Group is the 8th largest investment bank in the world.</p>\n\n<p>The recent performance of Jeffries Financial Group</p>\n\n<p>From the beginning of 2020 until the end of 2021, Jefferies Financial Group experienced tremendous growth in its business, having a record-breaking year in 2021.</p>\n\n<p>This growth was driven by a surge in demand for underwriting services, a strong performance from its trading and sales divisions and higher asset management fees.</p>\n\n<p>The company’s share price rose to a decade-high of $43.36 and reported revenues of $8.18 billion, up 36% year-over-year.</p>\n\n<p>Despite this impressive performance, the business has slowed down considerably in 2022. The company posted a third-quarter net income of $195 million, down 52% year-over-year.</p>\n\n<p>This is due to multiple factors, including:</p>\n\n<p>The Russia-Ukraine conflict: The conflict in Ukraine created geopolitical uncertainty, leading to a decrease in overall trading volume. Coupled with the fact that the pandemic has hampered global economic activity, this has created a challenging environment for Jefferies Financial Group. During this time of economic uncertainty, investors exercise caution, and companies are more likely to refrain from going public or issuing more debt.</p>\n\n<p>Rising interest rates: Interest rates have been rising since late 2021. This has decreased institutional demand for debt financing, as companies find it more expensive to access capital through traditional means. High-interest rates also affect the volume of IPOs and M&amp;A activity, as businesses are less likely to seek these options when financing costs are high. In addition, the recent IPOs of Coinbase, Rivian, and Robinhood have seen all three companies’ share prices decrease by as much as 70%. Seeing this trend, many businesses will be holding off on doing public, meaning that Jefferies Financial Group’s services are less likely to be in demand.</p>\n\n<p>Buffett’s long-term outlook</p>\n\n<p>When looking at the current environment, many investors appear to have succumbed to short-term thinking. They focus on stocks with high growth potential and try to capitalize on quick profits. However, Warren Buffett famously has a longer time horizon.</p>\n\n<p>He tends to look for companies with established track records that will continue to perform well over time. In the case of Jefferies Financial Group, Buffett saw an opportunity to buy its stock when it was undervalued due to market conditions beyond its control.</p>\n\n<p>Some of the upsides of Jefferies Financial Group Warren may have been looking at include:</p>\n\n<p>Healthy dividend: Buffett has an affinity for companies with a healthy dividend yield, and Jefferies Financial Group is no exception. Berkshire Hathaway collected nearly $13.5 billion in dividends in 2021, and they hope the recent move into Jefferies will help them increase that number in 2022. Jefferies Financial Group has a healthy dividend yield of 3.2% (as of November 2022), which is higher than the average for its peers. It also has a dividend payout ratio of 28.17%, which is sustainable and indicates the company commits to returning value to its shareholders.</p>\n\n<p>Valuation: Jefferies Financial Group has been trading at a discounted valuation compared to its peers. This makes it an attractive proposition for Warren Buffett, who is known for his value investing style. With the current market conditions putting downward pressure on stock prices, Jefferies Financial Group’s shares are trading at a discount to their intrinsic value.\nLeadership: The company has an experienced leadership team; CEO Richard Handler has been at the helm since 2001 and is one of the longest-serving bosses on Wall Street. He has extensive experience navigating through volatile markets and leading the company during times of growth. This, combined with the company’s established track record, likely gave Buffett the confidence to invest in Jefferies.\nDiversification: Diversifying into different areas, such as asset management, wealth management solutions, and structured finance, provides additional revenue streams for Jefferies Financial Group, which can help them weather any downturns in the future.</p>\n\n<p>Should you invest in Jefferies Financial Group Stock?</p>\n\n<p>Overall, Jefferies Financial Group was an attractive investment opportunity for Buffett, who is known for taking a long-term view of investments.</p>\n\n<p>Though its 16 million dollar stake is a drop in the bucket compared to the more extensive holdings of Berkshire Hathaway, which exceeds $340 billion, it still indicates that Buffett is confident in the long-term future of Jefferies Financial Group.</p>\n\n<p>Investors that have yet to add a financial services company to their portfolios may want to consider it. Investment bank stocks in general can bring several benefits, including:</p>\n\n<p>Generating significant returns on equity due to their ability to leverage their assets and drive strategic decisions to create value for shareholders.</p>\n\n<p>Providing exposure to some of the most attractive sectors and industries worldwide, including digital banking, fintech, private equity, venture capital, fixed-income trading and more.</p>\n\n<p>All in all, Jefferies Financial Group has a history of success in the financial sector, and its diversified revenue streams provide additional stability. If your portfolio is in need of a quality dividend stock, then Jefferies Financial Group could be a good choice.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]