[{"username": "Fearless-Pair3429", "url": "https://www.reddit.com/r/ThePPShow/comments/16ihutz/they_filed_the_8k/", "time": 1694696459.0, "subreddit": "r/ThePPShow", "title": "They filed the 8-k", "text": "<!-- SC_OFF --><div class=\"md\"><p>Let’s Fucking gooooo!!!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Fearless-Pair3429", "url": "https://www.reddit.com/r/ThePPShow/comments/126t39c/this_must_be_part_of_the_plan/", "time": 1610585473, "subreddit": "r/ThePPShow", "title": "This must be part of the plan", "text": "In looking through this info, are they not saying looks guys we need $300MM to pay off the ABL. We have 245MM shares to issue so we might not have enough to raise the $300MM without a reverse split. If we don’t raise the $300MM we’ll probably take a trip to Burger King. \n\nIf we do raise the $300MM we’ll be good and we will file it on an S-1 (generally used for IPOs). So let’s get the reverse split approved and done so we we can raise the money we need while simultaneously issuing the stock we need to finalize our plan.\n\nSpin off, save company, fuk Hedgies.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Fearless-Pair3429", "url": "https://www.reddit.com/r/ThePPShow/comments/11wxoog/this_play_is_going_to_be_huge_fud_articles_make/", "time": 1610585473, "subreddit": "r/ThePPShow", "title": "This play is going to be huge. FUD articles make no sense", "text": "I just read the article on WSJ  titled “Bed Bath & Beyond Stock Falls 21%, Complicating Further Fundraising”. It goes on to say how they may no longer be able to get additional funding from their deal as a result of the recent decrease in price. \n\nGet fucked WSJ. You’re telling me a company lined up financing to avoid BK then released information that would tank that and not be able to access any more? Then why bother I’m the first place?\n\nTheres no fucking way!! Something else is at play here and can’t wait for all of us diamond balled apes to reap the rewards when we find out WTF is going on. \n\nUntil then stay Zen! 🚀🚀🚀", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]