[{"username": "FIFOdatLIFO", "url": "https://www.reddit.com/r/ThePPShow/comments/16gufvi/being_suppressed_on_rmovies/", "time": 1694532714.0, "subreddit": "r/ThePPShow", "title": "Being Suppressed on /r/movies", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sorry this kind of a weird post but afraid to make this on SS since.... well y&#39;all get it haha. Not as much of a Bobby post as a Jimmy post although I think its important for any &quot;meme&quot; stock community. Was a post yesterday talking about &quot;dumb money&quot; on <a href=\"/r/movies\">/r/movies</a> and I think about Ken Griffin suing about his portrayal and it or some bs. Anyways.... I post out that Kenny G did a lot more than just sit by but also actively shorted GME as well. So that obviously gained a lot of attention from meltdowners. I got baited and called them dumb so got a 4 day banned although may turn into a perma since I reported one of the mods. But this is what I wanted to ask/see.</p>\n\n<p>ONE OF THE MODS LITERALLY SAID &quot;Look into cult reprogramming resources&quot; This is from a mod of a fucking <a href=\"/r/movies\">/r/movies</a> channel! (<a href=\"https://imgur.com/a/WwXYFxa\">https://imgur.com/a/WwXYFxa</a>). So literally on subs that have nothing to do with investing talks about &quot;meme&quot; stocks are being targeted. I mean my 4 day ban or whatever is completely legit I went hard on the person lol but more of a weird comment from a mod of that sub.</p>\n\n<p>Guess wondering if there is anyway to report them and get them banned from being a mod? If mods are going to pretend to be almighty gods of channels then they should be held to much higher standards and not being putting out their personal opinions to people.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "FIFOdatLIFO", "url": "https://www.reddit.com/r/ThePPShow/comments/15lpgx0/ight_i_100_believe_bbby_sub_compromised_but_it/", "time": 1691517727.0, "subreddit": "r/ThePPShow", "title": "Ight I 100% believe Bbby sub compromised but it actually has me insanely bullish.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I know people been saying that here for awhile and I kind of believed it but fuck man lol I actually somewhat have proof. See a comment on there from someone who tries to sound like they know what they saying. Basically how everyone invested in Bbby is f&#39;d yatta yatta yatta. Nothing new right we see this shit all the time. However, I decide to look into their post history and its two weeks of constantly shitting on Bbby (amongst some magic the gathering posts and some others). So this person for the last 2-3 weeks between their daily MGT posts and gaming and couple other subs they follow is just spamming comments about how fucked Bbby is. I mean.... who does that? REALLY WHO DOES THAT? We&#39;ve asked that question a lot haven&#39;t we? Who would spend a bunch of their time researching and shitting on a company they have no financial interest in? It doesn&#39;t really make sense does it?</p>\n\n<p>But you know what&#39;s the even better part of their post history? They go dark for awhile hardly any posts before this but almost exactly one year ago THEY WERE PUMPING STOCKS ON WALLSTREETBETS LMFAO. Like spam posting. Uranium &amp; other mineral stocks lmfao. </p>\n\n<p>Not Sus at all right? </p>\n\n<p>THESE ARE THE &quot;PEOPLE&quot; WHO ARE SHITTING ON THIS COMPANY. THAT IS NOT NORMAL. NOW ASK YOURSELF WHY. </p>\n\n<p>Honestly I still feel like there&#39;s a chance we get $0 but holy shit why all of this shit we&#39;ve seen... all the hate..... if this company is truly dead in the water? Who takes up an account after hardly posting in months just to shit on one chapter 11 filing? That trucking company just declared bankruptcy this week I don&#39;t see this person religiously following that  or at least yet. Its fucking sus y&#39;all. </p>\n\n<p>Not going to post their name here but will be my most recently replies in my history calling them out. Best part is my comments are full of downvotes on Bbby while his/hers are full of upvotes lmao.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]