[{"username": "Firm_Ad2155", "url": "https://i.redd.it/53auzzram5xb1.jpg", "time": 1698590722.0, "subreddit": "r/ThePPShow", "title": "I’m case no one has noticed! Haha", "text": "<!-- SC_OFF --><div class=\"md\"><p>I am a BBBYQ &amp; GME holder for almost 2yrs. </p>\n\n<p>Even though GME had a very good earnings report, shortly after we began to see negative sentiment in the media about the company and Ryan.</p>\n\n<p>For the past 3 months especially the stock has been attacked. </p>\n\n<p>Look familiar? (Our BBBy)</p>\n\n<p>Not saying the two stock are the same fundamentally but more so that it doesn’t matter if they want to come after you! </p>\n\n<p>Just throwing out for discussion as it looks a lot like an attempt at a death spiral to cellar boxing if things don’t change soon. </p>\n\n<p>We should all work together and need our voices to promote that!</p>\n\n<p>Apes together strong.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/53auzzram5xb1.jpg\"/></div>"},
{"username": "Firm_Ad2155", "url": "https://www.reddit.com/gallery/12rwed8", "time": 1681916975, "subreddit": "r/ThePPShow", "title": "Roach was right! There is a battle going on.", "text": "And it’s right here. Moves and counter moves. Wild to watch. \nOptimistically cautious. \nEnjoy!!!🚀🚀🚀🚀🚀🚀🚀🚀", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/_4oakC62oabdx9RYYQBQJJhvznZU4PU9pIMmyZzqLWE.jpg\"/></div>"},
{"username": "Firm_Ad2155", "url": "/r/BBBY/comments/12poehl/so_youre_worried_that_even_if_this_thing_squeezes/", "time": 1681845773.0, "subreddit": "r/ThePPShow", "title": "So you're worried that even if this thing squeezes, given how low the share price has fallen...it still won't even cover your cost base? (Let alone whether it will be enough to mean you won't ever have to work again for a living...)", "text": null, "preview": ""},
{"username": "Firm_Ad2155", "url": "https://www.reddit.com/r/ThePPShow/comments/12kzthm/cloak_dagger/", "time": 1681412767, "subreddit": "r/ThePPShow", "title": "Cloak &amp; Dagger", "text": "RC knows what’s going on here. If he is not involved he should have sent some type of msg long ago. I and many people here hold substantial amount of shares in both companies. If he is not involved and watched all this happen (we know he reads the sub) and let this past few months go on without a word I would think he will loose a huge following! Time for the Cloak & Dagger to end. Play incoming or were on our own. Let’s get it out there so we all can make decisions without or with at least that speculation!! If this company needs $6 or $7 to do an M/A an announcement of Ryan, Carl, Bret or a good white hat would push the stock up before the 26th and off we go. We are running out of time. LFG already 🚀🚀🚀🚀\nNot a shill. I am bullish still but getting tired. \nLike ABC my son got me involved and I am new to this We both have owned GME for some time. Together we own over 200,000 shares Bbby and over 8,000 shares GME. \nI voted for RS but if I find out that we have been mislead by not revealing info on why the board has done what they have done when there were other options. I will change my vote and ride this thing to BK before I am just taken advantage of. Emotional? Yep, I am a little at this point. My son and I we’re always in this for life changing opportunity but also always planed on reinvesting at least our original investment back into the company. I really did and do believe in what I hope will be a market changing eye opener. \nBest of luck to all and thanks for reading my rambling!\n😎🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Firm_Ad2155", "url": "https://www.reddit.com/r/ThePPShow/comments/12gze48/pulte/", "time": 1681082259.0, "subreddit": "r/ThePPShow", "title": "Pulte!!", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://mobile.twitter.com/pulte/status/1645195903509118976\">https://mobile.twitter.com/pulte/status/1645195903509118976</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]