[{"username": "Flicki111", "url": "https://www.reddit.com/r/ThePPShow/comments/156w721/giving_retail_investors_a_voice/", "time": 1690062157, "subreddit": "r/ThePPShow", "title": "Giving retail investors a voice", "text": "Hello fellow Bobbies,   \nbefore I start I would like to say that I‘m a long time lurker since August 22 and I own about 12k shares of BBBYQ.   \n(Excuse me much if that is not the right place to post that).   \nI‘m a fullstack developer and I‘m experienced in developing cloud applications from scratch.   \nFor almost a year I have been reading DD, opinions and speculations on reddit (you know the authors) which I consider way more valuable than ANY other articles on the internet.   \nWhen it comes to providing DD myself, I‘m sadly an absolut iliterate since I have very low business (or stock market) knowledge.   \nHowever, what I could provide is the following:   \nWhat about a platform, which allows retail investors to provide their DD and giving it an appearence outside of reddit? The problem is ( I think) that a lot of shitposts, shillposts and memes (dont get me wrong, I enjoy memes myself) are watering down the precious DD and are distracting from the actual relevant posts.   \nI would love to start an app, where retail investors can have a voice and provide their opinions in an environment which is especially made for that, writing DD.   \nBy giving a voice I honestly mean positives as well as negatives but being transparent if a post is bullish or bearish. People should be able to comment and down or upvote. You should also be able to discuss multiple stock tickers. I think it would be nice to have the opportunity to provide „Counter-DD“ to oppose certain posts of other users and to „debunk“ them. It would be nice to have a „shill counter“ and „hype counter“ to measure if a ticker is overhyped or suppressed (by counting up and down votes and compare it to up and downvotes of counter DD, for example).   \nIn addition to that it could help to get peoples DD on top results of search engines and get people‘s mind away from think „these are just some guys on reddit“.   \nSo what do you guys think of that idea? Maybe it is just stupid but I think this is the only way I could possibly contribute to the movement.   \nMaybe some of you with similar skills want to help out?   \nLet me know in the comments.   \nAlso: Shorts have not closed. This is going to the moon. *Drops mic* (NFA of course)", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]