[{"username": "FullMoonCrypto", "url": "https://www.reddit.com/r/ThePPShow/comments/17wtmfy/what_are_apes/", "time": 1700158752.0, "subreddit": "r/ThePPShow", "title": "What are APES?", "text": "<!-- SC_OFF --><div class=\"md\"><p>My journey following Ryan Cohen began a few days after the Jan ‘21 sneeze. I then followed the progress and eventually bought into BBBY. Been averaging down on both since. Watching tickers and stats every day it becomes easy to see the vast amount of market manipulation. 90% buy ratio coupled with an 8-10% drop that day. Free market right?</p>\n\n<p>We screamed at the SEC, the DOJ, to Congress. We were screaming into a void. No one was responding much less trying to help. At what point does someone realize that no one is on the side of the household investor?</p>\n\n<p>Maybe this where the acronym began. Maybe it stems from a grassroots effort to work together to balance the scales. How many know what I’m referring to?</p>\n\n<p>All People Equal Society</p>\n\n<p>If you are here, then you most likely support Ryan Cohen. One of the things he has said along the way is “Every detail matters”. Along comes Bill Pulte, a most generous soul with a huge following. He buys into GME and throws in his full support.</p>\n\n<p>Fast forward the timeline a bit and we arrive at BBBY. Not long after the traction began here Pulte again arrives, and takes <a href=\"/u/ppseeds\">u/ppseeds</a> under his wing.  He invites the YouTube  crew to host the show at his office, and subsequently had a few more stops following  the  show.</p>\n\n<p>Does anyone think it a Cohencidence that Pulte has been involved in both of RC’s newest Ventures? To me, it’s most blatantly obvious that he is here to guide us. He has been supportive of everyone, despite taking some heat from both subs he’s trying to be part of.</p>\n\n<p>To me, this  is what define an ape. Someone who is trying to balance the scales and make things equal for everyone. So anyone hating on Pulte either doesn‘t understand him, or is making the repeated effort of trying to push away yet another person who is trying to help.</p>\n\n<p>Some say clout chaser. Pathetic. He had over 3 million followers before buying a share of GME. He doesn’t need any of this. The abuse he has taken as a result of trying to help hardly seems worth it. Yet he persists, unwavering. I salute you <a href=\"/u/RealPulte\">u/RealPulte</a>  🫡</p>\n\n<p>So if you aren&#39;t paid to do so, and find yourself hating on people that are genuinely trying to help, then you are no APE.</p>\n\n<p>Best Wishes 💎🙌🦍🚀🌚</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "FullMoonCrypto", "url": "https://www.reddit.com/r/ThePPShow/comments/17br6u2/how_much_proof_do_we_need/", "time": 1697743285.0, "subreddit": "r/ThePPShow", "title": "How much proof do we need?", "text": "<!-- SC_OFF --><div class=\"md\"><p>My God folks, haven’t we seen enough? Pukte takes the PP crew in to host the show at his office, then flies them to Icahn HQ, with a subsequent trip planned to see Elon Musk. He tweets M&amp;A just a few days ago and last night’s meme was as in your face as it can get. Fuck around and find out is what this group of individual investors all say. The meme also says we’re at the corner, so this is our pivot moment. Look beyond the BS the bad actors here are trying to portray, because this is their last Hail Mary. They need you to relinquish control of your shares so they may survive. Shares renamed, then shares gone. Does this sound like a normal liquidation? Think critically, and don’t let the shitheads here, such as Gazelle (I actually believed in that horse’s ass for a moment), tell you how or what to think. Not only is the original thesis alive, it’s playing out in real time right in front of our eyes. Enjoy the ride, for in human history this is the best time to be alive. Someone said that, not sure who 😉</p>\n\n<p>As I’ve said before, I don’t respond to my crayon thoughts, I leave the discussion to you</p>\n\n<p>Best Wishes 💎🙌🦍🚀🌚</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "FullMoonCrypto", "url": "https://www.reddit.com/r/ThePPShow/comments/16lvgv8/drs_fud/", "time": 1695043407.0, "subreddit": "r/ThePPShow", "title": "DRS FUD", "text": "<!-- SC_OFF --><div class=\"md\"><p>Folks, I watched the FUD reign down when the GME sub finally started figuring out the power from direct registration. Even after that, the shills worked hard enough that it took weeks or months for it to gain traction. Here’s a fun fact, 75% of Goldman Sachs income is from share lending. That is a fact. Let that sink in. Using your shares to attack…your shares.  Do you think bad actors are not here trying to save their business? </p>\n\n<p>Secondly, when GME administered their dividend they made it crystal clear that registered shares were first priority. Brokers got leftover. If RC is involved, then you can reasonably expect the same here. Brokers are already stating forced selling, whilst registered shares cannot be sold without your consent.</p>\n\n<p>Lastly, even BuyBuyBaby promoted it. That was not a subtle hint.</p>\n\n<p>Knowledge is power. See through the lies. DRS is the way. Even the GME sub figured it out. And shills, you can fuck right off.</p>\n\n<p>Best Wishes 💎🙌🦍🚀🌚</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]