[{"username": "g0rillagamer", "url": "https://www.reddit.com/r/ThePPShow/comments/173sibp/sec_sues_elon_musk_two_days_after_he_posts_his/", "time": 1696859956.0, "subreddit": "r/ThePPShow", "title": "SEC Sues Elon Musk Two Days after he posts his Ice Cream Pic... Maybe it is all connected?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Forgive me if this has already been posted, I didn&#39;t see anything in my brief search (is it sad that this is where I get most of my News from?).<br/>\nAnyway, the SEC announced last Thursday that they are suing Musk over the Twitter acquisition and the stock trading around that time.<br/>\nFrom what I remember, Musk payed too much for the company, so not sure why they would be suing him unless they think something bigger is around the corner and want to suppress the news spreading on twitter?<br/>\nI usually wouldn&#39;t post this here but with all the speculation recently after his Ice Cream post and, Pulte seeming to dodge or brush off the Cohen/Musk partnership question as fast as he could, it seems like there is a possibility he is involved in what&#39;s about to come.<br/>\nAnyway, thought you guys might like what&#39;s happening as we wait for further filings.<br/>\nDunno, maybe it&#39;s nothing, maybe it&#39;s something, but yeah, here ya go.<br/>\nSnippet from the article:<br/>\n<em>&quot; Attorneys representing the SEC alleged in a legal filing released in the Northern District of California that Musk failed to appear for a Sept. 15 testimony as required by a subpoena, which the attorneys said was served to the</em> <em>Tesla</em> <em>CEO in May 2023.</em></p>\n\n<p><em>Broadly, the SEC said the investigation is tied to whether anyone committed securities fraud in purchasing Twitter shares last year as Musk was buying stock in the company. Musk</em> <em>closed</em> <em>his acquisition of Twitter, now known as X, in October in a deal worth roughly $44 billion.</em></p>\n\n<p><em>“Musk’s ongoing refusal to comply with the SEC’s administrative subpoena is hindering and delaying the SEC staff’s investigation to determine whether violations of the federal securities laws have occurred,” the attorneys wrote. “Accordingly, the SEC now asks the Court to compel Musk to appear for investigative testimony.”</em>  </p>\n\n<p><a href=\"https://preview.redd.it/tizczx4in6tb1.png?width=2908&amp;format=png&amp;auto=webp&amp;s=b6a6eb74e4225cec9857f60af428c395d5b4bcdc\">https://www.cnbc.com/2023/10/05/sec-sues-to-force-musk-to-testify-in-twitter-probe.html</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/r30pIintAQPv2IraRZshgr5WtDouUz2iW_68k1rqDO8.jpg\"/></div>"},
{"username": "g0rillagamer", "url": "https://i.redd.it/dmlaeczzvmpb1.png", "time": 1695313106.0, "subreddit": "r/ThePPShow", "title": "Tried Buying the Dip with my last few hundred bucks. I Guess I'll just keep waiting for the SECOND we're out of Expert Market... IF that will even buy me a share by then!", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dmlaeczzvmpb1.png\"/></div>"},
{"username": "g0rillagamer", "url": "https://www.reddit.com/r/ThePPShow/comments/16l7g83/salvatore_suspended_on_twitter/", "time": 1694973591.0, "subreddit": "r/ThePPShow", "title": "Salvatore Suspended on Twitter", "text": "<!-- SC_OFF --><div class=\"md\"><p>I like Salvatore and was concerned today when I went to find his twitter/X and nothing was coming up. I found a direct link to his account and it looks like his account was suspended.<br/>\nI didn&#39;t see anyone else post about this (I missed the last PP show so maybe I&#39;m late to the game?), but I figured I would share here so no one spreads any FUD about him leaving or anything.<br/>\nI believe suspensions are only temporary.<br/>\nHere&#39;s his twitter link so you can see also see the &quot;this account is suspended&quot; notification: <a href=\"https://twitter.com/PhantomBlack691/\">https://twitter.com/PhantomBlack691/</a> </p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]