[{"username": "GarbageMaster7822", "url": "https://www.reddit.com/r/ThePPShow/comments/17sjmgk/reevaluating_drs_a_candid_discussion_on_gamestops/", "time": 1699666653.0, "subreddit": "r/ThePPShow", "title": "Reevaluating DRS: A Candid Discussion on GameStop’s Path Forward", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;d like to initiate an open discussion about the purple circle, DRS. My history with GME dates back to October 2020, long before the January 2021 surge, and I believe in the company&#39;s prospects. While GameStop is in a better position, and Ryan Cohen is working hard to improve the company standing beyond what we can imagine. As an investor, I question: Is DRS truly the answer? </p>\n\n<p>Originally, DRS aimed to lock the float and trigger a short squeeze. However, it has since shifted into a confrontational stance against the system, with questionable effectiveness. It&#39;s crucial to remember that we are investors and customers, not employees. As investors, repeatedly employing an approach without results can lead to financial challenges. I&#39;m not suggesting disengaging from DRS, but I do encourage a deeper understanding of market mechanisms, even in the face of corruption. The initial squeeze occurred because many of us, Wall Street degenerates, were purchasing call options, prompting market makers to acquire shares to manage risk, ultimately contributing to the decline of Melvin Capital. Let&#39;s engage in an open and transparent conversation.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "GarbageMaster7822", "url": "https://i.redd.it/1820r2eidlzb1.jpg", "time": 1699653171.0, "subreddit": "r/ThePPShow", "title": "GME Bag holder here. Hoping this community welcomes my strategy: sold calls, pocketed the premium, reinvested in deep ITM calls and shares. Still selling covered calls on my non DSR shares. Can't wait to keep it up next week! 💎🚀", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sold these covered calls for $1.31 and bought them back for $0.09.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/1820r2eidlzb1.jpg\"/></div>"},
{"username": "GarbageMaster7822", "url": "https://www.reddit.com/r/ThePPShow/comments/17mhew1/bbbyq_options/", "time": 1698968790.0, "subreddit": "r/ThePPShow", "title": "Bbbyq Options", "text": "<!-- SC_OFF --><div class=\"md\"><p>What happens to options that still had life on them if the stock is re-listed?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "GarbageMaster7822", "url": "https://www.reddit.com/gallery/17e57z9", "time": 1698013785.0, "subreddit": "r/ThePPShow", "title": "Superstinks!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Superstinks!</p>\n\n<p>Listen up, fellow smooth ape investors! It&#39;s evident our community is growing, but our posts and engagement are on the decline. Many have explored DRS and various conspiracy theories, but it&#39;s time to consider another approach. With this beautiful dip and all the fresh new stocks you fuckers have bought let&#39;s harness market mechanics in our favor.</p>\n\n<p>I&#39;ve been part of this movement since before most of you, with my first investment in GameStop back in October 2020. My portfolio grew to over $1,000,000, I never sold my shares/options , but I did capitalize on options market and I continue to do so. I challenge you all to explore strategies like &#39;poor man&#39;s covered calls and selling covered call’ on the new shares you all have bought. </p>\n\n<p>For instance, you can purchase $10 calls expiring in January 17, 2025 for $6.05 (as of last Friday&#39;s closing) and then sell calls bi-weekly. The beauty is, even if the price surges, you can roll them to a future date and higher strike price. To get started, follow folks like Uncle Bruce and Pifi on YouTube for valuable insights. Let&#39;s adapt and thrive! 🚀💎 #StockMarket #InvestingStrategy&quot;</p>\n\n<p>I attached a screen shot so you bitches know I’m not BSing you and the post is still up on my instagram page.</p>\n\n<p>If I’m not blocked by the mods for posting this. I will be posting my weekly option trades and reporting them here live. #freedomofspeech</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/RM3CcSBac9Uo22MNLdTVPo0Vpjz07RHYG-OdRUvuK1s.jpg\"/></div>"}]