[{"username": "garymc88", "url": "https://www.reddit.com/r/ThePPShow/comments/17ink2k/if_shorts_really_have_been_able_to_close_with/", "time": 1698528424.0, "subreddit": "r/ThePPShow", "title": "If shorts really have been able to close with realised gains you’d have seen more Phils", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yet there is just one Phil, and the legitimacy of that singular Phil’s remains under scrutiny. One question, imo, proceeds all;</p>\n\n<p>Where are all the other Phils?</p>\n\n<p>As we threw shade at Phils claims, where were his fellow shorties to throw down their immense gains and ‘dance on our graves’. There has been so many anti-BBBYQ accounts popping up on Reddit and X, surely SOME of these guys are short, right? Right, Rod? </p>\n\n<p>Where are the closed shorts? </p>\n\n<p>Where are the realised gains?</p>\n\n<p>Where are all the other Phils?</p>\n\n<p>Surely all these shorties want to slap their balls in our face with all their gains, no? Why not?</p>\n\n<p>Well, we know why. Tomorrow.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "garymc88", "url": "https://i.redd.it/ij05dur689rb1.jpg", "time": 1696019315.0, "subreddit": "r/ThePPShow", "title": "Once more unto the breach dear friends", "text": "<!-- SC_OFF --><div class=\"md\"><p>You’re still fucking here. After everything, all the ridicule, all the fud, all the price drops. You stood by your conviction and you held this mother fucker to the very end.</p>\n\n<p>Well fucking done to you.</p>\n\n<p>PPShow, Pulte, Sal, David etc - all you fellas are true leaders. You kept us ploughing forward when everyone else dragged us back. Your impact on this group of fucking legends is immeasurable. I would not be here still without the examples of mental fortitude you showcase to the world. Well fucking done fellas.</p>\n\n<p>We fucked around, now it’s time to find the fuck out. If we’re still poor when the dust settles well so fuck there ain’t no bunch of daft bastards I’d rather be poor with than you lot.</p>\n\n<p>Much love. Congratulations on your unwavering conviction. You’ll probably never realise how unique it is to be able to stand up to the shit that’s been thrown at us. </p>\n\n<p>Its fucking unique as fuck. It’s fucking remarkable fellas.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ij05dur689rb1.jpg\"/></div>"},
{"username": "garymc88", "url": "https://www.reddit.com/r/ThePPShow/comments/1544fxd/last_time_we_had_6_consecutive_green_trading_days/", "time": 1689794969.0, "subreddit": "r/ThePPShow", "title": "Last time we had 6 consecutive green trading days was…", "text": "<!-- SC_OFF --><div class=\"md\"><p>August 2022.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]