[{"username": "GCU_Oops", "url": "https://www.reddit.com/r/ThePPShow/comments/1555e6o/theory_the_multicolored_spaceship/", "time": 1689892093.0, "subreddit": "r/ThePPShow", "title": "Theory: The Multicolored Spaceship", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ryan Cohen has alluded to Lego several times. It&#39;s looking more and more like there might be some kind of partnership in the works. I had a light bulb moment during the PPshow last night that pulled a very nostalgic thread for me.</p>\n\n<p>When I was young I used to dump out my huge tub of Lego and start building space ships to play with. The &quot;first draft&quot; space ship was always multicolored because I&#39;d build it with the first piece I found knowing it was going to the be the rough first draft. The second build would be the &quot;Real&quot; space ship with all the right colors and bells because I&#39;d already worked out most of the design on the multicolored spaceship. </p>\n\n<p>My theory is that Ryan has always liked Lego as much as I have and still does to this day. I still play. My wife buys me Lego for my birthday and I&#39;m almost in my 40&#39;s... We don&#39;t &quot;grow up&quot; and it&#39;s silly to kill that childish wonder we all have inside. That wonder that delights us when we build something new. </p>\n\n<p>The timeline shows that Teddy was a sparkle in Ryan&#39;s eye BEFORE the GME sneeze. I think Ryan built his multicolored spaceship with GME knowing it would sneeze. I think they watched for any ticker that was also in the same basket during the sneeze. I think they&#39;ve been assembling a Manhattan Project level short busting nuke with Teddy. I think they&#39;re assembling the final draft with all the bells and whistles. </p>\n\n<p>Thinking back I always used the multicolored spaceship as the good guy underdog who had assembled his ship from space junk and whatever he could find. I&#39;d always add a secret weapon to the multicolored one to help it win..</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "GCU_Oops", "url": "https://www.reddit.com/r/ThePPShow/comments/14wsptc/why_are_the_cayman_islands_and_brazil_red_when/", "time": 1689085162.0, "subreddit": "r/ThePPShow", "title": "Why are the Cayman Islands and Brazil red when we're green?", "text": "<!-- SC_OFF --><div class=\"md\"><p>If you visit a particular visualization website for financial data and look at the world map both the Cayman Islands and Brazil are bleeding right now. Just thought it was interesting and was wondering if there is a correlation to our green days. Wut doin Kenny?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]