[{"username": "general_dingleberry", "url": "https://www.reddit.com/r/ThePPShow/comments/12u76s7/marantzpp_drama_explained/", "time": 1682090536.0, "subreddit": "r/ThePPShow", "title": "Marantz/PP drama explained", "text": "<!-- SC_OFF --><div class=\"md\"><p>Alright everyone, I pretty much never make serious posts but thought I&#39;d make an exception for this. I saw a post a couple hours ago linking to one of Marantz&#39;s videos, and while I&#39;m not making any assumptions about the poster&#39;s intentions, it inevitably has the affect of promoting his content, giving him attention, and sending him views.</p>\n\n<p>At this point everyone has a basic idea on who Marantz is. On the surface level things seem pretty simple, he identifies as a content creator and his current focus for getting views is creating &quot;beefing&quot; content against PP and BBBY in general.</p>\n\n<p>I want to get the truth out there to defend PP and put this whole thing to rest before it gets out of hand. I&#39;m actually really good friends with PP, we chat almost every day often while we&#39;re on the toilet. He likes to joke a lot, but the truth is while he doesn&#39;t own a &quot;sex&quot; shop, he does own a store that happens to sell some basic sex items like condoms, as well as vibrators.</p>\n\n<p>Believe it or not, before this whole thing got started Marantz was actually a customer at PP&#39;s store. At that time he wasn&#39;t aware of the ppshow, he only knew PP as the store owner. Remember when PP way back mentioned he was understaffed so he had to go in to fill some shifts? Marantz happened to come in one of those days and asked PP about the vibrators.</p>\n\n<p>Unfortunately, PP had drank on the show before coming in, so he made some jokes about how you could use the vibrators anally. Sometimes it can be hard to tell when PP is being sarcastic, especially when he&#39;s had a few drinks, so Marantz took it seriously and ended up getting one stuck far up his rectum and had to go to the ER to get it out.</p>\n\n<p>Naturally Marantz was pretty upset, and confronted PP and threatened to sue him for medical damages. I remember talking with PP at the time and telling him in fairness, the guy had been through a lot and while it wasn&#39;t really PP&#39;s fault he should at least give him a refund on the vibrator out of goodwill.</p>\n\n<p>That&#39;s where things got bad. PP took my advice and did offer him a refund, but Marantz took it the wrong way and felt insulted. He tried to sue but of course had no real grounds for litigation and failed, racking up legal fees and becoming even more furious. That&#39;s when he found the ppshow and decided he was going to come after PP by trying to fight him with content instead.</p>\n\n<p>Now at this point you&#39;re probably asking wait, why didn&#39;t PP just put the truth out there? Why did he invite Marantz back on the show? The answer to that is PP is a genuinely nice guy, and he doesn&#39;t want to embarrass him and sometimes he feels so bad about the anal probe that he ends up giving him more screen time. Meanwhile, Marantz is actually not a bad guy, you can understand why he&#39;s upset at PP.</p>\n\n<p>Ultimately, this whole thing is my fault. I should&#39;ve never told PP to give him the refund, in hindsight that was bad advice and I get why Marantz took it the wrong way. I should&#39;ve  told PP to pitch in for the medical bills, or to just keep the vibrator money and use it to buy more BBBY shares at 30 cents.</p>\n\n<p>So if you all need someone to blame, blame me. I take full responsibility. Now let&#39;s put this whole thing to rest and stop giving this drama any more attention.</p>\n\n<p>&#x200B;</p>\n\n<p>TL;DR Marantz anal vibrator accident PP no bad guy my fault bad advice no more marantz posts</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "general_dingleberry", "url": "https://www.reddit.com/r/ThePPShow/comments/12m32vy/gentle_reminder/", "time": 1681490165.0, "subreddit": "r/ThePPShow", "title": "Gentle Reminder", "text": "<!-- SC_OFF --><div class=\"md\"><p>Guys, no matter what you believe we can all agree on at least one thing. The life of a BoBBY is hard. There&#39;s not a single one of us in this play that hasn&#39;t questioned on more than one occasion if mebe we aren&#39;t literally retarded (except real_eyezz, that dude has HUGE balls). I&#39;ve been here since July, and my anus is pretty much at its limit for how much more of a beating it can take.</p>\n\n<p>BUT HEAR ME NOW. No matter how much money you&#39;ve lost on this play. No matter how wrong you&#39;ve been. No matter how many boyfriends your wife has accumulated. No matter how much money you&#39;ve sent ppseeds for nudes with only his glasses on. When it&#39;s one of those days where you&#39;re feeling at rock bottom, remember this.</p>\n\n<p>None of us, and I mean NONE of us, are as retarded as this guy:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/y19avocxjvta1.png?width=441&amp;format=png&amp;auto=webp&amp;s=0e2a018f3f2ff02e3331691937cd526d055e21b6\">https://preview.redd.it/y19avocxjvta1.png?width=441&amp;format=png&amp;auto=webp&amp;s=0e2a018f3f2ff02e3331691937cd526d055e21b6</a></p>\n\n<p>&#x200B;</p>\n\n<p>(This is not financial advice)</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/rhMGYbBOQ154-IrzUg41a_dNmvLNCa3btS9rhEF09aY.jpg\"/></div>"}]