[{"username": "GodlessJuan", "url": "https://www.reddit.com/r/ThePPShow/comments/17867w2/anyone_see_this_yet/", "time": 1697339479.0, "subreddit": "r/ThePPShow", "title": "Anyone see this yet?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Idk if this would constitute as “DD” per say, but I was looking over the OCC paper and making comparisons with other companies which had the same OCC headlines regarding the advancement of options expirations and so on…</p>\n\n<p>Anyways I only found three companies which fit the bill exactly… PLx Pharma Inc, Diebold Nixdorf and Boxed Inc. Didn’t do a whole lot of digging, but what I did find was that Diebold fucked their shareholders, but ultimately exited bankruptcy, PLx is still in bankruptcy and no acquisition announcements have been made that I can find and Boxed was purchased by MSG Distributors for an undisclosed amount. I’d be VERY interested to hear from any former BOXD shareholders as from what I’m reading they also fucked over shareholders. </p>\n\n<p>The reason this caught my eye is that I found a link that shows there is a strong similarity between boxed.com and buybuybaby.com.</p>\n\n<p>Here is the link to the article…</p>\n\n<p><a href=\"https://techcrunch.com/2023/08/18/online-wholesaler-boxed-acquired-after-filing-for-bankruptcy/\">https://techcrunch.com/2023/08/18/online-wholesaler-boxed-acquired-after-filing-for-bankruptcy/</a></p>\n\n<p>The last paragraph is the most important part of the article and reads as follows…</p>\n\n<p>“Update, 8/23/23: MSG looks like it may have bought another company as well:: buybuybaby.com as the website, indicating it’s under new management, and has the exact same landing page, FAQ, and layout as the Boxed.com website. MSG has not responded to repeated requests for comment”.</p>\n\n<p>Now I’m not saying that because Diebold and (maybe) Boxed screwed over shareholders that Bobby is planning to do the same… honestly this might just be a big ass nothing burger! I’m only sharing this since I haven’t seen it discussed yet and having more folks look into it might reveal some more tasty secrets. For me, personally, I would just like to find some former BOXD shareholders and squeeze them for info! Lol.</p>\n\n<p>Still zen. Still holding (runaway shares apparently 😂). Still dreaming of Dougielarge and Kenny G playing “hide the bedpost in uranus” for who gets the others commissary.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/w5vlkjg0r1tb1.jpg", "time": 1696800487.0, "subreddit": "r/ThePPShow", "title": "Just stoooop!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Respect to Kevin Malone for taking some shit from fellow apes this weekend over what appears to be a misunderstanding. My man is still long and trapped with the rest of us so stop being so mean to him! </p>\n\n<p>Don’t you DARE delete my shit post, stock! 😂</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/w5vlkjg0r1tb1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/paqsg1t469rb1.jpg", "time": 1696018623.0, "subreddit": "r/ThePPShow", "title": "Trust me bro continuation re: AST", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>DISCLAIMER:</strong> I am not a legal or financial advisor and I offer no advisor-client services. All information contained herein is not meant to influence anyone in any way and is based entirely on my own research and speculation. If you have need of a legal or financial advisor and it is your own decision to do so, please seek a licensed professional for such services.</p>\n\n<p>So yeah I already posted this yesterday, but I called them again today… I promise, I’m not trying to annoy them or bog down their phone lines lol. I have legitimately been trying to change some information for my online account is all, but I did the same thing I did yesterday and asked at the end of the call “Has AST been instructed to cancel or otherwise destroy shares of BBBYQ” and her answer was “no”. As you can see, this was during power hour so I’m pretty sure if these shares were to be cancelled, extinguished, blah fucking blah, then they would’ve had those instructions by now!</p>\n\n<p>Again, this is just my own opinion, but anyone saying our shares are worthless now are either liars or they are severely misinformed!</p>\n\n<p>This on top of the recent docket drops has me zen AF! </p>\n\n<p>✌️&amp; ❤️ fellow 🦍!</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/paqsg1t469rb1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/16tsqh1", "time": 1695841060.0, "subreddit": "r/ThePPShow", "title": "You scream, ice cream, we all scream for NOLs and shareholder preservation!", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>DISCLAIMER:</strong> I am not a financial or legal advisor and therefore I offer no advisor-client services. All information contained herein is a product of my own research and speculation and should not be considered advice. If you have need of financial or legal services and it is your choice to do so, please seek out appropriately licensed professionals.</p>\n\n<p>With that out of the way, allow me to spam some shit lol.</p>\n\n<p>🌝🌝🌝🌝🌝🌝🌝🌝🌝🌝🌝🌝🌝🌝</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/5QyaxNTm2R8jSKbnZ_JlTdjGTVMzCPnoXe9SQJxuuKE.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/2sd7aa1tnmqb1.jpg", "time": 1695746110.0, "subreddit": "r/ThePPShow", "title": "Come pry them from my cold, dead fingers!", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>DISCLAIMER:</strong> I am not a financial or legal professional and nothing contained herein is meant to influence anyone in any way. I offer no advisor-client services. If you have need of financial or legal advice and it is of your own choosing to do so, please seek licensed professionals for such advice.</p>\n\n<p>The number of shares I DRSed is inconsequential as I was already almost fully DRSed… but now I have officially locked away 100% of my BBBYQ. You reading this hedgies? You CANNOT fucking have them!</p>\n\n<p>Btw it should be obvious from the disclaimer, but I’m not advocating that anyone do this because I did it. You should be making your own investment decisions and doing your own research. Thank youuuuuuuu!</p>\n\n<p>✌️&amp; ❤️</p>\n\n<p>P.S. I am NOT in a glass case of emotion lmfao. The tags on this sub are hilarious though 😂.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2sd7aa1tnmqb1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/16qivow", "time": 1695512727.0, "subreddit": "r/ThePPShow", "title": "Somebody stop me!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Only a matter of time before they block me I’m sure lmao.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/zBvFoWMvmIusjyVXa2-Q6JO8vaTbgNqoJdHsXauCx80.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/r/ThePPShow/comments/16mhsmj/wanna_get_to_know_the_highest_paid_by_rate_member/", "time": 1695099256.0, "subreddit": "r/ThePPShow", "title": "Wanna get to know the highest paid (by rate) member of AlixPartners? Look no further", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.alixpartners.com/our-professionals/dpuscas/\">https://www.alixpartners.com/our-professionals/dpuscas/</a></p>\n\n<p>Pssst. This is guy is also actively working WITH Holly E. and other members of AlixPartners on this whooooole debacle… u need look no further then the most recent monthly billing statements right hur!</p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DocketInfo\">https://restructuring.ra.kroll.com/bbby/Home-DocketInfo</a></p>\n\n<p>The man’s got cred, I’ll give him that. M&amp;A all the way!</p>\n\n<p>Btw I just say he’s the highest paid by rate as of this billing statement since Holly Etlin’s rate is marked N/A</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/16kfqnz", "time": 1694892337.0, "subreddit": "r/ThePPShow", "title": "Ok, so I fell down a HUGE rabbit hole. Sorry if some of this is unnecessary….", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>Disclaimer:</strong> I am not a legal or financial advisor or expert and I offer no advisor-client relationships. No information contained herein is meant to influence anyone in any way and is the product of my own research and speculation and may not be current. No information contained herein is meant to defame, slander, defraud or otherwise make legal or defamatory claims against any parties mentioned. If you have need of a legal or financial advisor, please seek appropriately licensed counsel if that is your decision to do so.</p>\n\n<p>(IMAGES GONE OVER AT THE END)</p>\n\n<p>This will be a loooong one so I’m sorry if some info in here is unnecessary or outdated, but I won’t lie… I spend about 92% of my day reading up on EVERYTHING BBBYQ/chapter 11/OTC/general stock related shit… <strong>ALL OF IT I CAN GET MY HANDS ON!</strong> Naturally, I’m open to being corrected on anything that may be dated or what have you. Just please provide sources for your arguments.</p>\n\n<p>First, let me state that I am FINE being in expert markets! I’m expecting new shares of a reformed or bought out company! I could care less if we were trading in rocks! But I still am obsessed with learning about this shit.</p>\n\n<p>So… I wanted to know… how <strong>does</strong> a company come out of the expert market? </p>\n\n<p>Well for those that don’t know, you have to find a <strong>market maker</strong> to file a form 211 for your company and have all other relevant filings up to date in regards to rule 15c2-11. Won’t go over everything involved in that, but it generally just requires the company make a couple SEC filings and obviously find a market maker to, well… make a market for them! So I found a LOVELY site that went over all the market markers that deal in OTC stocks and started digging into them fucking alphabetically… <strong>BAD IDEA!</strong></p>\n\n<p>Literally do NOT do this if you want to retain your sanity and also get sleep ever! Lol there are many, many pages and the information certainly isn’t up to date as some of these firms are no longer around or have since restructured to something else or have parent companies and several subsidiary companies. It literally goes alphabetically from A-W as well.</p>\n\n<p><strong>WARNING</strong>- In all likelihood, the images “may” not give you sufficient information and you may actually have to Google some definitions on your own, naturally, but If there is anything you don’t understand I’m happy to answer questions to the best of my ability!</p>\n\n<p><strong>Here is a some brief, some not so brief overview of just SOME of the market makers I dug into that I found interesting</strong></p>\n\n<p><strong>ACAP Financial, inc</strong> (EXPELLED BY FINRA FOR REPORTING ISSUES. Determined to be weird because I actually called FINRA this week and they told me they don’t know the company listing requirements to be removed from the expert markets and be properly quoted on OTC and that I would need to contact OTC markets for that information… TF do you not know your own disclosure requirements?!)</p>\n\n<p><strong>C.L. King &amp; associates</strong> (100% woman owned investment bank.)</p>\n\n<p><strong>Domestic Securities, Inc</strong> (Most of my images are about these guys and market implementations made in the late 90’s, early 2000’s. Other then the related images 1-10 [I truly am sorry… I’m doing this on my phone so a brief description for each photo can be found at the very end], I found VERY limited info on them other than they are based in Montvale, NJ although their OTC division was/is in Edison, NJ as most recently I could find on Linkdin and yellowpages.com… So yeah, I can’t even find out if they are around anymore. I want to also mention this particular one was on a page listed as “P&amp;S debt”, the P meaning purchase, S meaning Sale. Which is more clearly defined in the image about P&amp;S.)</p>\n\n<p><strong>J.P. Turner &amp; Company</strong> (This one was actually a bit interesting to me as well as they effectively shut down in 2014 and were acquired by RCS Capital Corporation, a brokerage firm, which also underwent a chapter 11 bankruptcy… wait, aren’t brokerage firms not allowed to file chapter 11? Maybe I’m missing something as I am a bit tired and this took a LOT of reading! So anyways, through the proceedings, they took private their advisory firm called Cetera Financial Group. They did this and successfully exited chapter 11 after coming to an agreement with their first and second lien bond holders, but they completely wiped out their shareholders in the process… but I guess I don’t care so much about shareholders investing in shady brokerage firms lol, which apparently they did have some shady activities happen before their bankruptcy filing. Won’t go into it. Don’t want this post to be too long, but the info is out there!)</p>\n\n<p>(So anyways, upon further digging into them, I found they emerged as Aretec Group, Inc under the parent company of GC Two Intermediate Holdings, Inc, a holding company in Delaware that also had a lil scuff with the SEC back in 2020 in regards to the Investment Company Act of 1940. Lol I guess I lied and I am somewhat going into it because it was essentially Cetera Advisors, LLC that committed the alleged fraud, not their parent companies or other subsidiaries. Won’t go ANY deeper into it besides to say it was essentially a fraud case of failure to disclose certain compensations.)</p>\n\n<p>SOURCE: <a href=\"https://www.yumpu.com/en/document/read/25078682/a-complete-list-of-market-makers-for-otc-listings\">https://www.yumpu.com/en/document/read/25078682/a-complete-list-of-market-makers-for-otc-listings</a></p>\n\n<p>Now I’m just going to stop here because as we can NOW see, there’s a TON of market makers that deal in the OTC market and I don’t even think this article is up to date, as it’s first page directs you to <a href=\"http://www.otclistings.com\">www.otclistings.com</a> which appears to no longer even be an active site as it redirects me to <a href=\"http://www.domainmarket.com\">www.domainmarket.com</a> and upon scrolling down a bit, even has a link to purchase the domain for otclistings lol, but yumpu.com seems legit.</p>\n\n<p>Geez, I hope your brain hasn’t switched off yet because what I find most interesting of all I saved for the last image!.. But yeah it’ll be described further below.</p>\n\n<p>I do apologize for the length here ladies and gents, but I do want to bring your attention to 3 other images and one other detail I found strange… If you go to images 11-14, this is also mentioned in the case in 2002/2003 with SEC v. Domestic Securities, Inc, I will detail the importance of each image at the end of the post IN ORDER. Again, sorry if you’re on mobile and you have to do a bit of scrolling back and forth. I did my best and it’s after 02:30 here so I’ll be posting this tomorrow (which if you’re reading this, it’s tomorrow… but is it ever tomorrow? Lol). It has to do with some weird ass looking shit to do with FIX (Financial Information Exchange). I guess if it’s not weird just tell me it’s not weird and we’ll all go about our days! </p>\n\n<p>Ok so let’s get into the images.</p>\n\n<p><strong>IMAGE 1:</strong> This goes over an SEC rule implementing something called SuperMontage into the markets. Domestic Securities, Inc challenged this implementation, but essentially it was thrown out because Domestic was late in filing its objection.</p>\n\n<p><strong>Image 2:</strong> Looks like a lot of other folks were not for this SuperMontage shit either!</p>\n\n<p><strong>Image 3:</strong> This goes over “crossed and locked” markets and how Domestic was basically challenging a feature of SuperMontage called decrementation. What decrementation does is essentially allow market makers to zero out or push to the back of the line any limit orders that did not get filled for… well, pretty much any reason the market maker didn’t want to fill them! Definitely suggest looking up decrementation!</p>\n\n<p><strong>Image 4:</strong> This just explains what a crossed market is basically. A locked market is when ask/bid prices are the same.</p>\n\n<p><strong>Image 5:</strong> So there’s also something called ECNs that functions with SuperMontage that were giving market makers a way to escape filling these OTC limit orders for customers. More on ECNs in the ECN image next.</p>\n\n<p><strong>Image 6:</strong> So yeah, ECNs we’re around BEFORE SuperMontage and also seems to also, at least if I’m interpreting it right, allows market makers to trade back and forth for their best price while ignoring the customers limit orders.</p>\n\n<p><strong>Image 7:</strong> Just your boiler plate explanation of how NASDAQ is actually a creation of NASD. If you don’t know about them, just do a Google search as I don’t want this to drag on any longer than it has to! But as you can see they are a self-regulatory organization. Who’s regulating you, NASD? Oh, NASD is? Ok, that seems on the level.</p>\n\n<p><strong>Image 8:</strong> Just goes over the basics of what SuperMontage is… but trust me bro when I say there’s a LOT more to it!</p>\n\n<p><strong>Image 9:</strong> P&amp;S transactions. This was mentioned earlier as Domestic Securities, Inc was listed on a page titled “P&amp;S”. It’s likely nothing. Just meant they handled purchase and sales of securities?</p>\n\n<p><strong>Image 10:</strong> This is another argument made by Domestic about SuperMontage and something I found very interesting in the following images just due to the connection to FIX… detailed in the next few images.</p>\n\n<p><strong>Image 11:</strong> Might wanna read that highlighted part a couple times and then head over to the website!</p>\n\n<p><strong>Image 12:</strong> Explains the role of FIX in the markets.</p>\n\n<p><strong>Image 13:</strong> So if you DID happen to go over to the website, and you clicked on the link for “member firms” you’ll see a line of things you can click on from buy/sell side dealers/institutions etc, etc… it contains all the usual suspects… Blackrock, Credit Sussie, Goldman Sachs, etc, etc... What I found SUPER weird was when I clicked on the section titled “regulators” I just got ASIC. What is ASIC? So far as I can tell, ASIC is the Australian Securities &amp; Investments Commission. TF?! The ONLY regulator for FIX is this Australian securities commission? Btw, if you try to click on them it tells you that you need to be a member and have an account to view any info on them. Is it weird? Idk, but it sure does seem fishy! At least to me!</p>\n\n<p><strong>Image 14:</strong> FINALLY! I already mention this one above, but this shows Lazard as an OTC market maker dealing in what? Convertibles! Do lambos come in convertibles? Lol. Lazard provides many services and as we know is currently in the service of BBB. Again, this info is obviously dated, but it’s important to see this is/was a specialty of theirs in OTC exchanges.</p>\n\n<p>Last thing and I’ll STFU I promise! I find it SUPER weird that all those Domestic Securities, Inc issues with the SEC were RIGHT around… actually I think after the time Clinton repealed The Glass-Steagall Act! Ya know… the act that prevented investment banks from doing shifty trades. If you don’t know what it is DEFINITIVELY give it a Google search as some claim the repeal of this act had a material effect on the 2008 housing market collapse.</p>\n\n<p>Congratulations if you read all of that and honestly, thank you if you read it all! It took a lot of work. I’m sorry again if there’s some info in here you find irrelevant.✌️&amp; ❤️ to all of you and enjoy your weekend!</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/AlCTRSkSqKILmtw4AvF6r6SXPoMXhxuZqd7LoSDE-zc.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/16is4ml", "time": 1694721361.0, "subreddit": "r/ThePPShow", "title": "So I called FINRA today and NO, FINRA! If you’re reading, I did not record our conversation!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ok so first off when you call FINRA, they have an automated message at the beginning that says they do not consent to recording calls. So I assure you FINRA, if you’re reading, I did NOT record you! lol and I also guess I’ll get the disclaimer out first on this one first.</p>\n\n<p><strong>Disclaimer:</strong> I am not a financial or legal advisor and nothing contained herein should be considered advice. I do not intend to influence anyone in anyway and I am only presenting my own, anecdotal accounts of today and information obtained or attempted to obtain through FINRA. Also, this is not a transcript or otherwise documented report of my calls with FINRA. I offer no advisor/client relationships. If you have legal or financial needs, seek a licensed professional if that is your decision to do so.</p>\n\n<p><strong>THE REASON I CALLED (TWICE)</strong></p>\n\n<p>So I been doing some research about how an OTC stock exits the expert markets and of course came across rule 15c2-11. There’s a lot of (a)(b)(c) (1)(2)(3)’s to it, but generally speaking, it’s essentially the rule that governs quotation in OTC markets by broker-dealers and market makers. </p>\n\n<p><strong>SO… WHY IMPORTANT?</strong></p>\n\n<p>Well I think it’s pretty darn important based on ALL the images I have included! FINRA, for those that don’t know is the Financial Industry Regulatory Agency and they KNOW these rules and requirements!</p>\n\n<p>Ok, so of course I’ll mark this a trust me bro because I could NOT and DID NOT record my conversation with FINRA, but only mean here to show I did call them.</p>\n\n<p>The first option I pressed was wrong I guess. I used option 3 for questions about securities I think? Well this guy was pretty chill and even offered to help at least TRY to find the answer to my question (which btw was what requirements must be met for BBBYQ to successfully come out of the expert markets). He told me they were kinda the wrong department and they were not really experts on the expert market and kinda chuckled about it a little. Seemed like a nice guy.</p>\n\n<p>Anyways he tells me I should have pressed option 1 for corporate action as they were more likely to know. I asked politely if I could be transferred to that dept and he said he could not do that and I’d simply have to call back in… ugh, but w/e.</p>\n\n<p><strong>So I call back in. Option 1 this time</strong></p>\n\n<p>This guy has a whole different attitude about him, or at least that’s how it came off to me. He kinda huffed after my question and then proceeded to tell me they have no information on that! (How a company comes out of the expert market) and the people I should be contacting is OTC markets. Well so I went over to otcmarkets.com and of course I found no phone number (if anyone has one for them, I’d appreciate it!) and the contact method was “Here. Give us your name, number, email and we’ll get back to you”. Sorry guys and gals… I did not do that just out of lack of time in my schedule so far.</p>\n\n<p><strong>But the pictures just don’t lie. FINRA most certainly does know this stuff. They just don’t care to tell us, obviously.</strong></p>\n\n<p><strong>image 1- my calls to FINRA.</strong></p>\n\n<p><strong>image 2- shows that disclosures outlined IN rule 15c2-11 are reported DIRECTLY to FINRA!</strong></p>\n\n<p><strong>image 3- goes over a SMALL amount of what 15c2-11 covers. I did find some information regardless of the calls though and it seems rule 211 is the rule which governs an OTC stock being removed from the market.</strong></p>\n\n<p>Thanks for reading everyone! ✌️&amp; ❤️</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/wN2EZR43aWB7d1e4vMQWS4Zml994pA60Vy1b4n8LHzw.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/a87jisi4o8ob1.jpg", "time": 1694705023.0, "subreddit": "r/ThePPShow", "title": "The hell is this on the 8-K? Lol", "text": "<!-- SC_OFF --><div class=\"md\"><p>Boxes checked “no”? Tf?</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/a87jisi4o8ob1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/i63owk4k98ob1.jpg", "time": 1694700124.0, "subreddit": "r/ThePPShow", "title": "I just like to tease em lol", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have a great interest in seeing if they get filled lol. It’s only 2. Fuck it, they can have just two while I perform my lil investment experiment hahah 😂 </p>\n\n<p>No disclaimer here. See all previous posts as to how you should KNOW not to follow anyone else into an investment or make investment decisions based on what others put on the internet! You should make those decisions yourself or with the help of a professional.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/i63owk4k98ob1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/9ddvreg348ob1.jpg", "time": 1694698287.0, "subreddit": "r/ThePPShow", "title": "I did the thing", "text": "<!-- SC_OFF --><div class=\"md\"><p>I said yesterday I’d be DRSing most of the rest of my shares today and I’ve done that. Although now that I’m counting, I’m only about 50% DRSed. Guess I gotta go back and send 1500 more. Putting in the highest limit orders on a few shares today that Fudelity will let me too just to see if they trade 😂 </p>\n\n<p>**Disclaimer: Ya already know I am not a legal or financial advisor and I am not advocating for anything here. I do not attempt to influence decision making and offer no advisor client relationships. If you have specific financial or legal needs, please seek a licensed professional if you choose to do so.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9ddvreg348ob1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/16hzsd9", "time": 1694641323.0, "subreddit": "r/ThePPShow", "title": "Goddamnit, I said yesterday I was done with the DD, but now that we’re in expert markets I MUST continue!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Marking as speculation since there is SOME in there… and also I promised yesterday I was done with DD posts! 😂 </p>\n\n<p>Ok so this article I think is <strong>CRITICAL</strong> to read fully. Mostly because the most recent rule updates made by the SEC that effect us being in the expert market were made in Sept of 2021… <em>cough cough</em> GME era.</p>\n\n<p><a href=\"https://blog.otcmarkets.com/2021/03/25/understanding-the-expert-market/\">https://blog.otcmarkets.com/2021/03/25/understanding-the-expert-market/</a></p>\n\n<p>Note at the very beginning, there is also a link to the actual SEC rule update which is equally important to read in its entirety to fully understand the situation of being in the expert market!</p>\n\n<p><strong>Just a couple images in this one.</strong></p>\n\n<p>So the first image is from the link. You can actually head over there and type in the search bar “BBBYQ”. There’s a lot of scary looking “Oh no! This company is in bankruptcy and it’s not reporting to the SEC”! Well um, Mr. SEC, we’re not required to report to you in OTC! Maybe that’s why he was soooo sad looking yesterday when his objection was overruled? He knows we got an ace buried soon to be dug up? Lol.</p>\n\n<p><strong>So anyways, about image 1</strong></p>\n\n<p>Image 1 is ACTUALLY explained more in detail in image 2!</p>\n\n<p>As set out in the new expert market rules, the trades measured on the expert market are unsolicited only. Meaning only measuring limit orders from those who are instructing broker-dealers to issue a limit order. So naturally I wish I had a million dollars already as I’d be placing some high ass level limit orders between now and the 28th!</p>\n\n<p><strong>Image 2</strong></p>\n\n<p>So the expert market likes to not give price quotes on the OTC market for securities trading in the expert market. Or maybe just not immediately until THEY know the true price, but…</p>\n\n<p>Psst. I have a secret to tell too. If you read all the articles, a security CAN come out of the expert market, JUST as an OTC stock can be re-listed on the major exchanges! \nOf course that’s not what we’re after though. Let’s get real. We want NEW SHARES! (Although I won’t lie, if BBBYQ goes into the hundreds/thousands/millions/infinity I’d still be pretty happy!) lol.</p>\n\n<p><strong>Disclaimer:</strong> I am not a legal or financial advisor and I offer no professional/client relationships. Any information contained herein is my own opinion and not meant to influence anyone in anyway. If you have specific legal or financial needs, you should seek a licensed professional should you so desire.</p>\n\n<p>I wanna add after my disclaimer here that I am NOT super familiar with the expert markets, but my night will be occupied with digging in more deeply to this shit!</p>\n\n<p>Also just wanna say I may have buried the lede here (IYKYK), but IF my assessment is correct, this information means short sales will no longer be tabulated in any future price discovery? I know positing this question opens the feed to a mass of shills saying I’m wrong (maybe I am, I’m not done researching damnit!), but bring it on! If you’re a shill, come tell me how if you have an open short position, that going to the expert market is a good thing!</p>\n\n<p><strong>Thanks again ladies and gents for reading! Sorry for lying to you all yesterday about being done with the DD posts because I probably never will be done with them lol</strong></p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/L-wOtGBf8ulLv8pnQ47sz7DWGDiT8PfpFKMKsrpe3XM.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/dn1ace5dz1ob1.jpg", "time": 1694624055.0, "subreddit": "r/ThePPShow", "title": "Someone yesterday said I didn’t DRS 900 shares yesterday when I did. So I did it again today lol", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>WITH PROOF!</strong></p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dn1ace5dz1ob1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/tsdzrbzz7rnb1.jpg", "time": 1694493784.0, "subreddit": "r/ThePPShow", "title": "Idk. I found this article. Pay me!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Link to article. <a href=\"https://eqvista.com/cancellation-of-shares/\">https://eqvista.com/cancellation-of-shares/</a> </p>\n\n<p>Obviously just hamster wheel going in the head and I’m probably not going to sleep well tonight... Might just continue reading hundreds of pages of dockets and background info on folks related to the case. I know, I know. I try not to be an emotional investor, but DAMN! I’m emotionally invested and I’m emotionally JACKED!</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/tsdzrbzz7rnb1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/r/ThePPShow/comments/16c7nfe/dont_be_emotional/", "time": 1694065399.0, "subreddit": "r/ThePPShow", "title": "Don’t be emotional", "text": "<!-- SC_OFF --><div class=\"md\"><p>Fuck it! Putting the trust me bro tag on this post too! Look, trading emotionally is BAAAAD NEEEWS, ok? I’m so sick of hearing “FUD” and “shill” tossed around every damn day! It means your basing your research and opinions on EMOTIONS! Here’s a fucking LOVELY article on how FEAR can be used to benefit! </p>\n\n<p>First, here’s a snippet from the introduction.</p>\n\n<p>Introduction\n<strong>Anxiety and fear responses are necessary components of adaptive behavior.</strong> Fear of predators and normal vigilant behavior are essential for survival in the wild. It is when these responses are uncontrollable that they stop being protective, instead becoming maladaptive and pathological, ultimately impairing an individual’s ability to function in the world.</p>\n\n<p><a href=\"https://www.sciencedirect.com/topics/psychology/fear-response\">https://www.sciencedirect.com/topics/psychology/fear-response</a></p>\n\n<p>There is more than one response to fear and the best one is to FIGHT! So are you going to keep fighting the ACTUAL bad guys like the buff ass apes and apettes I know you are? Or are we going to continue the in fighting over dumb shit?</p>\n\n<p>We are sooo close! Quit calling people shills for asking questions. Look at their profile. If they seem like a shill just don’t respond! WHY do some of us make ourselves out to be these all knowing god beings that shoot down ANY newcomer as a shill or an idiot and why do we have to peg them when they happen to be wrong?!?</p>\n\n<p>This is fucking COMPLEX stuff y’all! And a lot of us just don’t know 110% of it.</p>\n\n<p>What the FUCK happened to human decency?\nWhat the FUCK happened to the American dream?</p>\n\n<p>I’ll tell you… it died with the internet where people can hide safely behind their own walls, thousands of miles from who they are communicating with and totally shit on them with no consequences whatsoever. Call them names, make up stories about them. The list fuckin goes on! </p>\n\n<p>I’m sorry for yelling, guys and gals. It’s been a very, very hard month for me… and I just wish folks were nicer to each other. Even if you’re not in the same room with them, just act like you are! </p>\n\n<p>Be a GOOD person! 💜</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/r/ThePPShow/comments/16c5kyk/fucking_hacked/", "time": 1694058745.0, "subreddit": "r/ThePPShow", "title": "FUCKING HACKED", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just had to put a trust me bro on this cuz I don’t have any screenshots or jack shit really other than I’d swear on my dearly departed grandmother and all my other ancestors that I am being 1000% honest here. I was freaking out and like anyone, created a new email IMMEDIATELY and factory reset everything. </p>\n\n<p>I didn’t even back anything up. Fresh start! For the last week my iPhone NAME has been changed, NOT by me, to Kevin Malone. I am obviously NOT Kevin Malone, but I noticed it was Kevin Malone again yesterday (for the third time!) and changed it back to my chosen name. Lo and behold, today it’s FUCKING KEVIN MALONE AGAIN! Factory reset is done and I got no proof y’all, just be safe out there. Use unique passwords and usernames. And different ones across different platforms. Just make SURE you get a physical ledger so you can have a physical trail for your sign in information. </p>\n\n<p>And as always, this is not financial or legal advice and if you need such services, please seek a licensed professional. I offer no client/patron services.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "GodlessJuan", "url": "/r/BBBY/comments/166hge1/ape_have_important_treasury_bonds_question/", "time": 1693511102.0, "subreddit": "r/ThePPShow", "title": "Ape have important treasury bonds question!", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "GodlessJuan", "url": "https://i.redd.it/433d8grnsglb1.jpg", "time": 1693495863.0, "subreddit": "r/ThePPShow", "title": "NOT selling", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just a boredom meme. Do NOT let the stagnation get to y’all! We are in the end game now so I’ll probably just be doing more memes for now, but if we get a spicy docket, I’ll definitely do a post on that. And don’t think “oh we’re so close I can max out my credit cards and take out a loan and start spending early”. Don’t do that shit, ok? Lol Not financial advice of course.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/433d8grnsglb1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/p9xazk9cg7lb1.jpg", "time": 1693382755.0, "subreddit": "r/ThePPShow", "title": "SEC docket 2086", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m sure most us night owls or those of us that barely sleep, I’m sure you’ve already read the SECs objection. SEC clearly lays out that an absence of the opt out form is not confirmation that said shareholder has given up his/her rights to later sue.  </p>\n\n<p>1) they explain that to opt out, the holders must receive something in return, which as it stands, is nothing. According to the SEC, that’s a no no!</p>\n\n<p>2) they cited other cases (I’ve found some on my own too) where the absence of a filled out opt out form is not legal grounds for barring the holder from perusing legal action, except in extreme circumstances.</p>\n\n<p>So here’s my thoughts on this… WE. ARE. CLOSE!</p>\n\n<p>The SEC KNOWS a bunch of apes aren’t even gonna bother with those forms, new amended plan drops, SEC gets ahead of the ball by getting directly involved and saying “HEY! If you don’t give these people something, you can’t just wipe out there shares”!</p>\n\n<p>Why in the world would the SEC file an objection to a disclosure statement and plan!?</p>\n\n<p>I’ll tell you why… to get ahead of the ball cuz they KNOW shits bout to pop off and they wanna continue to appear like the “good guys” when this is all over so their institution remains in tact.</p>\n\n<p>Get ready 🦍 MOON SOON! Fed bout to go brrrrrrrrrrr.</p>\n\n<p>As always, not financial or legal advice. Purely my own speculation. You should seek a licensed professional for your specific needs. I aim to change no one’s opinion one way or the other.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/p9xazk9cg7lb1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/rt8pvfqrhpkb1.jpg", "time": 1693165312.0, "subreddit": "r/ThePPShow", "title": "Price up? Price down? Wut price?", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rt8pvfqrhpkb1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/vhifuqjd0ijb1.jpg", "time": 1692638869.0, "subreddit": "r/ThePPShow", "title": "Just bored so making memes 🤷‍♂️", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/vhifuqjd0ijb1.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/15sxsel", "time": 1692210353.0, "subreddit": "r/ThePPShow", "title": "I just keep coming back to these two things and I just know we are right. We were just a little early.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not financial advice, but I will be remaining zen even AFTER this week even if we get bad news or no news.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/1Ow0u4_m4-YW14r-1oWG2XnZQGyx3r6vtI0UGro_TIo.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/15s1v35", "time": 1692126956.0, "subreddit": "r/ThePPShow", "title": "Ok seriously. Wtf is happening over at Fidelity!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Trading stopped. App down. Website down. Reps unable to see my account information and said it was “weird” because it was happening across so many platforms.</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/HRiQRA0WDMq7lVNySMe87UcuqLo_tyb0vkLx27EWGic.jpg\"/></div>"},
{"username": "GodlessJuan", "url": "/r/BBBY/comments/15pq46w/deeper_dive_into_derivatives_exposure_2008current/", "time": 1691903631.0, "subreddit": "r/ThePPShow", "title": "Deeper dive into derivatives exposure. 2008/current comparison.", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/15pktx6", "time": 1691887883.0, "subreddit": "r/ThePPShow", "title": "2022 Quarterly derivatives report: First quarter", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.redditstatic.com/desktop2x/img/renderTimingPixel.png\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/r/ThePPShow/comments/15l8o63/just_wanted_to_share_this_light_hearted_story/", "time": 1691472606.0, "subreddit": "r/ThePPShow", "title": "Just wanted to share this light hearted story!", "text": "<!-- SC_OFF --><div class=\"md\"><p>So my son and I just watched the PP show, technically last night, and I just wanted to share our interaction. It was my 4th show watching and my sons first and he would like you to know, PP that he loves the show! We both do of course! </p>\n\n<p>We took some time going over the Teddy books before the show started.. I explained some deep DD and a bunch of tin foil with him and after he watched your show and so much of the things we talked about were also mentioned on the show, he said “Omg! Stop connecting the dots”! 😆 </p>\n\n<p>He usually doesn’t give a crap about this kinda stuff, but the more he listens in on me watching your show, the more he tries to understand it. Just wanna say thanks to you guys for all you do! </p>\n\n<p>You already know, but ONLY THE YOUNG!</p>\n</div><!-- SC_ON -->", "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "GodlessJuan", "url": "/r/BBBY/comments/15hkjll/my_thesis/", "time": 1691107864.0, "subreddit": "r/ThePPShow", "title": "MY THESIS", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/15hatlj", "time": 1691085065.0, "subreddit": "r/ThePPShow", "title": "Still think it’s worth it to at least voice my concerns 🤷‍♂️ even if it doesn’t influence direct action.", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.redditstatic.com/desktop2x/img/renderTimingPixel.png\"/></div>"},
{"username": "GodlessJuan", "url": "https://www.reddit.com/gallery/15gh8q4", "time": 1691002213.0, "subreddit": "r/ThePPShow", "title": "Made my first comment to the SEC", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.redditstatic.com/desktop2x/img/renderTimingPixel.png\"/></div>"},
{"username": "GodlessJuan", "url": "https://i.redd.it/1x7gs0mezlfb1.jpg", "time": 1690944286.0, "subreddit": "r/ThePPShow", "title": "If it’s been said once, we might as well say it a few more times… since SOME people still don’t get it! This is NOT the final plan!", "text": null, "flair": {"text": "El Capitan America 🇺🇸 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/1x7gs0mezlfb1.jpg\"/></div>"}]