[{"username": "grice24", "url": "https://i.redd.it/w1epgz81xexb1.jpg", "time": 1698703293.0, "subreddit": "r/ThePPShow", "title": "\"Knock knock MFers\" Said the caterpillar to Kenny and Cifu", "text": "<!-- SC_OFF --><div class=\"md\"><p>I fucking love being knee deep in this saga, and it gets more exciting every day as we inch closer to Tomorrow ™️</p>\n\n<p>Can&#39;t wait to see what comes out of the cocoon!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/w1epgz81xexb1.jpg\"/></div>"},
{"username": "grice24", "url": "https://www.reddit.com/r/ThePPShow/comments/17igxvz/rc_ceo_letter_comparison/", "time": 1698509202.0, "subreddit": "r/ThePPShow", "title": "RC CEO Letter comparison", "text": "<!-- SC_OFF --><div class=\"md\"><p>Remember the weird RC CEO Letter that varied in fonts depending on where it was sent? And that it was awkwardly written that any of his followers would know it wasn&#39;t anything like his writing style nor the message that he&#39;d be truly relaying?</p>\n\n<p>I think he sent that letter out as a foreshadow what was going to happen with shares getting cancelled reorganized insert name here - depending on broker, perhaps he sent every broker a differently worded instruction sheet. </p>\n\n<p>Could be my tinfoil smoke or could be a breadcrumb, but I don&#39;t believe in coincidence and all of the letters and instructions in this saga were very strange.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "grice24", "url": "https://www.reddit.com/r/ThePPShow/comments/17chg2z/where_do_we_find_the_rc_ventures_court_docs_that/", "time": 1697825005.0, "subreddit": "r/ThePPShow", "title": "Where do we find the RC Ventures court docs that were to be submitted on or before today?", "text": "<!-- SC_OFF --><div class=\"md\"><p>question in title, wondering if it&#39;s something that is public or just submitted to that court and we don&#39;t find out for awhile or ever.. </p>\n\n<p>i sure fucking hope it&#39;s a bomb of info and includes diagrams of how ryan cohens nuts dragged across every naysayer&#39;s forehead. </p>\n\n<p>conviction, unwavering.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "grice24", "url": "https://www.reddit.com/r/ThePPShow/comments/16q7sjv/in_rc_i_trust_i_wouldnt_hold_under_any_other/", "time": 1695483988.0, "subreddit": "r/ThePPShow", "title": "In RC I trust - I wouldn't hold under any other circumstances.", "text": "<!-- SC_OFF --><div class=\"md\"><p>If anyone other than Ryan Cohen was behind this thing, I&#39;d be out.</p>\n\n<p>I&#39;m dead serious.. if the rumor was Elon was behind it, I&#39;m out. Chamath? I&#39;m out. Mark Cuban? I&#39;m out. Any god damn tycoon in the world, i&#39;m out. I can&#39;t think of any big name that would have any interest in helping individual investors out by saving troubled companies that most write off as RIP DUMBASS.</p>\n\n<p>Before gamestock, I never even knew who Ryan Cohen was. Along the way, I&#39;ve learned a lot about him and his upbringing and his values. Come to find out,  I&#39;m him - most of us are like him. </p>\n\n<p>The conviction will come across to a meltie that we are blindly following some pipe dream of riches, but I can speak for most investors in this saga that we see and believe in the bigger picture that&#39;s coming. And like smart investors that build over the long term, buying and holding companies that no one else wants is a pretty solid plan out of Big Uncle Carl&#39;s playbook.</p>\n\n<p>Melties, if all of the strange parts of this story play out the way we anticipate, the told ya so&#39;s are going to be coming like an avalanche rolling down the mountain. </p>\n\n<p>RC, you smart sumbitch, we believe in you. Please push the detonate button soon.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]