[{"username": "gvsulaker82", "url": "https://www.reddit.com/r/ThePPShow/comments/17wefyl/mod_who_sshall_not_be_named/", "time": 1700110287.0, "subreddit": "r/ThePPShow", "title": "Mod who sshall not be named", "text": "<!-- SC_OFF --><div class=\"md\"><p>Wass jusst thinking. I was trying to figure out why this person who shall not be named is pushing so hard against bbby holders when the stock literally can not be bought or sold? Why does she care so much? She doesn’t have a position correct? Maybe, just maybe she’s trying to get us to become anti gme because that’s what her and her community supposedly represent. Why not pin us against gme holders (even though just about every bbbyq holder is also a gme holder). Maybe because she’s most definitely a plant, is most definitely anti retail and most definitely does not want us buying gme with our now available funds. Maybe this is a coordinated attack while also having people come in here and push overstock all of the sudden. I’ve always only known of two stocks w infinite risk and two stocks in the same damn basket. Two extremely heavily shorted stocks. Now one can’t be bought. Well ima keep buying the hell out of gme, idk about you. Nfa</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "gvsulaker82", "url": "https://www.reddit.com/r/ThePPShow/comments/17s87iq/ill_fly_over_there_and_kill_you/", "time": 1699635025.0, "subreddit": "r/ThePPShow", "title": "I’ll fly over there and kill you", "text": "<!-- SC_OFF --><div class=\"md\"><p>Was the most hilarious jake moment yet. It was so out of character for him and so hilarious I can’t remember laughing so hard at the ppshow before. Pretty sure that was due to Jake just being so fed up during the play debate that he finally malfunctioned. It was just so…perfect in the moment 🤣</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "gvsulaker82", "url": "https://www.reddit.com/r/ThePPShow/comments/17i4s72/some_confirmation_bias/", "time": 1698462841.0, "subreddit": "r/ThePPShow", "title": "Some confirmation bias", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ppshow started putting RC in the opening credits along w a bbbyq background recently. No way RC would let that slide if he wasn’t involved with the play. He would ask for the ppshow to remove any images of him in the credits. Cheers to being rich soon!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "gvsulaker82", "url": "https://www.reddit.com/r/ThePPShow/comments/17hq8ii/theres_a_thread_in_one_of_our_cousins_subreddits/", "time": 1698420855.0, "subreddit": "r/ThePPShow", "title": "There’s a thread in one of our cousins subreddits", "text": "<!-- SC_OFF --><div class=\"md\"><p>Basically just an entire thread of fud slinging shit at pulte and RC and DFV even. Pretty crazy. I’ve never seen so much inaccurate info and all of these ppl that are supposedly invested in RC over there that don’t believe in pulte are questionable actors imo. How do you invest in gme and RC and not see the entire picture , the buy buy baby angle, and realize that RC likes only pultes posts and still try to paint him as a clout chaser, grifter etc. we are fucking close. I’ve never seen so much misinfo and gaslighting about pulte.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "gvsulaker82", "url": "https://www.reddit.com/r/ThePPShow/comments/17g6jdl/just_a_couple_of_random_thoughts/", "time": 1698245368.0, "subreddit": "r/ThePPShow", "title": "Just a couple of random thoughts", "text": "<!-- SC_OFF --><div class=\"md\"><p>These aren’t connected at all. So I was thinking about it and I was wondering about the 500 dollar thing pulte had ppl doing. I was thinking why doesn’t he just donate, he gives away thousands a day anyhow? It’s most likely to insure plausible deniability when this play hits. He can’t financially help pp that way but it’s an indirect way of a. Giving pp and the gang the motivation and incentive to keep fucking and b. Bring the community together to form an even stronger community and to also signal to us that everything will be ok which I believe has been speculated before. The second part of my post is completely irrelevant to the first. I was thinking of rcs interview last year. He stated he was not interested in being ceo again, yet here we are a year later and he’s ceo. My theory is their plan a was the lbo in January and when jpm blocked that it backed everything up. I think by June when furlong stepped down they were expecting him to be ready to go wherever then and whether it be Teddy or gmerica or whatever and because bbby has been put on hold due to bankruptcy that plan was delayed which is now why RC is the current ceo. RC is the current ceo because whatever GameStop was supposed to acquire pre June has also been pushed back whether that be buy buy baby or something else. Someone else was supposed to come in and steer the ship of the new gme company w the acquisition and whoever it is has to be anonymous until then.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "gvsulaker82", "url": "https://www.reddit.com/r/ThePPShow/comments/16npkvk/pultes_office_ppshow_flight_tickets/", "time": 1695227124.0, "subreddit": "r/ThePPShow", "title": "Pultes office ppshow flight tickets", "text": "<!-- SC_OFF --><div class=\"md\"><p>This guy pulte is constantly giving money online to those in need. He then sets up a visit to his office w a weeks notice which isn’t much for regular joes. Pp then expresses to pulte he’s unsure due to his financial situation. Pulte doesn’t offer to cover tickets as far as I’m aware. Imo this is a hugely bullish indicator and perhaps a message. Knowing what we know about pulte and his helping those less fortunate, I don’t see any scenario where he invites a bunch of bbbyq holders to his office knowing they have to pay their own way unless he’s confident bbbyq holders aren’t about to be wiped out. Definitely makes me even more bullish. I have had unwavering conviction in this play and gme since early this year but this is definitely the cherry on top. Unsure if anyone has mentioned this yet; I didn’t hear it brought up on pp show or on sub so thought I would contribute. I’m in this play not because I’m a financial expert, but because I understand human behavior. And human behavior since Jan of 2021 is telling me we are bout to be rich. Wagmi! Only the hung.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "gvsulaker82", "url": "https://www.reddit.com/r/ThePPShow/comments/166gspm/drs_ast_question/", "time": 1693501664.0, "subreddit": "r/ThePPShow", "title": "Drs ast question", "text": "<!-- SC_OFF --><div class=\"md\"><p>Does anyone know where I can see which shares are short and long on ast? Website is kinda clunky, I want to transfer just my long shares back to fidelity but unsure how to go about it.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]