[{"username": "H3rbert_K0rnfeld", "url": "https://www.reddit.com/gallery/17teavn", "time": 1699770295.0, "subreddit": "r/ThePPShow", "title": "Uncle Fester - the OG HODLer", "text": "<!-- SC_OFF --><div class=\"md\"><p>Well then friends!  The wife and I were enjoying some quiet time and a movie.  We&#39;ve been going through the Christopher Lloyd catalog and arrived at The Addams Family Values.  </p>\n\n<p>All was well in the world.  I hadn&#39;t Reddited in hours.  My wife is a Swiftie.  She hadn&#39;t Swifted in hours.  We were all settled down and snuggled in for a movie.  That changed instantly.  I hosed down the coffee table with a mouth full of beer, jumped off the couch, pointing at the TV like a chimpanzee!  The wife WHAT THE FUCK!?ed naturally.  Pandemonium ensued for about 6.9 mins.  I took a scolding amd cleaned up a mess for 8.4 mins.  When the dust settled I got to making this post.</p>\n\n<p>Allow me to connect Ryan&#39;s chopstick post to Uncle Fester using the same Tennessee tar that made Jed Clampett a rich man.</p>\n\n<p>Using the breakthrough in home video marketing (Cheap reference to Spaceballs) we are able to rewind this saga to July 19, 2021.  Ryan Cohen posts a pic to Xwitter of two chop sticks sticking out of his nose.  July 19, 2021 was right about when the DRS movement started.  </p>\n\n<p>Debbie is seen to be rifling through Uncle Fester&#39;s papers.  He has held physical papers of US Treasuries, Bonds, Stock Certificates, IRA&#39;s for 84 years.  Family Values came out in 1993.  1993 we were well into the so-called paperless office and digital stocks.  Why would Fester have ancient paper certificates?</p>\n\n<p>And then Uncle Fester, OG HODLer, tries to impress Debbie by sticking chop sticks up his nose.</p>\n\n<p>I think Ryan was impressed with apes HODLing.  Real HODLIng.  None of that fake pound you in the ass shit you see in the brokerages.</p>\n\n<p>Anyway.  It was fun to share.  </p>\n\n<p>DRS!  HODL!  No cell no sell!  Remember Harambe!  And San Dimas Footbal rules!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/7TK3e7QtIOYJ0iPQ1UByLlOZ_vzlAfZDvXoOb4xLiKg.jpg\"/></div>"},
{"username": "H3rbert_K0rnfeld", "url": "https://i.redd.it/n0qyvereaetb1.png", "time": 1696952297.0, "subreddit": "r/ThePPShow", "title": "Arnold love ice cream too", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/n0qyvereaetb1.png\"/></div>"},
{"username": "H3rbert_K0rnfeld", "url": "https://i.redd.it/ewdfw3y9p8tb1.jpg", "time": 1696884651.0, "subreddit": "r/ThePPShow", "title": "TS, Tree's, and Apples. Oh My!", "text": "<!-- SC_OFF --><div class=\"md\"><h2>Introduction</h2>\n\n<p>Sup PP&#39;s. Here come&#39;s my first post.  I&#39;m not a Big PP DD writer.  I write from the mobile app and so like the high school kids of California you&#39;re just gonna have to take this raw.</p>\n\n<p>Let&#39;s get started</p>\n\n<p>Last night as per usual I had the puzzle pieces out in front of me and my wife snuggles in, gives me a little handy and a middle finger up the uranus but notices I&#39;m not really into it.  She asks what am I thinkin?  I tell her I&#39;m reading about Taylor Swift.  She gets all giddy and says Oooh she&#39;s my favourite subject!  I wanna talk about Taylor Swift too!  She is not a dirty ape.  I tell her about the money moves but I keep the tinfoil on my head.  I pay a lot of money so she can get her hair dressed and I don&#39;t want to mess it up.  So I tread carefully so not to taint the subject and ask Without any context what does the word <em>blah</em> mean to Taylor Swift</p>\n\n<p>And down the rabbit hole we go.  The following is a compilation of an hour of comparing notes.</p>\n\n<h2>Blah word 1 - Butterflies</h2>\n\n<p>It is without any doubt Taylor Swift the greatest music act in current history.  Her net worth was just shy of $1b and with the way she squeezes her fans trading cheap chinese trinkets for $ she has probably broken into a Baby Billy.  Love her or hate her she is a financial juggernaut right now.</p>\n\n<p>Aside from her financial profile her entire existence is shrouded in mystery and chicken eggs just like RCEO and Pulte.</p>\n\n<p>Taylor Swift happens to be obsessed with butterflies.  She has  butterfly imagery throughout her music videos and concerts and various media releases.</p>\n\n<p>Example -\n<a href=\"https://youtu.be/FuXNumBwDOM?feature=shared\">Taylor Swift - Me!\n</a></p>\n\n<p><a href=\"https://youtu.be/XzOvgu3GPwY?feature=shared\">Taylor Swift - Karma</a></p>\n\n<p>Is it me or is there also a lot of ComputerShare purple shown also?</p>\n\n<p>More butterflies - <a href=\"https://www.elitedaily.com/p/the-meaning-of-the-snake-exploding-into-butterflies-in-taylor-swifts-me-music-video-is-so-symbolic-17220090\">https://www.elitedaily.com/p/the-meaning-of-the-snake-exploding-into-butterflies-in-taylor-swifts-me-music-video-is-so-symbolic-17220090</a></p>\n\n<p><a href=\"https://www.mirror.co.uk/3am/us-celebrity-news/taylor-swift-feels-teenage-butterflies-31114512\">https://www.mirror.co.uk/3am/us-celebrity-news/taylor-swift-feels-teenage-butterflies-31114512</a></p>\n\n<p><a href=\"https://www.bustle.com/p/taylor-swifts-new-music-will-be-all-about-butterflies-according-to-these-new-fan-theories-16959615\">https://www.bustle.com/p/taylor-swifts-new-music-will-be-all-about-butterflies-according-to-these-new-fan-theories-16959615</a></p>\n\n<p>I don&#39;t have a direct connection to our shit yet so let&#39;s move on</p>\n\n<h2>Blah word 2 - Tree</h2>\n\n<p>We all know RCEO thinks the apple doesn&#39;t fall far from the tree -\n<a href=\"https://twitter.com/ryancohen/status/1499057365601161223\">https://twitter.com/ryancohen/status/1499057365601161223</a></p>\n\n<p>And in the last few days we&#39;ve seen Taylor Swift&#39;s image at 3:05</p>\n\n<p>Buuut do you know who Tree Paine is - \n<a href=\"https://en.m.wikipedia.org/wiki/Tree_Paine\">https://en.m.wikipedia.org/wiki/Tree_Paine</a></p>\n\n<p>Some say Taylor Swift would be a Sideshow Bob without Tree Paine.</p>\n\n<h2>Green Apple</h2>\n\n<p>Family anecdote time. My grandfather grew up on a farm, was recruited to fight in WW2, came home and married my grandmother, they had my dad and aunts and uncles and they had tons of grand kids and we are a big ass Irish Catholic family.  He worked in construction, retired at 54, taught us all tough life skills straight out of the depression era.  He passed away at 88.  He lived a long wonderful life.  I am proud to be his grandson.</p>\n\n<p>Like all grandparents my pops and mams told the same stories over and over and over, hahah!  I loved every second of it.  I&#39;m 49 now.  They visit my dreams periodically and I wake up crying in happiness and sadness.</p>\n\n<p>One of his famous stories was about green apples.  He grew up on a farm eating unripe green apples.  He would go to say in 1937 the army dentist told him that tooth has to come out.  The dentist started work then scratched his beard hmming.  He could not pull the tooth so he says I&#39;ll brb.  He brought in a drill sgt.  He said they had their foot in his chest and damn near pulled his jaw out of his head they still could not pull the tooth!  And so the tooth stayed.  He would laugh and laugh and claim the acid from the green apples made his bones tough as nails!  </p>\n\n<p>In my mind it was Monty Python style pandemonium and clown music in the dentist office!</p>\n\n<p>Alright gahdammit.  I&#39;m gettin all emotional now!</p>\n\n<p>I doubt this has anything to do with RCEO&#39;s green apple but damn it gives me a great excuse to recall fond memories of my life and share with you dirty PP&#39;s.</p>\n\n<h2>Blah word 3 - Ownership</h2>\n\n<p>Taylor Swift and Apple music have been clashing for years really since the dawn of modern streaming music. And  If anyone knows anything about internet culture they know the internet doesn&#39;t forget or forgive.  </p>\n\n<p>Taylor Swift is carrying a vendetta against all corp music - Apple Music, Spotify, Big Machine Records.  She&#39;s been getting other artists to leave Scooter Braun&#39;s Big Machine Records label.  That&#39;s great but where are they going? </p>\n\n<p>Taylor Swift is also obsessed with ownership.  We see that in her rerecording her back catolgue and rereleasing the  as (Taylor&#39;s Version) which she fully owns the right&#39;s to.</p>\n\n<p>We are also obsessed with ownership by utilizing the DRS process. We are investing in a corp that also happens to be obsessed with ownership of digital assets (GameStop) and happens to have a marketplace in beta that can sell items along with their digital ownership rights.</p>\n\n<h2>Here comes Little Boy</h2>\n\n<p>It is my uneducated opinion Taylor Swift is creating a label featuring today&#39;s mega stars.  That label will sell NFTs that will provide ownership right to digital music using the GameStop marketplace.  The business will be part of the butterfly corp.</p>\n\n<p>Could you imagine a launch that would have a greater impact??</p>\n\n<p>I hope you enjoyed my first post.  I&#39;ll be listening to the conversation and post edits if needed.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ewdfw3y9p8tb1.jpg\"/></div>"}]