[{"username": "habitualpotatoes", "url": "https://www.reddit.com/r/ThePPShow/comments/170ivng/the_lack_of_info_with_ast_is_a_cause_for_concern/", "time": 1696514718.0, "subreddit": "r/ThePPShow", "title": "The lack of info with AST is a cause for concern", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m as happy to go along with tinfoil as the next OG and &#39;they&#39; are definitely locked in here with us now BUT the fact that numerous people are unable to access account information at AST is not a great sign.</p>\n\n<p>As the company formerly known as BBBY&#39;s transfer agent (TCFKABBBY), they were the guys who were responsible for keeping track of ownership of shares. It seems like the do or die end game we are getting to needs to have some form of distribution for it to a positive ending. There can&#39;t be a distribution if they don&#39;t have a record of who owns what.</p>\n\n<p>Now it could be that a new transfer agent has been put in place (Computershare for example), but it would not explain why the data has been wiped from AST before an announcement has been made. So many bits of data legislation would require AST/Computershare to inform the user that their data was been transferred to a new organisation so that they could object/consent to the data policies of the new transfer agent.</p>\n\n<p>So it makes me feel that they have wiped the data as they no longer have an agreement with TCFKABBBY.  </p>\n\n<p>sad noises - but hoping my smooth brain ends up being completely wrong.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "habitualpotatoes", "url": "https://www.reddit.com/r/ThePPShow/comments/16amah1/hl_apes_i_think_that_hl_are_ignoring_the_fsm_act/", "time": 1693915227.0, "subreddit": "r/ThePPShow", "title": "HL Apes - I think that HL are ignoring the FSM act which went live last week", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/s5vkgfo0efmb1.png?width=621&amp;format=png&amp;auto=webp&amp;s=bd17a20762dd1a5bd6b6fd996d04063e99a56df8\">https://preview.redd.it/s5vkgfo0efmb1.png?width=621&amp;format=png&amp;auto=webp&amp;s=bd17a20762dd1a5bd6b6fd996d04063e99a56df8</a></p>\n\n<p>Not a finance Ape - but the previous issue was that the shares had to traded in a UK regulated exchange to be eligble to held with HL.</p>\n\n<p>There is no longer a requirement for a UK regulated investment firm that was in scope of the previous rules to trade on a UK regulated marketplace (the reason for being able to use shares from DE market).   </p>\n\n<p>This change was implemented on the 29th August. I get the feeling that this going live might have had an impact on HL&#39;s partner and hence the sudden exit.</p>\n\n<p>But the exemption within the new rules should mean that HL could still execute trades for BBBYQ with a US based counterparty and be compliant - in the same way that US brokers and IBKR are able to.   </p>\n\n<p>Not sure what legs this has - but if you&#39;re stuck in the platinum hands position - might be worth a discussion with HL. Feel that HL have a duty of some kind to provide a way to exit the position if they&#39;re the ones who have stopped being able to provide the service (even if 3rd party agent has exited).  </p>\n\n<p>FCA announcement on repel of the STO in MiFIR last week: <a href=\"https://www.fca.org.uk/news/statements/fca-statement-share-trading-obligation\">https://www.fca.org.uk/news/statements/fca-statement-share-trading-obligation</a>  </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/797uyetiGX7dkyrIIgmmVzJb4wEjd4AdNECyzG4XNew.jpg\"/></div>"}]