[{"username": "Hard-Mineral-94", "url": "https://i.redd.it/lof1md4kl8rb1.jpg", "time": 1696011706.0, "subreddit": "r/ThePPShow", "title": "Due Diligence into PPSEEDS himself", "text": "<!-- SC_OFF --><div class=\"md\"><p>We’ve come full circle ladies and gents, this is my final speculation about this play and it’s about our boy <a href=\"/u/ppseeds\">u/ppseeds</a> himself. Our boy has been spending a shit ton of time with <a href=\"/u/RealPulte\">u/RealPulte</a> and there seems to be some major activity going on with regards to the PPSHOW which is happening at the same time as the SpaceX launch at 8:30 PM. </p>\n\n<p>Elon Musk left us with one tantalizing hint regarding Bed Bath and Beyond’s fate that has me thinking along different lines to the popular TEDDY reverse merger thesis.</p>\n\n<p>Elon’s takeover of Twitter and rebranding to X has largely been met with disapproval and skepticism from the public, several major backers/investors including his Saudi Arabia backers, have openly voiced their disapproval of his time spent on X away from TESLA and Space X. His popularity has been plummeting recently and his public image as a Futurist which degraded to MemeLord Shitposter is now slipping into AltRight QANON status.</p>\n\n<p>So it might be time for a public image overall for Musky. Along comes BBBYQ and the memestock movement and Ryan Cohen’s congratulatory message of “welcome to the world of activist investing” to Elon. If SpaceX decides to reverse merge into the shell that is BBBYQ, saving retail investors and sticking the ol Giant Dildo Middle Finger to Short Hedgefunds in the process, in a move that NONE of us saw coming, it would be a brilliant masterstroke that would rebrand Musk once again as a savior of the common man.</p>\n\n<p>The question is, what does <a href=\"/u/ppseeds\">u/ppseeds</a> know about it? Blink twice bro.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/lof1md4kl8rb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/7a64brzd52rb1.jpg", "time": 1695933643.0, "subreddit": "r/ThePPShow", "title": "I’m getting liquidated on Oct 17 (Cash App)", "text": "<!-- SC_OFF --><div class=\"md\"><p>So now we come down to it, hero or zero, when they came for the gypsies I didn’t speak out and all that. One by one the brokers are going to start liquidating us. Sure we can DRS our shit and get out before then but if our activist investor doesn’t do SOMETHING soon we’re going to get fucked.</p>\n\n<p>That’s $5000 down the drain, when will ETrade, Schwab, TDA, FUDelity and the others start? This is getting down to the wire. If Ryan’s going to do something, it needs to be soon.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/7a64brzd52rb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://www.reddit.com/r/ThePPShow/comments/16irpjd/where_the_fuck_is_papa_papalia/", "time": 1694720335.0, "subreddit": "r/ThePPShow", "title": "Where the fuck is Papa Papalia?!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Can someone try to find out where he is and if he’s ok? Or did he get whacked like they did with Gustav Arnal? Where’s Michael Kaplan? WTF is going on?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://www.reddit.com/gallery/16h5ozb", "time": 1694558700.0, "subreddit": "r/ThePPShow", "title": "CHECKMATE. JPM + Freeman Capital Lien on BABY is wiped out.", "text": "<!-- SC_OFF --><div class=\"md\"><p>￼​Jake Freeman and JPM were the guys with liens on BABY, they had to be wiped out in order to deliver it to the interested party.</p>\n\n<ol>\n<li> ⁠Who paid off JPM? The DIP Financier</li>\n<li> ⁠Who wiped out Jake Freeman? The DIP Financier</li>\n<li> ⁠What did both JPM and and Jake Freeman have in common? A Lien on BABY.</li>\n</ol>\n\n<p>Check. Fucking. Mate.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/2py2we35rHaGotdK4CoIBBPBlPpIjBjQG5VaQr-7aZE.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/mhxr469lcwnb1.jpg", "time": 1694555872.0, "subreddit": "r/ThePPShow", "title": "CALL FOR RESEARCH INTO FREEMAN CAPITAL LIEN ON BABY", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys, so I know all of us have been looking into the future to try to see what happens, but sometimes to see the future you need to look at the past. RC Ventures letter to the board of Bed Bath and Beyond has been followed to a T up to this point, with regards of trimming/liquidation of fat, preservation of vendor contracts, selling off leases, etc.</p>\n\n<p>JPM had a $450 million loan to Bed Bath that they were using to leverage a lien on BABY. JPM got paid off.</p>\n\n<p>LIEN 1 DONE</p>\n\n<p>Freeman ??? Had a lien on BABY through bonds, and if I’m understanding correctly from court today, is getting wiped out very soon.</p>\n\n<p>LIEN 2 DONE.</p>\n\n<p>Now with those liens taken care of does anything stand in the way of BABY being given to the DIP Financier?</p>\n\n<p>Let me offer some perspective from a chess player’s standpoint. Getting BABY has always been checkmate for Hedgies. He tried an LBO in Feb and was blocked. Then his next attack was going into bankruptcy, liquidating assets to create a point-of-no-return situation for Bed Bath and Beyond, including selling off the leases and IP so the only route available for everyone involved was checkmate (him getting BABY).</p>\n\n<p>So he picked off his enemies one by one at that point, paying off JPM first and now wiping out Class 6 Bondholders. </p>\n\n<p>Am I missing something? Or are we at checkmate?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mhxr469lcwnb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://www.reddit.com/gallery/16fwh0n", "time": 1694441840.0, "subreddit": "r/ThePPShow", "title": "For anyone saying Ryan Cohen Dumped the Stock here are some pics of u/freemancapitalmngmnt participation in the pump and dump that happened in August of last year.", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/csh5mz7ifxlb1.jpg", "time": 1693697254.0, "subreddit": "r/ThePPShow", "title": "JENGAMAN RATED R", "text": "<!-- SC_OFF --><div class=\"md\"><p>PP MOD ANNOUNCEMENT:</p>\n\n<p>Hey guys what’s up? The following post is made with the permission of <a href=\"/u/Stock_Digest\">u/Stock_Digest</a> and <a href=\"/u/ppseeds\">u/ppseeds</a>:</p>\n\n<p>JENGAMAN RATED R</p>\n\n<ol>\n<li><p>TLDR: FREE BOOK\nI wrote an extremely, dark, fucked up Scifi/Anime Space Novel called JengaMan Rated R, available for everyone, about a sociopathic tree creature from outer space raised in a Naruto-esque world before leaving in Part 2 of the book for a Star-Wars-esque world. </p></li>\n<li><p>TLDR: PROFITS FOR EVERYONE\nI’m looking to collab with the community on an affiliate marketing program that makes people $5 per sale for promoting my artwork, which is being sold as T Shirts and Crop Tops (like the one above), but I need a programmer apes help to set up the affiliate system.</p></li>\n<li><p>TLDR: QR CODE PROGRAMMER APE REQUIRED:\nListen, I know my shit is good and has value, you help me I help you. This community has a lot of power. Per my English professors from University plus their peers, my writing is top-notch and JengaMan Rated R has the potential to be the Spaceballs of our generation. If we set this up right, then we both eat, people scan your QR Code and get $5 off a $30 shirt and you get $5 back. My Shopify cost of production is $15 so that leaves me with $5. It’s as egalitarian as possible and leaves us all as 50/50 partners.</p></li>\n</ol>\n\n<p>CONCLUSION: You are the Deep Fucking Value I see in this play.</p>\n\n<p>I have with in <a href=\"/u/realpulte\">u/realpulte</a> and Ryan Cohen but I think it’s time someone helps us NOW, and fuck it I’ll try. </p>\n\n<p>I want everyone to know about JengaMan and I want everyone to know about me. I also want to make you rich. I get $5, you get $5, we both blow up. That’s the deal. Even Steven. The missing link in all this is a QR CODE PROGRAMMER APE. That’s all that stands between us and making bank. I make the quality, you push it out, we all make profit. We just need someone to facilitate it.</p>\n\n<p>Below, I’ll share my book link, an Excerpt from the story and a link to my Instagram so you can see what you have to work with. This is a invitation for a community-born populist uprising through selling quality work. If it works, I will gift everyone who helped me with limited addition NFTs which give the owner store discounts on JengaMan merchandise with 10% royalty on resell of NFTs. An example is provided below in the comments.</p>\n\n<p>TLDR:</p>\n\n<ol>\n<li>Free Book (please review and upvote)</li>\n<li>Open request for QR Code Programmer Ape to help setup affiliate marketing program for apes in the community.</li>\n<li>NFTs for everyone who helps me and joins the #JengaMan Army</li>\n</ol>\n</div><!-- SC_ON -->", "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/csh5mz7ifxlb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/k9hydr499rlb1.jpg", "time": 1693623029.0, "subreddit": "r/ThePPShow", "title": "JENGAMAN RATED R FREE BOOK RELEASE FOR APEFAM", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/k9hydr499rlb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/sy3dqg7dlojb1.jpg", "time": 1692718638.0, "subreddit": "r/ThePPShow", "title": "Showdown! MasturDebators only, Pro Vs Con BBBY Arguments", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/sy3dqg7dlojb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/xl6uystcgkfb1.jpg", "time": 1690925062.0, "subreddit": "r/ThePPShow", "title": "Question for everyone: so what’s next? When is the date that we get the disclosure? When will everything come to a close? Holly Etlin said winddown by December. Bullish but in need of dates. Please help 🍆💦", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/xl6uystcgkfb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/dn3209eaj7fb1.jpg", "time": 1690768661.0, "subreddit": "r/ThePPShow", "title": "Remember Apes, this is all we ever need to know about the SEC when the boots on the other foot and we’re squeezing 10,000% on hedgefuck tears", "text": "<!-- SC_OFF --><div class=\"md\"><p>Let them eat cake? How about they LIGMA.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dn3209eaj7fb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://www.reddit.com/gallery/15b9z6k", "time": 1690483785.0, "subreddit": "r/ThePPShow", "title": "Based on RC Posts, something big is about to happen", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hope you’re ready for it.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/VvqVLVl0S0vVWBBtuFj2FAYszdE4lcrBTzdymGYe0Jo.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://www.reddit.com/gallery/15b84r1", "time": 1690479401, "subreddit": "r/ThePPShow", "title": "Need some hopium? Check this", "text": "For the shorts. Choo Choo mothafuckas here comes the Sun. One year ago to the day yesterday, RC tweeted in conjunction with the “best time to be alive in human history is now” tweet. His tweet? All species require adversity to survive. Stores close this weekend. What comes next? Death or glory. But riddle me this, downies, if we were going the full liquidation route, why pay off the $600 million dollar ABL credit facility with JP Morgan? Doesn’t make sense. Would have made a whole lot more sense for the DIP Financer to keep that money.", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/6USveuH8_zaW9X_EU1QkICTOIKhxSOCYzPGTy8ZuFBA.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/2zbjfds9p5db1.jpg", "time": 1689874764.0, "subreddit": "r/ThePPShow", "title": "I love you damn dirty apes! Heard you were looking for artwork so here’s one from yours truly! It’s one of three versions but I’m not sharing all of them because I’ll be making that into a commemorative NFT to give y’all to celebrate BBBY exploding later.", "text": "<!-- SC_OFF --><div class=\"md\"><p>TITLE: Memstock Episode 3 - Return of the Monkeys</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2zbjfds9p5db1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/8m793q3htxbb1.jpg", "time": 1689343471.0, "subreddit": "r/ThePPShow", "title": "GET FUCKING HYPED", "text": "<!-- SC_OFF --><div class=\"md\"><p>All the years of gaslighting, the bullshit hedgefund dick sucking on National Television, the blind eyes turned by our allegedly sacrosanct government towards the obvious abuse taking place in front of them. The hopes and dreams of honest men and women getting smashed over and over again by useless, soulsucking parasites in the name of a liquidity, making a mockery of true supply and demand. Let&#39;s get it. Let&#39;s smash these bastards to pieces. Let’s get our fucking future back. Stormtroopers are FUKT.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/8m793q3htxbb1.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://www.reddit.com/r/ThePPShow/comments/14x2dlv/tddy_squeeze_tendietown_and_the_end_of_days/", "time": 1689107024.0, "subreddit": "r/ThePPShow", "title": "TDDY Squeeze. Tendietown and the End of Days.", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is what&#39;s about to happen:</p>\n\n<ol>\n<li>TDDY squeezes</li>\n<li>MEME Basket Explodes</li>\n<li>Margin Calls go out</li>\n<li>Cascading Hedgefund Liquidations Start</li>\n<li>Cayman Islands/Offshore Accounts get liquidated </li>\n<li>NOT ENOUGH LIQUIDITY. Hedgefunds assets are seized and sold at Market Value. No buyers at current prices. Supply meets demand. Housing prices start dropping. Other people start panicking and selling.</li>\n<li>Housing Market Collapses.</li>\n<li>Run on Banks.</li>\n<li>Foreign Cash Buyers (China) step in and buy the assets at +15% relative to Market Value.</li>\n<li>Tenants start paying rent to China. </li>\n<li>China defeats USA without lifting a single weapon.</li>\n</ol>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://internationalbanker.com/history-of-financial-crises/the-volkswagen-short-squeeze-2008/", "time": 1688787761.0, "subreddit": "r/ThePPShow", "title": "TEDDY FINANCIAL Nuke set to blow next week", "text": "<!-- SC_OFF --><div class=\"md\"><p>HYPOTHESIS -</p>\n\n<p>Wally West obtained Barry Allen’s superpowers by recreating the lab accident that gave birth to the Flash. I believe that Carl Icahn, Ryan Cohen, Larry\nCheng and a host of other activist investors who hate shorts (Elon Musk, Ray Dalio, Mark Cuban) have secretly orchestrated a repeat of the Porche-Volkswagen Attack on Short Sellers and that we are going to see a repeat of that event happening here. Something important to note?</p>\n\n<p>74.1% of the company - there’s that number again - was owned by Porche when the squeeze was triggered, causing shares to skyrocket from 210 euros to 1005 euros from Oct 28 to Nov 2nd the squeeze lasted 4 days. After which Porche cut a deal with the shorts and let them\noff the hook with an offering, releasing a public statement that the squeeze was not their fault, rather the fault of their overleveraged opponents.</p>\n\n<p>TAKEAWAY - </p>\n\n<p>The Debtors represent Teddy Holdings and have purchased a supermajority stake in the company. They will detonate a financial bomb and wipe out the shorts, using the money from a post/peak squeeze offering to give them the war chest needed to compete on paper with Amazon. </p>\n\n<p>Teddy still has a lot of work that needs to be done for it’s “Mall-Azon” vision to succeed, and we should be on the lookout\nfor other companies they intend to acquire to create a walled-garden market to compete with Bezos’s open-field of random 3rd party sellers.</p>\n\n<p>My hypothesis on a peak top? No numbers, but if we’re in the several hundreds to $1000s and I see three touches to the top side I’m dipping out a bit.</p>\n\n<p>MISCELLANEOUS -</p>\n\n<p>Volkswagen Squeeze preceded the 2008 crash, I believe that this squeeze precedes the Great Crash of 2023, that’s why Apes will cash out into Teddy Holdings Bank.</p>\n\n<p>HISTORICAL ARTICLE -</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://internationalbanker.com/wp-content/uploads/2021/09/Volkswagen.png\"/></div>"},
{"username": "Hard-Mineral-94", "url": "/r/edwinbarnesc/comments/14f9y7o/the_icahn_blockbuster_takeover_play/", "time": 1687359449.0, "subreddit": "r/ThePPShow", "title": "The Icahn BlockBuster Takeover Play", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "Hard-Mineral-94", "url": "https://www.reddit.com/r/ThePPShow/comments/1395yc5/legal_precedent_for_bbbyq_oversold_shares/", "time": 1683331443.0, "subreddit": "r/ThePPShow", "title": "Legal Precedent for BBBYQ Oversold Shares", "text": "<!-- SC_OFF --><div class=\"md\"><p>US brokerage and bank operations and compliance managers will soon have to face an onerous back-office and legal challenge — figuring out how to make short sellers pay back $2.74 plus interest for each share of Dole Foods shorted more than three years ago. That money would be used to compensate beneficial investors who are considered the legitimate beneficiaries of a class action suit against Dole Foods.</p>\n\n<p>Triggering this administrative nightmare is a new decision from Delaware Chancery Court Vice Chancellor J. Travis Laster. He has ruled that US national securities depository Depository Trust Company (DTC) and its participants will have to work out among themselves how beneficial shareholders of Dole Food receive their fair piece of the $115.7 million pie in the class action settled in December 2015. The lawsuit accused Dole’s officers of fraudulently pushing down the company’s stock price before selling it into private ownership for US$1.6 billion in 2013. The privatization was structured as a merger agreement.</p>\n\n<p>Delaware is a popular state for companies to incorporate and the Chancery Court is the place to go to resolve disputes between Delaware corporations and their shareholders. The Dole settlement awarded an additional $2.74 a share plus interest to investors who could prove they were beneficial owners or recordholders during the eligible claims period. The eligibility period was June 11, 2013 to November 1, 2013, the day Dole’s privatization took effect and when DTC put a “chill” on Dole Foods stock. That meant that a participant could not deposit or withdraw its shares. Once the “chill” happened, positions in Dole’s common stock were locked in and could not change.</p>\n\n<p>Stuart Grant, a partner with the law firm of Grant &amp; Eisenhofer in Wilmington, Delaware who represented the class-action plaintiffs, says it comes down to the short-sellers compensating other investors.</p>\n\n<p>Questionable Enforceability</p>\n\n<p>Whether banks and broker-dealers will be able to obtain this money is the topic of plenty of debate among Wall Street operations executives. It all depends on how the contractual agreements between the banks and broker-dealers and  their short-seller clients are interpreted, say legal experts. It could take a quite a bit of time to review past records to locate and then notify the short-sellers. Whatever the agreements said back in 2013, the short-seller — often a hedge fund — could have since gone out of business or closed its account with its bank or broker-dealer. Even if located, the short seller could simply refuse to pay up. What then?</p>\n\n<p>If they don’t get the money back from the short-sellers, the banks and broker-dealers will likely decide to take it out of their own pockets, predicts Grant. If they don’t, they risk lawsuits from the disgruntled investors who lent the shares. Of course, the banks and broker-dealers could try to sue the short-sellers for the money. The short-sellers could then argue they are under no legal obligation to refund what they consider to be fairly-earned profits.</p>\n\n<p>Bottom line: in trying to solve one legal issue, Vice Chancellor Laster may have opened a Pandora’s box of others. Any liability will be shifted from Dole to the bank and broker-dealer participants of DTC. Judges in other state courtrooms could soon be faced with untangling new and even more convoluted lawsuits.</p>\n\n<p>His rationale: apparently, he couldn’t see any other way to solve the dilemma of who is entitled to the payout. “The journey down the rabbit hole would require mapping the whole warren,” argued Vice Chancellor Laster. Here is why: beneficial investors hold shares in the name of their financial intermediary. The financial intermediary, in turn, holds the shares in book-entry form at DTC. The US depository, in turn, holds shares on the books of a company in the name of Cede &amp; Co.</p>\n\n<p>Typically in a class action securities settlement, far fewer claimants ask for their compensation from the claims administrator than the number entitled to the compensation. Therefore, there is more money to divide among fewer shareholders. Even if short selling had occurred in those cases, it it was unlikely to result in a huge difference between the number of claimants asking for compensation and the number entitled.</p>\n\n<p>Not so with Dole Foods. There was so much short selling in the days leading up to Dole’s privatization — 2.9 million shares shorted as of October 13, 2013 — that a large discrepancy emerged between the number of “facially eligible” shares whose investors asked for compensation and the number of shares registered on the books of DTC. Because the US has a three-day settlement cycle, the depository’s ledger did not reflect all of the trades in Dole common stock on November 1, the day of the merger, or the two days preceding it.</p>\n\n<p>Borrowers Plus Lenders</p>\n\n<p>“The shorting resulted in additional beneficial owners who received the merger consideration who fell within the technical language of the class definition and who could claim the settlement consideration,” explained Vice Chancellor Laster. “Meanwhile, the lenders of the shares, not knowing that their shares were lent, also could claim the settlement consideration.” It is common practice for banks and broker-dealers to lend shares without the beneficial owners’ knowledge.</p>\n\n<p>What about just pretending the claims class is comprised of holders of 49,164, 415 shares and just compensate everyone pro-rata? Sounds a lot easier, administratively speaking. That approach would be “unjust,” said Vice Chancellor Laster. “It would result in 25 percent of the consideration going to holders who should not receive it. As a consequence, the true holders of shares would receive only 75 percent of the settlement consideration.”</p>\n\n<p>Vice Chancellor Laster’s decision does have some legal basis. Short sellers are considered borrowers of the stock and as such are not entitled to compensation from a corporate action which takes place during the three days between the day the trade is executed and its settlement. The lenders are entitled to the compensation. Apparently, he has interpreted the class action settlement as the equivalent of a corporate action, say operations managers. If so, that would be a corporate action announced after the fact.</p>\n\n<p>What could have prevented the Dole scenario from taking place? In one footnote to his ruling, Vice Chancellor  Laster suggested that the problem with compensating investors is an “unintended consequence” of the top-down federal solution to the paperwork crisis that threatened Wall Street in the 1970s. That paperwork crisis — thousands of stock certificates having to move between buyers and sellers — led to the creation of DTC and the book-entry system of securities ownership as we know it today.</p>\n\n<p><a href=\"https://finopsinfo.com/investments/dole-class-action-ruling-short-selling-clawback-next/\">Dole Case Pertinent to BBBY</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://www.reddit.com/gallery/138zf3m", "time": 1683316410.0, "subreddit": "r/ThePPShow", "title": "I think we have the shorts dead to rights here 750M/400M shares held with CEDE and Co not counting institutional shareholders. This is like Dole isn’t it?", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/lh_3BQkLlqHQ6GRizo9-WuaayHKCmDoD2275Hc1mR9Q.jpg\"/></div>"},
{"username": "Hard-Mineral-94", "url": "https://i.redd.it/ikfal60v13ya1.jpg", "time": 1683304961.0, "subreddit": "r/ThePPShow", "title": "Where is the Form 25? I thought it was due May 4th?", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ikfal60v13ya1.jpg\"/></div>"}]