[{"username": "HawaiiGuy888", "url": "https://www.reddit.com/r/ThePPShow/comments/160e333/blockchain_terms_being_talked_about_surrounding/", "time": 1692910934, "subreddit": "r/ThePPShow", "title": "Blockchain terms being talked about surrounding BBYQ/Teddy", "text": "So there have been a lot of terms being used and myself being in the computer/internet field I also find it daunting but here is a collection of terms from around the web in one post.\n\nI definitely think that if they do indeed issue us tokenized stocks I hope that it is an ERC-1155 token using Looprings L2 protocols (or something equal or better) to help prevent some of the potential nefarious schemes that can happen in the DeFi and financial world.  Now there are deeper dives that could be done and arguments of the pros and cons of Ethereum but this just attempts to lay down some terms and functions.\n\nBlockchain - A blockchain is a database of transactions that is updated and shared across many computers in a network. Every time a new set of transactions is added, its called a “block” - hence the name blockchain. Public blockchains like Ethereum allow anyone to add, but not remove, data. If someone wanted to alter any of the information or cheat the system, they’d need to do so on the majority of computers on the network. That is a lot! This makes decentralized blockchains like Ethereum highly secure\n\nEthereum - Ethereum is a network of computers all over the world that follow a set of rules called the Ethereum protocol. The Ethereum network acts as the foundation for communities, applications, organizations and digital assets that anyone can build and use.\n\nSmart Contract - The smart contract follows the instructions written in computer code. Nobody can change the rules or cheat because the instructions are like a promise that can't be broken. So, Ethereum smart contracts are like digital boxes that do things on their own, following the rules you put inside them.\n\nERC-20 -The ERC-20 introduces a standard for Fungible Tokens, in other words, they have a property that makes each Token be exactly the same (in type and value) as another Token.Example functionalities ERC-20 provides:\n\n* transfer tokens from one account to another\n* get the current token balance of an account\n* get the total supply of the token available on the network\n* approve whether an amount of token from an account can be spent by a third-party account\n\nIf a Smart Contract implements the following methods and events it can be called an ERC-20 Token Contract and, once deployed, it will be responsible to keep track of the created tokens on Ethereum.\n\nERC-721 - The ERC-721 introduces a standard for NFT, in other words, this type of Token is unique and can have different values than another.  Token functionalities are the same as above with ERC-20 with the addition of each token being unique.  All NFTs have a uint256 variable called tokenId, so for any ERC-721 Contract, the pair contract address, uint256 tokenId must be globally unique.\n\nERC-1155 - A standard interface for contracts that manage multiple token types. A single deployed contract may include any combination of fungible tokens, non-fungible tokens or other configurations (e.g. semi-fungible tokens).  There are other additional functions the standard provides. New functionality is possible with this design such as transferring multiple token types at once, saving on transaction costs. Trading (escrow / atomic swaps) of multiple tokens can be built on top of this standard and it removes the need to “approve” individual token contracts separately. It is also easy to describe and mix multiple fungible or non-fungible token types in a single contract.\n\nLoopring L2 - Loopring is a program designed to work on top of Ethereum’s blockchain (a layer 1, or base, blockchain). This means that Loopring seeks to make the experience of using Ethereum faster by processing elements of Ethereum transactions on its own network. You can think of it as creating a side road off the main highway to help ease congestion.\n\nLoopring’s developers claim this helps the protocol reach throughput approximately 1,000 times greater than Ethereum, with peaks of 2,025 transactions a second. Unlike Ethereum’s sky-high fees, transactions on Loopring cost less than a cent.\n\nLoopring accomplishes its high throughput and low cost through something called zkRollups. Let’s break that down. Zk stands for “zero-knowledge,” which itself is short for “zero-knowledge proofs.” This is a method of processing transactions privately. It allows one party to prove to another party that something is true without providing any extraneous information about the transaction itself. Rollups are the idea that instead of waiting and paying for each transaction to process independently on Ethereum, dozens and dozens of transactions are recorded on the layer 2 chain, then “rolled up” into a single transaction that is then fed back to the more expensive, slower blockchain. By doing this, the cost of that one transaction is split across lots of users.\n\nIn decentralized exchanges, front-running is when someone tries to mine transactions, before mining other transactions that are already in the pending transaction pool (mempool). This can be achieved by specifying a higher transaction fee (gas price), and if the front-runner happens to be a miner he can order pending transactions in a way that benefits himself.\n\nThe default Loopring match-engine does not guarantee First-Come-First-Serve (instead, it uses the over-the-counter or OTC model), meaning that orders’ timestamps are totally ignored. This further implies that front-running a trade has no impact on the actual price of that trade — Loopring only supports limit-price orders. The major schemes of front-running in Loopring (and any protocol for order-matching) are order-filch and ring-filch. Order-filch is when a front-runner steals one or more orders from a pending ring settlement transaction, and ring-filch is when a front-runner steals the entire ring from the pending transaction.  Loopring’s Dual Authoring solution prevents ring-filch and order-filch while still ensuring the settlement of rings can be done in one single transaction.\n\n&#x200B;\n\n[https://ethereum.org/en/developers/docs/standards/tokens/erc-20/](https://ethereum.org/en/developers/docs/standards/tokens/erc-20/)\n\n[https://ethereum.org/en/developers/docs/standards/tokens/erc-721/](https://ethereum.org/en/developers/docs/standards/tokens/erc-721/)\n\n[https://ethereum.org/en/developers/docs/standards/tokens/erc-1155/](https://ethereum.org/en/developers/docs/standards/tokens/erc-1155/)\n\n[https://www.coindesk.com/learn/what-is-loopring-and-whats-driving-its-rise/](https://www.coindesk.com/learn/what-is-loopring-and-whats-driving-its-rise/)\n\n[https://www.coindesk.com/learn/what-are-rollups-zk-rollups-and-optimistic-rollups-explained/](https://www.coindesk.com/learn/what-are-rollups-zk-rollups-and-optimistic-rollups-explained/)\n\n[https://medium.loopring.io/dual-authoring-looprings-solution-to-front-running-d0fc9c348ef1](https://medium.loopring.io/dual-authoring-looprings-solution-to-front-running-d0fc9c348ef1)\n\n[https://blaize.tech/article-type/overview/amm-solutions-to-impermanent-loss-and-front-running/](https://blaize.tech/article-type/overview/amm-solutions-to-impermanent-loss-and-front-running/)\n\n&#x200B;", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]