[{"username": "hey_ross", "url": "https://www.reddit.com/r/ThePPShow/comments/18016yh/credit_bid_why_havent_we_seen_it/", "time": 1700519675.0, "subreddit": "r/ThePPShow", "title": "Credit bid? Why haven’t we seen it?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Well, because it would jeopardize their ability to offer an alternative plan. See this for more, but given the worries about links, text below.</p>\n\n<p>Don’t Get Cute with the Court: Filing “Draft” Plan During Debtor’s Exclusive Period Can Cost You, No Matter What You Call It.</p>\n\n<p>“Don’t you mess around with [exclusivity]” – Lil’ Kim (as revised)</p>\n\n<p>We’ve posted before on the contours of a chapter 11 debtor’s exclusive period within which to propose a plan of reorganization, and on just what might not constitute impermissible solicitation prior to approval of a disclosure statement.  The Bankruptcy Court for the District of Massachusetts has now reminded us of the sacrosanct nature of the debtor’s exclusivity period, warning against any improper attempts to interfere with a debtor’s initial right to control its chapter 11 case.</p>\n\n<p>Section 1121(b) of the Bankruptcy Code provides debtors with an exclusive right to file a plan of reorganization for 120 days after the commencement of a chapter 11 case.  Though this “exclusivity period” is subject to extension or termination, it is automatic and inviolate unless and until the bankruptcy court orders otherwise.  Hand in hand with section 1121(b), section 1125(b) of the Bankruptcy Code prohibits solicitation of the acceptance or rejection of a plan of reorganization in the absence of a court-approved disclosure statement.  In turn, section 1126(e) of the Bankruptcy Code provides that “the court may designate any entity whose acceptance or rejection of such plan [i] was not in good faith, or [ii] was not solicited or procured [a] in good faith or [b] in accordance with the provisions of this title.”</p>\n\n<p>In re Charles Street African Methodist Episcopal Church of Boston, the debtor commenced a chapter 11 case and, on the same day, proposed a plan of reorganization.  That plan proposed to pay OneUnited Bank (the debtor’s major secured creditor) in full over time, with no recoveries for general unsecured creditors.  OneUnited, unhappy with that plan, moved to terminate exclusivity, attaching an unsigned “DRAFT” plan of reorganization of its own.  In its motion, OneUnited noted that this alternative plan would pay unsecured creditors in full, subject to a cash contribution from the First Episcopal District of the African Methodist Church (which was not a debtor in the church’s chapter 11 case).  OneUnited served the motion (without attachments) on seventeen of the church’s creditors, which constituted more than half of the debtor’s general unsecured creditors by number.  Even though the draft plan was not attached, OneUnited promised to circulate copies of the attachments on request.  Moreover, the complete motion (with attachments) was filed on the court’s public docket in the church’s chapter 11 case.  In response, the debtor-church filed a motion to equitably subordinate OneUnited’s claim, to designate the votes of OneUnited, and for the award of its attorneys’ fees from OneUnited.</p>\n\n<p>The bankruptcy court saw right through OneUnited’s clever attempt to dissuade creditors from accepting the debtor’s plan.  As the bankruptcy court concluded, OneUnited’s draft plan “could not possibly have been confirmed” because it depended entirely on a large cash contribution from a non-debtor that had no present obligation to fund the plan.  The court further noted that OneUnited was well aware of this “infirmity,” and that the motion and draft plan were all part of an effort undertaken “for [no] purpose other than to sway the votes of unsecured creditors with a false hope of payment in full. . . .”  In other words, the OneUnited “plan” was not a true exit strategy – instead, it was a ruse to attempt to rally the debtor’s creditors against the debtor’s initial plan.</p>\n\n<p>In considering the debtor’s motion, the bankruptcy court followed a previous non-binding decision from the same court, in which the court held that creditors who had filed and circulated a plan and disclosure statement prior to the termination of exclusivity period had violated both section 1121(b) and 1125(b) of the Bankruptcy Code.  In this case, the bankruptcy court noted that it was irrelevant that OneUnited had not actually filed a plan or a disclosure statement in their own right and that only two creditors had actually been served with OneUnited’s plan – the fact remained that OneUnited had “filed” a “plan” during the exclusivity period.  Regardless of who would have actually seen the draft plan, “[t]he filing of a document puts it on the public record . . . supplying actual notice to any who care to look at it.”  Moreover, the court noted that section 1121(b) is “a rule against filing” (emphasis in original).  Accordingly, the court could not countenance “the possibilities for mischief” in filing competing plans under the guise of otherwise permissible motions.  And while the court did not conclude whether the filing and service of the exclusivity termination motion constituted an impermissible solicitation, it noted that the question was merely “academic” because OneUnited had clearly infringed upon the debtor’s exclusive period to file a plan, and, at a minimum, must be penalized for this misconduct.</p>\n\n<p>Though the court declined to subordinate OneUnited’s claim, deeming such a remedy disproportionate to the harm (after all, it held a secured claim much larger than any other claims in the case), it fashioned a proper remedy, based on the specific facts of the case.  First, the court prohibited OneUnited from proposing any plan (a directive that the court said it would not have ordered had OneUnited been able to actually benefit the church’s estate via an alternative plan).  Second, the court awarded attorneys’ fees and expenses for the church’s counsel, at its regularly hourly rates (notwithstanding the fact that counsel was serving pro bono) for the work undertaken in connection with the church’s motion and held that OneUnited would not be entitled to payment of attorneys’ fees in connection with its exclusivity motion and defending against the debtor’s motion.  Third, because the court found these first two remedies to be “inadequate to the offense” (i.e., OneUnited’s “knowing and deliberate violation of the right of exclusivity . . . made only the more egregious by the falsity of the hope and pretense of the ploy”), the court required OneUnited to fund the cost of the examiner to be appointed in the debtor’s chapter 11 case (subject to a $50,000 cap).</p>\n\n<p>The bankruptcy court would not go so far as to subordinate OneUnited’s secured debt, but its harsh critique of OneUnited’s tactics serve as an uncompromising warning not to play games with a debtor’s exclusive right to manage its affairs in the first months of a chapter 11 case.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hey_ross", "url": "https://i.redd.it/v2y5w692l50c1.jpg", "time": 1699897851.0, "subreddit": "r/ThePPShow", "title": "Dipsy-doodle buy buy time", "text": "<!-- SC_OFF --><div class=\"md\"><p>Put it on sale, buy more, DRS, HODL. Thanks for the discount HF!</p>\n\n<p>You gotta wonder what’s driving this sale action on gamerstonk? The exposure there given BBBY exposure is locked has to be insane.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/v2y5w692l50c1.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://www.reddit.com/r/ThePPShow/comments/17scbdw/playing_around_with_ai_and_the_ppshow/", "time": 1699646198.0, "subreddit": "r/ThePPShow", "title": "Playing around with AI and the PPShow", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was playing around with ChatGPT and MidJourney and seeing if I could get AI to instruct AI.  I asked ChatGPT to summarize the PPshow channel and the subreddit, then asked it common terms and topics (shill, butterfly, discussion, stocks, money, wealth all came up) and then I fed it into Midjourney and got this beauty, which other than the suits, seems dead on.</p>\n\n<p><a href=\"https://preview.redd.it/v49syqi7skzb1.png?width=2912&amp;format=png&amp;auto=webp&amp;s=0817b4f3572594355a7418f421c0f83f99f1895d\">discussing stocks, money, opinions, butterflys and paid shills</a></p>\n\n<p>I also asked it to make a painting in the style of Rene Magritte that included the phrase &quot;This is not financial advice&quot; in french and showed butterflys and cash and got this one (I added the caption below in yellow as AI sucks at writing actual words in midjourney):</p>\n\n<p><a href=\"https://preview.redd.it/f2bsubgnskzb1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=b35b5374ec40159a446a3125c7b1c8ed3d0d7b28\">This is not financial advice</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/oaJ9XiLFNlCmEejYQxxOlVdgk440uWLiSAEtODSTeHo.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://i.redd.it/9zsxtccrjezb1.jpg", "time": 1699570528.0, "subreddit": "r/ThePPShow", "title": "What’s a little hot CEX between co-workers", "text": "<!-- SC_OFF --><div class=\"md\"><p>Stay off centralized crypto, kids!</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9zsxtccrjezb1.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://x.com/alyms77/status/1722263585047646354?s=46&amp;t=nv_sHMqCEi5gKi6FuLVgag", "time": 1699481060.0, "subreddit": "r/ThePPShow", "title": "Hard to be a good investor these days", "text": "<!-- SC_OFF --><div class=\"md\"><p>Jeff Yass, owner of Susquehanna, lost every race in PA he invested over $5m in total to win.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Lw_cGFh5SU9qWL4bRCUvp3R_dlgHqV6boCDhhlwcqUg.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://www.reddit.com/r/ThePPShow/comments/17mash9/kirkland_and_ellis_have_left_the_building_new/", "time": 1698951357.0, "subreddit": "r/ThePPShow", "title": "Kirkland and Ellis have left the building - new Docket drop", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjU4NTQxNA==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjU4NTQxNA==&amp;id2=-1</a></p>\n\n<p>Final K&amp;E bill, Prosekaur still outstanding.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hey_ross", "url": "https://www.reddit.com/r/ThePPShow/comments/17m8ec2/the_parasite/", "time": 1698945052.0, "subreddit": "r/ThePPShow", "title": "The Parasite", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is gonna a bit of a rambler and isn&#39;t really DD, but more some thoughts on the state of markets, how we got here, who got us here and what do to about it next as a culture.</p>\n\n<p>First, a little more about me for context - I grew up in West Palm Beach, Florida in the 1980&#39;s - I started high school in 1982 in Palm Beach county; my dad was the branch manager for the Paine Webber location in Palm Beach and worked with high net worth individuals.  I went to a private school in West Palm Beach, where most of my peers in the school had parents with white collar finance jobs.</p>\n\n<p>As a parallel, just south of me by 15 miles, was a guy a year younger than me growing up in this same toxic stew of &#39;money for money&#39;s sake&#39; - Ken C. Griffin.</p>\n\n<p>It&#39;s hard to relate now what the culture was like from 1980-1987 in south Florida but consider the cultural vibe - massive influx from the Mariel boatlift out of Cuba resulted in major criminal figures from the Cuban prison system setting up shop in Miami, running drug operations and tearing through Miami Shores neighborhoods in high-speed chases.  Small businesses were constantly being burgled, criminals trying to launder money through cash businesses led to weird things, like there being no legitimate laundromats in Overtown for several years. On television, Crockett and Tubbs were out fighting crime and Gordon Gekko was in the movies.  Greed, avarice, self-interest and &#39;I&#39;ll get mine&quot; were the vibe of the day, complete with white suits for the evening once you took off the Armani.</p>\n\n<p>The reason I bring this up is I clearly remember a lot of my peers, who had dads in Finance, talking about starting a career in finance, but their language was all wrong - it was about bond trading, arbitrage, derivatives on volatile stocks, etc.  It was the beginning of the financialization of the economy - money moving for the sake of money.</p>\n\n<p>This started with good intent - options, derivatives, swaps, etc. were all meant to hedge risk from disruption while real capital formation was about starting a business that created value.  But a thought was in the back of the mind of these 80&#39;s kids from their dads and role models and it came out of the rise of Las Vegas in the 1970&#39;s - the House Always Wins.  With the rise of financialization, the financial sector shifted, slowly at first, from a sector that existed of the transactional margins of a deal designed to help businesses grow by accessing capital to a sector that realized that the gambling on these hedging instruments was far more profitable.  Buy and hold, the advice of ages, became a problem - the casino doesn&#39;t make its money off the sports book bettor who comes in early May with a bet on the Seahawks to win the Superbowl next January, it makes its money off the person sitting nonstop at the slot machine or the table.  In other words, we stopped operating the financial sector for the purpose of raising capital, but for the purpose of betting on capital market participants.</p>\n\n<p>This mental shift is profound.  Prior to this, trades existed in one mindset - someone who thinks a particular company is going to grow faster than the market thinks (buyer) and someone who thinks a company is going to grow slower than the market thinks (seller), so the seller sells their stock to the buyer, who then holds it to see how the thesis plays out.</p>\n\n<p>Now we have a situation where you can not only bet on growth, but options and derivatives operate on the notion on extreme movement.  So, the bet isn&#39;t slow or fast growth relative to expectations, its now binary - success or failure.  This shows up in things besides cellar boxed stocks - binary options, 0DTE options, etc. are all bets on an outcome, not investment in a company.</p>\n\n<p>The % of income Wall Street market makers earn from Financialization as a % of GDP is completely out of control.  Cash is flowing to the casino; not main street and it shows.</p>\n\n<p>I&#39;m not that guy.  What I saw in Florida in the 1980&#39;s was a moment that disgusted me, not excited me.  These idiots were excited about the movement of money, but I was witnessing the rise of computers and how they would generate new forms of value.  I cannot begin to express how weird this was - I was one of three kids in 1980 I knew spending every moment reading coding books and trying new PEEK/POKE registers to see what would happen, while my peers were reading their Dad&#39;s Wall Street Journal.  I saw that this tool wouldn&#39;t be a new filing cabinet, but early BBS&#39;s like Mustang and other services showed it would be how the world connects and interacts and eventually, conducts business.</p>\n\n<p>I went away from finance - I think it&#39;s a corrosive influence on our society and on us as individuals if we start moving too far away from value.  As I&#39;ve said repeatedly, this play on Butterfly baskets is a bet - there isn&#39;t enough information to make it an investment.  But I think it&#39;s a reasonable bet for an unreasonable outcome, so I&#39;m playing it.</p>\n\n<p>What will I do with the money?  Same thing I do with money now - create businesses and invest capital.  Outside my day job at Oracle, I&#39;ve been the seed investor in 2 tech companies, 5 hospitality businesses and a manufacturer, but in the past I&#39;ve started over 15 companies, several of which went on to acquisition.  Job creation at the core is value creation and capitalism are way more fun if you play it as an Infinite game, where the goal is to get more players on the field and to create more value for others faster, not a Finite game where the goal is to win and eliminate the other players. I&#39;m done with tolerating parasites masquerading as a real part of our economy.</p>\n\n<p>I&#39;m here for the Infinite game. Play your own infinite game with others or on your own, but let&#39;s get everyone on the field.</p>\n\n<p>For those unfamilar with this concept, I highly encourage reading James P. Carse&#39;s book on this topic.   <a href=\"https://en.wikipedia.org/wiki/Finite_and_Infinite_Games#:%7E:text=A%20finite%20game%20is%20played,and%20announce%20winners%20and%20losers.\">Finite and Infinite Games - Wikipedia</a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hey_ross", "url": "https://www.reddit.com/r/ThePPShow/comments/1740zsq/moved_from_ss_connection_between_gme_and_bbby/", "time": 1696880601.0, "subreddit": "r/ThePPShow", "title": "Moved from SS: connection between GME and BBBY", "text": "<!-- SC_OFF --><div class=\"md\"><p>Note: this was originally posted over 18 months ago on a now compromised subreddit.</p>\n\n<p>Original post:</p>\n\n<p>Crazy, wild speculation on BBBY/GME connection</p>\n\n<p>It&#39;s been bugging me, hitting a spot in my brain where patterns that don&#39;t fit pop out and seem to wiggle a little - why is RC so focused on Bed, Bath and Beyond as a stock?</p>\n\n<p>There are other tickers in the market that are being targeted by SHF and aimed at cellarboxing, for sure, so what&#39;s different about BBBY?</p>\n\n<p>I dug into it and BBBY is somewhat unique in one aspect - it doesn&#39;t use Computershare as a stock registrar, it uses AST (American Stock Transfer, historically, but now branded as AST financial).  AST financial is privately held and a rapid adopter of technology, as noted here:  <a href=\"https://www.astfinancial.com/about-us\">https://www.astfinancial.com/about-us</a></p>\n\n<p>So, who own&#39;s AST?  It&#39;s owned by Equiniti, a PE-backed firm that was a rollup of firms by Siris Capital back in 2020.  PE firms invest in rollups when they think they can either create innovation between the companies or that the companies are likely to create a sum greater than the parts by coming together, then selling the entity.  I can see they are investing in several elements that would be critical to a functioning marketplace for a tokenized stock platform - private company issue management (2018), Proxy automation for shareholder votes (2019) and Astrella, a stock platform for private companies.</p>\n\n<p>What they are missing is a marketplace with transparent bid/ask pricing and ownership transfer management in that marketplace.  That&#39;s what it looks like Loopring and GME are building based on the Github code. </p>\n\n<p>So, my speculative brain fits the pieces together like this:</p>\n\n<ol>\n<li>GMErica, Inc. acquires Equiniti to own the share registry platform and the private company platform</li>\n<li>BBBY, as one of the only retailers issues by AST as a share registry, agrees to move shares to the NFT platform integrated in the GME nft marketplace</li>\n<li>BBBY recalls shares as GME recalls shares to move to the new marketplace.  This takes away the criticism of the nft marketplace not being a real market for stocks as it only has GME in the marketplace</li>\n<li>BBBY squeezes like a mofo as does GME, causing other firms to want to move to nft stock trading</li>\n</ol>\n\n<p>I think it&#39;s essential that the stock marketplace cannot be the home to just one company and I think BBBY is a candidate and as a result, either GME is going to buy Equiniti in a private transaction or Siris Capital is about to own one of the most valuable platforms in history.</p>\n\n<p>TL;DR BBBY isn&#39;t a distraction for GME, it&#39;s the first company other than GME to tokenize shares to blockchain in the nft marketplace.</p>\n\n<p>Edit over a year later: I now believe RC ventures will acquire EQ and then acquire a collection of cellar boxed companies for Teddy with shares issued on a blockchain marketplace.</p>\n\n<p>I think GameStop wallet had to die for this to work legally with the new SEC rules on crypto securities like Ripple</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hey_ross", "url": "https://www.reddit.com/gallery/1740rns", "time": 1696880040.0, "subreddit": "r/ThePPShow", "title": "Becoming intellectually compromised, a primer", "text": "<!-- SC_OFF --><div class=\"md\"><p>This was the conversation with the mods about the GameStop social media post on X. Being an official company communication I posted it to SS, fully aware of reddits and their restrictions on brigading.</p>\n\n<p>But this wasn’t me being provocative, it was the company itself, which makes it news and worth discussing.</p>\n\n<p>Apparently not.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/4KN3b8qNseLA5BIA1GyuPTr0_hoS4BDU4jPnty_0t_c.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://www.reddit.com/r/ThePPShow/comments/16hqlpa/good_news_and_weird_news_on_fidelity/", "time": 1694620216.0, "subreddit": "r/ThePPShow", "title": "Good news and weird news on Fidelity", "text": "<!-- SC_OFF --><div class=\"md\"><p>So, I did a buy this AM for 100,000 shares of BBBYQ on Fidelity with a Limit price of $.20 per share.<br/>\nHere is the execution tape for the trades:  </p>\n\n<p><a href=\"https://preview.redd.it/7em3jnupm1ob1.png?width=1590&amp;format=png&amp;auto=webp&amp;s=731a67cb6679dceb5f6694647022273d6022a08c\">A little shy of 3 minutes to get 100,000 shares, but at a $.20 limit price</a></p>\n\n<p>If you see the tape at the bottom, this sat as an open order with a $.20 limit and took a long time to fill, but curiously, every fill was at $.1699 price.  Someone is intentionally suppressing the price.  </p>\n\n<p>Oh, and I&#39;m up to 1,346,003 shares total.  Unwavering conviction, but I also am not a financial advisor, I&#39;m lucky beyond belief and I don&#39;t attribute any of my success to anything but blind luck and an ability to pay attention.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/3pJoFv02DsMMtRIpBFKNdUAkPCbstkabFbr7tp3iFwg.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://www.reddit.com/r/ThePPShow/comments/16ae1lz/whats_the_guess_for_the_high_tomorrow/", "time": 1693887684.0, "subreddit": "r/ThePPShow", "title": "What’s the guess for the high tomorrow?", "text": "<!-- SC_OFF --><div class=\"md\"><p>My guess is we drift up into a high of $.37/.38 the dip back to .24/.25.</p>\n\n<p>What’s your call?</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hey_ross", "url": "https://i.redd.it/jqd8bycnojib1.jpg", "time": 1692223335.0, "subreddit": "r/ThePPShow", "title": "Explaining BBBY and TEDDY, Greentext style", "text": null, "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/jqd8bycnojib1.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://i.redd.it/eympahscwaib1.jpg", "time": 1692116917.0, "subreddit": "r/ThePPShow", "title": "Just cross the 1m share mark", "text": "<!-- SC_OFF --><div class=\"md\"><p>Couldn’t pass up the discount this morning. Not financial advice, but I think they are closing the gate to the rocket soon. LFG 🚀 500k are in the bank, rest is in accounts that are difficult to drs (Ira, UGTM, etc)</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/eympahscwaib1.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://i.redd.it/0oisz3yq0v4b1.jpg", "time": 1690435546.0, "subreddit": "r/ThePPShow", "title": "Goddammit I have to remove the sarcasm tag from this damn post, don’t I?!", "text": null, "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/0oisz3yq0v4b1.jpg\"/></div>"},
{"username": "hey_ross", "url": "https://www.reddit.com/r/ThePPShow/comments/156uk8y/a_logic_problem/", "time": 1690058149.0, "subreddit": "r/ThePPShow", "title": "A logic problem", "text": "<!-- SC_OFF --><div class=\"md\"><p>Resolve this puzzle, it’s been the answer in the back of my head whenever I had a doubt about shareholder outcomes in the Teddy Adventures in Entity Capture saga as it plays out.</p>\n\n<p>Why would Ryan Cohen, Brett Icahn or any single capitalist ever attempt to take over a going concern business in a way that would immediately result in several hundred thousand angry people who are highly skilled at online activism?</p>\n\n<p>Why would you not activate that base as an online activism base to drive adoption of your new default “e-commerce for everything” business with brick and mortar presence?</p>\n\n<p>I’ve been doing tech go to market for 30 years and it would be a colossal breach of basic customer marketing to fuck this up with any other approach.</p>\n\n<p>Not financial advice, but you know, do your own probability calculation on this one.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦈 Megladon 🦈 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]