[{"username": "Highbrid95", "url": "https://www.reddit.com/r/ThePPShow/comments/13vkn9g/opinion_on_what_happens_to_non_drs_apes/", "time": 1685435829.0, "subreddit": "r/ThePPShow", "title": "Opinion on what happens to non drs apes?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Highbrid95", "url": "https://i.redd.it/n9ix9ba79n2b1.jpg", "time": 1685292962.0, "subreddit": "r/ThePPShow", "title": "“Block the noise”", "text": "<!-- SC_OFF --><div class=\"md\"><p>First time ever posting and only a handful of comments but still a determined ape with a xx,xxx position. Came about this article from business insider (don’t care for their credibility just getting some Cohen quotes) while searching for a Cohen-Wells Fargo connection when I heard that Wells Fargo retired from all DTCC services as of May 19.\nWhat an interesting time to leave that group, don’t you think?</p>\n\n<p>Turns out in 2017, RC invested 3.35 billion $ into Apple and Wells Fargo stock after selling Chewy. I don’t know how big his position is or if he even has one still but I don’t have the best service and time to research working in the middle of nowhere for weeks at a time (luckily this app is one of the only ones that works somewhat alright) Now, I don’t know if this is widely known information but I hadn’t heard of this until recently but it is provocative and gets the people talking!</p>\n\n<p>Something that interested me was the conviction in RC’s quotes. Stating that its “not for the faint of heart” as this play definitely isn’t. &quot;You need to have the temperament to block the noise,&quot; he said. &quot;Sometimes it feels like a rollercoaster.” Which also encompasses the sentiment of our subs.</p>\n\n<p>🛏️ 🛁 🚀 🎉 </p>\n\n<p>Anyway, BUY, HODL, DRS, BOOK KING\nNot fucking leaving because… I like…</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/n9ix9ba79n2b1.jpg\"/></div>"}]