[{"username": "hitmebbby", "url": "https://www.reddit.com/r/ThePPShow/comments/17bu978/t212_very_strange/", "time": 1697751059.0, "subreddit": "r/ThePPShow", "title": "T212 very strange!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just had a very long chat with a guy from T212 about my shares that have now been ‘sold’ as worthless. The narrative was that they were completely gone with no scenario where i could get them back. When I quoted the earlier T212 post he backtracked a little and said that of course if something changes I would realise the value. He also said that there is no precedent for that. </p>\n\n<p>However, the really interesting thing is that there is no record off the chat on my chat history. All other chats are there but not this one. Not really sure what that means but it sounds dodgy as fuck. </p>\n\n<p>He did again confirm that they are completely dependant on the IBKR stance.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hitmebbby", "url": "https://i.redd.it/uxtjxb2h0oqb1.jpg", "time": 1695762476.0, "subreddit": "r/ThePPShow", "title": "Well lookee who’s throwing some stuff up in the sky right after the PP flight!? Too late Bozos! 😂🚀", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/uxtjxb2h0oqb1.jpg\"/></div>"},
{"username": "hitmebbby", "url": "https://x.com/elonmusk/status/1703324372239585397?s=46&amp;t=pAc_jiKhaXHTCVXdpO7Z9w", "time": 1694941451.0, "subreddit": "r/ThePPShow", "title": "Elon Musk on X", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/5GJztelsKHXYYSslpN5mVK9srvrZckxe1qpg1jrFevc.jpg\"/></div>"},
{"username": "hitmebbby", "url": "https://www.reddit.com/r/ThePPShow/comments/15fq94l/a_simple_question_for_a_simple_mind/", "time": 1690927268.0, "subreddit": "r/ThePPShow", "title": "A simple question for a simple mind", "text": "<!-- SC_OFF --><div class=\"md\"><p>If BBBYQ is truly worth nothing why is it not already there? There have been multiple negative news stories, multiple negative dockets released but we are still trading between 0.20 and 0.40 - normally within 2-3 cents +/-0.30. It almost feels as though there are players (good or bad) that have a vested interest in maintaining this narrow channel. It makes no sense to me that bad actors can stop it at 0.30 but can’t knock it down sub 0.20. Retail are not controlling that surely?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hitmebbby", "url": "https://www.reddit.com/r/ThePPShow/comments/14yvsqt/the_ppshow/", "time": 1689280741.0, "subreddit": "r/ThePPShow", "title": "The PPShow", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just love it. That is all. PP and the crew have made DD fun. You’ve given us hope but you’ve also made sure that you’ve given a voice to the detractors. Equilibrium is what makes you believable. Appreciation post. 💜</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hitmebbby", "url": "https://www.reddit.com/r/ThePPShow/comments/14xzj0x/the_downside_of_moass/", "time": 1689193319.0, "subreddit": "r/ThePPShow", "title": "The downside of MOASS", "text": "<!-- SC_OFF --><div class=\"md\"><p>You guys….Honestly. It brings a tear to my eye. What in the hell am I going to do with my time without the constant refresh of my Reddit? How am I going to function on a solid 8 hours sleep without a ppshow that starts at like 1am for me? How the hell am I going to fill my time?? The hopium. The tinfoil. Even the shillfantacism! I’m institutionalised in this prison of constant optimism and disappointment. And then more optimism. Is there a bail hostel I can check into post squeeze to ease me back into normality? Asking for a friend.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hitmebbby", "url": "https://www.reddit.com/r/ThePPShow/comments/13wu3t7/iep_addition_to_t212/", "time": 1685557971.0, "subreddit": "r/ThePPShow", "title": "IEP addition to T212", "text": "<!-- SC_OFF --><div class=\"md\"><p>FYI for anyone that uses T212 it doesn’t currently show on the platform. I have requested for it to be added in case anyone’s interested in placing a bet on the big man. 😂</p>\n\n<p>PS I’m not advocating you use T212. You do you.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "hitmebbby", "url": "https://www.reddit.com/r/ThePPShow/comments/13qvezm/pay_it_forward_commitment/", "time": 1684957142.0, "subreddit": "r/ThePPShow", "title": "Pay it Forward - commitment", "text": "<!-- SC_OFF --><div class=\"md\"><p>It feels like this community is on the precipice of achieving something immense. For me that ‘something’ is ‘freedom’. Freedom from debt and all of the unnecessary stress and suffering that debt can bring. Freedom from the uncertainty about how I can support my kids in the future and make them the best humans they can be. </p>\n\n<p>I genuinely don’t want a Lamborghini. I just want to be free from all the shit I’ve dealt with for the past few years. I want my kids to be comfortable, but not so comfortable that they don’t learn a work ethic or don’t learn to have empathy with those who have less than they do. </p>\n\n<p>So I think we as a community should make a pledge to pay it forward. Whether Bill is involved or not his philanthropic approach is admirable. If we succeed in our goals I will personally donate 25% of my net profit (after debts/taxes are paid!) to a just cause. I feel like that’s fair because this will be money that I never would have had before and I recognise that there are people in the world that are in a much worse situation than I am. </p>\n\n<p>This should be a movement to redistribute wealth to those who need it most. Fuck Lambos….we don’t need Lambos when we go off road.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]