[{"username": "holdthehill", "url": "https://www.reddit.com/gallery/15d257f", "time": 1690662786.0, "subreddit": "r/ThePPShow", "title": "Lambos or mofo food stamps.", "text": "<!-- SC_OFF --><div class=\"md\"><p>So many coincidences and signs in this play for me to ignore.  This one was like a sign from the beyond for me today when I was driving by and noticed the lambo sitting in the parking lot outside a bbby store that closed months ago.  Had to pull into parking lot to snap this photo.  NFA, but I hodl.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/kpPMisSlUJm75ayjld1-Ym_vI_O10c-g_yRaMYZIcvY.jpg\"/></div>"},
{"username": "holdthehill", "url": "https://www.reddit.com/r/ThePPShow/comments/138u3z9/anyone_else_seeing_the_volume_reducing_by_about/", "time": 1683304705.0, "subreddit": "r/ThePPShow", "title": "Anyone else seeing the volume reducing by about 50% approx every 3 minutes on RH?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I only use Robbinghood to watch the ticker, but have noticed the past 2 days, the  total volume divides by around 2 every 3 minutes, then switches back to showing the volume that is inline with what fidelity is showing? \nAnyone else notice this or have an explanation for this? 🤔\nStrange. 🤷‍♂️</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "holdthehill", "url": "https://youtu.be/ucM9qEk1pIc", "time": 1683203304.0, "subreddit": "r/ThePPShow", "title": "How I prepare for watching the bbby ticker everyday.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I watch this clip and think about how this high risk high reward play could end.  Shorts start closing their position at 2:04, bbbyq moons at 3:01.  </p>\n\n<p>LG!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/ucM9qEk1pIc/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGHIgQSg5MA8=&rs=AOn4CLDvZtR3iIPdQLbA8CEkJ_TAGMgv8A\"/></div>"},
{"username": "holdthehill", "url": "https://www.reddit.com/r/ThePPShow/comments/136q33v/remember_what_matters_most_we_are_still_here/", "time": 1683126945.0, "subreddit": "r/ThePPShow", "title": "Remember what matters most - WE ARE STILL HERE!!", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://youtu.be/tZmbDwfSB4k\">https://youtu.be/tZmbDwfSB4k</a></p>\n\n<p>﻿\nBBBYQ holders, hear me. It is true, what many of you have heard. The evil short hedge funds have cellar boxed this company into chapter 11 and have now been delisted from the Nasdaq exchange.  However, nothing has changed, we simply continue this journey OTC.</p>\n\n<p>Believe me when I say we have a difficult time ahead of us. But if we are to be prepared for it, we must first shed our fear of it.</p>\n\n<p>I stand here, before you now, truthfully unafraid. Why? Because I believe something you do not?  No, I stand here without fear because I remember. I remember that I am here not because of the path that lies before me but because of the path that lies behind me:</p>\n\n<p>I remember that for 84 years apes have buying and holding this stock to help give this company a second chance at succuss.</p>\n\n<p>I remember that for 84 years short hedge funds have short borrowed millions upon millions of this company’s shares in effort to diminish the share price.</p>\n\n<p>I remember that for 84 years apes have been trying to understand the continuous diminishment of the share price, spite retail investors continuously buying up and holding millions upon millions of shares.</p>\n\n<p>I remember that for 84 years the news media outlets have spread nothing but negative news surrounding this stock, spite tremendous long interest positions being bought up and held by retail investors.</p>\n\n<p>I remember that for 84 years retail investors have been trying to expose the tremendous fraudulent exploitation the market makers have conducted on this stock to implode it to oblivion.</p>\n\n<p>I remember that after 84 years, if this fraudulent exploitation is not stopped, the conclusion will be all 32,000 employees who worked for this company will have lost their jobs, and all retail investor positions will be lost.</p>\n\n<p>I remember that for 84 years, retail apes have been waiting for buyer who sees through all the negative news portrayal, and realizes deep value of this company and chooses to acquire it.</p>\n\n<p>I remember that for 84 years there has been strong suspicion amongst retail investors that the short hedge funds have been selling naked short shares of this stock and the ticker share price we see is not real.</p>\n\n<p>I remember that for 84 years we have been waiting for these short hedge funds to close out their short positions to reveal the true share price of this stock.</p>\n\n<p>And after a 84years, I remember that which matters most...</p>\n\n<p>We are still here!</p>\n\n<p>Today, let us send a message to the corrupt financial terrorists of Wall Street. Let us shake the unstable house of cards they have constructed and sheltered themselves in. Let us tremble the earth, steel, and stone supporting the fragile house of cards they use to line their pockets with. Let them not forget that without investors, they have nothing! Let us expose their evil corrupt manipulation games and be heard in the skyscrapers of wall street.</p>\n\n<p>Let us make them remember, we are apes, we are not afraid to loose our investment and hold our shares to zero if it paves the way for a fairer market tomorrow!</p>\n\n<p>Expose!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]