[{"username": "Hoobleh", "url": "https://www.reddit.com/r/ThePPShow/comments/16jinhd/so_i_called_fidelity_and_was_told_bbbyq_and_bliaq/", "time": 1694796990.0, "subreddit": "r/ThePPShow", "title": "So I called fidelity, and was told BBBYQ (and BLIAQ!) are Position Close Only", "text": "<!-- SC_OFF --><div class=\"md\"><p>I flaired this as Trust Me Bro™ because I don&#39;t have chat logs. This is because I called. </p>\n\n<p>I read someone in the Gazebo Twitch stream chat (shout-out to fellow GZBOids!) write that they were able to buy BBBYQ from fidelity today, they just had to ask for a supervisor.</p>\n\n<p>So I thought, fuck it, and called. I had a tiny position from before bankruptcy proceedings began that I had since added to greatly at a silly low price per share and thought I could make it a nicer looking number. I think there&#39;s something to the memes and work RC has put forth, and I&#39;ve read too much great DD from here and other places to help myself otherwise. </p>\n\n<p>Plus, my straggler non-DRS&#39;d GME shares were lonely 🙂.</p>\n\n<p>I was read a disclosure and had my account coded for buying penny stocks (I was also told there would be a $30+ commission fee 🙄). He attempted to process a buy for 500 shares for me at a limit of $0.19. It did not go through. When I tried, I got an error saying &quot;(TC9052) Opening transactions for this security are not currently permitted due to limited company information and/or the risk associated with the security.&quot;</p>\n\n<p>Out of curiosity, I asked him to try the same for BLIAQ. 1000 shares at a limit of $0.01. He said that too would not go through, not just for my account, but for what he implied to be fidelity themselves. He stated he could not place an order for either.</p>\n\n<p>Once again, I tried in my fidelity app, figuring, &quot;It&#39;s another penny stock, why not? I&#39;m all coded and shit now!&quot; I got a different error this time, &quot;(TC9050) Opening transactions for Caveat Emptor are not permitted because of the risks associated with these securities and all Microcap securities.&quot;</p>\n\n<p>I told him this and implied a supervisor may need to get involved. He said he would check with his back office and went away for 5-10 min while I listened to hodl music.</p>\n\n<p>This guy comes back and says these are stocks that are currently Position Close Only. He said it didn&#39;t make sense to him because he dug through every coding and disclosure he found required, and I had them all already (I have previously had interactions online and over the phone where I had accepted disclosures for certain curiosity plays). He said I should be able to buy, or he should be able to place an order for, penny stocks, but that he is being told these are PCO for everyone, not just non-disclosured individuals.</p>\n\n<p>I&#39;ve heard this question asked somewhere else. Why would a broker, who surely has clients trying to offload positions of these penny stocks, prevent others from buying from these holders?</p>\n\n<p>..and if these clients sell, or close, their positions in these stocks, who the fuck is buying from them? The only thing I can surmise from this behavior is that there are positions that &quot;need to close&quot; by buying these shares. Positions that would desperately not want competition in the form of FOMO from some hereto undisclosed announcement of some kind. </p>\n\n<p>Yes, like shorts.</p>\n\n<hr/>\n\n<p>To be clear, this gentleman from fidelity was a very kind and chill dude I would consider sharing a melted green crayon with. I was as nice as I could be with him. But this news filled me with rage. He said I was likely fine to purchase almost any other penny stock but that these specific stocks (BBBYQ AND BLIAQ) are restricted for, and I quote, &quot;everybody.&quot;</p>\n\n<p>I thanked him and profusely wished him a fantastic day for making the call as painless as possible, but not before telling him this is fraud. He mentioned the events of 2021 with GameStop, and I reminded him of the congressional hearing held to find the crime. I advised that the PCO behavior of 2021 likely amounts to fraud a degree higher. I advised that the business may be on the wrong side of history. He seemed shaken but remained extremely professional. </p>\n\n<p>To be clear, it is not my intention to cause heartache for people there to help me. I don&#39;t grill customer service reps very often, but when I do it&#39;s because I believe I am being fucked.</p>\n\n<p>Fuck around and find out hedge fucks. The end of the game is on the horizon and is inevitable. </p>\n\n<p>Diamond fucking hands.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]