[{"username": "Houstman", "url": "https://i.redd.it/2cpqkluxvszb1.jpg", "time": 1699744119.0, "subreddit": "r/ThePPShow", "title": "They didn't teach Dougie about paragraphs in law school, apparently🙄", "text": "<!-- SC_OFF --><div class=\"md\"><p>A big giant problem with Dougie&#39;s theory here is that the debt had been culled from $5b down to $1.5b, down to &quot;creditors expected to be made whole&quot;, and suddenly $10.8 billion administrative debt shows up?</p>\n\n<p>Explain that one, if the $10.8b isn&#39;t to accept equity in the new org, bud?</p>\n</div><!-- SC_ON -->", "flair": {"text": "MISLEADING", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2cpqkluxvszb1.jpg\"/></div>"},
{"username": "Houstman", "url": "https://i.redd.it/rg2jluukvzxb1.jpg", "time": 1698957049.0, "subreddit": "r/ThePPShow", "title": "When shills run out of things they always do the \"bet\" and \"escrow\"", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hundreds upon hundreds of them. All you have to do is ask them to reveal their real name and face. They go away.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Social Media 🐦 📷 🤳 ❌", "text_color": "dark", "back_color": "#ff8717"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rg2jluukvzxb1.jpg\"/></div>"},
{"username": "Houstman", "url": "https://www.reddit.com/r/ThePPShow/comments/17lp3fu/want_to_know_about_gts_canaccord_genuity_and/", "time": 1698880153.0, "subreddit": "r/ThePPShow", "title": "Want to know about GTS, Canaccord Genuity and MMTLP? Here's your cliffs notes version.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The shortest version possible:</p>\n\n<p>MMAT wanted a US ticker after IPOing in Canada, TRCH was a oil company facing delisting brought about by giant short attacks during the covid oil price collapse. MMAT offered a merger to take their ticker. It was decided that every two TRCH shares would become one MMAT, and every TRCH share would receive an MMAT-1 untradeable preferred share representing the assets of the defuct oil company, which would eventually pay out cash upon the sale of assets (roughly estimated at about $1-2 a share at the time). This merger was June 2021</p>\n\n<p>Then, in October 2021, GTS and Canaccord Genuity filed some forged documents with FINRA claiming they had the permission of MMAT to start trading MMAT-1 (they lied) and FINRA granted them permission and MMAT-1 became MMTLP and began trading on the OTC.</p>\n\n<p>MMAT contacted FINRA and the SEC stating that they did not authorize the trading of these share, FINRA was like &quot;too late, tough shit.&quot;</p>\n\n<p>By winter 2022, the true value of the MMTLP shares was thought to be upwards of $30-100 due to the huge spike in oil prices and recent sales of smaller oil fields for around $30b per 1bbl of oil (the MMTLP fields have in excess of 3.5bbl of oil).  Meanwhile, GTS and Canaccord were shorting the absolute shit out of MMTLP this whole time.</p>\n\n<p>So, in the Summer of 2022 MMAT filed an S-1 to take MMTLP private and issue new paper shares in a new company called NextBridge Hydrocarbons. This S-1 finally got approved November 2022. NextBridge decided that the last day to trade the shares would be December 12th with new paper shares to be issued December 14th, and asked FINRA to issue a corporate action... FINRA dilly-dallied for weeks and finally issued a daily notice on December 6th that had the wrong language, and then issued a new one December 8th, letting everyone know that anyone who bought shares on the 9th or the 12th may not meet the t+2 date of record requirement for distribution on the 14th.</p>\n\n<p>Brokers already knew this, and had issued &quot;purchase close only&quot; orders for December 9th and 12th and some even warned shorts that they would be force-closing their short positions in MMTLP in preparation of the distribution of new equity.</p>\n\n<p>By this time the level 2s showed that it would only take 50 or so trades before the price of MMTLP would reach the thousands of dollars a share on Friday December 9th.</p>\n\n<p>It appears that the evening of 12/8 someone at FINRA finally got a gander at the bluesheets and FREAKED-THE-FUCK-OUT when they saw how many shorts existed and just how much the price would explode on this--we&#39;re talking liabilities likely in the TRILLIONS on this one ticker. After all, leading up to this the shares price spiked to $12, and was on the thresholds list for 45+ days.</p>\n\n<p>So, midnight on the 9th, hours before the market opened, FINRA issued a super rare U3 halt (something that had only been done two other times in history on a domestic stock) on MMTLP effectively killing any short squeeze.</p>\n\n<p>Their claim was that an &quot;extraordinary event&quot; was about to occur... and later, when they got sued, their explanation was that this extraordinary event was that settlement by the 14th might too hard🙄 and people may not get their shares <em>jerk off motion</em></p>\n\n<p>It turns out, leaving 1 billion or so shorts make it damned-near impossible to issue paper shares and here we are almost a year later and tens of thousands of shareholders still do not have their shares (especially people whose brokers use APEX clearing).</p>\n\n<p>MMTLP is currently the subject of numerous hearings on Capitol Hill (many of which have been behind closed doors) and were still trying to find out if shorts will ever be forced to close their open positions. Meanwhile, NextBridge has filed a new S-1 granting equity in a new subsidiary for those who DRS their shares.</p>\n\n<p>The saga continues...</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Houstman", "url": "https://www.youtube.com/live/6dZqpSGA2Hc?si=6qC1DHcCo_3xUsuF", "time": 1696711697.0, "subreddit": "r/ThePPShow", "title": "Going to have Salvatore and Jake2B on my show at 4pm Pacific/7pm ECT", "text": "<!-- SC_OFF --><div class=\"md\"><p>If yesterday&#39;s show is any indicator, I expect big shill bot attacks. Lots of accounts were spamming the chat with horrible racist and homophobic garbage. The mods had their hands full. The last time I got shill attacks like this was right before FINRA halted MMTLP. Curious🤔</p>\n</div><!-- SC_ON -->", "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "Houstman", "url": "https://youtu.be/qI6V6VD56n8?si=dDFsZHuNb4ese1oS", "time": 1696182979.0, "subreddit": "r/ThePPShow", "title": "My personal favorite song about Butterflies", "text": "<!-- SC_OFF --><div class=\"md\"><p>Machines of Loving Grace has all of your industrial metal needs.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/qI6V6VD56n8/hqdefault.jpg\"/></div>"},
{"username": "Houstman", "url": "https://i.redd.it/b5g1cavclgrb1.jpg", "time": 1696108492.0, "subreddit": "r/ThePPShow", "title": "It was always either Zero or Hero.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Has anyone ever died from edging before?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/b5g1cavclgrb1.jpg\"/></div>"}]