[{"username": "htank728", "url": "https://www.reddit.com/r/ThePPShow/comments/14pvgjl/ftds_on_june_6th/", "time": 1688419727.0, "subreddit": "r/ThePPShow", "title": "FTD’s on June 6th", "text": "<!-- SC_OFF --><div class=\"md\"><p>Was just looking at the FTD’s for the first half of June and I think I noticed something pretty crazy.</p>\n\n<p>On June 5th their were 295,000 FTD’s. On June 6th, the FTD total went up to 5.173 million FTD’s which is an increase of about 4.8 million FTD’s. The volume on June 6th was 9.6 million shares. Does this mean that about 50% of the volume that day was a failure to deliver…🤯</p>\n\n<p>Edit: forgot about the FTD’s being t+2. This means that the FTD’s occurred on June 2nd when volume was 25 million shares, which is still 20% of the daily volume being a FTD. Still insane.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "htank728", "url": "https://www.reddit.com/r/ThePPShow/comments/12thcsp/just_did_some_quick_math_please_correct_me_if_i/", "time": 1682029655.0, "subreddit": "r/ThePPShow", "title": "Just did some quick math, please correct me if I am wrong", "text": "<!-- SC_OFF --><div class=\"md\"><p>So if I remember correctly, bbby owes JP 111 million by April 26th. As of April 10th bbby had issued 558 million shares, and said they raised 48 million dollars from the ATM. Since bbby can issue a maximum of 900 million shares, they had 342 million shares left after April 10th to get to the total 111 million equity raise. They already raised 48 million dollars meaning they have to raise another 63 million dollars with 342 million shares. Even at 20 cents, the share offering would have given them 68.4 million which would be enough to satisfy JP Morgan. Why would they file bankruptcy? Am I missing something?</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]