[{"username": "IamVoltamatron1018", "url": "https://www.reddit.com/gallery/164ufex", "time": 1693343189.0, "subreddit": "r/ThePPShow", "title": "Docket 2084 released on Kroll Life’s hearing moved to 9/12", "text": "<!-- SC_OFF --><div class=\"md\"><p>Life’s application to shorten the time period for hearing on the motion for today was denied and was moved to 9/12.</p>\n\n<p>Since this was moved to the same date as the “Final approval of debtor’s disclosure statement and confirmation of their plan” hearing, do we think it’s going to be dismissed?</p>\n\n<p>Curious of everyone’s thoughts on this. Seems probable to me that they’ll announce that his objection to the plan is dismissed and they’ll move forward with the plan hearing.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/Va0ftCkM6LAUHrPUsnXpvHjGcrdBMMl4HA_9L8kfEp4.jpg\"/></div>"},
{"username": "IamVoltamatron1018", "url": "https://i.redd.it/xu3gf8y0nphb1.jpg", "time": 1691859535.0, "subreddit": "r/ThePPShow", "title": "Wrinkly brains 🧠 I need your help (Opt Out Discussion)", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I’m reading the opt-out form and come across the two highlighted paragraphs that I uploaded.</p>\n\n<p>I am in no way well versed in legal documentation but wanted to take a stab at this and clear up some confusion. Anyone that is well versed in legal jargon/documentation, please join the discussion in the comments. </p>\n\n<p>The first highlighted section states this, “ Without limiting the foregoing, from and after the Effective Date, any Entity (other than the DIP Agent, the DIP Lenders, the ABL Agent, the FILO Lenders, or the FILO Agent) that is given the opportunity to opt out of the releases contained in this Article X.D and DOES NOT exercise such opt out MAY NOT assert any claim or other Cause of Action against any Released Party based on or relating to, or in any manner arising from, in whole or in part, the Debtors” (I capitalized the does not and may not)</p>\n\n<p>What I understand from this is that if you do not opt out from the release, you cannot make any claim against the debtors if this thing goes south for whatever reasons.</p>\n\n<p>Second part I highlighted states this,” FROM and AFTER the Effective Date, any Entity (other than the DIP Agent, the DIP Lenders, the ABL Agent, the FILO Lenders, or the FILO Agent) that opted out of (or otherwise did not participate in) the releases contained in this Article X.D MAY NOT assert any claim or other Cause of Action against any Released Party for which it is asserted or implied that such claim or Cause of Action is not subject to the releases contained in Article X.C of the Plan without first obtaining a Final Order from the Bankruptcy Court…”</p>\n\n<p>What I understood from this is that if you choose to opt out after the cut off date, you also lose your right to make any claim against the debtors.</p>\n\n<p>So in summary, if any of us would like the option to make a claim against any of the responsible parties, we would need to check the opt out box and submit it.</p>\n\n<p>That’s what I got from the sections I highlighted. Would like to discuss this and clear it up so that I can make a well informed decision. Thanks in advance!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/xu3gf8y0nphb1.jpg\"/></div>"}]