[{"username": "icantsleep123", "url": "https://www.reddit.com/r/ThePPShow/comments/16zoepk/rtheppshow_sub_growing_at_a_fast_pace/", "time": 1696429010.0, "subreddit": "r/ThePPShow", "title": "r/ThePPShow sub growing at a fast pace…", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been hanging around this sub for a while, really since it’s inception. I reminisce with my buddies who are also in on the play, of a distant time when PPseeds was posting hype vids in the original Bobby sub… good times.\nBut DAMN. Time has passed and shit it changing quickly. Is anyone else noticing how fast this sub is growing as of lately? Eventually, this is going to be a big problem for the bad guys on the other side of the trade. Thoughts?!? This gives me pre-Jan 2021 vibes HARD.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "icantsleep123", "url": "https://i.redd.it/ilmp10rp4fqb1.jpg", "time": 1695654943.0, "subreddit": "r/ThePPShow", "title": "100k shares booked. See you on the moon 🌚 🌙", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ilmp10rp4fqb1.jpg\"/></div>"},
{"username": "icantsleep123", "url": "https://i.redd.it/dudie4r2wcnb1.jpg", "time": 1694320278.0, "subreddit": "r/ThePPShow", "title": "Can we talk about PRTYQ for a sec?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Some guy the other day tried to call me a shill cause I was talking about PRTYQ. Funny thing is you can’t buy PRTYQ even if you wanted to. It’s currently in the expert market, stuck in there with BLIAQ (RIP blockbuster). Check out pic above to see PRTYQ in its current form 😅 </p>\n\n<p>Let’s take a brief look back on Party City and how I think it may play a role in Teddy / Gmerica / Icahn thesis—</p>\n\n<ul>\n<li>Yeeted from about $1 to $9 late 2020 to mid 2021 (GME sneeze era) since then been absolutely obliterated to doggy dookie 💩 </li>\n<li>tracked straight back into dirt just like BBBYQ with similar volatility patterns </li>\n<li>Voluntary Chap 11 filed in January 2023 </li>\n<li>unknown entity DIP financer $150 million</li>\n<li>party city is right next to the goddam BuyBuyBaby AND Bed Bath and Beyond where I live - Party City is open for business </li>\n<li>serious FUD from MSM as their chapter 11 plan was approved in USBC with NO effective date listed but “shareholders get wiped out”</li>\n<li>stock sitting at .0018 as I type this this and accounts on the Party sub &amp; stocktwitz talking about selling right now to cut their losses, it’s over, we are fucked etc etc if you don’t believe me go take a look for yourself I highly encourage you to check out the irregular behavior </li>\n</ul>\n\n<p>Conclusion is simple:\nI believe we are seeing the beginning of GMERICA / TEDDY in keiretsu form - party city being one of the entities included. Before the effective date, a plan will come that will benefit shareholders and include them in the chapter 11 plan. The whole thing Seems awfully similar to our beloved BBBYQ bankruptcy with its own unique quirks as it is an entirely different business.  We are in the final stages and it is clear that there is artificial negative sentiment being pushed throughout the Internet by the media and social media. It is clear that the objective is to get people to sell their positions. It is clear “they” know what is coming. DIP lender is Icahn or RC, or maybe not specifically them but definitely part of the grand plan we are currently seeing playing out in real time. </p>\n\n<p>Check out this latest FUD:\n<a href=\"https://www.foxbusiness.com/markets/party-city-bankruptcy-approved-bad-news-shareholders.amp\">https://www.foxbusiness.com/markets/party-city-bankruptcy-approved-bad-news-shareholders.amp</a></p>\n\n<p>Let me know what ya think!!\nLove you guys and gals</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dudie4r2wcnb1.jpg\"/></div>"},
{"username": "icantsleep123", "url": "https://i.redd.it/6nfl991d5jfb1.jpg", "time": 1690909258.0, "subreddit": "r/ThePPShow", "title": "My daddies ❤️ with an AI pirate themed twist 🏴‍☠️ argggghhh mateys let’s blast 🚀", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/6nfl991d5jfb1.jpg\"/></div>"}]