[{"username": "Icy-Ad2711", "url": "https://www.reddit.com/r/ThePPShow/comments/17nv58c/funny_video/", "time": 1699131013.0, "subreddit": "r/ThePPShow", "title": "funny video", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.youtube.com/watch?v=qq8d5jvjarA\">The 10 Year Wait for GTA6</a></p>\n\n<p>I personally find this very funny. The amount of tinfoils and hype dates GTA 6 gets is wild. </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Icy-Ad2711", "url": "https://i.redd.it/c2lwco8a1cdb1.png", "time": 1689951483.0, "subreddit": "r/ThePPShow", "title": "Pete the scumfuck back at it again with more bullshit", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/c2lwco8a1cdb1.png\"/></div>"},
{"username": "Icy-Ad2711", "url": "https://www.reddit.com/r/ThePPShow/comments/155qc21/pete_the_poor_scumfuck_back_at_it_again/", "time": 1689951353, "subreddit": "r/ThePPShow", "title": "Pete the poor scumfuck back at it again", "text": "[Image is very self-explanatory ](https://preview.redd.it/xdxova6j0cdb1.png?width=978&format=png&auto=webp&s=4bf725b0a4b0d415c893cd901a44bef9a3a3fc08)\n\n&#x200B;", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Z40NOSFSJwJFhei-K2YvrKBDzrddmx1Hpiw_zOI80Nc.jpg\"/></div>"},
{"username": "Icy-Ad2711", "url": "https://www.reddit.com/r/ThePPShow/comments/155qc1y/pete_the_poor_scumfuck_back_at_it_again/", "time": 1689951353, "subreddit": "r/ThePPShow", "title": "Pete the poor scumfuck back at it again", "text": "[Image is very self-explanatory ](https://preview.redd.it/xdxova6j0cdb1.png?width=978&format=png&auto=webp&s=4bf725b0a4b0d415c893cd901a44bef9a3a3fc08)\n\n&#x200B;", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Z40NOSFSJwJFhei-K2YvrKBDzrddmx1Hpiw_zOI80Nc.jpg\"/></div>"},
{"username": "Icy-Ad2711", "url": "https://www.reddit.com/r/ThePPShow/comments/13dbbf9/house_of_cards_by_atobitt/", "time": 1683678926.0, "subreddit": "r/ThePPShow", "title": "House of Cards by Atobitt", "text": "<!-- SC_OFF --><div class=\"md\"><p>I came across this very interesting article on Peruvian Bull&#39;s twitter. It was written by a fellow redditor called atobitt.</p>\n\n<p><a href=\"https://pdfhost.io/v/lRQ4HqpG0_House_of_Cards_Atobitt\">https://pdfhost.io/v/lRQ4HqpG0_House_of_Cards_Atobitt</a></p>\n\n<p>&#x200B;</p>\n\n<p>Did some quick search and found out he was one of the ogs who participated in the jimmy saga. I highly encourage people to read this one. The article is very straight forward and the target audience is us apes. Atobitt highlights that all the naked shorting is made possible by the DTC&#39;s enrollee- Cede &amp; Co. The way I understand it is that Cede &amp; Co. is like the Death Star. It&#39;s Wall St&#39;s ultimate weapon and one of our greatest enemies alongside with them algos and SHFs.</p>\n\n<p>Also, please check out this external link mentioned in the article:</p>\n\n<p><a href=\"https://smithonstocks.com/part-8-illegal-naked-shorting-series-who-or-what-is-cede-and-what-role-does-cede-play-in-the-trading-of-stocks/\">https://smithonstocks.com/part-8-illegal-naked-shorting-series-who-or-what-is-cede-and-what-role-does-cede-play-in-the-trading-of-stocks/</a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Icy-Ad2711", "url": "https://www.reddit.com/r/ThePPShow/comments/134tm9o/thoughts_on_delisting/", "time": 1682961226.0, "subreddit": "r/ThePPShow", "title": "Thoughts on delisting", "text": "<!-- SC_OFF --><div class=\"md\"><p>First time posting. Long time lurker of this sub and bbby sub. My profile looks sus but I’m not a bot. </p>\n\n<p>I personally think the 8-k filed on 04/24/23 provided some crucial information about the delisting notice issued by NASDAQ. The sole reasons of receiving the delisting notice were stated in that particular 8-K:</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/static-files/0ad9a73e-06be-419b-b41c-935cc3d4caa9\">https://bedbathandbeyond.gcs-web.com/static-files/0ad9a73e-06be-419b-b41c-935cc3d4caa9</a></p>\n\n<p><em>as a result of the Chapter 11 Cases and in accordance with Nasdaq Listing</em> <strong><em>Rules 5101, 5110(b) and IM-5101-1</em></strong><em>, Nasdaq had determined that the Company’s common stock will be delisted from Nasdaq.</em> </p>\n\n<p>3 sections of Nasdaq Listing rule 5100 series were mentioned.</p>\n\n<p><a href=\"https://listingcenter.nasdaq.com/rulebook/nasdaq/rules/nasdaq-5100-series\">https://listingcenter.nasdaq.com/rulebook/nasdaq/rules/nasdaq-5100-series</a></p>\n\n<p>&#x200B;</p>\n\n<p>Let’s take a look at Rule 5101 first.</p>\n\n<p><em>5101. Preamble to the Rule 5100 Series</em></p>\n\n<p><em>Nasdaq is entrusted with the authority to preserve and strengthen the quality of and public confidence in its market. Nasdaq stands for integrity and ethical business practices in order to enhance investor confidence, thereby contributing to the financial health of the economy and supporting the capital formation process. Nasdaq Companies, from new public Companies to Companies of international stature, are publicly recognized as sharing these important objectives.</em></p>\n\n<p><em>Nasdaq, therefore, in addition to applying the enumerated criteria set forth in the Rule 5000 Series, has broad discretionary authority over the initial and continued listing of securities in Nasdaq</em> <strong><em>in order to maintain the quality of and public confidence in its market, to prevent fraudulent and manipulative acts and practices, to promote just and equitable principles of trade, and to protect investors and the public interest. Nasdaq may use such discretion to deny initial listing, apply additional or more stringent criteria for the initial or continued listing of particular securities, or suspend or delist particular securities based on any event, condition, or circumstance that exists or occurs that makes initial or continued listing of the securities on Nasdaq inadvisable or unwarranted in the opinion of Nasdaq, even though the securities meet all enumerated criteria for initial or continued listing on Nasdaq.</em></strong> <em>In all circumstances where the Listing Qualifications Department (as defined in Rule 5805) exercises its authority under Rule 5101, the Listing Qualifications Department shall issue a Staff Delisting Determination under Rule 5810(c)(1), and in all circumstances where an Adjudicatory Body (as defined in Rule 5805) exercises such authority, the use of the authority shall be described in the written decision of the Adjudicatory Body.</em></p>\n\n<p><em>Amended June 16, 2009 (SR-NASDAQ-2009-052).</em></p>\n\n<p>So my understanding is that this Rule set grants Nasdaq the authority to examine, <strong>SUSPEND</strong>(remember this word),or delist a specific stock that meet all the enumerated criteria for listing during a special event(in bbby’s case chapter 11). We all know this is not a fair/just market, but let&#39;s just take this by its literal meaning and assume this rule set is implemented to protect investors and prevent fraud and manipulation.</p>\n\n<p>Now we have a basic understanding of this how 5100 Rule Series work let’s move on to the next rule listed in the 8-K</p>\n\n<p><em>5110. Change of Control, Bankruptcy and Liquidation, and Reverse Mergers</em></p>\n\n<p><em>(b) Bankruptcy and Liquidation</em></p>\n\n<p><em>Nasdaq may use its discretionary authority under the Rule 5100 Series to</em> <strong><em>suspend or terminate</em></strong> <em>the listing of a Company that has filed for protection under any provision of the federal bankruptcy laws or comparable foreign laws, or has announced that liquidation has been authorized by its board of directors and that it is committed to proceed, even though the Company&#39;s securities otherwise meet all enumerated criteria for continued listing on Nasdaq. In the event that Nasdaq determines to continue the listing of such a Company during a bankruptcy reorganization, the Company shall nevertheless be required to satisfy all requirements for initial listing, including the payment of initial listing fees, upon emerging from bankruptcy proceedings.</em></p>\n\n<p>5110(b) is designated to chapter 11 and it is up to Nasdaq to decide whether they apply this rule or not. I personally believe bbby is compliant to all the criteria and chapter 11 is the triggering event that lead to this Nasdaq notice. Again, in this section, the word <strong>SUSPEND</strong> and terminate(delisting) are used separately. </p>\n\n<p>The last sentence of the 8-k states that ‘Trading of the Company’s common stock will be suspended at the opening of business on May 3, 2023.’ I assume this means Nasdaq is only suspending bbby on May 3 instead of straight up delisting it. Of course, delisting is still on the table. It is clearly stated in the 8-k but there was not specific date for delisting. Although the Nasdaq notice is named &#39; delisting notice&#39;, it does not have a definitive effect on delisting bbby.</p>\n\n<p>So why suspension? Here comes my tinfoil/speculation: Nasdaq is initiating an investigation on bbby. Maybe they tryna figure out how many outstanding shares are our there? </p>\n\n<p>With all the RS and cancelled offering bullshit, I think there&#39;s a relatively high possibility that bbby will come up with some new bullshit before the suspension or during the suspension(definitiely before delisting). </p>\n\n<p>I&#39;m still trying to understanding Rule IM-5101-1 and how it applies to bbby. I hope more wrinkled brains can take a look at it and share their thoughts on this.</p>\n\n<p>I know delisting is not the end and I&#39;m ok with trading in OTC market. I just don&#39;t think delisting can truly &#39;unlock&#39; the value of bbby.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]