[{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/17ut32a/marcus_lemonis_a_in_clothing/", "time": 1699932223.0, "subreddit": "r/ThePPShow", "title": "Marcus Lemonis - a 🐺 in 🐑 clothing?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I think it would be prudent to tread with caution and skepticism when it comes to this guy.</p>\n\n<p>It seems like he is trying hard  (too hard) to win the allegiance of bbby(q) holders. It’s smart and it makes sense for him to do so but I keep getting the hey fellow kids meme vibes from him and worry he is less an RC type and more of an Adam Aron type - saying things we want to hear that we will post in the subreddit (like the recent tweet trying to align himself with us)</p>\n\n<p>Until he puts his money where is mouth is … repeatedly, I won’t be buying what he is selling.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/16ki0rk/qq/", "time": 1694898261.0, "subreddit": "r/ThePPShow", "title": "QQ", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have a quick question and the daily isn’t great. I will delete the post if I get an answer or before the weekend is over. </p>\n\n<p>My question is: In a scenario where a stock gets delisted and is worthless, who benefits from shares that are not sold? Short Hedge Funds don’t have to buy back shares, I get how they benefit, but they benefit either way (if shareholders sell and it goes to 0 or if it gets delisted) right?</p>\n\n<p>What got me thinking about this is wondering if there could theoretically be reverse shills whose job is to convince people to hold hoping for a turn around that isn’t coming (thing Party City). </p>\n\n<p>Would that essentially just go to the Market Makers? Debtors?(if they were in bankruptcy) SHFs? </p>\n\n<p>Kind of a shower thought and I figured people here might know. 🤷🏼‍♂️</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/16gavta/moass_isnt_sept_12th_but_it_is_tomorrow/", "time": 1694474344.0, "subreddit": "r/ThePPShow", "title": "Moass isn’t Sept 12th but it is Tomorrow ™️", "text": "<!-- SC_OFF --><div class=\"md\"><p>Tomorrow is a big day, no doubt. </p>\n\n<p>Tomorrow, assuming all objections have either a solution in place or are smaller and not impactful (I’m sure there is a legal term for those type of things that I don’t know)  there should be an approved Restructuring Plan in place. If they needed more time to resolve things I would think they would have pushed the hearing back by now. </p>\n\n<p>Unless we see a docket entry tonight that changes the plan and gives common shareholders equity (in whatever form that may be) No one should expect to see the ticker explode upwards tomorrow imo. </p>\n\n<p>In fact, I think we will see dozens of Fuddy articles tomorrow and especially Wednesday that it’s officially over, investors should pack their bags and cash out…and for good measure they will drop the stock to corroborate their story that retail is exiting their position. </p>\n\n<p>Don’t take the bait. Don’t get overly emotional about tomorrow. I don’t think I have ever seen so many posts hyping a particular date and that includes GME 2021-present. I’m mentally prepared for craziness. Ramen or lambos. Hold.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/1677nef/stupid_algo/", "time": 1693576114.0, "subreddit": "r/ThePPShow", "title": "Stupid Algo", "text": "<!-- SC_OFF --><div class=\"md\"><p>Anyone else annoyed they seem to have really locked us between $0.211 and $0.29?</p>\n\n<p>It would be impressive if it wasn’t so annoying.</p>\n\n<p>Obviously doesn’t impact my long shares but I was enjoying a nice little daily swing trade and they have ruined my fun. </p>\n\n<p>Seems like we won’t be able to break free until some sort of news hits.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://forms.ra.kroll.com/efiling/fr/ra/bbbyimpaired/new", "time": 1692627582.0, "subreddit": "r/ThePPShow", "title": "Opting Out - How to for class 9 - common share holder.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Meant to do this over the weekend but life is distracting. </p>\n\n<p>Disclaimer first: This post isn’t telling you you should or shouldn’t Opt-Out (I personally did as I see no down-side to retaining my right to legislate against Bed Bath (or join a class action if one comes about from shenanigans) in the future, but you do you)</p>\n\n<p>The process honestly is quite simple. Click the link in the post. </p>\n\n<p>The first page is all talking about the plan and disclosure statement and how we do not get to vote and it will be assumed we vote No. Read if you need to. Scroll to the bottom and click next. </p>\n\n<p>The second page is the beginning of the opt-out form. If you do nothing and do not sign you “are deemed to grant the third party release” … in other words, you are legally letting everyone off of the hook. (Personally, if news comes to\nLight that there was serious wrong doing I would like to be able to do something about it.) Read if you need to. If you are a common shareholder (class 9) you do not need to enter an ID as you don’t have one to enter. Scroll to the bottom and click next. </p>\n\n<p>You should be on page 3. Read if you need to. Scroll to the bottom… now you get to do something. Check the box at the bottom that says By Checking this box you elect to Opt Out of the Third Party Release.</p>\n\n<p>Sign. Input relevant information. Submit. Voila! You have just Opted Out of the release and will get an email confirmation. </p>\n\n<p>Please note…. If you have DRS’ed shares you will have a unique ID. (As DRS’ed shares are class 8) This needs to be put in on page 2. </p>\n\n<p>I’m not a big brain… just a normal person trying to dispel the myth that this is hard or complicated or takes a great deal of time. It can be done in less than 2 minutes.</p>\n\n<p>If it makes you uneasy to opt out then…dont. If you want to wait until closer to the deadline, by all means, do that. Have a great week!</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"file:///C:/Users/JASON~1.SPI/AppData/Local/Temp/msohtmlclip1/01/clip_image001.gif\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/15i078v/us_market_not_halted_yet/", "time": 1691155929, "subreddit": "r/ThePPShow", "title": "US market not halted- yet", "text": "Just bought some shares. Ticker seems to be operational.", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/vnp55h25yjfb1.jpg", "time": 1690918936.0, "subreddit": "r/ThePPShow", "title": "🎢", "text": "<!-- SC_OFF --><div class=\"md\"><p>Weeeee</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/vnp55h25yjfb1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjA0MTE3MA==&amp;id2=-1", "time": 1690312227.0, "subreddit": "r/ThePPShow", "title": "Objection to Dream on Me taking over lease - Docket Entry 1509", "text": "<!-- SC_OFF --><div class=\"md\"><p>Docket Entry basically states the law firm who filed the entry represents the landlord (Enid) for a New Jersey Baby store. </p>\n\n<p>“The notice identified Dream on Me as the successful bidder for the leased premises. Although we understand that Dream on Me has purchased intellectual property from the estate, Enid (landlord) is not aware of Dream on Me as being a viable “brick and mortar” retailer with the means to operate the leased premises and to satisfy and maintain all lease obligations”</p>\n\n<p>I wondered (and I think others did as well) how they intended to run 11 stores, where they even got the capital to purchase the stores, How they have enough merchandise to fill those stores, why they would get all new employees etc.  </p>\n\n<p>Hopefully this gets addressed at the hearing on Friday and we get some spicy details. It feels like a going concern bid without calling it a going concern bid. It’s perplexing.</p>\n\n<p>Anyone have any DD on this? Theories?</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/6wo81d1jqcdb1.jpg", "time": 1689959931.0, "subreddit": "r/ThePPShow", "title": "You know what? I’m not leaving.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The show goes on!</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/6wo81d1jqcdb1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/153hyoj/good_night_westley_good_work_sleep_well_ill_most/", "time": 1689733302.0, "subreddit": "r/ThePPShow", "title": "Good Night, Westley. Good work. Sleep well. I’ll most likely kill you in the morning.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Phew. It’s been an interesting day, it’s been an interesting ride. We’re not there yet but the docket entry i think a lot of us have been waiting for (at least the first iteration) will be filed tonight or tomorrow. (Not sure if it would be strategically advantageous for them to wait until after the phase II lease auction or not) </p>\n\n<p>What we know: There is a disclosure statement and plan that has been agreed upon by the Unsecured Credit Committee and the DIP lenders and we will get to see what they have been working on. It will then be up to the judge to decide if this is good enough or if they need to revise it. (You can almost guarantee there will be objections to the plan from the Ad Hoc Bondholder group)</p>\n\n<p>I doubt this will answer all of our questions but it will be a big piece of the puzzle. Don’t be too disappointed if it doesn’t say RC/Icahn. Whether or not they are a part of the play we know that they don’t like to show their hand until the work is done done. </p>\n\n<p>I will read the docket entry myself (as we all should) and personally plan to wait for a few of the big brains to get time to look over the document before I get too worked up. (I tend to get overly excited, jump the gun  and then need to pull myself back)</p>\n\n<p>That’s a lie. I’m going to lose my shit with excitement no matter what. Time for me to eat some snacks, watch a dumb 80s action movie and wait for the figurative dinner bell to ring. 🚀 💰 🌙</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/1537ii3/restructuring_plan_within_24_hours/", "time": 1689707785.0, "subreddit": "r/ThePPShow", "title": "Restructuring Plan within 24 hours.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Get hype. Someone light the rockets.</p>\n\n<p>Edit: It will be a combined disclosure statement and plan that has been agreed upon by the UCC and the DIP lenders that will be filed today or Tomorrow with a court hearing the first week in August to approve it. Pending any objections which should be able to be addressed before that hearing date.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/y4070hbnoqcb1.jpg", "time": 1689692948, "subreddit": "r/ThePPShow", "title": "Amended Agenda for todays hearing…", "text": "Looks like meats (asset auction) back on the menu boys. Notice how lease auctions are referenced as such below the highlighted section. \n\nWhat about them, their fresh? (This seems to be something different from lease auctions and something new I didn’t see in the agenda before)\n\nThey are not for eating. (I may be wrong, but if I am you only have to wait 3 and 1/2 hours to find out I’m an idiot.)", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/y4070hbnoqcb1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/14x071s/there_is_a_path_forward/", "time": 1689102147.0, "subreddit": "r/ThePPShow", "title": "There is a path Forward", "text": "<!-- SC_OFF --><div class=\"md\"><p>Bed Bath attorney just confirmed Sixth Street as the path forward to come out of Chapter 11.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/14lk42n/main_bond_holder_part_of_creditor_committee/", "time": 1687983947.0, "subreddit": "r/ThePPShow", "title": "Main Bond Holder - Part of Creditor Committee", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sixth Street attorney just said one of the majority Bond Holders is also part of the Creditor Committee and that the Ad Hoc group must be having issues with him and that could be why they are there. </p>\n\n<p>This is the information I have been wanting to hear. This could mean that a majority bond holder (…someone like RC/Icahn) just angered other bond holders. </p>\n\n<p>Perhaps they caught wind of another deal they were making … who knows for sure. Praying that the judge sides with the Bed Bath attorneys.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://twitter.com/patrickbyrne/status/1673433661146820609?s=46&amp;t=s-SS6qV_3TgTbO-9rMUtow", "time": 1687812871, "subreddit": "r/ThePPShow", "title": "IWO JIMA", "text": "I don’t know what It means but… it’s my new safe word", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/bwZuE0KGdbQlDDWL6y-BaIMJ9msWN7C72xuou_bMz2E.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.reddit.com/r/ThePPShow/comments/149dgpl/1_bond_holder_holds_1_billion_in_bonds/", "time": 1686763041.0, "subreddit": "r/ThePPShow", "title": "1 Bond Holder holds 1 Billion in bonds?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/s6dvuablin5b1.jpg", "time": 1686603653.0, "subreddit": "r/ThePPShow", "title": "It’s Time.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Let’s go.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/s6dvuablin5b1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/lq37x9cubf5b1.jpg", "time": 1686504529.0, "subreddit": "r/ThePPShow", "title": "This evenings deadline is for Stalking Horse Selection not a deadline to file", "text": "<!-- SC_OFF --><div class=\"md\"><p>The Stalking Horse Deadline is today at 5pm. I’m hyped, your hyped, we are all hyped. </p>\n\n<p>I just wanted to put it out there that this deadline isn’t the deadline to file with the court. (Meaning file the docket) It is the deadline for the bidders to get all of their ducks in a row, submit their bid, likely some negotiating and for Bed Bath to select one OR MORE (or none) stalking horse bids. (There could be seperate accepted stalking horse bids on different assets). They may very well file before midnight, but, maybe not. </p>\n\n<p>Also, They recently filed dockets that allow for keeping some things confidential as well… so we may not get the bidder information but perhaps just the details of the accepted stalking horse bid(s) (this is just a guess)</p>\n\n<p>We are getting close now.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/lq37x9cubf5b1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/doivogadzw4b1.jpg", "time": 1686282409.0, "subreddit": "r/ThePPShow", "title": "Stalking Horse Deadline extended to Sunday at 5pm", "text": "<!-- SC_OFF --><div class=\"md\"><p>As the title says the deadline has been extended until Sunday at 5pm. Only a few extra days. We should have our stalking horse before Monday morning. Let the weekend hype commence!</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/doivogadzw4b1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://www.tarterkrinsky.com/insights/stalking-horse-bidder-to-be-or-not-to-be#:~:text=An%20investor%20can%20benefit%20by,and%20other%20important%20deal%20terms", "time": 1685816623.0, "subreddit": "r/ThePPShow", "title": "Stalking Horse Bidder - To Be or Not To Be", "text": "<!-- SC_OFF --><div class=\"md\"><p>Article I found useful and interesting on the benefits and disadvantages of being the Stalking Horse Bidder. </p>\n\n<p>If I were in a position to make a play for the company… I have to say, I am not so sure I would put in a Stalking Horse bid. I might wait, see where the floor is, see what debt the company is a capable of getting rid of via Ch 11, and then, being ready on Auction day or Bid deadline with my best offer. (Assuming my offer were better than the Stalking Horse Bid)</p>\n\n<p>The benefit of the Stalking Horse bid for shareholders is that shareholders will know prior to auction day what the worst case scenario for them would be. I can’t imagine the board would accept the bid from the company who only want the digital and trademark rights when there is a bid on the table to keep Baby and 75% of its stores intact. Should be an interesting couple of weeks.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"/logo-ie11.png\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTUxMTc0Nw==&amp;id2=-1", "time": 1685475372.0, "subreddit": "r/ThePPShow", "title": "Docket 493 - 5/31 Court Date Agenda", "text": "<!-- SC_OFF --><div class=\"md\"><p>Looks like a long day of trudging through final approval of motions and things needed to keep things moving along. </p>\n\n<p>I am particularly interested in matter IV, topic #1. We may not learn anything new, but then again… we very well may get some interesting info. Only have to wait until tomorrow to find out.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/lsmt7efn2v2b1.jpg", "time": 1685387603.0, "subreddit": "r/ThePPShow", "title": "Exacta 🚀", "text": "<!-- SC_OFF --><div class=\"md\"><p>Exacta: A bet in which the player attempts to pick the 1st and 2nd place horse on one ticket. This is my bet (wish) for a Stalking Exacta.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/lsmt7efn2v2b1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/acrvbtce5c2b1.jpg", "time": 1685158496.0, "subreddit": "r/ThePPShow", "title": "I spotted a couple Strange looking horses Stalking about…", "text": "<!-- SC_OFF --><div class=\"md\"><p>Saddle up. 🚀</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/acrvbtce5c2b1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/64fhvl8ng42b1.jpg", "time": 1685065424.0, "subreddit": "r/ThePPShow", "title": "Pultejuice Pultejuice Pultejuice", "text": "<!-- SC_OFF --><div class=\"md\"><p>It’s SHOWTIME!</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/64fhvl8ng42b1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/qzi0q6ijyq1b1.jpg", "time": 1684901945.0, "subreddit": "r/ThePPShow", "title": "Only The Young Guns", "text": "<!-- SC_OFF --><div class=\"md\"><p>Regulators, let’s mount up. </p>\n\n<p>🚀</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/qzi0q6ijyq1b1.jpg\"/></div>"},
{"username": "Iforgotmynameo", "url": "https://i.redd.it/44fpsjohco1b1.jpg", "time": 1684870317.0, "subreddit": "r/ThePPShow", "title": "Billy the Kid - Only the Young", "text": "<!-- SC_OFF --><div class=\"md\"><p>Only the Young (Guns)</p>\n\n<p>Shareholders own the company. </p>\n\n<p>Shots fired. </p>\n\n<p>Let’s go.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🐺 Cries Wolf 🐺 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/44fpsjohco1b1.jpg\"/></div>"}]