[{"username": "Infinite_Length_4572", "url": "https://i.redd.it/pc1omd06mswb1.jpg", "time": 1698433288.0, "subreddit": "r/ThePPShow", "title": "GameStop and Gundam Metaverse", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not a bbby thread, mods feel free to delete if this should be elsewhere. </p>\n\n<p>So TIL Bandai Namco has a <a href=\"https://gmpj.bn-ent.net/en/pr/\">whole metaverse project in beta testing for their Gundam series of IP</a>. I didn’t notice any announcements or chatter among apes like there has been with Lego or other potential Teddy collaborators. </p>\n\n<p>For non anime people living outside of moms basement, this is one of the biggest franchises ever, with TV media backed by virally popular in media snap fit model kits in various scales and grades of detail. These guys pretty much invented the paradigm of propagandizing action figured on TV as a form of targeted ads to kids that was then picked up by Mattel and Hasbro, so we’ve all experienced the echoes of their genius. Despite not having popular penetration into the US market, <a href=\"https://www.siliconera.com/gundam-made-record-breaking-131-billion-jpy-in-2023-fiscal-year/#\">they pull 800-900 million USD equivalent per year.</a> </p>\n\n<p>Like Lego, they offer a creative product that lends itself well blockchain implementation for validation and additional utility, and currently they’re making that 900mil purely by serving the Japanese market and the middlemen that provide the kits to the western world. </p>\n\n<p>I noticed during the beginning of the GameStop turnaround that they started stocking some pretty cool gunpla models for a lot cheaper than I could get them through Amazon or the other usual resellers. This dropped off, but it got my attention. I can reasonably assume Bandai Namco has deals in place with GameStop for distributing Namco published games, but I was very happy to have a new line on gunpla. So we know preexisting lines of communication are there. </p>\n\n<p>Just wanted to point all this out since it seems to be out of the convo, anyone else have any info linking Cohen or GME/Teddy to Bandai? </p>\n\n<p>Wouldn’t it be nice if Bandai broke 1billy in annual profits by teaming up with a partner to push Gundam kits and their associated cryptotrinkets in the USA?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/pc1omd06mswb1.jpg\"/></div>"},
{"username": "Infinite_Length_4572", "url": "https://i.redd.it/clekpkksh0wb1.jpg", "time": 1698092824.0, "subreddit": "r/ThePPShow", "title": "Talked to my Fidelity Rep then her Supervisor, she had this to say:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Another tick for “DTCC sent the instructions to remove shares” if anyone’s counting</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/clekpkksh0wb1.jpg\"/></div>"}]