[{"username": "InterestingButALie", "url": "https://www.reddit.com/r/ThePPShow/comments/14trl6s/you_guys_are_all_fuckers_this_is_the_real_proof/", "time": 1688784633, "subreddit": "r/ThePPShow", "title": "You guys are all fuckers - this is the real proof we are going to the moon on Monday", "text": "Let me tell you something. Do you love America? Do you love the stars and stripes and everything that goes with it, including C130 raining down freedom on our enemies? If you are a bear and shorting BBBY, you are against America. It's called bed, bath, and beyond for a reason. BBBY cares about Americans. They sell bed products so you can go to sleep at night and wake up feeling refreshed so you can support and pump the American economy. The bath is because they give a shit about us and sell bidets and towels. Beyond because they are god fearing company and nothing is more Christian than being in BBBY. This is as America as it gets. You ever been to the beach? You know how American it is to go to the beach? Well BBBY gets it, that's why its called the Towel Stonk. Let me tell you something, there is something else that BBBY sells because they care about us - it's bidets. When I used to take showers with my uncle, he used to tell me that the best way to clean your asshole is with a bidet. You know what else he said? Make sure to use a high-thread count towel to make sure you butthole feels good. Who sells towels? You guessed it, Target sells towels. However, those are the shit brand from China. You need the high-thread count towel, where do you get those? William Sonoma. Wait are you a wussy? You don't shop there then. Best places for towels in down is BBBY. They know a thing or two about towels. They are called Towel stonk for a reason. Like I said shorts, do you care about your asshole being clean? BBBY does. They will make sure you use a high-thread count towel and not the cheap shit that will rip your butthole apart. Never bet against BBBY. You are betting against America if you are, and if you are shorting it, you are a dirty communist. ", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"spoiler\"/></div>"},
{"username": "InterestingButALie", "url": "https://www.reddit.com/r/ThePPShow/comments/13cewan/a_kind_request_to_pp_my_parents_yelled_at_me/", "time": 1683605180, "subreddit": "r/ThePPShow", "title": "A kind request to PP, my parents yelled at me tonight", "text": "I was watching the stream PP and my mom walked in and was angry because one of the gents was shirtless in the stream. Can you tell people to keep their shirts on? \n\nThanks", "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]