[{"username": "Itchy_Principle6434", "url": "https://i.redd.it/f1ij4jzv0frb1.jpg", "time": 1696089501.0, "subreddit": "r/ThePPShow", "title": "Stages of a Butterfly", "text": "<!-- SC_OFF --><div class=\"md\"><p>We know that creative names are often used to hide M&amp;A’s.  DK Butterfly shows up as the new name for what is left of BBBY.  There’s been plenty of Tin Foil about butterflies.</p>\n\n<p>I was thinking about what a butterfly represents.  It is a very common tattoo that represents transformation, freedom, rebirth.</p>\n\n<p>While Butterfly could just be a random name, I don’t believe it because it ties in too much with the path of Bed Bath and Beyond.</p>\n\n<p>So to start, Bed Bath and Beyond has been a successful company over the years and has a place in many’s hearts.  It’s well documented how bad leadership and short selling has been a detriment to the company.  Ryan Cohen saw the beauty in the company and specifically in its crown jule Baby.</p>\n\n<p>As you can see in the image.  Butterflies have a cyclical life.  It begins with a butterfly laying an egg.  What is interesting is that this egg turns into a caterpillar that ends up protecting itself in a cacoon before it can develop wings and fly.</p>\n\n<p>So, the original butterfly who has been trapped by debt and ABL loans laid its egg.  The cocoon was formed around this company (chapter 11 protection).  The cocoon also represents the past of BBBY, eventually the shell must be removed as the butterfly grows wings and flys.</p>\n\n<p>I wish I had better writing ability and could make this more poetic.</p>\n\n<p>Overall, I just think the name Butterfly represents something beautiful.  Why would you name a liquidating trust something beautiful if it was just wiping out shareholders and selling off remaining assets?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/f1ij4jzv0frb1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/c2lzub6v9erb1.jpg", "time": 1696080413.0, "subreddit": "r/ThePPShow", "title": "Non-Voting Securities", "text": "<!-- SC_OFF --><div class=\"md\"><p>Apologize for the formatting but this section is split up into 2 pages.</p>\n\n<p>It’s interesting that it says the plan does not provide for new equity. </p>\n\n<p>IMO, shills keep saying we are not being distributed anything from the plan.  To me I don’t want to be part of the plan.</p>\n\n<p>With Butterfly filing the 8k and having 900,000,000 shares I believe that all remaining debt and equity for BBBY was/ will be held in Butterfly where our buyer will purchase the remains.</p>\n\n<p>There is a lot of talk about Share Issuances and NOLs in the August Lazard Billing.  I think Butterfly is going to issue 1 for 1 shares.  They may have also done enough to keep the NOLs available for whoever buys Butterfly.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/c2lzub6v9erb1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/uspvyzp7rvpb1.jpg", "time": 1695420370.0, "subreddit": "r/ThePPShow", "title": "Is this the revised plan? We find out Monday!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/uspvyzp7rvpb1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/16jyrrq/rc_account_in_the_pp_chat/", "time": 1694840514.0, "subreddit": "r/ThePPShow", "title": "RC account in the PP Chat", "text": "<!-- SC_OFF --><div class=\"md\"><p>1) 25 hours to figure out 50 ways to say good bye..</p>\n\n<p>In the Train song he mentions Yom Kippur in the song.  Yom Kippur features a 25 hour fast.  Watch the music video, the Jewish man sticks out like a soar thumb.</p>\n\n<p>2) The day Myril Haug hit 6 singles in one day was June 6, 1934.  </p>\n\n<p>On that exact day Teddy Rosevelt:</p>\n\n<p>Prior to the signing of the Securities Exchange Act by President Roosevelt on June 6, 1934, there was not much oversight of the United States securities market. The act created the Securities &amp; Exchange Commission (SEC) and some regulation of large public companies really began</p>\n\n<p>Then right after we play the Train song, RC account gets back in the chat and says “soon”.</p>\n\n<p>Super tin foil but those are insanely deep riddles that he knew we’d figure out</p>\n\n<p>He came back on and said he’s not RC but an engaged colleague.</p>\n\n<p>I find it interesting.  Someone came up with some pretty deep riddles that they knew we’d dig into.  It’s also telling they said they weren’t RC.  If it was a troll or attention seaker they’d probably let it ride.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/1645mhl", "time": 1693275346.0, "subreddit": "r/ThePPShow", "title": "SEC Disclosure?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just thinking that the original plan was amendment ended to add this line about SEC.  Potentially related.</p>\n\n<p>However, the time was charged in advance of the original plan.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/etNuXS4NucG-G1JQkaqrSR_UviVR1GxiDz4OsddruWE.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/15y5a8z/docket_1958_shower_thoughts/", "time": 1692709515.0, "subreddit": "r/ThePPShow", "title": "Docket 1958 shower thoughts.", "text": "<!-- SC_OFF --><div class=\"md\"><p>1) most everything is liquidated.  Filo and DIP lender are not going to get paid back their investment in full.  They made a terrible decision to help BBBY through Chapter 11.</p>\n\n<p>2) since the above aren’t recovering their money, bondholders aren’t either.  </p>\n\n<p>Wait a second…</p>\n\n<p>3)  BBBY lawyers said in court they expect a route to a “successful” Chapter 11 exit.  How do they expect that after points 1 and 2?</p>\n\n<p>4)  pretty much all the debt that is left is dip loan, filo and bonds.  The bonds are the prepetitiom amount.  There were signs someone was making make whole calls of the bonds.  Is it possible 6th street or whoever they are representing is now the sole creditor?</p>\n\n<p>5)  Why successfully exit chapter 11 with no equity, no NOLs and absolutely no business.  Especially if your BK estate isn’t even able to pay back the DIP loan?  </p>\n\n<p>6) point 5 makes me think the only reasonable outcome is that the plan is complete and someone has full ownership of the company for Pennie’s on the dollar.  The total funded debt is misleading and/or can be exchanged for equity.  Credit bid on the way to cancel all debt and to announce reverse merger of Tedding Holdings.</p>\n\n<p>Idk just some thoughts, nothing ever adds up with this stock.  Would appreciate if anyone has anything additional or if this leads to further investigation.</p>\n\n<p>Happy Tuesday!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/hxx7a3ga03gb1.jpg", "time": 1691149689.0, "subreddit": "r/ThePPShow", "title": "Gazelle has posted half FUD 17 times this morning.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/hxx7a3ga03gb1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/hxx7a3ga03gb1.jpg", "time": 1691149689, "subreddit": "r/ThePPShow", "title": "Gazelle has posted half FUD 17 times this morning.", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/hxx7a3ga03gb1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/15hfcfp/activist_lawyer/", "time": 1691095278.0, "subreddit": "r/ThePPShow", "title": "Activist Lawyer", "text": "<!-- SC_OFF --><div class=\"md\"><p>Would be awesome to get a big name Activist Law Firm to dig into the objection and back common share holders.</p>\n\n<p>Hmm,  don’t we happen to know one?  Pulte mentioned the one he shares with Ryan Cohen several times.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/6bjvmcffl4fb1.jpg", "time": 1690733058.0, "subreddit": "r/ThePPShow", "title": "Kastin response to Wu", "text": "<!-- SC_OFF --><div class=\"md\"><p>Pretty interesting.  Enjoy your time away is an odd thing to say IMO</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/6bjvmcffl4fb1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/15cx3rp", "time": 1690649796.0, "subreddit": "r/ThePPShow", "title": "Why did Lazard get paid if we are liquidating?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Credit to Travis the Stripper and Kaiser.  I pulled some images from your old posts.  Search Lazard in the thread and you can find some good ones.</p>\n\n<p>This isn’t new info, but rather an important “Why?” To add to Salvatore’s list.</p>\n\n<p>Things just don’t make sense, I’m holding because things seem off and I believe there is something deeper here</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/kXXrEfOLfmx_3zfoQ99pn3yOEsp48M9zYC9cQkNLd6I.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/158a7k3/when_this_rips/", "time": 1690204058, "subreddit": "r/ThePPShow", "title": "When this rips…", "text": "I’m going to use some of my gains to protect retail investors by suing Marantz.\n\nFirst off the man acts like an ass, and has countless times been condensing to ABC.  That’s not against the law but lights the fire.\n\nMostly, the man consistently gives financial and legal advice by threatening that he has his own trained bankruptcy lawyer feeding him information.  He needs to be careful because just saying “NFA” and putting a disclaimer does not protect him when he is threatening that he is receiving financial advice and sharing it.\n\nSorry for the post, just wanted you all to know the first thing I’m doing with my money.  Anyone is welcome to joint the lawsuit.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/158a7k3/when_this_rips/", "time": 1690204058.0, "subreddit": "r/ThePPShow", "title": "When this rips…", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/14x12pa/plan_to_exit_chapter_11_to_be_filed_in_a_few_days/", "time": 1689104109.0, "subreddit": "r/ThePPShow", "title": "Plan to exit Chapter 11 to be filed in a few days.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Well read in between the lines.  If 6th street has been helping with a reorganization plan to successfully exit Chapter 11 proceeding… and they plan to file it in the next few days.</p>\n\n<p>Leads me to believe, there was never a plan to have BBBY or Baby as a going concern.</p>\n\n<p>Also they made it clear there were no “qualified” bids for a going concern.  I wonder if “qualified” had certain covenants (NOLs, equity carryover, etc) that the debtors determined wasn’t sufficient.</p>\n\n<p>Also great to see the fake drop.  </p>\n\n<p>Not gonna lie I got nervous when the Judge asked next steps, but K&amp;E had that response ready to go and it sounded like it’s been the plan for awhile.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/14w9qiq/does_the_company_need_to_be_worth_anything/", "time": 1689030925.0, "subreddit": "r/ThePPShow", "title": "Does the company need to be worth anything?", "text": "<!-- SC_OFF --><div class=\"md\"><p>There are several “outside the box” points to consider regarding Teddy and its potential merger with BBBYQ&#39;s Shell. Here&#39;s a breakdown of the key points:</p>\n\n<p>1) Bond Prices: The idea lies in the fact that bond prices haven&#39;t seen the same bounce as stocks since bankruptcy. This could be due to factors such as most bonds being locked up and a lack of liquidity affecting their price and demand.  If someone secretly owns these they don’t care about the prices currently because they know there is a large payout.  Illiquid means they are locked up.  I would expect more volatility if these were being traded.</p>\n\n<p>2) NOLs (Net Operating Losses): If someone acquires the corporate structure of Bbby with a plan to operate the same business, they could take advantage of the NOLs. The updated debt/liability vs. assets will provide a clearer picture of the company&#39;s financial standing. If Teddy is behind the DIP (Debtor-in-Possession) loan, they might be able to obtain the company&#39;s equity at a low cost or potentially a net positive due to NOLs and the sell off of Bed Bath and Beyond.  Teddy could also take some of the remaining leases to get started, but I don’t think they need a lot.  Could they buy 1 for example and continue to sell Bedding, towels and baby gear to get the NOL benefit?  That’s an extreme example but just shows that little of the actual physical assets matter.</p>\n\n<p>3) Relentless Retail Base: Teddy possesses a valuable asset in its loyal retail customer base. If Cohen utilizes the stock for the company, it can gain instant popularity and liquidity. This can lead to the stock trading at high valuations and provide easy access to capital for company development.</p>\n\n<p>Based on these factors, merging with BBBYQ&#39;s Shell could provide Teddy with an equity structure and a ticker symbol, enabling it to tap into BBBYQ&#39;s existing popularity and liquidity. Additionally, it may allow Teddy to take advantage of its NOLs and potentially acquire the company at a low cost, possibly including some desirable leases.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/14t95qr/baby_going_concern_was_for_vendors_sake/", "time": 1688740787.0, "subreddit": "r/ThePPShow", "title": "Baby Going Concern was for Vendors Sake", "text": "<!-- SC_OFF --><div class=\"md\"><p>In chapter 11 BK one of the best outcomes for secured lenders in the form of Vendors is to maintain as a going concern.  This provides them with an opportunity to restructure their debt and continue to do business with you.</p>\n\n<p>When we reserved the list of top 30 Creditors, I believe it was Life Relationship who pointed out that most of them were suppliers or worked with BBBY in some fashion or another.</p>\n\n<p>A going concern was what the Judge wants to see.  He atleast wants to see that Etlin and crew are pushing for it.</p>\n\n<p>In reality it would have been a solid outcome for Shareholders as well for Baby as is to be a going concern.  We learned last night that is off the table.</p>\n\n<p>However, this doesn’t escape the fact that 6th street has stated they will credit bid for “some assets”.</p>\n\n<p>So if they don’t want the IPs then what do they want.  To get scared with the FUD, there’s still a lot at play here.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/14sxs69/late_night_thoughts/", "time": 1688708118.0, "subreddit": "r/ThePPShow", "title": "Late night Thoughts", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/14sxs69/late_night_thoughts/", "time": 1688708118, "subreddit": "r/ThePPShow", "title": "Late night Thoughts", "text": "Seen it posted in some other threads, but it’s apparent that there was no bidder to keep “Baby” running as a going concern…. There was a bidder for the IP, now we wait to see if the theory is right about someone using what’s left asset wise to give birth to Teddy.\n\nIt’s scary that it’s come to this as the final option, but it’s also what everyone has dreamed of (no pun intended).  I’m not going to put odds on it but am just going to wait it out and see what happens.  I have a few thoughts that are keeping me bullish.\n\n1) Teddy’s new trademarks aren’t all for baby projects, in fact most of them have more in relation to Bed Bath which has sold its IP off already.  So if Cohen is starting Teddy, it doesn’t make much sense for him to keep Baby as a going concern.  It makes more sense to sell the names.\n\n2) Dream On Me is a current vendor for Baby.  They are getting the name of Buy Buy Baby to increase their brand awareness, but are not going to compete with a company like Teddy.  Rather they would most likely have a section within Teddy where they sell the quality rebranded Dream On Me Products under the name Buy Buy Baby.  This sets up well to be a subsection within Teddys ecosystem.\n\n3). Related to the point above, dream on me is paying more than half of their revenue for intellectual property.  This really doesn’t make sense, and I can’t see how they can afford it.  Maybe Cohen has backed them to buy the IP and they become the future Baby Registry for Teddy?  Just a thought.  \n\n4).  Bbby has cut down its debt dramatically and still we haven’t seen updated numbers since the leases were auctioned.  If NOLs can be taken advantage of it’s possible the shell BBBYQ could be used almost like a SPAC to get the equity structure, store footprint and existing infrastructure going for Teddy.  Although it would need some work, it’s cheaper than building it all from scratch.\n\n5). To utilize the NOLs the company has to continue operating in a similar fashion.  Someone had a post earlier today about RC Ventures “can’t remember” code being the same as BBBY’s.  Also most of a Teddys trademarks match the existing companies business identically.\n\n6). The last reason is the retail investors he ends up with.  Yea there will be an influx of new investors if this happens.  However he will have a core that had so much trust in him that they held though BK and constant FUD.  What a way to build an investor base. \n\nMany of you don’t want to hear this but I don’t see Overstock and Bed Bath being a major part of this.  They have their nitch, but Overstock has a brand that is unsold retail selling for cheap.  I don’t think Cohen would want Teddy directly involved with that, but I could see some synchronicities in Teddy not holding on to inventory long and having a deal with Bed Bath to Sell it online.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/14qvpjp", "time": 1688517511.0, "subreddit": "r/ThePPShow", "title": "All I needed to see in the FT Article", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/BfNWQOctFwKYpsGaWEKPG9s7YWS6iRamjNqF1FsBdhQ.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.dailydac.com/90-second-lesson-why-would-a-debtor-choose-to-liquidate-under-chapter-11/", "time": 1688338304.0, "subreddit": "r/ThePPShow", "title": "Summing up what’s going on in 90 seconds.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.dailydac.com/wp-content/uploads/2019/11/90-Second-Lesson-Why-Would-a-Debtor-Choose-to-Liquidate-Under-Chapter-11-scaled-e1679967909775.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/14mpvjz/need_to_clear_this_up_going_concern_vs_not/", "time": 1688098153.0, "subreddit": "r/ThePPShow", "title": "Need to clear this up. Going concern vs not.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Listened in on the show and was frustrated with the “going concern” debate.</p>\n\n<p>To state it simply:  the 2 words we want to hear are “Going Concern”. Probably the best two words we can hear in chapter 11 BK.</p>\n\n<p>On the other side: “Not a going concern” is almost the worst thing we can hear someone say.</p>\n\n<p>I hate to tear down the hype on the show, but it is pretty clear if you listened to the court case that Holly Etlin said Bed Bath as is will not be a going concern.  That is not necessarily all bad, but is evident that they can not survive with the current business model and debt.</p>\n\n<p>Now the good news is that they decided to have a “Going Concern” auction for Baby.  To me this is the only option that saves shareholders, and I think it has above a 50% change.</p>\n\n<p>Now all the “Teddy” theories and Bed Bath or Baby not needing their IPs is not completely impossible.  I just don’t see that as the most logical outcome.  I just don’t see the value of the sum of parts being there without their IPs.</p>\n\n<p>I am hoping for Baby to continue as a going concern here and using the “dual path” liquidation of Bed Bath &amp; Beyond to free Baby of debt.  The ultimate sacrifice of a parent for their child.</p>\n\n<p>My theory is we will see this being Icahn through Sixth Street.  We will be carried forward as well so that he can take the NOL benefit.  </p>\n\n<p>Travis was right last night when he Stated Cohen actually never said he wanted it.  I think that Cohen summoned Icahn to take it over and turn it into the brand it can be.</p>\n\n<p>I think Teddy and Cohen come a little later and bring in both a revitalized “Overstock (Bed Bath)” and Self Sustained Baby. </p>\n\n<p>We as shareholders leave bankruptcy in one piece under the BBBY symbol that stands for Buy Buy Baby, and we ignite the squeeze that cracks the basket.</p>\n\n<p>Cohen then breaks the basket with multiple announcements of combining Iconic brands.</p>\n\n<p>The fact that Holly Etlin is hopeful and working for a going concern of Baby is all we should care about at this point.  That was the best thing said in yesterdays hearing.  She’s a badass, and experienced.  She pretty much is telling us Baby can make it on it’s own, now we just need the buyer to step up.</p>\n\n<p>IMO, this is the play.  Sorry if I burst some bubbles, but there is information out there and we need to slow down on the tinfoil.  This is make or break time.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/14ky8aw/bed_bath_beyond_name_to_remain/", "time": 1687922401.0, "subreddit": "r/ThePPShow", "title": "Bed Bath &amp; Beyond name to remain", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not sure the exact wording but it was something such as “We are thrilled that Overstock has agreed to keep the brand name alive”.</p>\n\n<p>There were something like 5 IP assets sold to Overstock.  We haven’t learned exactly what they are.  </p>\n\n<p>How will Bed Bath and Overstock work together?  I’m thinking that Overstock is going to lease the IP rights back to Bed Bath, and potentially form a partnership where unsold bed bath items are provided to Overstock as their “lease” payment for the name.</p>\n\n<p>The debtors seemed the deal they got was exactly what they wanted.  </p>\n\n<p>They are not selling all of their leases.  It’s very possible the company can be a going concern.</p>\n\n<p>Let’s see what happens with Baby now.  I have a feeling they have a plan.  </p>\n\n<p>CNBC or whoever telling us that interest in waning, yet today we found out their are multiple Stalking Horses for Baby under NDA.</p>\n\n<p>I think it’s about to get exciting.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/14i6kkk", "time": 1687648591.0, "subreddit": "r/ThePPShow", "title": "~30 Baby stores and the DFW distribution center added to Phase 1 Lease Auction.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The original docket about the auction had a note that today was the deadline to sell Baby stores as part of Phase 1 leases.</p>\n\n<p>Image 1 in todays docket shows they made the decision to sell them.</p>\n\n<p>Do they know the buyer, and have been given the go ahead that they don’t want these stores?</p>\n\n<p>It’s weird to me we haven’t had any sort of stalking horse for Baby in any way.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/yAcbzGVB52Nst1xqY0JaQyBPA8ZqW6iz7Uvr2mM7qS8.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/ig7ft8ox8n7b1.jpg", "time": 1687472102.0, "subreddit": "r/ThePPShow", "title": "IP Royalties - Overstock/BBBY partnership.", "text": "<!-- SC_OFF --><div class=\"md\"><p>A lot of speculation on the Overstock deal.  Reading the filings it’s evident that it is for IP.  Overstock actually over paid from what BBBY estimated their IP at in their recent 10k.</p>\n\n<p>One thing is weird to me.  Bed Bath has a lot more tangible assets that were not sold in the “Bed Bath” Auction today.  Warehouses, merchandise, logistics.  So the question is when will that be sold?</p>\n\n<p>They have a separate auction for their leases, and then on for Baby assets only.</p>\n\n<p>You can’t tell me nobody bid on the rest of Bed Baths assets.  I believe they actually weren’t for sell.  Things are starting to make sense to me.</p>\n\n<p>Overstock buys the IP, which generally Bed Bath as we know it would need to continue using a lot of their trademarks etc.</p>\n\n<p>However, Bed Bath doesn’t technically need to own their IP… they can license it through Overstock.</p>\n\n<p>This allows a quick upfront cash injection by Overstock, in which Bed Bath pays back over time during the restructuring.  See image above page 49, it talks about valuing the asset as a cash flow as if they were licensing it from another company.  This seems to be fairly common in corporate America.</p>\n\n<p>My gut feeling is we will see Bed Bath continue as a going concern and maybe see some type of partnership with Overstock to get rid of a lot of the “Overstock” assets that Bed Bath has.  A lot of the Tritton brands can be sold through Overstock, and Newell and West Point Brands can begin to sell using a more lean Bed Bath Physical footprint.</p>\n\n<p>We will see what happens to Baby, but I think we will see Sixth Street buy baby for the Debt to Equity that leaked last week.  Cohen Icahn could also own other bonds and we could see Bed Bath come out of Bankruptcy with no debt and a successful spin off of Baby.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ig7ft8ox8n7b1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/owzdcvo0t27b1.jpg", "time": 1687224611.0, "subreddit": "r/ThePPShow", "title": "Holly Etlin is a babe!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just read the highlighted part.  Maybe the reason Buy Buy Baby is being held for last!</p>\n\n<p><a href=\"https://macabacus.com/taxes/attributes#:%7E:text=In%20taxable%20acquisitions%20in%20which,the%20transaction%20and%20are%20lost\">https://macabacus.com/taxes/attributes#:~:text=In%20taxable%20acquisitions%20in%20which,the%20transaction%20and%20are%20lost</a>.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/owzdcvo0t27b1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/mystlvtg0z6b1.jpg", "time": 1687178689.0, "subreddit": "r/ThePPShow", "title": "NOL’s", "text": "<!-- SC_OFF --><div class=\"md\"><p>Seemed like we had 2 accountants on the show last week who didn’t believe this because it’s not on the balance sheet.  I’m not an accountant, but I will give my opinion.</p>\n\n<p>The NOL’s are listed as Not more likely than not.  Meaning BBBY legally stated there is Not more than 50% chance they will be used.  Maybe legalise but they stated in a weird way that also means it’s not less than a 50% either.  Every step in chapter 11 (not allowing 4.5% holders to sell) has led to the idea that this NOL is being held as an asset.  Which would mean Share Holders are safe!</p>\n\n<p>Another note is to David Simpson.  I don’t follow him on Twitter unfortunately but know he was looking at liabilities vs assets.  I believe he was using and NOL number that was about half what the new 10Q showed.</p>\n\n<p>The operation losses in the end seem to be purposely done to take advantage of this credit.</p>\n\n<p>Also, to put the value of the NOL into perspective.  If it was hypothetically distributed to share holders then the SP would be around $1.  This is an incredible asset for a buyer.  </p>\n\n<p>Would be interested on David’s or others stocks.  Seemed like we were already close to being net positive and still waiting for what BABY brings.</p>\n\n<p>I’m feeling optimistic.</p>\n\n<p>Bonus note:  let’s say HBC or an entity is holding 311 non voting shares.  This effectively retains almost 50% of the company.  So if a buyer owns it, then buy acquiring the rest they can pretty easily retain the NOLs.</p>\n\n<p>Also, IMO there’s no way there are more than 120 million shares outstanding in the open market!  Volume is way to low and there’s way too much retail.  My theory is a lot of\nThe 749 million is locked up/ in treasury/ held closely.  These shares also can’t be sold until a restricting plan is released.  If someone is holding these, which to me it looks like, then share holders are part of the plan.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mystlvtg0z6b1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/14c3op4", "time": 1687040792.0, "subreddit": "r/ThePPShow", "title": "Wanted to Jack some Titties on a Saturday", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hope all is well!  The shills, bears, pessimists have been quick to point out that RC Ventures showing up in the Paced document is only due to the ongoing securities Law Suit.</p>\n\n<p>Well apes there are a couple details that proves that’s BS.  See link below for a share point of RC’s motion to dismiss.  I’ve included in the picture the attorneys signatures for RCV and Ryan Cohen…</p>\n\n<p><a href=\"https://www.reddit.com/r/BBBY/comments/11sj4k7/faq_rc_ventures_motion_to_dismiss/\">https://www.reddit.com/r/BBBY/comments/11sj4k7/faq_rc_ventures_motion_to_dismiss/</a></p>\n\n<p>Now this is huge, because when you see RC Ventures show up as a creditor there are the words “Pro Se” (Image 2).  So we know that he wouldn’t be named as a creditor (Some one BBBY owes money) that’s obvious.  And now we can see that he had attorneys in that court case.  There for RC Ventures was not Pro Se.  Below is a quick definition from google.</p>\n\n<p>Pro Se: Refers to persons who present their own cases in court without a lawyer; from the Latin for &quot;on one&#39;s own behalf.&quot; Also referred to as “self-represented litigants.” If you are the person filling out the Civil Case Information Sheet and you do not have a lawyer, check this box.</p>\n\n<p>So there you have it folks!  Have a great Saturday.  I’m as zen as ABC.  About to go get a massive double meat chipotle burrito and watch some baseball.</p>\n\n<p>I added one more picture.  If anyone was to be shown as a “creditor” wouldn’t it be Mark Tritton?  He has not been listed much in the documents and has never shown as an Interested Party like Ryan Cohen has.</p>\n\n<p>I dont have pacer access, but would be curious to see if he was listed as a Creditor in there?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/u3soOgvyT13GrVVSUeSI5xYVvCDjtCBvMOebCAotrJQ.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/1496awz", "time": 1686744755.0, "subreddit": "r/ThePPShow", "title": "3.5 Billion NOL’s.", "text": "<!-- SC_OFF --><div class=\"md\"><p>People who are complaining or scared by this number have no clue.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/xPzJ8JDYwA7Rmzykoejsg4OsPfRYL7RRZYbvJR694R4.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/148pvjx/baby_sale_confidential/", "time": 1686691026.0, "subreddit": "r/ThePPShow", "title": "Baby sale confidential?", "text": "<!-- SC_OFF --><div class=\"md\"><p>After the dockets Friday and only Bed Bath IP showing up from the Stalking Horse Deadline, I’m deducting that the spin off of Baby is confidential for some reason.</p>\n\n<p>Let’s see what happens, but I’m getting a good feeling about it.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/1cugms884s5b1.jpg", "time": 1686659360.0, "subreddit": "r/ThePPShow", "title": "Take a deep breath. Overstock bid more than BBBYs valuation", "text": "<!-- SC_OFF --><div class=\"md\"><p>Clearly this is just the stalking horse bid for BBBY’s intellectual property.</p>\n\n<p>Baby assets are most likely under NDA.</p>\n\n<p>The 21.5 million bid greatly exceeds what Bed Bath valued their Ip at per the cnbc article a few weeks ago.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/1cugms884s5b1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/r7ew1p2uep5b1.jpg", "time": 1686626603.0, "subreddit": "r/ThePPShow", "title": "Doesn’t add up", "text": "<!-- SC_OFF --><div class=\"md\"><p>Nothing in this play ever adds up.  This docket is very suspicious as well.  Why hasn’t BBBY been sharing information with this group of bondholders.</p>\n\n<p>Why isn’t Mellon in this group of bondholders.</p>\n\n<p>Idk, kinda makes my mind wander.  If this was a normal bankruptcy what would the debtors have to gain?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/r7ew1p2uep5b1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/147mwkm/lets_say_one_of_the_leaked_bids_was_the_stalking/", "time": 1686572906.0, "subreddit": "r/ThePPShow", "title": "Let’s say one of the leaked bids was the stalking horse.", "text": "<!-- SC_OFF --><div class=\"md\"><p>With multiple delays it leads me to be fairly confident the bidders that leaked their intentions will not be the winner.</p>\n\n<p>Late Friday something went down, the team is dotting I’s and crossing T’s.  My suspicion is the confidentiality aspect of it added complexity to the paper work and they wanted to make absolutely sure they were clear before releasing it.</p>\n\n<p>Idk if delays are bullish or bearish.  However in a desperation scenario where creditors are all over them to get some money they wouldn’t be so lenient.  The fact that so many big restricting name are involved in this makes me think something complex is in the works.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/14662qc", "time": 1686418367.0, "subreddit": "r/ThePPShow", "title": "Lazard Fee Estimation and dates of engagement", "text": "<!-- SC_OFF --><div class=\"md\"><p>Excited about the dockets last night.  Some items I found interesting.</p>\n\n<p>Photo 1: Lazard makes the full 15 million with a sell of most of the companies assets.  It then refers to Schedule 1 (photo 2) fees associated with an Other Sale Transaction Fee.</p>\n\n<p>Photo 2:  Gives us a general idea on the 15 million number and how that fee came to be.</p>\n\n<p>If we look at the 1 billion dollar line the fee would be 1.30%. If they were to sell only Buy Buy Baby for 1 billion, Lazards fee would be 13 million.</p>\n\n<p>*note that I think this is a standard fee structure from Lazard.  Technically if Buy Buy Baby sold for more than 2 billion, the company’s fee would then be north of 23 million.</p>\n\n<p>It would be in Lazards best interest to sell Buy Buy Baby for more than about $1.5 billion if they sell it as it’s own asset.</p>\n\n<p>Photo 3/4: this is nothing new.  The dates are highly specific and relate to some dates involving Cohen and Icahn.</p>\n\n<p>8/10/22 Original Engagement Letter</p>\n\n<p>Photo 5: Cohen sold shares within a week of engagement letter.</p>\n\n<p>Not pictured:  Cohen tweeted a Purple Heart 💜 on 8/10.  A Purple Heart is awarded to people who are injured and/or die in the line of duty.  I have my Grandfathers Purple Heart from losing his leg.  Was Cohen separated from his shares for the greater good?</p>\n\n<p>10/18/22 Dealer Manager Agreement</p>\n\n<p>Phot 6: Cohen and Icahn picture the night before Dealer Manager Agreement was made .</p>\n\n<p>1/15/23 Prior Engagement Agreement</p>\n\n<p>I don’t have a good picture.  However there was a snip of pitch book around this time that a LBO happened.  Also (photo 7) along with Holly Etlins letter shows that they were trying to sell the company around that time. </p>\n\n<p>Photo 8: Cohen tweeted he buys all stocks on 1/18.</p>\n\n<p>Few weeks later government shot down his balloon.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/uqAy9LUIBpmr5z11hgGpfqVtUnVpEMctWy_s0on5hhQ.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/142fgn2/sp_minimum/", "time": 1686056679.0, "subreddit": "r/ThePPShow", "title": "SP minimum", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is not in anyway meant to be bearish and is per speculation.  We are getting close and we are starting to see all the shills telling us the stock is going to be wiped.  I remain confident that it won’t, but I own a considerable amount and it does tend to penetrate my thoughts from time to time.</p>\n\n<p>I think the PP show is great because it keeps people from getting in their own heads.</p>\n\n<p>So this week we see a lot of Twitter bears showing up, we have the Meme King documentary tonight, and we will have plenty of media coverage of the stalking horse.</p>\n\n<p>In an effort to ease some minds and allow people to disassociate with the current stock price I had some thoughts at how shareholders could receive something regardless of the restricting.  Again all these are speculative but just some different avenues.  To me these would be worst case, I definitely don’t think they are more probably than us squeezing the shit out of shorts and going on Tour with Pulte and T Swift next summer.</p>\n\n<p>1).  Take a look at sears as an example.  It’s been a long drawn out bankruptcy in which the restricting plan was f’d up by lawyers.  Several years and law suits later there is a chance share holders will get a pay out.</p>\n\n<p>IMO if Gove and company truly ran us into the ground while diluting massively then there will be a lot of pissed share holders and lawyers looking to make a buck.  I keep going back to the EToro interview and the evidence in the filings that bankruptcy papers were being worked on in Dec-Feb.  I also look at how big of a lie we were told that we’d go bankrupt if we couldn’t do the R/S vote and then not even holding the vote.</p>\n\n<p>There is clearly some fuckery if this company just falls apart and liquidates.  It wouldn’t be sexy but I think share holders would get atleast $50 million from potential lawsuits.  </p>\n\n<p>So based on 739 million that could be .15 cents a share.  Could obviously be a huge range based on what’s uncovered but I don’t thing $50 is a stretch.</p>\n\n<p>2) The cohen class action.  We will see what happens there, I believe it’s on hold during bankruptcy.  However if cohen is not involved anymore, there could be some leniency from a judge to help out share holders who got screwed.  I think that was in the 60 million range that Cohen would potentially pay back to share holders for the pump and dump.</p>\n\n<p>So really what I’m trying to say is current SP could be a low as far as how share holders will make out. </p>\n\n<p>I hope none of this happens, but hope it eases some of you that there are options to recover some money if they end up wiping out Share Holders.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/mbxjdjn4144b1.jpg", "time": 1685931901.0, "subreddit": "r/ThePPShow", "title": "BABY valuation not included in CNBC Assets vs Debts", "text": "<!-- SC_OFF --><div class=\"md\"><p>Haven’t seen a whole lot of discussion on the actual balance sheet for Bed Bath and Beyond.</p>\n\n<p>I’m not an accountant or in finance.  So I’m trying to better understand and would appreciate to get a discussion going.</p>\n\n<p>What’s pretty clear to me is most of the assets are made up of Merchandise, Cash, Leases etc.  Those alone made up the $4 billion number.</p>\n\n<p>There is one line item called other assets representing about $129 million.</p>\n\n<p>With Ryan Cohen valuation of Buy Buy Baby as an asset as well as our knowledge of what it’s potential is.  I see Baby similar to the used cars that Hertz had.  We need a bidding war to drive the price up, or we need our white nights to buy it.</p>\n\n<p>Questions from the balance sheet:</p>\n\n<p>1) Do the lease assets and liabilities pretty much cancel out?</p>\n\n<p>2)If the company is a going concern are we worried about long term debt?  Can’t that just be restructured with a plan that creditors would agree to?</p>\n\n<p>3) where can the tax incentives that have been talked about be found.  I’ve heard talk of over a billion in tax write-offs.</p>\n\n<p>Regardless depending on what Baby brings, it is pretty up in the air on how the debt/liabilities will look.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mbxjdjn4144b1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/140oif2/baby_and_bed_bath_both_a_going_concern_i_think_i/", "time": 1685908935.0, "subreddit": "r/ThePPShow", "title": "Baby and Bed Bath both a going concern? I think I see a way.", "text": "<!-- SC_OFF --><div class=\"md\"><p>There’s been several great posts and theory’s about who owns the bonds, and where the shares from HBC sit.</p>\n\n<p>Well based on the daily volume of trades, it appears that’s very small amount of the float is liquid.  </p>\n\n<p>Maybe Icahn does have ownership of BBBY already and nobody knows.</p>\n\n<p>We know that Etlin has said that they are looking to sell off parts of company.  Then end goal would be to keep both as a going concern in some capacity.</p>\n\n<p>I’m going to take a guess that the sell of Baby to whoever is going to align with Icahns ownership of Bed Bath debt.  The sell of baby then clears the rest of the secured creditors.  Icahn then reorganizes Bed Bath to be profitable with synergies from his other brands.</p>\n\n<p>Explains the IEP attack.</p>\n\n<p>Some added tinfoil:  I posted a little more detail on this in the Cohen Lyric thread a few below.</p>\n\n<p>Cohen eats a lot of fruit (fiber) that makes him poop (he likes to work on a toilet) and he ate so much fruit that he needs to see his gastro for advice (Icahn)</p>\n\n<p>BCG/shorts are the💩.  Cohen is simply clearing the system.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/13znyqu/bbby_doesnt_need_to_be_sold/", "time": 1685822988.0, "subreddit": "r/ThePPShow", "title": "BBBY doesn’t need to be sold.", "text": "<!-- SC_OFF --><div class=\"md\"><p>A lot of FUD in the CNBC articles about no interest in the Bed Bath and Beyond part.</p>\n\n<p>What is going on right now is Chapter 11 restructuring.  We are not in a liquidation yet.  Lawyers are working around the clock to figure out a way to make as much of the company a “going concern”.</p>\n\n<p>Now the bears will take a look at the assets vs debts and since assets are less immediately say Shareholders are wiped out.  However that is far from true.</p>\n\n<p>The Stalking Horse bidders being reported only seem to want Buy Buy Baby.  It is bullish that someone has said they would potentially do an equity deal to keep it a going concern at 75%.  This would be a great outcome for Baby, and would them allow them to focus on growing.  This fits into what Cohen proposed in his letter (Reread his letter and he doesn’t say he wants direct ownership). He may have someone else buy it and then partner with Teddy.</p>\n\n<p>It’s apparent that Buy Buy Baby is a beast.  CNBC reports that Babylist registries increased by 200k since Bed Bath filed.  Holy shit.  200k x 12 months is 2.4m registries a year.  Let’s put about $5000 per registry on average.  (Probably more because Babylist is a boutique online shop planning a physical showroom in Beverly Hills)</p>\n\n<p>Thats over a billion in only baby registries!</p>\n\n<p>For Babylist their company is based on registries.  Buy Buy Baby has several other avenues for income by being a brick and mortar retail.  This 1) allows new parents to shop and understand the quality.  2) Allows new parents to go into a nearby store and use a scanner to create their registry. Beats doing it online or flying to California to do it.</p>\n\n<p>Ok now on to my main point of this thread.  Bed Bath and Beyond.</p>\n\n<p>Well it’s not fully liquidating yet.  From the outside looking in it appears that a full wind down is happening.  If you look harder though a lot of bad locations and leases are being shredded.  In addition everyone in there mom loves a going out of business sell.  BBBY is clearing old inventory and right sizing their physical footprint.</p>\n\n<p>They have many types of debt.  When people see 5 billion in debt they make the assumption that it needs to be paid back immediately.  However it doesn’t.  The sell of Baby should allow for a restructuring of Bed Bath and Beyond to take place.  The two may then have separate owners but could still fall under a future Teddy umbrella.  Bed Bath can start filling their store with Newell goods as they restructure and get back to the brand everyone loves.</p>\n\n<p>So I don’t think BBBY is just going to disappear like MSM wants you to think.  There is too much name value here.  </p>\n\n<p>IMO the shareholders have a good chance to make it through alive.   Hopefully we receive some equity in Baby as well as get some sort of direct investment in BBBY as is.  There are many different scenarios that can play out.</p>\n\n<p>Gove was talking about 2030 and having females in power positions.  I don’t think her interview was a straight lie.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/13zgrfy/shoutout_to_porsche_on_twitter_for_finding_this/", "time": 1685807297.0, "subreddit": "r/ThePPShow", "title": "Shoutout to Porsche on Twitter for finding this. (Listen closely)", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://twitter.com/porscheonly1/status/1664989821964525568?s=46&amp;t=q5BQeN59JqWpAJg801L4oQ\">https://twitter.com/porscheonly1/status/1664989821964525568?s=46&amp;t=q5BQeN59JqWpAJg801L4oQ</a></p>\n\n<p>She has a Freudian slip of “he” which she quickly changes to they.  He sounds like Icahn or Cohen so they don’t want to share that narrative.</p>\n\n<p>Also when they talk about Babylist you hear the anchor say “I think I used them.”  Very positive talk about babylist.</p>\n\n<p>CNBC knows more about the first bidder and doesn’t want the news to break.</p>\n\n<p>If someone wants to keep stores open the court isn’t going to let Babylist just buy the domain.  People jobs are at stake.  </p>\n\n<p>They also say there could be more than 2 bidders.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/13yyxs7", "time": 1685761998.0, "subreddit": "r/ThePPShow", "title": "Buy Buy Baby Vs Babylist", "text": "<!-- SC_OFF --><div class=\"md\"><p>Reading the updated CNBC article that says Babylist wants BABY online name and domain.</p>\n\n<p>Honestly that made me laugh.  Who is running that company and do they have any understanding on how Registries work?</p>\n\n<p>For example:  Whether you are getting married or having a kid.  As a young couple it’s a lot of fun to go into a physical baby store and scan the items for your baby.</p>\n\n<p>Young couples don’t want to do this online and can’t afford to fly to a flagship store front in Beverly Hills, California.  </p>\n\n<p>The fact that Babylist added 200k registries in a month is fascinating since BBBY went out of business.  It shows the need for retailers in the baby registry space.</p>\n\n<p>In addition a local baby store where you can get something quickly is a benefit of the store fronts.</p>\n\n<p>Babylist looks like a flawed business plan, and could have an oppurtunity if they kept the Baby model as it’s lower cost local option.</p>\n\n<p>This also shows that Baby has significant value.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/32q_nLjyxyKuyFbVi_jEiwFxQS0zVxxU6Krm0HIgBFw.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/13yfkkd", "time": 1685719119.0, "subreddit": "r/ThePPShow", "title": "Going Concern", "text": "<!-- SC_OFF --><div class=\"md\"><p>Having been through a bankrupt stock play (Luckin Coffee)</p>\n\n<p>What you want to hear is the words “Going Concern”</p>\n\n<p>Huge news in that CNBC article that multiple parties are fighting to keep Baby operable.</p>\n\n<p>I’ll go out on a limb here and say that the secret bidder is Cohen.</p>\n\n<p>Maybe he has come in at the last second.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/U-BNSjEKIYCw7MCZjHxSZH3OIKjeX6-L37WU_GyYgdg.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/13vcebp", "time": 1685409507.0, "subreddit": "r/ThePPShow", "title": "S-1 shares outstanding.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Image 1:\nFrom S-1 filing explains S-3 ATM.  ~100 million shares sold for about 48.5 </p>\n\n<p>Image 2:\nFrom doc 25 on petition date.  S-1 was capped at nearly 50 million shares sold.</p>\n\n<p>Therefore the S-1 filing gives us an accurate understanding of TSO.  Float could be completely different.</p>\n\n<p>Image 3:\n558,735,983 - April 10</p>\n\n<p>Image 4:\n558 million not including 145 million ( see image)</p>\n\n<p>558 + 145 million = 703 million.</p>\n\n<p>BBBY stated 739 million on petition date.</p>\n\n<p>Image 5-7 talks more about the warrants.</p>\n\n<p>I believe the stock price dropped from April 10 until the petition date that required BBBY to issue more shares to fulfil the 200% on hand.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/psOjCPnRHn34k4XStj6mXSHrvsJbeq9G70-mphMt8hM.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/13uy5md", "time": 1685374504.0, "subreddit": "r/ThePPShow", "title": "Examples of Icahn as Dip provider and as stalking horse", "text": "<!-- SC_OFF --><div class=\"md\"><p>There was a post awhile back that Icahn might be the DIP loan provider through six street.  I did a quick google search to see if he has in fact done this before.  He actually did it for Blockbuster.  However it says block buster did not meet deadlines for providing details on its reorganization plan.</p>\n\n<p>Icahn also owned a lot of secured senior bonds.  <a href=\"https://www.reuters.com/article/us-blockbuster/blockbuster-gets-290-million-stalking-horse-bid-idUSTRE71K5SO20110221\">https://www.reuters.com/article/us-blockbuster/blockbuster-gets-290-million-stalking-horse-bid-idUSTRE71K5SO20110221</a></p>\n\n<p>Tiger Capital in my second image seemed familiar.  <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5Njc1Nw==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5Njc1Nw==&amp;id2=-1</a></p>\n\n<p>Small tidbits as we all patiently wait on some news about who wants to acquire us and if next years Memorial Day Weekend will be spent working a holiday shift at Burger King or spending time on our new boats at our lake houses!</p>\n\n<p>Interesting this article came out last week.  Especially since there has been nothing in the dockets or public about Icahn</p>\n\n<p><a href=\"https://investorplace.com/2023/05/will-carl-icahn-step-in-to-save-bed-bath-beyond-bbbyq-stock/\">https://investorplace.com/2023/05/will-carl-icahn-step-in-to-save-bed-bath-beyond-bbbyq-stock/</a></p>\n\n<p>At this point speculation has a few can’t miss items.</p>\n\n<p>1) icahns IEP is being brutally attacked. Maybe a form of backlash from MM’s who are pissed he is about to screw them on BBBY.</p>\n\n<p>2) bonds being bought for cheap as discovered by Kevin Malone on Twitter.</p>\n\n<p>3) the Icahns exiting Newell months ago.  Maybe a conflict of interest.  Newell had also mentioned BBBY and future plans with them during their annual report.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/-niQ3WIz9s2xgbUt6yrVIsO31NNWtdn9g3dSlkGNJB4.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/5pz81zrv77wa1.jpg", "time": 1682483709, "subreddit": "r/ThePPShow", "title": "RadioShack delisted and traded up.", "text": "https://moneymorning.com/2015/05/13/whos-still-trading-radioshack-stock/", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/5pz81zrv77wa1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/5pz81zrv77wa1.jpg", "time": 1682483709.0, "subreddit": "r/ThePPShow", "title": "RadioShack delisted and traded up.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/5pz81zrv77wa1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/12yx1om/dont_understand_the_gloom/", "time": 1682458886.0, "subreddit": "r/ThePPShow", "title": "Don’t understand the gloom", "text": "<!-- SC_OFF --><div class=\"md\"><p>The blow to us was Bankruptcy.  We were eventually going to trade OTC regardless, todays news is a nothing burger.</p>\n\n<p>I traded Luckin coffee during Chapter 15 on OTC and did very well.  It went from $1.86 to $30.</p>\n\n<p>I do like how they provided a date so maybe there is a short squeeze left after all.  If not OTC is not the end of the world, your shares aren’t cancelled.  The Bankruptcy in general is the concerning part.  Hoping someone swoops in to buy us.</p>\n\n<p>In addition who sells stuff AH?  Someone who’s trying to cause panic, or manipulate the price action.</p>\n\n<p>Very little selling could have caused this price action.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/12whfq8/value_of_the_retail_investor/", "time": 1682267910.0, "subreddit": "r/ThePPShow", "title": "Value of the retail investor", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ok, still trying to digest the filing this morning.  Overall, I’m not too happy but I have been through this before and wasn’t wiped out.  </p>\n\n<p>I kinda figured this play may get uglier before something good happens.  Well it just got ugly.</p>\n\n<p>I’m confused about the wording in Sue’s PR and the wind down on the website.  To me it sounds like they are getting wound down, but could stop if the company or some of its assets are sold.</p>\n\n<p>Chapter 15 is restructuring, and if they get someone to come in and buy the company may remain ongoing.  If you can make it out of Bankruptcy as a going concern it’s usually good for shareholders.</p>\n\n<p>The worst case scenario is the assets are picked apart and there is nothing left for shareholder.</p>\n\n<p>This is an odd play and I have been pretty confident that retail owns a large percentage of the float.  We have almost 800 O/S now and we’ll see how our market cap reacts to this news tomorrow.  </p>\n\n<p>If someone is trying to buy “assets” of BBBY, I’d have to say what ever their future plans are we could be included as an asset.</p>\n\n<p>Just saying if someone wants to do something with Baby or BBBY and take over ownership what is an extra 150 million to buy some loyal apes?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/12u0aq6/not_a_lawyer/", "time": 1682080457.0, "subreddit": "r/ThePPShow", "title": "Not a lawyer", "text": "<!-- SC_OFF --><div class=\"md\"><p>Would be interested if there are any lawyers or someone in tune with the legal ramifications of a bankruptcy.</p>\n\n<p>This is my second Bankruptcy play and am made a lot of money holding Luckin Coffee through Chapter 15.</p>\n\n<p>I assume BBBY would be a more aggressive version of bankruptcy and would open the exec board to a ton of scrutiny and digging.</p>\n\n<p>Fortunately from Lawyers we’ve had over 60,000 retail holders trying to connect every possible dot and reading every line of every filing.</p>\n\n<p>At this point I find it hard they can get away with a bankruptcy having listed in a legal document that they need the R/S split to avoid it.  It would be on them if the media was true and they failed to get the vote in time.  Some companies can knock this out in a week, what is taking BBBY so long.</p>\n\n<p>In my opinion, whether you like Gove or not there is no way she wants to put her self through this.</p>\n\n<p>Maybe a less recognized company where it doesn’t make a headline.  We’ve already made 10s of headlines and haven’t even announced.</p>\n\n<p>In addition you have the Tritton law suit, which is going to lead to a deep look into the company and Goves input if it goes down.</p>\n\n<p>IMO I trust that Sue is doing everything she can to keep the company alive.  The question is, is she up to the job.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://i.redd.it/7evud1nxv2va1.jpg", "time": 1681995416.0, "subreddit": "r/ThePPShow", "title": "Sue Gove’s Face", "text": "<!-- SC_OFF --><div class=\"md\"><p>Some want to act like this is nothing or just a PR stunt.</p>\n\n<p>However Sue Gove is seemingly invisible for most of her career and then Shows her face in an interview a week before “filing for bankruptcy”.</p>\n\n<p>Not only that but she is asked about the bankruptcy in the interview and acts like everything is going well.</p>\n\n<p>The FUD yesterday stinks!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/7evud1nxv2va1.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/12scsf0", "time": 1681943662.0, "subreddit": "r/ThePPShow", "title": "Calm down, MSM finally just read our R/S Prospectus. This news is confirmed by the company, yet doesn’t mean squat", "text": "<!-- SC_OFF --><div class=\"md\"><p>14A gives them the source for the news today.  It does not confirm anything and really says they need the vote to be for.  However they have advisors looking at bankruptcy options already.  </p>\n\n<p>Literally in an interview and filed in an 8-k as additional information for our R/S prospectus.</p>\n\n<p>Legally I don’t think they can or want to file before the vote is even finalized.</p>\n\n<p>In addition they’ve had a month, so if they desperately needed the R/s they could have expedited it.</p>\n\n<p>Lying in an 8-k the week before would be idiotic.  In past 8-is they have also mentioned they were doing the R/S for that purpose</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/2odyvIejFiAT6LqC0eQSv0iFDHg2slh_FBH3jzMXH8I.jpg\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/12pv6p8/retail/", "time": 1681762583.0, "subreddit": "r/ThePPShow", "title": "Retail", "text": "<!-- SC_OFF --><div class=\"md\"><p>Throughout today there has been 5,000+ consistently on <a href=\"/r/bbby\">r/bbby</a>.</p>\n\n<p>There have been over 100 on this sub.</p>\n\n<p>The show tonight will bring in 500+ viewers for a full 3 hours.</p>\n\n<p>Reddit has tweets by the second about BBBY.</p>\n\n<p>Tell me we don’t own the float.  Not sure what shares are being traded but at some point the game will be stopped.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/12pjwce/nobody_knows_the_tradeable_float/", "time": 1681743448.0, "subreddit": "r/ThePPShow", "title": "Nobody knows the tradeable float.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have what was once a significant holding and amounts to a decent amount of shares.  This is in the 6 figures.</p>\n\n<p>I know many other traders are holding as well.  I have learned to disassociate the fundamentals with this trade as I don’t think they matter.  Plenty of people like me are holding a majority of the tradeable float.</p>\n\n<p>I for one have a target price in mind.  Others do as well, I’m not here to provide MMS those targets.  I am here to warn them that what ever they think the actual float is, is dead wrong.  </p>\n\n<p>My shares aren’t for sale at these levels.  If you want to short them nakedly go ahead.  I’m going to wait until we get a buy out, or until BBBY begins their turnaround.</p>\n\n<p>Not even hedgies understand how trapped they are.  The additional new shares O/S, even if they are hitting the market isn’t close to enough for them to escape.</p>\n\n<p>Fully convinced the squeeze is coming!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/12ovjzm/the_price_is_fake/", "time": 1681692443.0, "subreddit": "r/ThePPShow", "title": "The Price is Fake!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Another reason why it’s not typical.  Let’s look at two possibilities of the dilution.</p>\n\n<p>Over the last couple months ~400,000,000 shares have been added to the O/S.  We are now at 558,735,983 per the S-1.  This is as of April 10th when the stock price was .30 cents.  It has now dropped to .238 cents.  It’s likely more shares have been added since April 10th so I’m going to calculate MC based on the .30 cent number puts us at at MC of $167,000,000.</p>\n\n<p>So bears have been crying dilution and bulls have been thinking maybe these shares are being held by someone somewhere and not necessarily hitting the market.</p>\n\n<p>Option A:  shares have been hitting the market and it’s pure dilution.  Price reflects this as we have gone down consistently for about 2 months.  BBBY is getting barely anything for equity and absolutely screwing current shareholders.  Because of the negligence they need a R/S because they are out of authorized shares.  (Honestly if this is happening I see law suits in Sue’future).  Negligence, but who knows wall street will cover it up.</p>\n\n<p>Anyway based on Option A shares are flooding the market to the tune of 5x in 2 months.  To sell ATM somebody is buying them.  Is it MM’s?  Is it shorts trying to get out of positions (No, SI has stayed within a million this entire time).  It’s not insane to think retail is buying these shares in this scenario… </p>\n\n<p>60k followers on this Reddit.  Meaning it would take each member an average of a $2800 investment.  Now there are a lot of bots in that number, but there are also a lot of people with much higher investments.  I know people putting in their bi weekly paychecks.  I know others with $100,000+ and ABC had mentioned he knows of people with 7 figure positions.</p>\n\n<p>In that scenario it is very possible that Retail owns the entire market cap of the company.  I would find it hard to believe they don’t own atleast half the market cap.</p>\n\n<p>Option B). Is interesting and could mean the available float is much less than the O/S.  Now it’s impossible to say that some of the shares have been hitting the market.  The last known tradeable float we know of is 114 million on Yahoo.  This number Varys, but let’s say it’s 200 million ( they’ve diluted some to the market, and have a few holders holding the rest)</p>\n\n<p>Ok in this scenario the MC of shares available to purchase is much less.  Assuming the 60k holders it would take each owning $1000 of BBBY stock!</p>\n\n<p>The fact that our MC is so low is amazing.  Retail should have the ability to move this.  However we are seeing volumes of over 70% daily traded in dark pool.  We have also seen fidelity data of 90% buys on the lit market.</p>\n\n<p>We have no idea how many shorts / naked shorts there are.</p>\n\n<p>What we do know is something is F’d up here.  It doesn’t add up.  The only thing that makes sense is that there is illegal naked shorting going on in order to drive this to bankruptcy.  Say what you want about the companies fundamentals, it doesn’t matter.  If Retail wanted BBBY to be $1 billion dollars they could easily do it with the 60k Reddit users putting in less than an average of $10,000.  </p>\n\n<p>We are in a situation where the value of the retail investor is getting swallowed by illegal Mm manipulation.  So I do think there is someone who got themselves in trouble here.  They didn’t know the power of retail.  Let’s see how it plays out..</p>\n\n<p>THE STOCK PRICE IS FAKE!!!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/r/ThePPShow/comments/12onhg5/kais_and_roach_compromised_if_so_by_who/", "time": 1681676350.0, "subreddit": "r/ThePPShow", "title": "Kais and Roach compromised? If so by who?", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is complete speculation but after a seemingly vanilla interview by Sue Gove the 👑 has apparently started a campaign against her.  Then this morning we see Roach lost trust in the board after the interview.</p>\n\n<p>Now Kais is kinda just there, and it’s funny to hear the dots he often try’s to connect.  However his stance has changed dramatically and he is almost sounding like he’s reading a script.  <a href=\"https://twitter.com/kaismaalej/status/1647671680058249218?s=46&amp;t=q5BQeN59JqWpAJg801L4oQ\">https://twitter.com/kaismaalej/status/1647671680058249218?s=46&amp;t=q5BQeN59JqWpAJg801L4oQ</a></p>\n\n<p>Roach on the other hand is one of my favorite guests on the show.  If it weren’t for Kais new agenda matching Roaches then I would think it’s real.  However I see them as opposites and somehow now their opinions have merged.</p>\n\n<p>Both bringing up the EToro CEO connection.  Both bringing up the poison pill scenario.</p>\n\n<p>Personally I saw nothing in the video yesterday that concerned me.</p>\n\n<p>I wasn’t involved in GME bud did Wall Street ever get desperate to start messing with retail?  We’ve seen Kais in the WSJ this week and had Motley Fool Tony Dong investigating the show.</p>\n\n<p>Who knows Roach may be right, I’m not trying to judge.  Just find it odd that Kais new theory is lining up exactly with his.</p>\n\n<p>*bonus:  I’m 100% confident Kais did not take the video in the office.  If you look closely it is pitch black.  A corporate office would have security and or be locked.  Also it appeared to be trespassing so him posting that on Twitter could be grounds to press charges.</p>\n\n<p>Things are getting weird.  Someone doesn’t want the vote to go yes.</p>\n\n<p>1). It’s our activist investor and the poison will is accurate.</p>\n\n<p>2). Naked shorts will get crunched during the R/S.  Similar to the risk of short squeeze statement by the company.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Itchy_Principle6434", "url": "https://www.reddit.com/gallery/12mnaq0", "time": 1681526904.0, "subreddit": "r/ThePPShow", "title": "Is BBBY coming soon to the Teddy shelf?!", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I remember seeing the GameStop building on the shelf on the teddy.com website a while back.  I thought it was interesting.</p>\n\n<p>Thanks to Kai’s I noticed Sue added some flair of her own to her shelf for her interview.  The picture is a little blurry, but what CEO puts a mini store front on their shelf!</p>\n\n<p>I’m assuming that’s a little Bed Bath and Beyond.. I couldn’t find it online anywhere but the logo matches.</p>\n\n<p>It’s also interesting that it’s in the bottom right as the GameStop store front on the front page of the Teddy website.</p>\n\n<p>Is the BBBY next to join the Teddy Shelf?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ridZkcyYVoU9a5YP1lX7d8B29lMB340SzHNlbz6FAEM.jpg\"/></div>"}]