[{"username": "jadlesss", "url": "https://www.youtube.com/watch?v=4WUGhteNlzM", "time": 1697116859.0, "subreddit": "r/ThePPShow", "title": "Let Them Bleed", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m having a moment right now. I just watched Dumb Money and it stoked a rage that I have almost forgotten through all of details of following this Chapter 11 case that I had after we were fucked over through PCO on Gamestop in Jan ‘21. As an OG Superstonker, my rage continued to develop as I learned more the mechanics of wall street’s corruption, and how they have rigged the entire market, economy, politics, and society in their favor without ever adding anything of value to it. All they do it’s take, steal, kill, and destroy. The have ruined the lives of multitudes without retribution.</p>\n\n<p>So I say let them bleed. Be “greedy.” Not just for yourself, but to wipe their “businesses” off the face of the planet. After all, now we set the price. My price is FUCK YOU. What they’ve done has a COST.</p>\n\n<p>This is not financial advice, and I encourage you to think about this more than just your own individual lives and to focus on the broader impact this play can have.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/4WUGhteNlzM/hqdefault.jpg\"/></div>"},
{"username": "jadlesss", "url": "https://youtu.be/y8kEiL81_R4?si=msXTwrQQFKZGFMVx", "time": 1697062377.0, "subreddit": "r/ThePPShow", "title": "To Pimp A Butterfly", "text": "<!-- SC_OFF --><div class=\"md\"><p>We are completing the metamorphosis of society. Who else want to fund a music festival in front of the US Capitol featuring modern protest music like Rage Against the Machine, Kendrick Lamar, punk acts, etc. I’d love to make those old farts poop themselves.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/y8kEiL81_R4/maxresdefault.jpg\"/></div>"},
{"username": "jadlesss", "url": "/r/Superstonk/comments/148iohb/ceo_of_lazard_unknown_affiliates_representatives/", "time": 1686681855, "subreddit": "r/ThePPShow", "title": "CEO of Lazard (unknown affiliates representatives for bd bth bynd ch. 11 case) is showing as CEO of GameStop on Robinghood", "text": "", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": ""}]