[{"username": "jake2b", "url": "https://www.reddit.com/gallery/17zppw0", "time": 1700490454.0, "subreddit": "r/ThePPShow", "title": "We found you, Ryan Cohen.", "text": null, "flair": {"text": "✒ Master Debater ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/XKlr7q_akh0us8UScDgFHB21tNFKDDlKXIZ1mCovuB8.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/17xjf63/correcting_the_titanic_the_chronology_of_bbby_as/", "time": 1700239982.0, "subreddit": "r/ThePPShow", "title": "CORRECTING THE TITANIC: The Chronology of BBBY as a Company from March 2002 to April 2023, Part 1:", "text": "<!-- SC_OFF --><div class=\"md\"><p>PREFACE</p>\n\n<p><em>hello.</em></p>\n\n<p>I am returning to the PP sub to write and submit my largest DD. I have not been as involved on the platform where we all started. It is only fair to give a hat-tip to where we came from, to prepare ourselves for where we are going.</p>\n\n<p>This is not financial advice and you would have to be crazy to interpret it as such. Have you met me? I don&#39;t even sit on my own couch. </p>\n\n<p>TLDR</p>\n\n<p>This will be difficult because the aim of the post is to challenge everyone&#39;s individual thinking and then to receive feedback of those thoughts. Giving a TLDR would ruin this as it would introduce bias. </p>\n\n<p>The best I can do is, what if how we believed this has played out was not the entire story, or just incorrect?</p>\n\n<p>INTRODUCTION</p>\n\n<p>I want us to revisit the timeline and relationships that occurred from March 2022 to April 2023. I believe that there could be clues that have not been found within the information from the SEC filings. I say that because prior to Chapter 11, that was the main/only source of information. Later, we will revisit this period in time through the declarations of various professionals involved in the Company&#39;s Chapter 11, when they had given their declarations to the Judge for why they should be allowed to represent and continue to work with the Debtors thereafter. This will be a multi-part post series.</p>\n\n<p><strong>Part 1:</strong> We are here. We will focus on the chronology of events and the goal is to refresh everyone on the important occurrences and participants. Equally, I will be discussing <em>who</em> entered the scene and <strong>when,</strong> as I believe and will attempt to substantiate my thinking that these were intentional actions by the parties involved.</p>\n\n<p>Part 2: we will explore the potential relationships and inter-connectedness of these participants, with information and evidence to substantiate my thinking and explorations. If this doesn&#39;t break the character limit, then I will attempt to combine it with part 3, otherwise..</p>\n\n<p>Part 3: we will jump timelines and explore April 2023 to September 29, 2023. I will share some theories on which participants I believe were still involved throughout the Chapter 11 process, while at the same time further-substantiating the purposeful intentions of the participants that we will introduce in Part 1.</p>\n\n<p>Part 4: we will attempt to bring it all together in a concise manner to try and &quot;tell a story&quot; as I feel that will be the best way to make a lot of it make sense. </p>\n\n<p>Let&#39;s go.</p>\n\n<p>BODY</p>\n\n<p>For the longest time, one of the main bear counterpoints to the BBBYQ play was that the participants were arriving to line their own pockets; to be opportunists, you could say. And on its face it is an angle that cannot be simply refuted as crazy-talk, as this behaviour is rampant in the capital markets where financial exploitation and profit margins are the name of the game and quite aptly are sometimes referred to as a &quot;fuck you, I got mine&quot; mentality. </p>\n\n<p>But the bears never substantiated any of that line of thinking, <strong>nor</strong> did they ever prove any financial interest in the stock either long or short. Therefore, I can only speculate that their intention was to sow FUD or worse, behavioural tendencies that we don&#39;t need to get into.</p>\n\n<p>Regardless, in this post we will attempt to provide counterpoints to some of that bearish thinking.</p>\n\n<p>For simplicity and mindfulness of post-length, we will begin in March 2022 and with Ryan Cohen&#39;s letter to the board. But <strong>please,</strong> keep in mind that in order for RC to have sent this letter, he had already made the share purchases going back to January 2022 and further, before someone of his business acumen accumulates a near-10% ownership stake, he had been conducting diligence, consulting with affiliates and strategically planning his move <strong>for much longer.</strong> It is therefore of course possible that his interest, and by extension the planning and collaboration with who would be involved, could date <strong>much further</strong> into the past. </p>\n\n<p>We&#39;ve all seen (if not read) the RC letter to the board from March 6, 2022. So I will provide a concise summary — of an already very concisely written document, to his credit — to give some perspective:</p>\n\n<p>1.</p>\n\n<p>• Board compensation is completely detached from Company performance. Directors are not significant shareholders and interests are de-coupled from the Company.</p>\n\n<p>• Poor forward-looking strategy for re-igniting growth.</p>\n\n<p>• Poor shareholder return on investment.</p>\n\n<p>•  <strong>A direct recognition of the Company&#39;s short interest.</strong> </p>\n\n<p>2.</p>\n\n<p>• Conduct a full-or-partial sale of Baby.</p>\n\n<p>3.</p>\n\n<p>• Evaluate a full sale to a well-capitalized acquirer. — important! Keep in mind this is before Chapter 11 and RC is suggesting that BBBY sell the entire business to someone, <em>&quot;with the ability to pay a meaningful premium.&quot;</em> The stock price at the time of the letter was ~16$ and ~80M TSO, but remember also all the expensive leases, the debt, the bonds looming being due. </p>\n\n<p>4.</p>\n\n<p>• &quot;strengthen leadership&#39;s alignment with shareholders.&quot; Get paid tons when you give tons to shareholders. Re-align your interests.</p>\n\n<p>source to the letter: <a href=\"https://www.sec.gov/Archives/edgar/data/886158/000119380522000426/ex991to13d13351002_03072022.htm\">https://www.sec.gov/Archives/edgar/data/886158/000119380522000426/ex991to13d13351002_03072022.htm</a></p>\n\n<p>Ryan Cohen clearly had an interest in this Company and I will speculate that more specifically, Baby. </p>\n\n<p>There is a proxy battle that is <em>very</em> short. By <strong>March 25,</strong> Ryan Cohen inserts three directors of his choosing to the Board of Directors. The Company&#39;s press release states:</p>\n\n<p>&quot;<strong>Bed Bath &amp; Beyond Inc. Announces Cooperation Agreement with Ryan Cohen</strong></p>\n\n<p><em>Appoints Three New Independent Directors to the Board with Finance and Strategy Experience&quot;</em></p>\n\n<p>Finance and Strategy Experience. Cool. They are:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/47p9vtm7ex0c1.png?width=2760&amp;format=png&amp;auto=webp&amp;s=9cc0ff0a56fc52dfa1d2eef2968aeb29210a75a7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/47p9vtm7ex0c1.png?width=2760&amp;format=png&amp;auto=webp&amp;s=9cc0ff0a56fc52dfa1d2eef2968aeb29210a75a7\"></a></p>\n\n<p>source: <a href=\"https://www.sec.gov/Archives/edgar/data/886158/000114036122011120/brhc10035704_ex99-1.htm\">https://www.sec.gov/Archives/edgar/data/886158/000114036122011120/brhc10035704_ex99-1.htm</a></p>\n\n<p><strong>Immediately,</strong> two of these three directors join (it was likely created with their arrival, but that is never confirmed) a strategy committee focused on:</p>\n\n<p><em>&quot;In conjunction with the cooperation agreement, Bed Bath &amp; Beyond today announced that Ms. Bowen and Mr. Rosenzweig, will join a four-member Strategy Committee focused on exploring alternatives to unlock greater value from the Company’s buybuy BABY banner.&quot;</em></p>\n\n<p>Talk about going to WORK.</p>\n\n<p>On <strong>June 29,</strong> Mark Tritton is fired as CEO by the Board of Directors. Many news outlets publish the story adding that he was <strong>pushed</strong> out. At the same time, Sue Gove is appointed interim-CEO and I personally believe this is Day 1 that Plan A could have begun to be implemented. But again, by the time something has begun being acted upon it would have already been in the works for some time prior, and I want to remind everyone that Carl Icahn&#39;s IEP was hit with the Hindenburg &quot;short report&quot; on <strong>May 2.</strong></p>\n\n<p>Mr. Icahn had taken a substantial loan out against his IEP units in XXXX and the newsmedia widely reports that he was at risk of a margin call on those loans. Was this an attempt to sabotage the potential actions and funding plans for &quot;a well-capitalized acquirer&quot;? </p>\n\n<p>We all know this, but one thing <em>that I did not realize</em> until I began writing this post is that Mr. Icahn paid off <strong>all of IEP&#39;s 2024 bonds</strong> on <strong>January 18,</strong> 2022.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/a4lzdiv9ix0c1.png?width=2760&amp;format=png&amp;auto=webp&amp;s=1aa16444839edf29c3f9f73866e10e6fb4e0790a\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/a4lzdiv9ix0c1.png?width=2760&amp;format=png&amp;auto=webp&amp;s=1aa16444839edf29c3f9f73866e10e6fb4e0790a\"></a></p>\n\n<p>source: <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000813762/000110465922005417/tm223784d1_8k.htm\">https://www.sec.gov/ix?doc=/Archives/edgar/data/0000813762/000110465922005417/tm223784d1_8k.htm</a></p>\n\n<p>—</p>\n\n<p>Hmm, but we have the counterpoint that Ryan Cohen sold his position on <strong>August 18,</strong> 2022. So let&#39;s take a look into what else occurred in August and by extension, what may have occurred between June and August of 2022?</p>\n\n<p>I am going to assume that between March and August since the appointment of the members to the board, there were negotiations happening. Things moved positively as I could speculate that then CEO, Mark Tritton, could have been opposed to RC&#39;s strategy and well, he was removed. But that doesn&#39;t matter.</p>\n\n<p>But between July and August, I speculate that <strong>either</strong> talks broke down, or a plan of action was formed. </p>\n\n<p>On <strong>August 17,</strong> Ryan Cohen files a form 144 proposing that he has an intention to sell his BBBY position at some time in the future. (The Form 144 does allow for a window of time).</p>\n\n<p>But what what bears conveniently often forget to mention is that following that release, BBBY issued a statement on <strong>August 18 PRE-MARKET</strong> in the form of an 8-K, stating:</p>\n\n<p>&quot;“[w]e were pleased to have reached a constructive agreement with RC Ventures in March and are committed to maximizing value for all shareholders . . . we have been working expeditiously over the past several weeks with external financial advisors and lenders on strengthening our balance sheet. . .”</p>\n\n<p>Then, <strong>after that, on August 18 POST-MARKET,</strong> Ryan Cohen submitted an SEC filling that he had sold his common stock position on <strong>August 16 and 17,</strong> 2022.</p>\n\n<p>Now <strong>WHY</strong> would the Company be issuing a statement <strong>the morning after RC had completed the sale of his position,</strong> that they had reached an agreement? </p>\n\n<p>Sounds a bit different when you look at the full picture, doesn&#39;t it?</p>\n\n<p>Following this, Sixth Street enters the picture. </p>\n\n<p>On <strong>September 1,</strong> they issue a press release that the Company had <strong>COMPLETED THE UPSIZING</strong> of the ABL to <strong>1.13 billion dollars</strong> with JPM, as well as receiving a <strong>375 million dollar</strong> FILO loan, providing access-to-capital. Remember, completed. As in they had approached and been working on it with the Company <em>prior</em> to September 1.</p>\n\n<p>source: <a href=\"https://sixthstreet.com/investment_announce/union-n-j-bed-bath-beyond-inc-nasdaq-bbby-today-announced-the-successful-completion-of-its-previously-disclosed-financing-agreements/\">https://sixthstreet.com/investment_announce/union-n-j-bed-bath-beyond-inc-nasdaq-bbby-today-announced-the-successful-completion-of-its-previously-disclosed-financing-agreements/</a></p>\n\n<p>Importantly, at the same time, <strong>the media is having a field day</strong> with RC selling and from August 19 to 23, the stock price plummets from 18.55$ on August 18, to 8.78$ on August 23.</p>\n\n<p>Can you tell me, when the media is portraying this is as an ER MAH GERD and that the Company is done for, <strong>JPM increases their ABL and Sixth Street provides money?</strong></p>\n\n<p>It doesn&#39;t add up <em>unless,</em> the media is trying to push a narrative and something else is <em>actually</em> happening.</p>\n\n<p>—</p>\n\n<p>Now, we all (basically) know all this and it has been written about before. But I needed to add it so that the next part makes sense. </p>\n\n<p>So, I want to challenge everyone&#39;s thinking and throw something out there:</p>\n\n<p>What if Ryan Cohen and the Board of Directors of BBBY, never saw eye-to-eye? Or, what if they had opposing strategies for the best outcome of the Company? I know, you&#39;re saying &quot;this isn&#39;t new information..&quot; but hang on, because here is where I got really excited when I started thinking about this:</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What if</strong> Ryan Cohen and affiliates <strong>forced</strong> the Company to an unwanted default on it&#39;s ABL with JP Morgan in <strong>January 2023?</strong> </p>\n\n<p>&#x200B;</p>\n\n<p>Allow me to explain. We know that one of the events of default was the upside down ratio of inventory/money loaned on the ABL. <strong>But,</strong> they <strong>specifically</strong> state this in the SEC filing. They <em>also</em> state &quot;among other reasons..&quot; as in, <strong>there were other events</strong> that triggered the default as well. What order they occurred in we will never know, nor will we ever know how often JPM checks on the inventory/loan ratio on the ABL.</p>\n\n<p>So then, <strong>why</strong> is the Company <strong>not admitting in detail,</strong> <em>all</em> of the events that occurred that caused the default? Did they want to save face from not looking like complete idiots? I could speculate that yes, that could be exactly why.</p>\n\n<p>One thing that I have been thinking about since March 2023 that I have never been able to reconcile in my mind is: <strong>how</strong> could the Company and the Board of Directors <strong>be so stupid and such bumbling idiots,</strong> that they allowed these &quot;other events of default&quot; to occur under their noses at such a critical, cash-tight time? </p>\n\n<p>After all, JPM took cash dominion over their accounts (no access to cash!) and the Company <strong>missed the February 1 payment</strong> on their bonds. </p>\n\n<p>We have an abundance of evidence to substantiate the attempted leveraged buy-out that occurred in <strong>January 2023.</strong> Based on the credit agreement, we have speculated that one of the other events of default on the JPM ABL could have been a change of control.</p>\n\n<p>What if Ryan Cohen attempted the LBO, <em>not in alignment with the board,</em> to <strong>force</strong> the Company into a precarious financial position? </p>\n\n<p>It would explain the selling of the common stock position in August, as he may have realized that working <strong>with</strong> the Board was not going to work. Perhaps they were afraid of losing Baby as the rest of the business was in shambles, or, they just did not agree with RC&#39;s strategy? Coming in a few months before, bullying the Board around, winning a proxy, kicking out the CEO.. </p>\n\n<p>RC would need a <strong>new angle</strong> of approach.</p>\n\n<p>But <em>why?</em> You may ask. Well, what if the intention was to back them into a corner where <strong>they</strong> <strong>could not refuse</strong> an offer from Hudson Bay Capital, coming in with an ATM Equity offering, <strong>when they already had such an agreement in place with Jeffries since August 2022?</strong></p>\n\n<p>Aha. In these circumstances then, the intentions of HBC suddenly become very clear. Do you remember this tweet from RC?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/99twb07ykx0c1.png?width=1180&amp;format=png&amp;auto=webp&amp;s=0731e68aa86cda984b0ba0aaccb89edd1b70f9b7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/99twb07ykx0c1.png?width=1180&amp;format=png&amp;auto=webp&amp;s=0731e68aa86cda984b0ba0aaccb89edd1b70f9b7\"></a></p>\n\n<p>This is dated <strong>April 12..</strong> </p>\n\n<p><strong>a week after</strong> the first business day after <strong>the end of Hudson Bay Capital&#39;s concession to remove price restrictions to allow for the continuance of the Equity Offering,</strong> where HBC receives warrants/preferred for cash. This was the <strong>second time</strong> they had amended the offering, removing restrictions they had put in place and I believe the concessions were made to continue the accumulation for HBC to meet their target position and ownership, despite the cellar-boxing.</p>\n\n<p>What if RC tried <em>complicating the situation for the Board</em> of the Company, trying to force their hand against their desire to sell him Baby? Sounds like a strategy that someone else would implement.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/yzm033m6tx0c1.jpg?width=978&amp;format=pjpg&amp;auto=webp&amp;s=a4b38ae9fd1f91c8b95757f3af3e43f5e33898b9\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/yzm033m6tx0c1.jpg?width=978&amp;format=pjpg&amp;auto=webp&amp;s=a4b38ae9fd1f91c8b95757f3af3e43f5e33898b9\"></a></p>\n\n<p>The stock price had been cellar-boxed since mid-February. I believe that was a deliberate attempt to prevent the Company from raising capital by not being able to fulfill the requirements of the equity offerings from February. </p>\n\n<p>They admit themselves in SEC filings that they do not believe the stock price is reflective of the underlying business and their transformation plan.</p>\n\n<p>You could make the argument that <strong>April 12</strong> was the day that RC, or the Board and Company, decided that they were ready for, or, could not prevent/delay filing for Chapter 11 any further.</p>\n\n<p>That tweet could have actually been about BBBY.</p>\n\n<p>I am going to have to split Part 1 into two pieces, it is taking so long! Part 1.2 coming later today.</p>\n\n<p><strong>to be continued.</strong></p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Master Debater ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/buUIuTZJqb7IsBGIn5VIrS9E90H4bWOTS0-eX4ja65k.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/17sdewy/some_interesting_deloyt_information_found_in/", "time": 1699649303.0, "subreddit": "r/ThePPShow", "title": "Some interesting DeLOYT information found in their fee statement:", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just want to share some small pieces as I have continued looking through the Deloitte billing docket. Each time I read through it, it appears more and more obvious as to why it had been held back until November 1. There&#39;s a lot in here.</p>\n\n<p>First, at the beginning they seem to be pretty open and honest, indicating what has long-been speculated, but with a twist.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/79vxf744zkzb1.png?width=1752&amp;format=png&amp;auto=webp&amp;s=3a457b9c7becedde8625d8492b018c9896948991\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/79vxf744zkzb1.png?width=1752&amp;format=png&amp;auto=webp&amp;s=3a457b9c7becedde8625d8492b018c9896948991\"></a></p>\n\n<p>They do mention a Section 382 ownership change — 382 referring to the NOL tax benefit — but why do they have ownership change in quotations? This strikes me as odd, because it is the correct language and exact words for this section of the Law. Consider my interest piqued. </p>\n\n<p>But one thing is clear, you <strong>cannot have both.</strong> Ownership change and no more company/liquidated and gone cannot coexist. If you have one, you can&#39;t have the other. <strong>Wowza.</strong> See why they held back releasing this docket?</p>\n\n<p>And why on earth do they state <strong>each</strong> Debtor&#39;s stock basis? Could this possibly suggest a new share issuance and the tax professionals having to accommodate such implications, alongside the &quot;ownership change&quot;? I don&#39;t know yet, but it begs for more reading.</p>\n\n<p>Then we have this piece I want to share:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3ef89ya9zkzb1.png?width=1844&amp;format=png&amp;auto=webp&amp;s=e0701da1b5e59709a969c10eaf6870a1d50dffb1\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/3ef89ya9zkzb1.png?width=1844&amp;format=png&amp;auto=webp&amp;s=e0701da1b5e59709a969c10eaf6870a1d50dffb1\"></a></p>\n\n<p>The stock basis is something that will require its own post, but in a simple explanation for now consider that during Chapter 11 there may be changes in the company&#39;s ownership structure and as a result, the value of the stock may be affected. That&#39;s an overly-skimmed version but like I said, I will follow-up on it.</p>\n\n<p>Otherwise, they confirm the existence and importance of the NOL in this Chapter 11 proceeding. The timing here is August 22, so this is <strong>well</strong> after any IP sale-related matters with Overstock and Dream on Me. </p>\n\n<p>This is important as we know with the NOL preservation, the &quot;structure&quot; of the NewCo ownership needs to be precise and if not done correctly, can cancel-out the 382(l)(5) benefit which can allow the full use of the tax attributes vs. 2% per year.</p>\n\n<p>Again, <strong>completely not possible</strong> to have NOL recovery if no company exists and there was no emerging NewCo coming out of Chapter 11. There is a mountain of evidence at this point to conclude that there will be an emerging entity/entities.</p>\n\n<p>Lastly, this is repeatedly reported from pages 278-281:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/e2qw5lkozkzb1.png?width=1844&amp;format=png&amp;auto=webp&amp;s=cae91970f1599fec1d69d9e866ecce1856190242\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/e2qw5lkozkzb1.png?width=1844&amp;format=png&amp;auto=webp&amp;s=cae91970f1599fec1d69d9e866ecce1856190242\"></a></p>\n\n<p><strong>oh my.</strong> This activity is dated for July 11 <strong>and I believe,</strong> it is <em>the</em> answer as to why the BuyBuy Baby auction was cancelled; <em>it wasn&#39;t needed.</em> </p>\n\n<p>The entities were formed, the assets amongst them decided and then later distributed.</p>\n\n<p>But let&#39;s explore this language more. The &quot;current legal entity structure&quot; on July 11 could have been anything, really. But that alone would be very speculative so I am thrilled to further see the remainder, which adds:</p>\n\n<p><em>&quot;..and which entities were acquired versus formed.&quot;</em></p>\n\n<p><strong>wat.</strong></p>\n\n<p>This is an enormous piece of information. It provides evidence to my speculation that <strong>multiple</strong> entities will emerge after this Chapter 11 concludes. They do state entities in plural, after all.</p>\n\n<p>Further, this is evidence to my other speculation that one of these entities may be BuyBuy Baby and BBBYTF, as they do specifically state that <strong>new entities were formed.</strong> </p>\n\n<p>Lastly, the language quite plainly implies that another entity/entities were <strong>acquired.</strong> </p>\n\n<p>Wow, talk about some unambiguous descriptions on what they were doing on that day. I believe this is a massive piece of information to validate the bull thesis for the outcome of this Chapter 11.</p>\n\n<p>I&#39;m going to keep working my way back through dockets to see if anything might stand out now with more knowledge of language/terms. </p>\n\n<p>I&#39;d love to hear anyone&#39;s input and/or objections. What do you think?</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Master Debater ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/lPVfT_p5wbrVnvnmgz5yiOaLmIsMZw_Rdl12Ibqyzxc.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/17r4nz7/ill_be_having_a_space_call_on_x_with_platinum/", "time": 1699502934.0, "subreddit": "r/ThePPShow", "title": "I'll be having a Space call on X with Platinum Sparkles tomorrow at noon EST. What would you like to hear discussed?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone!</p>\n\n<p>I tried to get Platinum to come on the pp show tonight, but she wouldn&#39;t which is too bad. She did agree to have a Space call however, which I will host tomorrow at 12:00pm.</p>\n\n<p><a href=\"https://x.com/sboho/status/1722426818332873038?s=20\">https://x.com/sboho/status/1722426818332873038?s=20</a></p>\n\n<p>Now, before I say anything else I just want to be clear so that no one is disappointed. I am not going to use this as an opportunity to lay into her with insults or otherwise &quot;roast&quot; her. I&#39;m sure to some peoples&#39; disappointment. Sorry. </p>\n\n<p>One, I&#39;m sure she would just leave immediately anyway and more importantly, it would not be an accurate or fair representation of the BBBYQ community as a larger whole. In a way, I partially view the PP community as people who love and hodl GME, but are outcasts of sorts because BBBYQ holders have been insulted, ridiculed, &quot;there is only one stock&quot;, etc. It would be ironic in the worst way possible.</p>\n\n<p>So, why then? Well, I&#39;m an eternal optimist and every time I have engaged with her, I&#39;ve only tried to point out she shouldn&#39;t be so certain about her bearish outlook, or that she doesn&#39;t fully know the play and some (many) of her points are not correct.. but even if I can&#39;t broaden her perspective on the bull thesis, maybe she will draw people into the Space (I think she has a good amount of followers?) that might have not heard a bullish thesis for BBBYQ or otherwise don&#39;t believe in one. Hearing it presented fully, instead of snippets from posts, could educate someone out there. </p>\n\n<p>It will be recorded so if anyone else wants a comprehensive summary (like what Salvatore and I did on the Houston Wade stream) it may be beneficial to bulls, too.</p>\n\n<p>OK, enough with my rambling.</p>\n\n<p>Does anyone have any questions they would like me to ask her, </p>\n\n<p>or, </p>\n\n<p>any points you feel would be beneficial for helping someone understand what the PP community believes in?</p>\n\n<p>--</p>\n\n<p>Full disclosure: </p>\n\n<p>I am giving her the benefit of the doubt. If she ends up having bad intentions, who cares. It&#39;s not like that happening would change anyone&#39;s thoughts on the play anyway and I think my thoughts on BBBYQ have been shared pretty clearly so I am not personally worried. </p>\n\n<p>She and I have privately messaged. She takes the position of simply being a retail investor, &quot;we are on the same side&quot; and that she just wants to learn more. Cool.</p>\n\n<p>I&#39;m not preparing any notes or anything, I&#39;ll just be going with the flow. </p>\n\n<p>--</p>\n\n<p>If nothing comes of it, great. If someone hears some information during the Space that they found valuable, greater!</p>\n\n<p>Throw out any and all ideas for what you&#39;d like me to ask.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/17p7vek/what_is_going_on_with_these_new_bonds_at_ibkr/", "time": 1699291378.0, "subreddit": "r/ThePPShow", "title": "What is going on with these new bonds at IBKR?", "text": "<!-- SC_OFF --><div class=\"md\"><p><em>HI EVERYONE!</em></p>\n\n<p>I want to follow up with some digging on info that is viewable on IBKR. Some recent, some brand new. I tried buying bonds and got some interesting info. </p>\n\n<p>This is not financial advice, have you met me? That would be an absurd proposition.</p>\n\n<p>First, when you search BBBYQ in the magnifying glass at the top, you get the stock and bonds show up. But only as of today (at least for me?) I have this, &quot;Show BBBYQ in your Portfolio&quot; and a link to go back to my accounts.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/kirfksr0gryb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=80a7313e7f687818c79c2d30c29e8bc23f42cf35\">k, weird.</a></p>\n\n<p>Cool, but whatever. The bonds are the funny piece so look at this. Go search for the bonds, unselect &quot;include non-tradable&quot; and the three IBCID## bonds remain, for &#39;24, &#39;34 and &#39;44. Why? lolz</p>\n\n<p>If you go to the page for any of them, you can see that they are listed as <strong>exchange-traded</strong> and <strong>callable.</strong> What&#39;s more, all of them are shortable and have specific amounts of individual liquidity. At the time of my screenshot it is 8,229; 25,880; 10,564.  </p>\n\n<p><strong><em>how?</em></strong> Where is this liquidity coming from? </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ig58m8icgryb1.png?width=832&amp;format=png&amp;auto=webp&amp;s=a0147d563665887a615c124228f863a8661fb5c0\">k, dafuq?</a></p>\n\n<p>There&#39;s no way this is a &quot;glitch&quot;, the numbers are specific and unique.  </p>\n\n<p>So I try to purchase some bonds. I am greeted with a warning screen telling me the bonds are trading flat, which is expected. Here&#39;s a summary of what that is:  </p>\n\n<p><em>&quot;A bond also trades flat if interest payment on the bond is due but the issuer is in default. Bonds that are in default are to be traded flat without calculation of accrued interest and with delivery of the coupons which have not been paid by the issuers.&quot; (investopedia)</em>  </p>\n\n<p>I accept the warning and attempt to buy, at which point my order is rejected and I&#39;m greeted with an IBKR summary page about distressed bonds. </p>\n\n<p>Mostly discussing the trading flat limitations, you&#39;re not getting coupon payments, etc etc. but then, there&#39;s this warning:  </p>\n\n<p>&quot;Bankruptcy courts can issue broad orders at the request of a bankruptcy debtor that halt or seriously restrict trading in all of the debt and equity of the debtor corporation for the protection of the bankruptcy debtor&#39;s net operating loss (&quot;NOL&quot;) carryovers and other tax attributes of the debtor.&quot;  </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hoy39ynhgryb1.jpg?width=1289&amp;format=pjpg&amp;auto=webp&amp;s=8249d2a2de25e5f83baff4fe3b2f07670eb390af\">k, it is NOLvember I guess.</a></p>\n\n<p>Gosh, that pesky NOL! Not only is it alive and well from the Deloitte Restructuring docket, but here it is again. Not dead!</p>\n\n<p>So the bonds are trading flat and/or not tradable/halted by the Bankruptcy Court. But they are back, <strong>with new</strong> CUSIP/IBCID and <strong>no warning</strong> <strong>pop up</strong> like the other, old bonds about &quot;for info purposes only.&quot; They are also <em>actively</em> shortable. </p>\n\n<p>But wait, there&#39;s more. <strong>Since I started writing this post,</strong> the &#39;34&#39;s went from 8,229 to 8,039 SLB availability. <strong><em>How?</em></strong> How is that possible. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ahytw7nkhryb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=62b576d28e4947fc3bb9317e618202eb0b3a245e\">k, my body is ready.</a></p>\n\n<p><em>&quot;Rumors of my death may have been greatly exaggerated.&quot;</em>  </p>\n\n<p><strong>If</strong> bonds are going to be reissued to legacy holders instead of being converted to equity then.. <em>wow.</em> I don&#39;t even know how to communicate that level of excitement. A <strong>1.1 billion dollar</strong> mountain would be out of the way to pave recovery for Class 9 Common Stock shareholders. Which Hudson Bay Capital is holding, don&#39;t forget. I hadn&#39;t even considered this kind of scenario.</p>\n\n<p><strong>Why</strong> are these new bonds popping up when searching? <strong>Why</strong> are they listed as exchange traded? <strong>Why</strong> are they <strong>actively</strong> being shorted, <em>right now?</em> And yes, IBKR is still showing BBBY as a shell company, indicating that it is possible restructuring is completed, NewCo is ready to emerge and is just awaiting public disclosure.</p>\n\n<p>Does anyone have a counter-theory as to how <em>any</em> of this is possible?</p>\n\n<p>The best time to be alive is now.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/4iTz5lCE1N7JebD2C8ES_TsHw_iRTa-_qEqA3uSrKOE.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/17my165/is_this_new_ibkr_is_listing_bbbyq_as_a_shell/", "time": 1699026429.0, "subreddit": "r/ThePPShow", "title": "Is this new? IBKR is listing BBBYQ as a Shell Company:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys, I&#39;m back on reddit after most of this week away. I know I have a lot of missed messages and notifications. We will connect!</p>\n\n<p>I want to share an interesting datapoint I found. Was this always the case? IBKR shows BBBYQ as a shell company.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lg3gmulil5yb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=ab664fa431fa0640c07b2a9b6d5bf365a1c909e4\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/lg3gmulil5yb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=ab664fa431fa0640c07b2a9b6d5bf365a1c909e4\"></a></p>\n\n<p>Additionally, the bonds with designations IBCID### are listed as &quot;callable&quot; and &quot;exchange traded&quot;.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ziuutxoml5yb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=e3bb5db74f6b899b9ebf374957ce2ecbdc6922b3\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ziuutxoml5yb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=e3bb5db74f6b899b9ebf374957ce2ecbdc6922b3\"></a></p>\n\n<p>The others appear as historical.</p>\n\n<p>The company being listed as a shell is a <strong>very positive</strong> sign, intriguing and paves the way for emerging from Chapter 11. I&#39;m curious if we will be seeing SEC filings soon.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/l8sRwM2-692xNDknX1qIZDCPDeISsPNB0W3_xMFdjyw.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/17m8n8z/sixth_street_bought_some_or_all_of_the_underlying/", "time": 1698945677.0, "subreddit": "r/ThePPShow", "title": "Sixth Street bought some or all of the underlying business of Buy Buy Baby:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sorry guys, I haven&#39;t been on reddit in a while and I promise I will get to everyone&#39;s messages and notifications. </p>\n\n<p>It appears Sixth Street have bought some or all of the underlying business of Buy Buy Baby. What has been long-speculated has some definitive confirmation.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rstvsxjzwyxb1.png?width=1540&amp;format=png&amp;auto=webp&amp;s=1b26216abe0b33220cae7ec924b695e5023fba26\">page 564</a></p>\n\n<p>The new Kirkland final fee docket appears to have previously-redacted information included within it. This is docket 2656. </p>\n\n<p>I had previously shared that the Baby IP had some notable &quot;exclusions&quot;, such as &quot;excluded trademarks.&quot;</p>\n\n<p>Docket overload continues, but this was a big one. Now, I am unsure if sixth Street and Dream on Me are financially connected, or if this purchase was after the IP sale to Dream on Me for what was left. I will continue to look.</p>\n\n<p>Then there was this, Deloitte analyzing a tax basis if issuing stock of a subsidiary:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/d580u0oqxyxb1.png?width=1460&amp;format=png&amp;auto=webp&amp;s=9a9c97d8bf7d841098df27e93f69edb4f60aa436\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/d580u0oqxyxb1.png?width=1460&amp;format=png&amp;auto=webp&amp;s=9a9c97d8bf7d841098df27e93f69edb4f60aa436\"></a></p>\n\n<p>Welcome to the end game.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/IQ3yT09PG7derB5JteAppeMJ0wCP0V5O_E9M1k9uOrY.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/17ir9az/i_have_never_posted_a_tinfoil_but_since_i_am_it/", "time": 1698539582.0, "subreddit": "r/ThePPShow", "title": "I have never posted a tinfoil, but since I am it may as well be a Bill Pulte:", "text": "<!-- SC_OFF --><div class=\"md\"><p>So Bill joined us on a Space Call earlier this evening to talk about Pulte Group. Thanks <a href=\"/u/realpulte\">u/realpulte</a>! 🤙🏼</p>\n\n<p>During the call, we had asked about his sweater — admittedly, it is cool — he had worn during his X short video when he was in a GameStop store.</p>\n\n<p><a href=\"https://x.com/pulte/status/1718041531309818272?s=20\">https://x.com/pulte/status/1718041531309818272?s=20</a></p>\n\n<p>He chuckled and said he would think about making more of them. ..as in, he either put <strong>this logo</strong> on the sweater himself with one of those cricket machines, or had this item with the accompanying logo made for him. </p>\n\n<p>The logo? Well it&#39;s a stork, flying and carrying a package in its mouth.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/58qewmssb1xb1.jpg?width=874&amp;format=pjpg&amp;auto=webp&amp;s=1be187ec6c97ae9c68d4d43b8905f208e969ae64\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/58qewmssb1xb1.jpg?width=874&amp;format=pjpg&amp;auto=webp&amp;s=1be187ec6c97ae9c68d4d43b8905f208e969ae64\"></a></p>\n\n<p><strong>enhance!</strong> OK so I can&#39;t make out the first word, but I suspect the other three say &quot;..in a box&quot;. We? Win? I don&#39;t know. Anyone want to guess?</p>\n\n<p><a href=\"/u/realpulte\">u/realpulte</a>, what&#39;s the first word on the sweater?</p>\n\n<p>I remember reading stories when I was young with storks.</p>\n\n<p>They would always be delivering a baby.</p>\n\n<p>🤔</p>\n\n<p>Separately, he said he sees GameStop making an acquisition soon, because &quot;it just makes sense.&quot; Only speculation, just from what he sees on the balance sheet of the Company and his own opinion based off of his own experience. </p>\n\n<p>OK, tin is <em>really</em> addictive so I need to put this down. I&#39;ll see everyone with a new DD on Monday. 👋🏼</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/_uznOvBjrG40HfL1W3HjfEiALtGkLp3fP4DtY8VTxd0.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/17eoogq/share_cancellation_shareholder_confusion_and_an/", "time": 1698078835.0, "subreddit": "r/ThePPShow", "title": "Share Cancellation, Shareholder Confusion and ..an Oddity?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone! I&#39;m sorry that I have been away since Thursday evening, I&#39;ve been super busy with family and related events including 3 birthday parties in one day. <em>Awesome.</em></p>\n\n<p>Feels great to be back and looking into the dockets again. I want to share some observations and get the conversation going with things I have noticed. But first, here&#39;s an update on my end: my one brokerage is down today, another still has my shares as placeholder and has not changed for weeks, WealthSimple has taken my shares out of view but has no activity or accounting of what happened and IBKR has removed my shares and stated &quot;delisted&quot; as the reason. </p>\n\n<p>If what I am posting has already been reviewed, please let me know and I can delete it.</p>\n\n<p>So I began looking through docket 2520 and a few things stood out to me. It states:</p>\n\n<p>&quot;On <strong>October 10, 2023,</strong> at my direction and under my supervision, employees of Kroll caused the Combined Hearing Notice to be served via First Class Mail on the Supplemental Master Mailing Service List attached hereto as Exhibit G.&quot;</p>\n\n<p>I immediately found this as odd, since all items referred to within the Combined Hearing Notice have occurred a long time ago. Specifically, </p>\n\n<p><strong>July 28:</strong> Voting Record Date; <strong>August 2:</strong> Amended Joint Chapter 11 Plan; <strong>September 1:</strong> Objection Deadline; <strong>September 12:</strong> Combined Hearing; and etc.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/6set063z6zvb1.png?width=1520&amp;format=png&amp;auto=webp&amp;s=4e41da46f5a191715de82485caf9eac76176324c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/6set063z6zvb1.png?width=1520&amp;format=png&amp;auto=webp&amp;s=4e41da46f5a191715de82485caf9eac76176324c\"></a></p>\n\n<p><strong>So why then,</strong> is this document being re-served on all parties — Supplemental GUC Service List and Supplemental Impaired Service List — at this time? Notably, docket 2520 certifies that the Service <strong>occurred on October 10, 2023,</strong> the Certificate of Service was written on October 19, 2023 and it was publicly posted to Kroll on October 20, 2023.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/pyiep4uw6zvb1.png?width=1564&amp;format=png&amp;auto=webp&amp;s=0355702dc3f15713a9dc3738b673bd2af9ddeed3\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/pyiep4uw6zvb1.png?width=1564&amp;format=png&amp;auto=webp&amp;s=0355702dc3f15713a9dc3738b673bd2af9ddeed3\"></a></p>\n\n<p>What is going on..? <strong>Why</strong> would they be Serving the parties so far after the dates mentioned throughout this document? Well, I believe I have discovered why. Docket 2520 is titled as a <strong>Supplemental</strong> Affidavit of Service.</p>\n\n<p>Please correct me if I am wrong, but I believe this piece here is included in the Service document <strong>for the first time:</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/pnko77be7zvb1.png?width=1564&amp;format=png&amp;auto=webp&amp;s=4819550e09d0c209541cf0f41eb8b3eb72dc5bc8\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/pnko77be7zvb1.png?width=1564&amp;format=png&amp;auto=webp&amp;s=4819550e09d0c209541cf0f41eb8b3eb72dc5bc8\"></a></p>\n\n<p>The Combined Hearing <strong>may be continued</strong> from time to time (as in, in the future) and importantly, it may be continued <strong>without further notice.</strong></p>\n\n<p>Again if this piece of information has been in previous dockets, please let me know but otherwise it seems that this would open the door for, well, anything really and it also explains the reason behind the documents being Served on all applicable parties again, despite the dates contained within having occurred so far in the past.</p>\n\n<p>I also want to point out something I have noticed within this docket and the chronological timeline. The Service occurred on October 10. They didn&#39;t write it up until over a week later on the 19th and then one day later before they said anything about it publicly. I believe this theme may be occurring in a lot of aspects of this case where we will potentially not know immediately — maybe even until the last moment — what exactly is going on and more importantly, <em>when</em> it is going on.</p>\n\n<p>Here&#39;s two more things I noticed. First, in docket 2513 it states:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/4n63cxk59zvb1.png?width=1768&amp;format=png&amp;auto=webp&amp;s=24e73a088031810b4c17eea489561c7229dbb463\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/4n63cxk59zvb1.png?width=1768&amp;format=png&amp;auto=webp&amp;s=24e73a088031810b4c17eea489561c7229dbb463\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xe0n2xk69zvb1.png?width=1768&amp;format=png&amp;auto=webp&amp;s=90fe449c655161ec9d7009b87fe0b13d8625f495\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/xe0n2xk69zvb1.png?width=1768&amp;format=png&amp;auto=webp&amp;s=90fe449c655161ec9d7009b87fe0b13d8625f495\"></a></p>\n\n<p>So in the context of ongoing Administrative Claims procedures, Mr. Sandler states that <strong>on October 19</strong> the Plan Administrator is <em>just getting up to speed</em> in these cases and they are requesting the Court adjourn (set aside, with intent to resume later) any scheduled hearings on these Admin Claims.</p>\n\n<p>I understand the context is with regards to the Admin Claims, but the point stands — Mr. Sandler is requesting that the Plan Administrator be given time to get educated about what is going on and what he will be doing, <strong>to the extent that</strong> <strong><em>any</em></strong> hearings about the Claims be set aside. Perhaps he needs time to &quot;execute&quot; the procedures that were outlined as his role in docket 2172. </p>\n\n<p>Additionally, the Plan Administrator has himself requested that <strong>two attorneys</strong> be admitted pro hac vice (dockets 2515 and 2516) and begin their work regarding this case, on <strong>October 19, 2023. WHY?</strong> Why would the Plan Administrator need two additional attorneys, <em>on top of</em> the Pachulski team at this stage? (actually asking). It&#39;s <em>very</em> interesting.</p>\n\n<p>In contrast, looking at docket 2517 it states:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fsl7edovazvb1.png?width=1766&amp;format=png&amp;auto=webp&amp;s=b947ea0a22615cbb64ef2a3388fc68beeb695de1\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/fsl7edovazvb1.png?width=1766&amp;format=png&amp;auto=webp&amp;s=b947ea0a22615cbb64ef2a3388fc68beeb695de1\"></a></p>\n\n<p>and further, on page 5:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/g1d6ssezazvb1.png?width=1766&amp;format=png&amp;auto=webp&amp;s=95e11bd0f58bf952ba357b660a26ff3fd11478d0\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/g1d6ssezazvb1.png?width=1766&amp;format=png&amp;auto=webp&amp;s=95e11bd0f58bf952ba357b660a26ff3fd11478d0\"></a></p>\n\n<p>It sounds like the Plan Administrator <em>got right to work</em> and inked a deal the first day that he was in charge. I&#39;m also curious, why was this asset sale put off until now and why did it not happen along with the other locations that were sold? I don&#39;t know.</p>\n\n<p><strong>All this to say,</strong> that there is obviously an organized procedure under which everything is occurring. It also appears that this procedure may have already happened and it has not been communicated publicly. Like, how Bed Bath did not exist as of September 21 but we only learned that it was called DK-Butterfly on September 29.</p>\n\n<p>Or, it can be said equally that perhaps the Plan Administrator is &quot;just getting started&quot; because he needed to get up to speed. I really don&#39;t know. All I am really saying is that it is much too soon to be making definitive statements about any outcome as the process is clearly not over. Like how he just brought two new attorneys into the case. </p>\n\n<p>Or, it could be that anything that were to happen, has happened and we just don&#39;t know it yet.</p>\n\n<p>I believe that we (the public) will be the last to know anything and through historical context, it appears when we do find out, it will have <em>already happened.</em></p>\n\n<p>I&#39;ve just begun resuming my digging so I value all input and feedback. Please let me know what you think.</p>\n\n<p>Thank you for reading.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/mm68xjgAvlrj3nhtMKqiHvILFWQkYAFQiE2YnksnV-w.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/176d9nd/looking_back_at_the_november_private_bond/", "time": 1697133747.0, "subreddit": "r/ThePPShow", "title": "Looking back at the November private bond exchanges, they were related and both subject to the Lazard Dealer Manager Agreement:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Full disclosure, this find is credited to Spidey on X and he has asked that I make a post of it to document the finding. As far as I know, this was unknown before but if I am incorrect, please let me know.</p>\n\n<p>On November 9 and 14, 2022 we learned of a pair of private, off-market bond exchanges made between the company and i) a single existing entity holder and then later, ii) several existing institutional holders.</p>\n\n<p>David Simpson has documented this and opined that it was the first step of the LBO attempt for acquiring Bed Bath. He noted that the conversion profit, coupon rate profit and otherwise did not make sense for the bondholder at face value, unless it was a part of a larger whole.</p>\n\n<p>Today it was discovered that there was more to it. So let&#39;s see:</p>\n\n<p>On December 6, there are a pair of Form D SEC filings for each of these events. First, was the individual holder:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9rsvuq3c3ttb1.png?width=1994&amp;format=png&amp;auto=webp&amp;s=be3069ff16e5ed693414e1b7cf707b71e7edd3f5\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/9rsvuq3c3ttb1.png?width=1994&amp;format=png&amp;auto=webp&amp;s=be3069ff16e5ed693414e1b7cf707b71e7edd3f5\"></a></p>\n\n<p>It was immediately followed by the group of institutional investors:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/b2wbcree3ttb1.png?width=2626&amp;format=png&amp;auto=webp&amp;s=d4f6c4a876853e282644cb51f52aac90f4339b68\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/b2wbcree3ttb1.png?width=2626&amp;format=png&amp;auto=webp&amp;s=d4f6c4a876853e282644cb51f52aac90f4339b68\"></a></p>\n\n<p>Of note, Perella Weinberg earned a commission on that particular off-exchange transaction. </p>\n\n<p>After the Form D filings, there is an accompanying 8-K and I&#39;m glad I found it, because I was of the understanding the bonds were traded in for the common stock shares. In fact, they were exchanged with new maturity dates and coupon rates.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/t7rmjztu4ttb1.png?width=1670&amp;format=png&amp;auto=webp&amp;s=271152ad971dbfea74af08de519b5f13b8eae9f8\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/t7rmjztu4ttb1.png?width=1670&amp;format=png&amp;auto=webp&amp;s=271152ad971dbfea74af08de519b5f13b8eae9f8\"></a></p>\n\n<p>So the recipients of the common stock shares also received new bonds (this may be common knowledge, was just interesting to me.)</p>\n\n<p>But in this 8-K, there is an incredible piece of information in Exhibit 99.1:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ml4kexp66ttb1.png?width=1670&amp;format=png&amp;auto=webp&amp;s=324a7510cbad6aee15b75b80a7a52d2fd1a78bfb\">wat?</a></p>\n\n<p>The two parties <strong>appear to be acting as affiliates and/or the same legal entity,</strong> according to the Lazard Dealer Manager Agreement. You&#39;ll recall that the Lazard DMA was most-recently included in the Court disclosure for the Lazard Engagement Letter and in a nutshell, allowed multiple parties, affiliates, activist investors even, etc to operate as one legal entity for the intentions of deal-making.</p>\n\n<p>From docket 345:</p>\n\n<p><em>&quot;Lazard began advising the Debtors on strategic and restructuring initiatives prior to the commencement of these Chapter 11 Cases. Lazard was initially engaged as the Debtors’ investment banker on August 10, 2022, and has provided advisory services in connection with the Debtors’ restructuring efforts since its engagement.&quot;</em></p>\n\n<p>So Lazard is advising the Debtors on strategic and restructuring initiatives and also, through the Dealer Manager Agreement, assisted in some capacity with the bond exchanges. Now, we additionally have information to suggest that the &quot;single holder&quot; as well as the &quot;several institutional holders&quot; were working together towards a common goal as affiliates through the dealer-manager agreement.</p>\n\n<p>In this exchange they received 2,762,444 and 11,667,021 shares of common stock respectively, as well as revised bonds. But most importantly, it appears they were working together towards the suspected, attempted acquisition of Bed Bath.</p>\n\n<p>I do wonder if this was part of Plan A, which was the attempted LBO in January 2023 or if this would still be playing a role in the current Chapter 11 situation. I would love to hear everyone&#39;s thoughts.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/lcIuuFSqbMMkY_Qy4fujxV7PsxiTAuzF8oOHEjdzIF8.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/174q9rb", "time": 1696957408.0, "subreddit": "r/ThePPShow", "title": "Substantiating Company Actions re: Form 25, Form 15 and its Relation to a Potential Acquisition.", "text": null, "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/x2bxIvcHhY-bdpzTBxwiEayYUea_y6zBxIOzIl1SOLU.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/170munj/i_think_this_deserves_a_look_considering_the_ast/", "time": 1696524484.0, "subreddit": "r/ThePPShow", "title": "I think this deserves a look considering the AST news:", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m reading into some interesting connections that I wanted to share — namely FTI Consulting and M3 Partners, LP.  </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xkpnslfrxesb1.png?width=1762&amp;format=png&amp;auto=webp&amp;s=a9190eb64aaef5ea7b62ad0100d26589ac125de2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/xkpnslfrxesb1.png?width=1762&amp;format=png&amp;auto=webp&amp;s=a9190eb64aaef5ea7b62ad0100d26589ac125de2\"></a></p>\n\n<p>From SEC filings, we know FTI Consulting is providing Lender Advisor Services to the Administrative Agent, who is Sixth Street Specialty Lending.  FTI specializes in <strong>Blockchain and Digital Assets</strong> as well as Business Transformation and Strategy, among others. <em>Interesting.</em>  </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5ppx32j6yesb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=d4f42a37cde4018dce790fd6b4f358d762ffde8e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5ppx32j6yesb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=d4f42a37cde4018dce790fd6b4f358d762ffde8e\"></a></p>\n\n<p>I find that <em>very</em> cool since learning that AST was informed they were no longer going to be the transfer agent for the butterfly.</p>\n\n<p>We know M3 Partners is providing Lender Advisory Services to the FILO party, which is <em>also</em> Sixth Street Specialty Lending.  M3 Partners was founded with the mission of dedicating senior professionals with cross-functional expertise to efficiently develop actionable plans for identifying <strong>and maximizing value.</strong>  </p>\n\n<p>Where have I heard that before?  </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/kumn60iayesb1.png?width=2062&amp;format=png&amp;auto=webp&amp;s=a1baafb3279c6a4a9e0a65ff19b34228e7ec9949\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/kumn60iayesb1.png?width=2062&amp;format=png&amp;auto=webp&amp;s=a1baafb3279c6a4a9e0a65ff19b34228e7ec9949\"></a></p>\n\n<p>Since the removal of AST, I have read a lot of the focus recently is on M3 Partners. I would opine the focus should be <strong>expanded to FTI Consulting,</strong> considering their specialties and DIP representation.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/k8DeWKKK0RoGn_4PV5qpbl5nwT6yR1qrT6w-ACM-ca8.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/i6k5m9nfb7sb1.jpg", "time": 1696432041.0, "subreddit": "r/ThePPShow", "title": "Please read: call with my bank this morning", "text": "<!-- SC_OFF --><div class=\"md\"><p>I want to share an update, according to a conversation with my bank this morning. </p>\n\n<p><strong>please treat this as a trust me bro. I am only sharing this to contribute to sharing the latest information from individual brokerages. Just because this is what I was told, should not mean anything. It’s just a data point.</strong></p>\n\n<p>I had spoken with a senior manager from the trading floor at my bank, which holds one of my brokerage accounts. My question was regarding the status of my position, as it remains in my account but is nameless.  </p>\n\n<p>At first when checking the corporate action page, he informed me there was no new information. Then, he looked into what he described as the security master — having no idea, I asked what this was, and was informed that it is an internal utility from the banks internal system. He stated:</p>\n\n<p>The security is still listed. It’s not on the market anymore, but it’s definitely still listed. It’s not deleted or terminated or anything so that is why it remains in your account. </p>\n\n<p>I then shared that I had learned from individuals with other brokerages, their positions were being renamed and gave some examples. </p>\n\n<p>He made it clear at this point that he was speaking hypothetically as his system did not indicate the same information, but explained this was common in re-organizations and it is a bookmark so that the brokerage can do a potential distribution accordingly. </p>\n\n<p>Returning back to my matter, I asked hypothetically, if this were occurring, what happens. </p>\n\n<p>He stated that the bank would be waiting for the transfer agent to send them the new holdings. Once they receive these holdings from the transfer agent, they make distributions internally amongst their clients according to the instructions from the transfer agent. This process usually takes a few working days. </p>\n\n<p>Importantly, he did state the transfer agent and not Cede and Co. I do believe this is specific to my situation, as my country’s laws require my bank to have the holdings they beneficially own on my behalf. </p>\n\n<p>Most importantly, please do not hang your hat on this information. I am relaying what I was told on the phone. I will not publicly share the recording of the phone call, as I had to provide all of my personally identifiable information to confirm my identity when speaking with the bank representative. </p>\n\n<p>This is simply to pass along the newest information I have, from my personal experience. I encourage everyone to make their own calls to their own brokerages and get their own information.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/i6k5m9nfb7sb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16yzfat/ryan_cohen_i_think_i_found_you_part_3_of_3/", "time": 1696357484.0, "subreddit": "r/ThePPShow", "title": "RYAN COHEN: I think I found you. Part 3 of 3:", "text": "<!-- SC_OFF --><div class=\"md\"><p>It seems fitting to pivot this series away from the lender relationships that I had originally planned and finish it with my newest research and findings. I would love to be disproven on this one as it has wrangled my mind for a long time. I believe docket 2310 had the answer.</p>\n\n<p>—</p>\n\n<p>I would like to expand my thoughts on Ryan Cohen&#39;s potential involvement with BBBYQ. It culminates and centres around an entry in Docket 2310 on page 109.  </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ye2tpzue51sb1.jpg?width=2796&amp;format=pjpg&amp;auto=webp&amp;s=53b02b584884e772e2f3a8ba7fddfd345ea06402\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ye2tpzue51sb1.jpg?width=2796&amp;format=pjpg&amp;auto=webp&amp;s=53b02b584884e772e2f3a8ba7fddfd345ea06402\"></a></p>\n\n<p>Attorney Ms. Becchina states that she spent one hour on:  <em>&quot;Review warrant transaction and discuss February transfer agent data re potential Section 16(b) reporting claim.&quot;</em>  There&#39;s a lot here so let&#39;s go through it together and see what we can deduce. </p>\n\n<p>—</p>\n\n<p>We can assume that the warrant transaction refers to the only known one, involving Hudson Bay Capital and filed with the SEC.  February transfer agent data would make me think that Hudson Bay may not have sold any of this position on the open market or dilute, but instead register the position with the transfer agent.  </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ffkvhxkg51sb1.png?width=1220&amp;format=png&amp;auto=webp&amp;s=83009d249c658bdc5153fe8857e82e6942bf84cf\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ffkvhxkg51sb1.png?width=1220&amp;format=png&amp;auto=webp&amp;s=83009d249c658bdc5153fe8857e82e6942bf84cf\"></a></p>\n\n<p>Section 16(b) reporting is a <strong>very</strong> specific rule that is worth explaining. It is called the <em>Short-Swing Profit Rule:</em>  The short-swing profit rule is a Securities and Exchange Commission (SEC) regulation that requires company insiders to return any profits made from the purchase and sale of company stock if both transactions occur within a six-month period. </p>\n\n<p>A company insider, as determined by the rule, is any officer, director, or shareholder who owns more than 10% of the company&#39;s shares. </p>\n\n<p><em>Hmm.</em></p>\n\n<p>Why would Hudson Bay Capital potentially be impacted by this rule?  Ryan Cohen was reporting ownership of 11.8% in SEC filings in August.  He sold his position on August 18, 2022 and HBC completed the ATM equity offering on February 8, 2023.  That is under six months, at 5 months and 20 days.  </p>\n\n<p>Does <strong>anyone</strong> know any other director, officer or 10%+ shareholder who would qualify for this Section 16(b) reporting? <em>I don&#39;t.</em> </p>\n\n<p>This further supports the idea that Hudson Bay Capital did not sell their equity into the open market and dilute/give short positions an exit-window, as was heavily pushed around the time it occurred.   </p>\n\n<p>—</p>\n\n<p>If you read the contract terms of the equity offering, HBC was allowed to accumulate equity above 9.99% ownership as &quot;blocked shares&quot; with the Company, held in abeyance. All they had to do was give written notice. Could this be why the Company had so many shares held in treasury? I speculate that it was.  </p>\n\n<p>Interestingly, Judith Cohen was suing RC Ventures for violating Section 16(b). Now, bears will say that it was regarding his purchase in March 2022 and sale in August 2022.   It very well may have began that way. But remember, the attorney is <strong>considering Section 16(b) to the February transaction</strong> with Hudson Bay.  </p>\n\n<p><em>Very interestingly,</em> Ms. Cohen dropped her lawsuit during discovery. I wonder if she was shown material, non-public information and was required to sign an NDA, or whether her attorney(s) had viewed the same through &quot;for professional eyes only.&quot; But abruptly, the lawsuit was gone.  As far as I know, no other insider would qualify for Section 16(b) — we would know! There would be SEC filings.  So why then, was Ms. Becchina reviewing Hudson Bay Capital&#39;s ATM equity offering in February and its potential Section 16(b) reporting claim? </p>\n\n<p>—</p>\n\n<p>I think I found you, Ryan Cohen. You sneaky fox!  </p>\n\n<p>I can&#39;t wait to find out.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/QjfveoxorxRKe-2xyAA076jqi6a2Uy0e1c3qNRBLc7w.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16umlsy/an_interesting_perspective_on_sec_reporting_and/", "time": 1695923381.0, "subreddit": "r/ThePPShow", "title": "An interesting perspective on SEC reporting and language from the Plan:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone! I&#39;m sorry I don&#39;t have enough time to retype my X post on here fully, I am short on time right now bigly. Here&#39;s what I am referring to: docket 1713, page 34, point 6.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/g3cwg3zka1rb1.png?width=1730&amp;format=png&amp;auto=webp&amp;s=1d977626dd2e4e345ac1960b2a1895340624b148\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/g3cwg3zka1rb1.png?width=1730&amp;format=png&amp;auto=webp&amp;s=1d977626dd2e4e345ac1960b2a1895340624b148\"></a></p>\n\n<p>I expand on the matter here: <a href=\"https://twitter.com/sboho/status/1707450807967252801\">https://twitter.com/sboho/status/1707450807967252801</a></p>\n\n<p>I&#39;m not promoting or anything like that, please don&#39;t follow or anything I just want to get the information out there.</p>\n\n<p><em>&quot;be sure to like and subscribe, hit the bell and leave a comment on what you thought of today&#39;s video guys!&quot;</em></p>\n\n<p>NO. ❌</p>\n\n<p>Just go read it please and give me your thoughts. Very interesting language that has <strong>been there since August 2,</strong> lolz.</p>\n\n<p>Peace in the streets.</p>\n</div><!-- SC_ON -->", "flair": {"text": "✒ Or Not 2b Jake ✒ 🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/sZ4eVRgbTSoSiLkSbPoOoFjyBL69r3ZQpN_JaKiPykQ.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/9cvcxp1m8uqb1.jpg", "time": 1695837854.0, "subreddit": "r/ThePPShow", "title": "I wonder if this is Ryan Cohen?", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9cvcxp1m8uqb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16oz1xn/liquidation_transactions_should_not_scare_you_in/", "time": 1695350898.0, "subreddit": "r/ThePPShow", "title": "Liquidation Transactions should not scare you. In fact, they may be the mechanism of the bull thesis:", "text": "<!-- SC_OFF --><div class=\"md\"><p>As the Effective Date nears I&#39;d just like to point out that liquidation is not that scary of a word.  </p>\n\n<p>If the Plan were to be modified, here are some things that could occur within Liquidation Transactions:  </p>\n\n<p>• one or more mergers, amalgamations, consolidations, </p>\n\n<p>• continuances, restructurings, </p>\n\n<p>• conversions, </p>\n\n<p>• or other corporate transactions</p>\n\n<p>The <em>actions</em> to implement the Liquidation Transactions may include:  </p>\n\n<p>• (a) the execution and delivery of any appropriate agreements or other documents of merger, consolidation, restructuring,.. </p>\n\n<p>• (b) the execution and delivery of appropriate instruments of transfer, assignment, assumption, or delegation <strong>of any asset,</strong> </p>\n\n<p><strong>•</strong> (c) the filing of appropriate certificates or articles of incorporation, reincorporation, merger, consolidation, conversion,..   </p>\n\n<p><a href=\"https://preview.redd.it/583jtf0mzppb1.png?width=941&amp;format=png&amp;auto=webp&amp;s=faac38325b76758d343560ea97a7916240d9a1e9\">crazy, right.</a></p>\n\n<p>&#x200B;</p>\n\n<p>Important to note, the <em>&quot;Wind Down Debtors&quot;</em> if it is created, <strong>retain all</strong> the same authority of action.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/e361jyzmzppb1.png?width=941&amp;format=png&amp;auto=webp&amp;s=5e96e75acffa764d8f5b953ba746445d425cb45a\">wow.</a></p>\n\n<p>Though the Liquidation Transactions have been talked-up to sound scary, it appears they are the mechanism by which any potential bull-thesis scenario could actually be enacted. Oh, <strong>the irony.</strong> </p>\n\n<p>The more you know.</p>\n\n<p><strong>&quot;</strong>Liquidation Transaction means any liquidation, dissolution or winding up of the Company, whether voluntary or involuntary, <strong>or</strong> the consolidation or <strong>merger of the Company</strong> into or with any other entity or entities which results in the exchange of outstanding shares of the Company for securities or other consideration issued or paid or caused to be issued or paid by any such entity or affiliate thereof..&quot;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/h558qszwzppb1.png?width=948&amp;format=png&amp;auto=webp&amp;s=c84862dca5c4a83959c5bfd151f751709dc47495\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/h558qszwzppb1.png?width=948&amp;format=png&amp;auto=webp&amp;s=c84862dca5c4a83959c5bfd151f751709dc47495\"></a></p>\n\n<p>All occurring on the Effective Date. </p>\n\n<p>Note: it appears from a lot of further reading, notice of the Effective Date will be given either: on the Effective Date, the day after the Effective Date, up to three business days after the Effective Date.</p>\n\n<p>Effective Date: when things happen.</p>\n\n<p>Notice of Effective Date: how you will know when things happen<strong>ed.</strong></p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/lvBVqd140XlxLp6YR1C3ul2B3BjR57MKPOZ5Ni-pfN8.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/16mgpsr", "time": 1695095794.0, "subreddit": "r/ThePPShow", "title": "KGP (same title at AlixPartners as Holly) , Holly Etlin and the Plan Administrator meet to discuss a.. transition?", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/fv-PkpeQMGLovdS4h0FizgUFhEEdHrLwQDg5QlUWV0g.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/juzyk26rx4pb1.png", "time": 1695095695.0, "subreddit": "r/ThePPShow", "title": "KGP (same title at AlixPartners as Holly) , Holly Etlin and the Plan Administrator meet to discuss a.. transition?", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/juzyk26rx4pb1.png\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16l80n2/hope_to_see_you_there/", "time": 1694974904.0, "subreddit": "r/ThePPShow", "title": "Hope to see you there:", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9je1r52myuob1.jpg?width=1029&amp;format=pjpg&amp;auto=webp&amp;s=d1b1c7db5b38c096b542c911b513292b4c82746f\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/9je1r52myuob1.jpg?width=1029&amp;format=pjpg&amp;auto=webp&amp;s=d1b1c7db5b38c096b542c911b513292b4c82746f\"></a></p>\n\n<p><a href=\"https://x.com/sboho/status/1703207282228523399?s=20\">https://x.com/sboho/status/1703207282228523399?s=20</a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/NuIsoaOJUnHuAYYa-3no8UOWv2mLKDyhazbxBqWtmPw.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16l7zas/hope_to_see_you_there/", "time": 1694974819.0, "subreddit": "r/ThePPShow", "title": "Hope to see you there:", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/96es7cocyuob1.jpg?width=1029&amp;format=pjpg&amp;auto=webp&amp;s=5113a26fc346d2d822e9019f4d50594e9d87ee37\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/96es7cocyuob1.jpg?width=1029&amp;format=pjpg&amp;auto=webp&amp;s=5113a26fc346d2d822e9019f4d50594e9d87ee37\"></a></p>\n\n<p><a href=\"https://x.com/sboho/status/1703207282228523399?s=20\">https://x.com/sboho/status/1703207282228523399?s=20</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/NuIsoaOJUnHuAYYa-3no8UOWv2mLKDyhazbxBqWtmPw.jpg\"/></div>"},
{"username": "jake2b", "url": "https://x.com/sboho/status/1703207282228523399?s=20", "time": 1694974697.0, "subreddit": "r/ThePPShow", "title": "Hope to see you there:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/NuIsoaOJUnHuAYYa-3no8UOWv2mLKDyhazbxBqWtmPw.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/k58cpi0yyiob1.jpg", "time": 1694829730.0, "subreddit": "r/ThePPShow", "title": "Access to information must be protected at all costs:", "text": "<!-- SC_OFF --><div class=\"md\"><p>We’re in the endgame, now. again. ™</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/k58cpi0yyiob1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16ijvjk/a_serious_discussion_about_the_8k_why_are_so_many/", "time": 1694701552.0, "subreddit": "r/ThePPShow", "title": "A serious discussion about the 8-K. Why are so many new services being paid for, this late?", "text": "<!-- SC_OFF --><div class=\"md\"><p>The last page of the 8-K is a table of Post-Petition Accounts Payable. Post-petition refers to <em>anything that occurs after you&#39;ve filed for bankruptcy.</em> Now these services do not seem as though they are consistent with a Company that will stop existing, but let&#39;s look at them to make sure.</p>\n\n<p><a href=\"https://preview.redd.it/fwd2xa94b8ob1.png?width=1640&amp;format=png&amp;auto=webp&amp;s=382064db608714513f572fd38651358a1e41bce7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/fwd2xa94b8ob1.png?width=1640&amp;format=png&amp;auto=webp&amp;s=382064db608714513f572fd38651358a1e41bce7\"></a></p>\n\n<p><strong>Workday Inc:</strong> Workday, Inc., is an American on‑demand financial management, human capital management, and student information system software vendor. </p>\n\n<p>&quot;Workday Enterprise Management Cloud gives organizations of all sizes the power to adapt through finance, HR, planning, spend management, and analytics ...&quot; </p>\n\n<p><strong>NCR Corporation:</strong> NCR Corporation, previously known as National Cash Register, is an American software, consulting and technology company providing several professional services and electronic products.</p>\n\n<p>&quot;<em>NCR</em> is the world&#39;s leading enterprise provider of software, hardware and services for banks, retailers, restaurants, small business and telecom ...&quot;</p>\n\n<p><strong>Monotype Imaging:</strong> is an American company that specializes in digital typesetting and typeface design for use with consumer electronics devices. </p>\n\n<p><em>oh?</em></p>\n\n<p>&quot;Monotype provides the design assets, technology and expertise that help you create beautiful, authentic and impactful brands that your customers will engage with and value, wherever they experience your brand, now and in the future.&quot;</p>\n\n<p><strong>Redlands Joint Venture, LLC:</strong> Not much out there, but why are you paying someone with Joint Venture in the title.. this may be in relation to the Mexico Joint Venture, might not. We don&#39;t know, yet.</p>\n\n<p><strong>Caliber Americas LLC:</strong> Caliber is part-technology company, part 4PL-provider specialized in moving fixtures, furniture, and equipment. We focus on finding the best solutions for the retail, hospitality, food &amp; beverage, and entertainment industry. Our self-developed IT system MyCaliber uniquely connects retailers, suppliers, carriers, and general contractors. This enables us to order, pick-up, and deliver to project sites with unparalleled levels of control, coordination, and cost transparency, reducing total time and money spent.</p>\n\n<p>hmm. Where is all this going to go, we&#39;re liquidating.</p>\n\n<p><strong>Akamai Technologies Inc:</strong> Akamai: Cloud Computing, Security, Content Delivery.</p>\n\n<p>&quot;Every day, billions of people connect with their favorite brands to shop online, play games, share ideas, manage money, and so much more. They may not know it, but Akamai is there, powering and protecting life online.&quot;</p>\n\n<p><em>what</em></p>\n\n<p><strong>Verizon Business Network:</strong> </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lhfs96csc8ob1.png?width=2504&amp;format=png&amp;auto=webp&amp;s=0184b6617123c75623e41aa428a8fad2c00c73b2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/lhfs96csc8ob1.png?width=2504&amp;format=png&amp;auto=webp&amp;s=0184b6617123c75623e41aa428a8fad2c00c73b2\"></a></p>\n\n<p><strong>I&#39;m beginning to have a suspicion as to why the 8-K may have been filed late.</strong></p>\n\n<p><strong>Willis Towers Watson US LLC:</strong> At WTW, we provide data-driven, insight-led solutions in the areas of people, risk and capital that make your organization more resilient, motivate your workforce, and maximize performance. Managing people, risk and capital to propel the world’s leading businesses forward.</p>\n\n<p>—</p>\n\n<p>The 8-K cannot lie. There is more than has been disclosed happening here, <em>a lot more.</em> If any of this were for Overstock or Dream on Me, I would be a very upset member of the Unsecured Creditor Committee, getting 0-2.5% recovery on my investment, knowing the Company is throwing money around at things when it won&#39;t exist. </p>\n\n<p>But if I were in the UCC, I voted in support of the Plan. I have also been under NDA since June, having weekly meetings with legal representatives of the debtors since then as well.</p>\n\n<p>Something is happening. The information in this 8-K is <strong>almost certainly</strong> the reason it is so late. </p>\n\n<p>What do you think?</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/XDA_g3zHxvFUaFwUYDIKtgJLyGyus7UsH09ibEqkmEM.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16ij70v/a_freshly_spent_766015_on_ncr_corporation_but_why/", "time": 1694699844.0, "subreddit": "r/ThePPShow", "title": "A freshly spent 766,015$ on NCR Corporation, but why? ..and some simulation fun too:", "text": "<!-- SC_OFF --><div class=\"md\"><p><em>&quot;NCR is the world&#39;s leading enterprise provider of software, hardware and services for banks, retailers, restaurants, small business and telecom ...&quot;</em></p>\n\n<p>Now why is a Company that is liquidating and not going to exist anymore spending my unrecoverable money on <strong>that</strong>?! </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ev6z8ie788ob1.png?width=1676&amp;format=png&amp;auto=webp&amp;s=5403f32afef854a8f9adf25f1d1d88abce857bd6\">fresh spend.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/38jm26ah88ob1.png?width=2478&amp;format=png&amp;auto=webp&amp;s=ef7668b740f2940af2c93cc22271107c9aace7c0\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/38jm26ah88ob1.png?width=2478&amp;format=png&amp;auto=webp&amp;s=ef7668b740f2940af2c93cc22271107c9aace7c0\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hcag1a8i88ob1.png?width=848&amp;format=png&amp;auto=webp&amp;s=50d0d8f2cc0cb4b0f7bdc0e2c29dc9f3d42b0c64\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/hcag1a8i88ob1.png?width=848&amp;format=png&amp;auto=webp&amp;s=50d0d8f2cc0cb4b0f7bdc0e2c29dc9f3d42b0c64\"></a></p>\n\n<p>This does not sound very liquid-like.</p>\n\n<p>Who knows what it means, but I will be wondering today how and why a company that will not be existing is spending money on such services.</p>\n\n<p>--</p>\n\n<p>Though that is enough of a head scratcher on its&#39; own, here&#39;s some fun to make you laugh:</p>\n\n<p><a href=\"https://preview.redd.it/alhoydr888ob1.png?width=2280&amp;format=png&amp;auto=webp&amp;s=64988efe40b9f7e8c9bd339f0e40061b40edfc20\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/alhoydr888ob1.png?width=2280&amp;format=png&amp;auto=webp&amp;s=64988efe40b9f7e8c9bd339f0e40061b40edfc20\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/84vbz1h988ob1.png?width=1740&amp;format=png&amp;auto=webp&amp;s=f0fdb6766e0e96feef6f5b4412945139c3f90039\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/84vbz1h988ob1.png?width=1740&amp;format=png&amp;auto=webp&amp;s=f0fdb6766e0e96feef6f5b4412945139c3f90039\"></a></p>\n\n<p>Now I am <strong>not</strong> saying this is why they did it, it&#39;s just hilarious.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/pfet1cO7dXTwtKaZYTL-8cN4DePufsE6FQEIg-bDhtM.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16ii38k/company_files_a_new_8k/", "time": 1694697030.0, "subreddit": "r/ThePPShow", "title": "Company files a new 8-K:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Expert Market? Not for long.</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/sec-filings/sec-filing/8-k/0001193125-23-235012\">https://bedbathandbeyond.gcs-web.com/sec-filings/sec-filing/8-k/0001193125-23-235012</a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16gvr0v/confirmation_hearing_expectations/", "time": 1694535762.0, "subreddit": "r/ThePPShow", "title": "Confirmation Hearing expectations:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, I have been doing some reading on historical Chapter 11 cases to get a sense of what to expect today.</p>\n\n<p>It turns out you can&#39;t rely much on other cases, as they are unique but let me share what I have found. I read up on Hertz, American Airlines and Delta so far.</p>\n\n<p>In Hertz, </p>\n\n<p>Disclosure Statement Hearing: April 21, 2021</p>\n\n<p>Voting deadline: June 1, 2021</p>\n\n<p>Confirmation Hearing: June 10, 2021</p>\n\n<p>Effective Date: June 30, 2021</p>\n\n<p>notes: Hertz Plan was <strong>confirmed during the Confirmation Hearing.</strong> Interestingly, it seems the Effective Date was announced on the Effective Date but I cannot confirm this. All the online sources PR Newswire, Reuters, CNBC sent out articles on June 30 that the company emerged out of Chapter 11 and the Effective Date is <em>now.</em></p>\n\n<p>Also important to add, Hertz held an auction which may have dictated the deadlines. </p>\n\n<p>—</p>\n\n<p>In American Airlines,</p>\n\n<p>Confirmation Hearing: August 15, 2013</p>\n\n<p>Judge &quot;rules&quot; to sign on the Confirmation: September 13, 2013</p>\n\n<p>notes: So the Judge can walk out of the Confirmation Hearing without making a decision, <strong>but importantly</strong> in this case, there was a DOJ investigation into I believe the CEO receiving a 20M$ severance (lolz) at the time the Confirmation Hearing so I don&#39;t know if because of the investigation, this was the reason the Judge waited.</p>\n\n<p>—</p>\n\n<p>In Delta Airlines,</p>\n\n<p>Delta issues a press release about the Vote ending: April 16, 2007</p>\n\n<p>Confirmation Hearing: April 25, 2007</p>\n\n<p>Effective Date: April 30, 2007.</p>\n\n<p>notes: </p>\n\n<p><em>&quot;The next milestone in Delta’s bankruptcy proceeding will be April 25 when the court will be asked to confirm Delta’s Plan of Reorganization, allowing the airline to exit Chapter 11. On Feb. 7, Delta received court approval of its Disclosure Statement and the authorization to solicit votes from creditors on its plan of reorganization.  Voting on the plan ended April 9.&quot;</em></p>\n\n<p>Some dates there. Importantly, during the Confirmation Hearing the Judge was quoted by Reuters as saying: <em>“I will sign the confirmation order,” Judge Adlai Hardin said at a hearing in U.S. bankruptcy court in New York.&quot;</em></p>\n\n<p>Again, all the articles on the topic are dated April 30, 2013 saying that the company emerges out of bankruptcy today. So again I don&#39;t know if this was known ahead of time, or was just dropped when it went live.</p>\n\n<p>I will continue looking into other cases as I believe the legal strategy for this afternoon&#39;s Hearing is to get the Confirmation. As such, I do not think that the debtors would be revealing drastic changes, because this would open up the possibility for objections and potentially delays, but maybe I am wrong! I don&#39;t know anything.</p>\n\n<p>What I do know is that the debtors used language in a docket allowing them to alter the Plan up until the Effective Date, so if I don&#39;t hear anything at the Confirmation Hearing I will not assume that means no further changes could potentially come.</p>\n\n<p>👍🏼</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/16g283d", "time": 1694455116.0, "subreddit": "r/ThePPShow", "title": "AlixPartners Fee Statement for July: NOL's still haven't \"vanished\"; our first anonymous legal entity?", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/sapg-0aEhn2E45ihvBoG2kt2ZVm5jmYPAUPakJGoszY.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16fkh9l/a_quick_note_about_my_previous_comments_on_the/", "time": 1694402303.0, "subreddit": "r/ThePPShow", "title": "A quick note about my previous comments on the Effective Date:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Thanks to Kaiser on discord for bringing this into the light. </p>\n\n<p>I had previously mentioned how the Effective Date is typically 30 days after the Confirmation Hearing, but could be requested shorter by the debtors. </p>\n\n<p>Well it turns out it may be *much* shorter. </p>\n\n<p>Docket 2134, page 75:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nkm5o606hjnb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=c0e71269473d20184fb9467929e30f8653c39efc\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/nkm5o606hjnb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=c0e71269473d20184fb9467929e30f8653c39efc\"></a></p>\n\n<p>So Rule 3020(e) says: <em>&quot;(e) Stay of Confirmation Order. An order confirming a plan is stayed until the expiration of 14 days after the entry of the order, unless the court orders otherwise.&quot;</em></p>\n\n<p>A stay means: </p>\n\n<p><em>stay</em></p>\n\n<p><em>Stay is an action taken by a court to stop a</em> <em>legal proceeding</em> <em>or the actions of a party.</em> </p>\n\n<p><em>A stay may also refer to an</em> <em>automatic stay</em> <em>which is a statutory requirement that a party not pursue some right. Automatic stays are most popular for bankruptcy where creditors are “stayed” from pursuing payments from the debtor until the bankruptcy proceedings have ended.</em> </p>\n\n<p>Just for context. So a stay is a stop. </p>\n\n<p>Typically after the Confirmation Hearing, let&#39;s assume the Plan is approved, there is a 14-day stop period.</p>\n\n<p>3020(e):</p>\n\n<p><a href=\"https://preview.redd.it/e5mmmeauijnb1.png?width=1524&amp;format=png&amp;auto=webp&amp;s=c30ece4d64a01688ed0995cdcfd2db23621490d9\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/e5mmmeauijnb1.png?width=1524&amp;format=png&amp;auto=webp&amp;s=c30ece4d64a01688ed0995cdcfd2db23621490d9\"></a></p>\n\n<p>So the Company does not want to wait the 14 days. Let&#39;s go back to the language in Docket 2134.</p>\n\n<p><em>&quot;Given the</em> <strong><em>complexity</em></strong> <em>of the Plan and the</em> <strong><em>various transactions</em></strong> <em>implicated by the Plan,&quot;</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5anc3ceejjnb1.jpg?width=861&amp;format=pjpg&amp;auto=webp&amp;s=a5955bc8cc59dacdb6218b62224bddec51b3dd5e\">I was told this was a simple liquidation.</a></p>\n\n<p>Just kidding, we don&#39;t <strong>know</strong> anything, but it is interesting language used as a reason to hurry up.</p>\n\n<p><em>&quot;the Debtors may take certain steps to effectuate the Plan..&quot;</em></p>\n\n<p><em>&quot;..in anticipation of and to facilitate the occurrence of the Effective Date..&quot;</em></p>\n\n<p><em>&quot;..so that the Effective Date can occur promptly.&quot;</em></p>\n\n<p>So they are going to start taking steps even before this waiver is approved, so that they are ready to implement the Effective Date, real fast.</p>\n\n<p>Hmm. OK so bears will say shareholders are fuk because this means that if the Judge says OK approved then that&#39;s it, that&#39;s all. Well, no, that&#39;s not certain. They are asking to waive the 14-day stay. What if the Effective Date is the end of the week? The next day? No one knows, so don&#39;t let the FUD get to you.</p>\n\n<p><em>&quot;Therefore, good cause exists to waive any stay imposed by the Bankruptcy Rules so that the proposed Confirmation Order may be effective immediately upon its entry.&quot;</em></p>\n\n<p>I <strong>really</strong> don&#39;t think they will be waiting 30 days. Notice the language here though, they do <strong>not</strong> say the <em>Effective Date</em> may be effective immediately, they say the <strong>Confirmation Order.</strong> </p>\n\n<p>So if the Confirmation Order says we want the Effective Date to be&quot; Wednesday 13 September or Friday 15 September, <em>that</em> is what would be effective immediately upon its entry. <strong>Not</strong> necessarily a shareholder wipeout.</p>\n\n<p>Although this continues to be a highly speculative, &quot;zero-or-hero&quot; type play, I find it so interesting that even as time passes, more dockets are released, more information is provided, there is no explicit, conclusive and definitive way to say the bullish theory of a down-the-road Plan change cannot occur. </p>\n\n<p>Hypothetically, the Effective Date is Monday. What if a Supplement is released on the Sunday night before? Or if Friday, Thursday evening outside of market hours? The possibility exists which I find amazing and hilarious.</p>\n\n<p>—</p>\n\n<p>Now, a status update. I have been doing a lot of reading lately, less posting. Where I am at on some things I yet do not fully understand:</p>\n\n<p>The Plan was not approved by Class 6, therefore there is no consensual Plan. Thanks <a href=\"/u/theorico\">u/theorico</a> who informed me that in order to have a Plan Supplement that would save shareholders, Class 6 must be paid first according to the waterfall provision / absolutely priority rule.</p>\n\n<p>So I have been searching for any data to say how much Class 6 is owed. A brief summary:</p>\n\n<p>DIP: 240M, FILO: 347M (200 was sent to DIP) = 547M.</p>\n\n<p>Bonds: 1.1B. Bonds and DIP FILO = 1.647B</p>\n\n<p>Total funded debt — as last reported — was 1.8B.</p>\n\n<p>1.8B - 1.647B = potentially Class 6 claims are as low as 153M? </p>\n\n<p>Doesn&#39;t seem insurmountable to pay Class 6 or convert to equity to satisfy their claim?</p>\n\n<p>If anyone has any leads or data on Class 6 claims, please let me know! I have been looking for this for a long time.</p>\n\n<p>Also, there is a cram down rule, where the Judge can pass a Plan that was not voted on unanimously, but I have been told this cannot happen without satisfying Class 6. </p>\n\n<p>I need to read more on the waterfall provision, the cram down and how they interplay in the current situation. </p>\n\n<p>—</p>\n\n<p>Now, some fun because I get the impression everyone is very nervous and serious as &quot;the date&quot; approaches.</p>\n\n<p>EHM was the backup bidder behind Dream on Me. So I guess, 3rd? Because Dream on Me was the second-highest bid. Explain that to creditors if this were a liquidation.. </p>\n\n<p>So Everyday Health Media was bought by Ziff Davis and merged into them in 2016. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/53maixzkmjnb1.png?width=1952&amp;format=png&amp;auto=webp&amp;s=c03a86f121010f51e8541c75b771ca9557c7ef82\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/53maixzkmjnb1.png?width=1952&amp;format=png&amp;auto=webp&amp;s=c03a86f121010f51e8541c75b771ca9557c7ef82\"></a></p>\n\n<p>j2 Global provided Internet services through two divisions, <em>Business Cloud Services</em> and Digital Media. Since 2016 they just amalgamated into Ziff Davis. </p>\n\n<p>Ziff Davis owns IGN.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/k4egrrimmjnb1.png?width=764&amp;format=png&amp;auto=webp&amp;s=7a0688cec38144aa1494284cb2b0ae47ba3a9de6\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/k4egrrimmjnb1.png?width=764&amp;format=png&amp;auto=webp&amp;s=7a0688cec38144aa1494284cb2b0ae47ba3a9de6\"></a></p>\n\n<p>Yea, the <strong>gaming</strong> IGN. Very interesting timing for GME to get a completely new credit agreement on May 11, shortly after the Chapter 11.. </p>\n\n<p>..and then on May 12, Teddy renews the trademark applications.</p>\n\n<p>See, fun! </p>\n\n<p>Thanks everyone for the love on pp show, the sub and on X. I&#39;ve been fortunate to be a speaker on some spaces and carry gratitude as well as responsibility being given a voice. Everyone has been kind and supportive and at the very least, you all deserve my thanks. </p>\n\n<p><em>thank you!</em></p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ZAfNakeRlnByML_DwYaBQCTFA20DqHsr6TMsZU_W50U.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/rcox7zy12zmb1.png", "time": 1694152812.0, "subreddit": "r/ThePPShow", "title": "The Stage is Set. Now, the waiting begins.", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rcox7zy12zmb1.png\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16czmvm/what_timing_to_talk_about_on_the_pp_show_the_plan/", "time": 1694144227.0, "subreddit": "r/ThePPShow", "title": "What timing to talk about on the PP show; the Plan Supplement has been filed:", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjUxNjQwMQ==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjUxNjQwMQ==&amp;id2=-1</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/39itq3yy1umb1.png", "time": 1694092261.0, "subreddit": "r/ThePPShow", "title": "PP Show next week:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/39itq3yy1umb1.png\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16a2czc/alvarez_marsal_fee_statement_a_look_behind_the/", "time": 1693857804.0, "subreddit": "r/ThePPShow", "title": "Alvarez &amp; Marsal Fee Statement: A Look Behind the Curtain — Subpoenas, Discovery and Historical Business Analysis being conducted. But why?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Wow so a big thanks to <a href=\"/u/mastermindchilly\">u/mastermindchilly</a> and their post here: </p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/169vtag/docket_2096_analyzing_debtors_document_production/\">https://www.reddit.com/r/ThePPShow/comments/169vtag/docket_2096_analyzing_debtors_document_production/</a></p>\n\n<p>It made me have a look at Docket 2096 and wow, I was not expecting to find what I did. Behind the scenes there is something brewing. I speculate that a party is questioning whether the company needed to file for Chapter 11 and if I were to speculate further, would it be to prevent a successful emergence? Let&#39;s have a look at the docket and see.</p>\n\n<p>This first series of images is from the &quot;Financial and Operational Matters&quot; fee section and it displays some very ..curious information:</p>\n\n<p><a href=\"https://preview.redd.it/nl7l52l8jamb1.png?width=1870&amp;format=png&amp;auto=webp&amp;s=7e401d9171d68562275a6a3936c052da92527eaa\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/nl7l52l8jamb1.png?width=1870&amp;format=png&amp;auto=webp&amp;s=7e401d9171d68562275a6a3936c052da92527eaa\"></a></p>\n\n<p>A subpoena arrives shortly after the Baby IP auction is cancelled. The next highlight is reviewing the production of the document — production in this sense refers to &quot;producing what is required&quot; — but the description, responsive solvency documents. What does this mean? I am not sure but I hope <a href=\"/u/travis_b13\">u/travis_b13</a> or accounting-knowledgable users can help shed some light. Solvency documents part however, that caught my attention. Further:</p>\n\n<p><a href=\"https://preview.redd.it/38v1qvy9jamb1.png?width=1870&amp;format=png&amp;auto=webp&amp;s=34963ea307919d5ee0aff0b4f795d4cb08051703\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/38v1qvy9jamb1.png?width=1870&amp;format=png&amp;auto=webp&amp;s=34963ea307919d5ee0aff0b4f795d4cb08051703\"></a></p>\n\n<p>More details potentially about the contents of the subpoena. the debtors (Company) are preparing documents on the subject of solvency items, D&amp;O insurance and cash forecasts. But why? FYI: Directors and Officers (D&amp;O) liability insurance is <em>&quot;coverage intended to protect individuals from personal losses if they are sued as a result of serving as a director or an officer of a business or other type of organization.&quot;</em></p>\n\n<p><a href=\"https://preview.redd.it/289dbumbjamb1.png?width=1386&amp;format=png&amp;auto=webp&amp;s=c9b004e0cc392bb68edf09eb3dac268ea3f0f66c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/289dbumbjamb1.png?width=1386&amp;format=png&amp;auto=webp&amp;s=c9b004e0cc392bb68edf09eb3dac268ea3f0f66c\"></a></p>\n\n<p>Further potential explanation about the contents of the subpoena and more detailed historical data about the Company including historical transactions, financial statements and SEC filings, capital expenditures. It appears someone wants a clear chronological accounting of the Company&#39;s recent  performance.</p>\n\n<p><a href=\"https://preview.redd.it/cdhrf6qcjamb1.png?width=1336&amp;format=png&amp;auto=webp&amp;s=f72fc21f41f378846c7191b2cb1b6f419a0fb5e2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/cdhrf6qcjamb1.png?width=1336&amp;format=png&amp;auto=webp&amp;s=f72fc21f41f378846c7191b2cb1b6f419a0fb5e2\"></a></p>\n\n<p>Even more, this time adding restructuring matters, emails (wow), opinions on an audit and I interpret this as all materials the Company has relating to their filing for Chapter 11. </p>\n\n<p><a href=\"https://preview.redd.it/y6xvpm5fjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=b7dfa19c231fb4445c242146e584ffdb3c7ac651\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/y6xvpm5fjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=b7dfa19c231fb4445c242146e584ffdb3c7ac651\"></a></p>\n\n<p>Really getting into the nitty-gritty, wanting potentially all details surrounding credit agreements and amendments, negotiation materials for the FILO and ABL, <strong>a timeline of events,</strong> and general analysis of how the documents production is being prepared and provided to counter parties.</p>\n\n<p><a href=\"https://preview.redd.it/mbb7vrrfjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=ac8be6b2d076fbcd8f1300ceb8cecf1281dbf2dc\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/mbb7vrrfjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=ac8be6b2d076fbcd8f1300ceb8cecf1281dbf2dc\"></a></p>\n\n<p>More digging, the more I read it the more it seems as though someone wants to challenge whether the Company needed to go into Chapter 11.</p>\n\n<p><a href=\"https://preview.redd.it/zduuwbfgjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=b3dd91cc38ceca8f6fc584cb6a2e4d9f7ab35c25\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/zduuwbfgjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=b3dd91cc38ceca8f6fc584cb6a2e4d9f7ab35c25\"></a></p>\n\n<p>Even more specifically than the credit agreements, now the warrant and preferred stock issuance documentation and communication. Basically all of 2023 is on this page. Of note: for the first time, Pachulski is mentioned here issuing a subpoena but it can&#39;t be stated if this is <em>the</em> subpoena in question, or perhaps a counter going the other way. Pachulski is the legal team for the UCC.</p>\n\n<p>You&#39;ll also notice Form 12b-25, that is known as the: <em>&quot;Notification of Late Filing, SEC Form 12b-25 is filed with the SEC by a company that determines it is unable to file a required periodic report when it is due without unreasonable effort or expense for SEC Form 10-K..&quot;</em> So someone wants to know why the 10-K was late.</p>\n\n<p><a href=\"https://preview.redd.it/sc9ugfthjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=9ba226b20e56bab65262c01133bbe54660c7d952\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/sc9ugfthjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=9ba226b20e56bab65262c01133bbe54660c7d952\"></a></p>\n\n<p>Mark Greenberg is very senior at Alvarez and Marsal, supervising what is being put into the documents to comply with the subpoena. More interesting topics to be requesting information for.</p>\n\n<p><a href=\"https://preview.redd.it/xe04mnijjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=adf57246ae6feb7442704cedb2872750ae9b095e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/xe04mnijjamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=adf57246ae6feb7442704cedb2872750ae9b095e\"></a></p>\n\n<p>And wait a second; under a new subsection of the fee statement, Mr. Greenberg is on the phone with the UCC to discuss <strong>the status of the case.</strong> That&#39;s a development. This also makes me think that the Pachulski subpoena would be &quot;friendly&quot; but I do not know for certain.</p>\n\n<p>Moving on, under the subsection of Potential Avoidance/Litigation Matters we see <strong>investigation strategy.</strong> Could this be in the other direction? I don&#39;t know, but it is worth noting.</p>\n\n<p><a href=\"https://preview.redd.it/2gkruhvdnamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=6cffde124438c0d5568da6542c2a74d32b28afb8\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/2gkruhvdnamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=6cffde124438c0d5568da6542c2a74d32b28afb8\"></a></p>\n\n<p>M3 Partners are involved in the collaboration regarding this investigation strategy. </p>\n\n<p><a href=\"https://preview.redd.it/jbr1rpuonamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=352657c53e575554515f1a1fc8e4a3fcb5b8ef9e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/jbr1rpuonamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=352657c53e575554515f1a1fc8e4a3fcb5b8ef9e\"></a></p>\n\n<p>Continued under Potential Actions/Litigation Matters, more strategizing. </p>\n\n<p><a href=\"https://preview.redd.it/f41td0ntnamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=b6848888d52b07592e5e17a9170cb48de4c260c0\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/f41td0ntnamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=b6848888d52b07592e5e17a9170cb48de4c260c0\"></a></p>\n\n<p>That&#39;s all for now, I have to admit I am in a rush and so I didn&#39;t add as much writing as I wanted, but perhaps this is better. I&#39;d love to hear what everyone thinks of this and what it could potentially mean. </p>\n\n<p>I&#39;ll end on a happy note:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lgkoeo1hoamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=9ee00c71cc265141619962cf427aaa5870824fdd\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/lgkoeo1hoamb1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=9ee00c71cc265141619962cf427aaa5870824fdd\"></a></p>\n\n<p>As they are wrapping up the BuyBuy Baby IP sale and cancelling the auction, the legal teams are reviewing how the sales could either impact the NOL, or maybe assessing the current value, or who knows. But there&#39;s NOL doubt it is a matter of interest to the legal teams leading up to the Baby IP sale.</p>\n\n<p>Curious to hear what everyone thinks. There&#39;s more from the docket (on another subject) that I left out to keep the focus of this one on the subpoena and investigation. </p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/L2guJRIuobxxq8Q2ZtA00ApgWqdUCNJ-atmVnfb7fak.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/fk55i2xm3vlb1.png", "time": 1693669070.0, "subreddit": "r/ThePPShow", "title": "Tamar Donikyan of Kirkland and Ellis describes her role with BBBY:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/fk55i2xm3vlb1.png\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/167guam", "time": 1693597129.0, "subreddit": "r/ThePPShow", "title": "Pachulski Fee Statement initial tidbits:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/pDRnWjNzISJXTFBl-5hrcBm4MPIMwRw8kIaBwO8MjnI.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/166i7ju/ryan_cohen_bypassed_recipient_possibly_solved/", "time": 1693504957.0, "subreddit": "r/ThePPShow", "title": "Ryan Cohen Bypassed Recipient possibly solved?", "text": "<!-- SC_OFF --><div class=\"md\"><p>A1 work to <a href=\"/u/Famous_Variety\">u/Famous_Variety</a> and their post here:</p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/166ectl/rc_and_pals_have_control_through_the_series_a/\">https://www.reddit.com/r/ThePPShow/comments/166ectl/rc_and_pals_have_control_through_the_series_a/</a></p>\n\n<p>For further background reading, I had written about HBC being a potential proxy for Common Stock acquisition here:</p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/16554cv/is_hudson_bay_capital_potentially_the_proxy/\">https://www.reddit.com/r/ThePPShow/comments/16554cv/is_hudson_bay_capital_potentially_the_proxy/</a></p>\n\n<p>Famous_Variety&#39;s post gave me an aha moment for Ryan Cohen and the bypassed recipient and creditor scenario.</p>\n\n<p>Through Section 3(a)(9) of the Securities Act of 1933, any conversion of Warrant into Preferred and then subsequent conversion of Preferred into Common Stock is <strong>exempt from SEC registration.</strong></p>\n\n<p><a href=\"https://preview.redd.it/hj4ymcstghlb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=91b190e1ffa9b2234cb67fc1075599e79f7759ad\">See last paragraph. March 30, 2023 8-K</a></p>\n\n<p><em>&quot;Section 3(a)(9) of the Securities Act of 1933 provides an</em> <strong><em>exemption from the registration requirements of Section 5,</em></strong> <em>and in particular exempts transactions as follows:</em> <strong><em>“[E]xcept with respect to a security exchanged in a case under title 11 of the United States Code,</em></strong> <em>any security exchanged by the issuer with its existing security holders exclusively where no commission or other remuneration is paid or given directly or indirectly for soliciting such exchange.”</em></p>\n\n<p><em>Since</em> <strong><em>Section 3(a)(9) is a transactional exemption,</em></strong> <em>the new securities issued are subject to the same restrictions on transferability, if any, as the old securities, and any</em> <strong><em>subsequent</em></strong><em>transfer of the newly issued securities</em> <strong><em>will require registration or another exemption from registration.</em></strong> <em>However, since the new securities take on the character of the old securities, tacking of a holding period is generally permitted, allowing for subsequent resales under Rule 144 (assuming all other conditions have been satisfied for use of such rule).</em></p>\n\n<p><em>In particular, Rule 144(d)(3)(ii) provides that where securities are acquired from an issuer solely in exchange for other securities of the same issuer, the newly acquired securities may tack onto the holding period and shall be deemed to have been acquired at the same time as the securities surrendered for conversion, even if the securities surrendered were not convertible or exchangeable by their terms. Moreover, in accordance with Rule 144, even if a promissory note does not have a conversion feature, the issuer and investor can agree to conversion terms and still benefit from a tacking on the holding period.</em></p>\n\n<p><strong><em>Section 3(a)(9) exchanges have gained in popularity as many investors are willing to fund public companies</em></strong> <em>with convertible promissory notes which notes convert into freely tradable stock upon expiration of the Rule 144 holding period, again assuming all other conditions are satisfied. For more information regarding the satisfaction of other conditions (such as non-affiliate status of the shareholder, current information by the issuer, shell status of the issuer, etc.), please see my blog on Rule 144 posted here.&quot;</em></p>\n\n<p>Emphasis mine.</p>\n\n<p><a href=\"https://www.legalandcompliance.com/section-3a9/#:%7E:text=Section%203(a\">https://www.legalandcompliance.com/section-3a9/#:~:text=Section%203(a)(9)%20exempts%20any%20securities%20exchange%20by,times%20be%20a%20successor%20issuer</a>(9)%20exempts%20any%20securities%20exchange%20by,times%20be%20a%20successor%20issuer)</p>\n\n<p>As long as the conversion occurred prior to April 23, there would be no reporting requirement.</p>\n\n<p>Further, despite this we know that HBC had been reporting 24M ownership as of their second-most recent 8-K. Then, the SEC stopped requiring reporting on the stock and their most-recent filing shows 0.</p>\n\n<p><strong>But why would they be reporting 24M shares if they are exempt?</strong> Section 3(a)(9) does not cover bankruptcy (title 11).</p>\n\n<p>Could the remaining warrants and preferred have been triggered into conversion as a result of the Chapter 11 filing?</p>\n\n<p><a href=\"https://preview.redd.it/8ihmx07aihlb1.png?width=2060&amp;format=png&amp;auto=webp&amp;s=5a2addf6056526e738cdf9f1b960976bf5168581\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/8ihmx07aihlb1.png?width=2060&amp;format=png&amp;auto=webp&amp;s=5a2addf6056526e738cdf9f1b960976bf5168581\"></a></p>\n\n<p>I suspect they were. </p>\n\n<p><strong>What does all this mean?</strong> If HBC is the proxy for Ryan Cohen beneficially acquiring shares, it plausibly explains why he is listed as a creditor and bypassed recipient. The shares converted are <strong>considered a debt to the company.</strong></p>\n\n<p><a href=\"https://preview.redd.it/aqumtutzihlb1.png?width=1544&amp;format=png&amp;auto=webp&amp;s=a8714562298dfda6c98c9c1c9922fa41118a939f\">June-filed 10-K</a></p>\n\n<p>So if HBC is acting as a proxy for Ryan Cohen, could he be considered a creditor if these converted shares are a liability to the company? I will dig to determine this conclusively.</p>\n\n<p>It also explains his Bypassed Recipient status as he would be a duplicate recipient with HBC and/or their legal representation. It also conveniently explains his pro-se self-representation without an attorney.</p>\n\n<p>Thoughts?</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/FVJ_puluCwqfm92ATGo9lIA2hsRNMlufZQDUZyA5CuY.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/165xbbl", "time": 1693445929.0, "subreddit": "r/ThePPShow", "title": "Continued focused and very interesting activity from Lazard in their Fee Statement:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/zxRx6YBNYX48bFCb6zJYAcA5esv-JMyNnmDT76v_yAY.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/16554cv/is_hudson_bay_capital_potentially_the_proxy/", "time": 1693370893.0, "subreddit": "r/ThePPShow", "title": "Is Hudson Bay Capital potentially the proxy holding entity? Let's see:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Thank you to <a href=\"/u/Region_Formal\">u/Region_Formal</a> for their great post today which reminded me to revisit the March 30, 2023 8-K.</p>\n\n<p>Let&#39;s get right into it.</p>\n\n<p><a href=\"https://preview.redd.it/0g2l8d7la6lb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=c31e8ebf89fa42a3d23c3dd4ab83b126540ce0a6\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/0g2l8d7la6lb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=c31e8ebf89fa42a3d23c3dd4ab83b126540ce0a6\"></a></p>\n\n<p>HBC Investments LLC, Hudson Bay Master Fund, Hudson Bay Capital. They always have so many names. </p>\n\n<p>So February 7, the Company uses B. Riley Securities as an underwriter for the preferred shares and warrants. HBC Investments buys the warrants.</p>\n\n<p>Here&#39;s the important distinction to get any potential, actual share count that HBC has. Warrants can be traded for Series A, Series A can be converted for Common Stock. <strong>Importantly, at the same time Warrants and Series A do not have voting rights until they are converted.</strong></p>\n\n<p>So, the second Recital paragraph says: <strong>As of March 30, 2023,</strong> HBC Investments holds Series A Preferred Stock either bought from B. Riley <strong>and/or</strong> (important but ambiguous language) exercised (converted) Warrants into Series A Preferred Stock <strong>AND</strong> <strong>ALSO</strong>, Preferred Stock Warrants which can be exercised (converted) <strong>into an additional</strong> 70,004 Series A Preferred.</p>\n\n<p>That&#39;s going to need a count..</p>\n\n<p>Now, thanks again Region, super importantly, any Warrants converted into Common Stock <strong>do not require SEC disclosure.</strong></p>\n\n<p>It&#39;s only <em>beginning</em> to get interesting.</p>\n\n<p><a href=\"https://preview.redd.it/fkjj4688c6lb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=bed9444c05f6735a54041537765cbb615a206931\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/fkjj4688c6lb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=bed9444c05f6735a54041537765cbb615a206931\"></a></p>\n\n<p>As of March 30, 2023, the Company has 428M shares of Common Stock issued and outstanding — OK.</p>\n\n<p>As long as <strong>ANY</strong> Preferred Shares <strong>OR</strong> Rights (to shares) remain outstanding (active) by HBC Investments, the Company has to make sure it has no less than 100% (has to have all) the end-result Common Stock of <strong>ALL</strong> the Preferred Shares (Series A) then outstanding. </p>\n\n<p><strong>What does this mean?</strong> As long as HBC has ANY remaining Rights (interests), the Company is not allowed to release the entire TSO into the market. As in, as long as HBC is in, <strong>the float cannot be the entire 739M shares of the TSO.</strong></p>\n\n<p><strong>SPICY TIME!</strong> </p>\n\n<p>At no time shall the number of Common Stock reserved exceed 139,930,168 shares. <em>But remember!</em> The Company has to have at all times no less than 100% — ALL SHARES — of then outstanding HBC Preferred Shares. </p>\n\n<p>139,930,168 shares? According to Docket 1716 <em>&quot;approximately 739,056,836 shares of voting common shares were outstanding.&quot;</em></p>\n\n<p>I think <strong>this is why</strong> they used the &quot;voting common shares&quot; language at that time. </p>\n\n<p>739,056,836 — 139,930,168 = 599,126,668 &quot;available&quot; TSO. And we also know 295M shares are being held in treasury as of the day they filed for Chapter 11. If HBC is still holding this position, <em>which we don&#39;t know,</em> <strong>potentially the &quot;free float&quot; becomes approximately 304M shares.</strong></p>\n\n<p>139,930,168 / 739,056,836 = <strong>18.9% ownership.</strong> </p>\n\n<p><a href=\"https://preview.redd.it/0goufrj8f6lb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=289f6877a8b66882f754bb78842a97b68f7a0393\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/0goufrj8f6lb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=289f6877a8b66882f754bb78842a97b68f7a0393\"></a></p>\n\n<p><a href=\"https://preview.redd.it/oa9x9gr9f6lb1.png?width=1296&amp;format=png&amp;auto=webp&amp;s=502eea9a190b3fcde7564f1de5258a2f8d220adc\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/oa9x9gr9f6lb1.png?width=1296&amp;format=png&amp;auto=webp&amp;s=502eea9a190b3fcde7564f1de5258a2f8d220adc\"></a></p>\n\n<p>Remember the Lazard Dealer-Manager Agreement? <strong>HBC can be holding this position as a proxy,</strong> for any of their attribution parties. Read that again. <em>ohmaifuk.</em></p>\n\n<p>I&#39;m starting to wonder why there was so much FUD surrounding Hudson Bay. Dilution! Selling to line their pockets! Hudson Bay bad! Who knows. Crazy shit. Thank you Region for reminding me about the March 30 8-K.</p>\n\n<p>Before Docket 2067, I would have no idea if HBC was still in. SEC data says their position is 0, but I believe this is because the SEC does not require reporting ownership of this stock anymore and that was an automated pull of the data. After all, all &gt;4.5% holders cannot touch their position as was ruled by the Judge. Then, there was this:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/08q3y84qg6lb1.png?width=1824&amp;format=png&amp;auto=webp&amp;s=5bf74399c0749946056243d961dd43fac4f585b4\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/08q3y84qg6lb1.png?width=1824&amp;format=png&amp;auto=webp&amp;s=5bf74399c0749946056243d961dd43fac4f585b4\"></a></p>\n\n<p>I do not believe they exited. <strong>I speculate that they are the proxy holding for the potential buyer or buyer group, in accordance with the Lazard DMA.</strong> </p>\n\n<p>—</p>\n\n<p>Also as a side note, a lot of questions surrounding DWAC. Well, I still haven&#39;t read up on it but I thought everyone would want to know that HBC uses them.</p>\n\n<p><a href=\"https://preview.redd.it/zj0gn8vxf6lb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=6cc971654ce007fdf242da356bd86a077b20675e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/zj0gn8vxf6lb1.png?width=2058&amp;format=png&amp;auto=webp&amp;s=6cc971654ce007fdf242da356bd86a077b20675e\"></a></p>\n\n<p>Thanks for reading.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Y7TQIAi1bSI1uKCj2dQigHDLApQT9esmu0f3QxpSjwA.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/164imec/i_want_to_reiterate_some_points_from_last_nights/", "time": 1693315933.0, "subreddit": "r/ThePPShow", "title": "I want to reiterate some points from last night's PP Show:", "text": "<!-- SC_OFF --><div class=\"md\"><p>I want to apologize to everyone for not presenting important information clearly last night on the show and I want to take a moment to reiterate the points I was trying to make, more clearly. </p>\n\n<p>Looking back at the older fee statements, the bulk of the analysis was done from the section titled &quot;Asset Sales/Section 363/Use, Sale &amp; Disp&quot; — Disp being disposition. </p>\n\n<p>Naturally, asset sales is self-explanatory and made sense for the context; IP sales, auction, APA and related.</p>\n\n<p>Section 363 is a section of the Bankruptcy Code that <em>&quot;allows a company to sell its assets outside of the ordinary course of business during bankruptcy proceedings.&quot;</em></p>\n\n<p>Disposition means getting rid of things, such as the leases.</p>\n\n<p>—</p>\n\n<p>I can’t stress this enough and I feel that I did not communicate it as clearly as I intended on last night show, we have <strong>pivoted away completely</strong> from that in the July fee statement. We are now conducting analysis under the &quot;Corporate and Governance Matters&quot; billing subsection.</p>\n\n<p>I cannot over state how significant this is.</p>\n\n<p><em>&quot;Corporate governance is the</em> <em>system of rules, practices, and processes</em> <em>by which a firm is directed and controlled. Corporate governance essentially involves balancing the interests of a company&#39;s many stakeholders, such as shareholders, senior management executives, customers, suppliers, financiers, the government, and the community.&quot;</em></p>\n\n<p>You can simplify this to essentially say <em>&quot;the fiduciary relationship between directors and stakeholders.</em><em>&quot;</em></p>\n\n<p>Now, with this context in mind, I want to reintroduce something:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/38j6tp6st1lb1.png?width=972&amp;format=png&amp;auto=webp&amp;s=4701bc8768ce08184872a52951ac39512ece75ee\">Baby Acquisition, stock matter, AST instruction letter.</a></p>\n\n<p>Baby acquisition. Not APA sales, not IP; <strong>acquisition</strong> in the context of fiduciary relationship between directors and stakeholders. This is an extraordinary clue in the docket when you consider how much time has been spent removing confidential information. Just imagine what was in there before the redactions.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9qzq690au1lb1.png?width=972&amp;format=png&amp;auto=webp&amp;s=9c3be5fb7a2a5d6157359c481bb314a3788fb93e\">Hudson Bay Capital and potentially their warrants/preferred stock going over the 19.99&#37; ownership threshold. Share count. AST correspondence.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/6qw3y67uu1lb1.png?width=1908&amp;format=png&amp;auto=webp&amp;s=fba250fa0e40b00ad14c9ffaa8dbffa8971a562c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/6qw3y67uu1lb1.png?width=1908&amp;format=png&amp;auto=webp&amp;s=fba250fa0e40b00ad14c9ffaa8dbffa8971a562c\"></a></p>\n\n<p>HBC and the greater than 19.99% ownership. Remember how the Ryan Cohen standstill agreement allowed him to <strong>beneficially</strong> own up to 19.99%? That is an interesting coincidence.</p>\n\n<p>Share count, delisting process, future SEC disclosures.</p>\n\n<p>Section 16 requirements.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/m2iapo2rv1lb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=c70f708d8c3142adf90e66ba1ee1d4b9ccb525c1\">Section 16: new directors, officers and new significant shareholders.</a></p>\n\n<p>Why, on July 25 is Kirkland discussing claims about Form 3, 4, and 5? Is this not, <strong>despite MSM &quot;informing&quot; me,</strong> a liquidation?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/6wkxq7z5w1lb1.png?width=1946&amp;format=png&amp;auto=webp&amp;s=0d86e102dc17d42ed5b3d35fe5a6e178603d9ea8\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/6wkxq7z5w1lb1.png?width=1946&amp;format=png&amp;auto=webp&amp;s=0d86e102dc17d42ed5b3d35fe5a6e178603d9ea8\"></a></p>\n\n<p>Remember the Holly Etlin statement on the stand, (paraphrasing as I can&#39;t remember exactly) <em>&quot;we are enacting a parallel liquidation and restructuring..&quot;</em> </p>\n\n<p>Consulting with the Directors — who have no financial vested interest in the company — on restructuring updates?</p>\n\n<p>Why are they drafting, revising letters of instruction to the transfer agent AST? I can only rationally conclude, though I am speculating, that it is instructions on how to distribute new equity and at what pre-determined ratio (old shares:new shares, ie. 1:1, 5:1, random number:1).</p>\n\n<p>—</p>\n\n<p>I hope that makes it more clear. In my opinion, this was a really big deal.</p>\n\n<p>Lastly I just want to say, thank you everyone for being so welcoming and kind on the pp show. I haven&#39;t said it out loud yet, I <em>love</em> the live chat it is absolutely <strong>hilarious.</strong> I get so many good laughs and love reading it all. </p>\n\n<p>I especially love people who call me a snake and a shill, <strong>because no heros.</strong> Let the information do the talking and the substance of the material give the credibility.</p>\n\n<p>Thanks for reading.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/FSRqjgYGmaQxEak5yj9D7gkRSF_hJY4qwDGcmEFWvb0.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/1642jho", "time": 1693267332.0, "subreddit": "r/ThePPShow", "title": "I believe HBC is still in:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Maybe they were holding as a proxy? Who knows. Not tinfoil anymore though. </p>\n\n<p>Bonus, section 16 claims. New directors (board)? Significant shareholders?</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/BV9ZOUNuXVbMLYS-eFpXtEsnSmOOXE9SIObMOW7RrDY.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/163vq2g", "time": 1693251494.0, "subreddit": "r/ThePPShow", "title": "Did we know Carol Flaton was Managing Director at AlixPartners? and was Managing Director in the restructuring practice of Lazard Freres &amp; Co.?", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Vkpv48jAIMDq3fTuabkBpPK7rJBPtUIrA-0kGib1zhA.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/u2d7h8j77wkb1.png", "time": 1693246513.0, "subreddit": "r/ThePPShow", "title": "There it is: the most compelling evidence so far in my opinion:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/u2d7h8j77wkb1.png\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/163s620", "time": 1693243475.0, "subreddit": "r/ThePPShow", "title": "There's a lot of legal activity with legacy shares. I thought this was a \"liquidation?\" 🤔", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/K1ToR5CDyLWV7ejbFIPZ7jT-gg2jePrmnlNRwtzYwJ8.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/1612nog/interesting_dream_on_me_connections_to_pull_on/", "time": 1692977844.0, "subreddit": "r/ThePPShow", "title": "Interesting Dream on Me connections to pull on: (amazing potential connection by u/Real_Eyezz)", "text": "<!-- SC_OFF --><div class=\"md\"><p>OK amazing credit here to <a href=\"/u/Real_Eyezz\">u/Real_Eyezz</a> for making this post about Dream on Me and 1532 South Washington Ave. Please see here:</p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/160p4dq/4_pics_currently_looking_at_another_angle_but/?utm_source=share&amp;utm_medium=mweb\">https://www.reddit.com/r/ThePPShow/comments/160p4dq/4_pics_currently_looking_at_another_angle_but/?utm_source=share&amp;utm_medium=mweb</a></p>\n\n<p>Real Eyezz is a super sleuth. This opened the doors for new threads to pull on. I’m making a post because I can’t add multiple photos to his, but I only want this used as a reference to <strong>that</strong> post. </p>\n\n<p>Dream on Me, who pulls in $20M a year (right?), in 2015 buys 1532 South Washington Ave, Pistacaway, NJ. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/szys2qn5s9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=83f590952d44f7d507126ba571bee73689456bc6\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/szys2qn5s9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=83f590952d44f7d507126ba571bee73689456bc6\"></a></p>\n\n<p>For $16+M. In 2015, they also are listed under 125 Helen St, South Plainfield, NJ. I have no idea how much that warehouse cost, but let&#39;s keep going.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rneuzc6ns9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=f638ef1d6df235c90040f80a26b71b56207d4d60\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/rneuzc6ns9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=f638ef1d6df235c90040f80a26b71b56207d4d60\"></a></p>\n\n<p>Oh, yes I do. They bought 125 Helen Street in July 2012 for just under $5M. <strong>These two locations are 2.4 miles apart.</strong> You will notice, they have used two separate LLC&#39;s for these two locations.</p>\n\n<p>Then,</p>\n\n<p>In <strong>July 2020</strong>, Dream on Me refinances their 1532 South Washington Ave mortgage and receives a new, <strong>21,547,500$</strong> mortgage. That seems ..high for a company making 20M annually (can someone please help me find where that info originated from, thank you).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8u0t518ft9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=b899305982ac35a6d1740f8bb284caf02bc1eaec\">..a what transaction?</a></p>\n\n<p>In this new mortgage, they are listing a Swap Transaction. <em>Don&#39;t do it!</em> I believe it refers to swapping from variable interest rate to fixed.</p>\n\n<p>So they have 125 Helen Street and 1532 South Washington Ave, as of July 2020. That is seeming like <strong>a lot</strong> of mortgage overhead but I don&#39;t know anything about that so if anyone has insight in real estate or warehouse financing, please chime in.</p>\n\n<p><strong>Then,</strong></p>\n\n<p>In <strong>December 2021,</strong> just <em>17 months later,</em> they <strong>take out an additional, 12,500,00$</strong> mortgage. Wow, <strong>that&#39;s a lot of overhead.</strong> Realistically, how much could they have paid off in 17 months? I don&#39;t know. But I discovered just the <strong>property tax alone for 1532 South Washington Ave is 519,000$ a year.</strong> </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/14ly8ykou9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=775a03c20bbe22396260a6c5a4679d0aaa0455d5\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/14ly8ykou9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=775a03c20bbe22396260a6c5a4679d0aaa0455d5\"></a></p>\n\n<p>You might be thinking, they refinanced the July 2020 mortgage. <strong>I don&#39;t believe so,</strong> look at this:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/uojduj51v9kb1.jpg?width=1289&amp;format=pjpg&amp;auto=webp&amp;s=e7fd897d9034e6ea7aaff46eadcca6fdbd23cbe8\">looks like a mortgage double Krabby patty.</a></p>\n\n<p>Am I wrong? I&#39;m genuinely asking. I think this $12.5M is in addition to whatever is left of the $21.5M. 34M total, fyi, not counting repayments. </p>\n\n<p>Now, here comes the good part. </p>\n\n<p><strong>Then,</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qocyba1jv9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=40c739208e86ca63ade0ce8f3af4e749b78fe582\">On August 25 you say?</a></p>\n\n<p>They lease the 125 Helen Street warehouse on <strong>August 25, 2023.</strong> The property <em>either</em> leases the same day, or <strong>maybe</strong> was not needed to be listed <strong>because they had a buyer?</strong> I <strong>cannot find</strong> a single webpage, document, note, <em>anything,</em> about the August 25 lease. This shot also shows &quot;undisclosed rate.&quot;</p>\n\n<p>On <strong>August 25, 2022,</strong> the company issues a press release that they will give a strategic update on August 31, 2022.</p>\n\n<p>On <strong>August 24,</strong> Reuters reports that the company is finalizing negotiations with Sixth Street for the $375M FILO. </p>\n\n<p>On <strong>August 9,</strong> the company amends its credit agreement with JPM.</p>\n\n<p>In <strong>August 2022,</strong> the company engaged Lazard to pursue a debt exchange transaction to address the Senior Unsecured Notes.</p>\n\n<p>Each individual element on its own may not seem &quot;important&quot; or relevant, but as I said before, you need to observe the entire situation as a whole. I am making my first timeline post today, to expand on this.</p>\n\n<p>Also,</p>\n\n<p>Remember how I pointed out earlier, the two LLC&#39;s? Well the sale happened, that image is from the New Jersey Property Records website. But on that same website, Srour Properties LLC, an LLC for Dream on Me that I at least, have been yet to find, <strong>is still listed as the owner.</strong></p>\n\n<p><strong>So then, who did they sell 125 Helen Street to?</strong> </p>\n\n<p>On the PP show I had acknowledged that one tinfoil I subscribe to is that Ryan Cohen <strong>may potentially</strong> be funding Dream on Me, or concealing <strong>his</strong> <strong>movements</strong> by funding <em>and</em> using Dream on Me to acquire.</p>\n\n<p>Here are some more (Srour) Dream on Me LLC&#39;s. <strong>Why does a furniture manufacturer and seller, making $20M annually, have so many LLC&#39;s?</strong></p>\n\n<p><a href=\"https://preview.redd.it/5f90ij27y9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=84e980c93235c5192440bf73bfb57b40455538c9\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5f90ij27y9kb1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=84e980c93235c5192440bf73bfb57b40455538c9\"></a></p>\n\n<p>Thank you Real Eyezz, today I remove (only) <strong>one</strong> layer of that tinfoil and expose some hairs.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/IWwWCHkgMuxf-4qMzuQgrjfPAfMVgdhDFZoNAteRhhw.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/1603f60/nol_snippet_clarifying_the_18_month_ownership/", "time": 1692887105.0, "subreddit": "r/ThePPShow", "title": "NOL snippet: clarifying the 18 month ownership requirement for bondholders to become \"qualified\" creditors; DIP superpriority is exempt:", "text": "<!-- SC_OFF --><div class=\"md\"><p>In my further readings regarding the NOL to better participate in the debate, I learned of Section 382(l)(5)(E)(ii). </p>\n\n<p><a href=\"https://preview.redd.it/ievxk7keg2kb1.png?width=1486&amp;format=png&amp;auto=webp&amp;s=99e31a13d4687871131ea1c1536656e739c5b0f5\">ie. DIP</a></p>\n\n<p>Put simply, a regular bondholder, when covering debt to equity and wanting to utilize the full NOL under Section 382(l)(5), must have held the bond (debt) for 18 months prior to the start of the Chapter 11 bankruptcy. However, </p>\n\n<p><strong>OR</strong></p>\n\n<p>382(l)(5)(E)(ii) states that <strong>the DIP and superpriority debt structure in the bankruptcy case are exempt from this 18 month requirement.</strong> Under Section 382(l0(5)(E)(ii), any future ownership from <strong><em>that</em></strong> debt being converted into equity did not have to be held for 18 months.</p>\n\n<p>In searching through past posts I noticed a lot of people counting when RC bought, when Carl entered the scene, etc. Under the bull thesis of Sixth Street converting debt to equity, anyone receiving that equity or using them as a proxy, or beneficially owning the new entity as a result of the superpriority debt being converted, does not have to meet the 18 month requirement.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/-W6OL1DlKVx9nxPUX6X0JtpWgv_PzLg1KObHDy1acc0.jpg\"/></div>"},
{"username": "jake2b", "url": "/r/BBBY/comments/15zdsh4/retraction_nol_section_382l5_corrections/", "time": 1692818748.0, "subreddit": "r/ThePPShow", "title": "RETRACTION: NOL Section 382(l)(5) corrections, references, clarifications and my thoughts:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/15ydd3e", "time": 1692727131.0, "subreddit": "r/ThePPShow", "title": "This is not a shell company, at least not yet. They still have a distribution centre, warehouse and office use location, as well as lease :", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/jpFIfJ0-cyuo6xzlqrwIUINx3t-5uSRQsNzkXw4vlVI.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/15y9j4b", "time": 1692718947.0, "subreddit": "r/ThePPShow", "title": "Plan Supplement has some conflicting dates?", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/hDkWyCqUTXGIT6_CBZFhd806GH8FfF3S2FLIy_VLgGA.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/4503tlmnlojb1.png", "time": 1692718754.0, "subreddit": "r/ThePPShow", "title": "Plan Supplement has some conflicting dates?", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/4503tlmnlojb1.png\"/></div>"},
{"username": "jake2b", "url": "/r/BBBY/comments/15xhkrz/lazard_and_legalese_the_ultimate_bear_trap_the/", "time": 1692646472, "subreddit": "r/ThePPShow", "title": "Lazard and Legalese: The ultimate bear trap? The most artistic use of the English language and tinfoil-level plausible deniability.", "text": "", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "/r/BBBY/comments/15tvrg8/case_study_american_airlines_chapter_11_emergence/", "time": 1692297466.0, "subreddit": "r/ThePPShow", "title": "CASE STUDY: American Airlines Chapter 11 Emergence; Liquidation, wiped-out Shareholders, Cancellation of Old Stock, “Cease to Exist”, Initial Disclosure Statement and Plan with NO Shareholder Recovery — and yet, it all worked out with a Section 382(l)(5) NOL and Shareholders saved in New Entity:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "/r/BBBY/comments/15s2ett/ryan_cohen_cohencidences_as_far_as_the_icahn_see/", "time": 1692128009.0, "subreddit": "r/ThePPShow", "title": "RYAN COHEN: Cohencidences as far as the Icahn see. Part 2 of 3:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "https://www.reddit.com/gallery/15ostnw", "time": 1691809040.0, "subreddit": "r/ThePPShow", "title": "NOL and NDA: As of late June, NOL preservation and analysis remains ongoing; UCC has submitted a confidential Motion.", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.redditstatic.com/desktop2x/img/renderTimingPixel.png\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/z7d5463wkchb1.jpg", "time": 1691701767.0, "subreddit": "r/ThePPShow", "title": "Docket 1873, Page 94: “..correspond re effect of share conversion on NOL’s”", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/z7d5463wkchb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/z7d5463wkchb1.jpg", "time": 1691701767, "subreddit": "r/ThePPShow", "title": "Docket 1873, Page 94: “..correspond re effect of share conversion on NOL’s”", "text": "", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/z7d5463wkchb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/1yi2pkxa8chb1.png", "time": 1691697367.0, "subreddit": "r/ThePPShow", "title": "🚨🚨🚨 Docket 1873: Did I just read CARVE OUT? Is this real life? 🥳", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/1yi2pkxa8chb1.png\"/></div>"},
{"username": "jake2b", "url": "/r/BBBY/comments/15nlq0w/counter_fud_the_nda_how_nearly_every_attorney_in/", "time": 1691695688.0, "subreddit": "r/ThePPShow", "title": "Counter FUD: The NDA. how nearly every attorney in Docket 1873 has to bill time to revise their invoicing because of confidentiality:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "https://i.redd.it/j3n1ucejpbhb1.jpg", "time": 1691690882.0, "subreddit": "r/ThePPShow", "title": "Docket 1873 🔥🔥🔥 Kirkland and Ellis had their M&amp;A/Private Equity Attorneys spend 553.3 hours in June on this bankruptcy.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Crazy rite</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/j3n1ucejpbhb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/br6pd1ohmbhb1.jpg", "time": 1691689857.0, "subreddit": "r/ThePPShow", "title": "Docket 1873 🔥 Kirkland and Ellis Monthly Fee Statement. Do you think it took 312.9 hours to make the disclosure statement in its current, conditional form?", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/br6pd1ohmbhb1.jpg\"/></div>"},
{"username": "jake2b", "url": "/r/BBBY/comments/15k9dhy/nol_the_misunderstood_shiniest_jewel_of_them_all/", "time": 1691379807.0, "subreddit": "r/ThePPShow", "title": "NOL: The misunderstood, shiniest jewel of them all. There is SO much more value; this is a bull thesis banger.", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "/r/BBBY/comments/15jr7nb/misinformation_correction_andrew_glenn_and_the/", "time": 1691332740.0, "subreddit": "r/ThePPShow", "title": "MISINFORMATION Correction: Andrew Glenn and the Hertz Objection that saved shareholders and common statement from many users.", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/15ip9t3/docket_1728_breakdown_and_explanations/", "time": 1691221270.0, "subreddit": "r/ThePPShow", "title": "Docket 1728: Breakdown and Explanations; Depolarizing Opinions and Maximizing Understanding", "text": "<!-- SC_OFF --><div class=\"md\"><p>A single-cell organism knows this is not financial advice.</p>\n\n<p>Well, shit. Let&#39;s get right into it. Docket 1728 was released and has left quite the crater. </p>\n\n<p>&#x200B;</p>\n\n<p>SUMMARY</p>\n\n<p>The purpose of this post is to break down docket 1728 into smaller pieces, essentially the individual arguments, to make sense of what is being said and improve the community&#39;s baseline interpretation.</p>\n\n<p>&#x200B;</p>\n\n<p>TLDR</p>\n\n<p>No.</p>\n\n<p>&#x200B;</p>\n\n<p>BODY</p>\n\n<p>First I want to say, no matter whose fault it was, it is really unfair that the parties who submitted the docket had so much of their private information revealed. I will refer to them in this post as the party, or parties.</p>\n\n<p>There are a handful of statements here, a lot of allegations and some very drastic recommended solutions. </p>\n\n<p>&#x200B;</p>\n\n<p>First</p>\n\n<p>The parties allege that there are bondholders who are shorting their own bonds through swaps and CFD&#39;s. They argue argue that they are committing fraud because they are claiming they are losing money on their bonds in the case, but are in fact enriching themselves as the value of those bonds goes down. You can see where this creates a conflict of interest, especially since bondholders need to vote on the Plan.</p>\n\n<p>Specifically:</p>\n\n<p>The bondholders are claiming losses on the bonds, but the true amount they should be owed should be reduced by the gains from their open short positions as their real loss should be <strong>NET</strong> loss. They are double-dipping by indirectly preventing shareholders from getting any recovery, claiming they would have to be paid out first. But they don&#39;t care to get paid out, because if the company dies they don&#39;t have to close out their shorts and make massive tax-free gains.</p>\n\n<p>Also, it mentions BBBY previously failed to get enough bondholders to participate in an exchange offer for new convertible notes in December and January, and use this as further proof bondholders have bad intentions. They paint a picture where bondholders short-selling and also refusing to exchange notes caused the offer to fail and was a pretext for bankruptcy.</p>\n\n<p>Then they suggest a solution, which is to either skip bondholders and pay shareholders first, or, (and this is the real thing), mandate that any bondholder voting on the Plan close their shorts first because of laws broken and conflicts of interest.</p>\n\n<p>Second</p>\n\n<p>To their credit, they brought the receipts. They have a mountain of trading data in which they found the bonds, then they linked the trade to specific swaps. Assuming the analysis of the data is true and correct, it is extremely detailed and equally impressive as to how much work must have gone into it. </p>\n\n<p>Third</p>\n\n<p>The parties allege that the debtor is in on it and is purposefully trying to sink this company. This is an <strong>extraordinary</strong> claim that should require an extraordinary burden of proof. The parties cite the Conditional Disclosure Agreement and how it states no shareholder recovery, as their proof. I detail the Conditional Disclosure Statement in my post here: <a href=\"https://www.reddit.com/r/BBBY/comments/15fmrnj/antithesis_for_fud_the_conditional_disclosure/\">https://www.reddit.com/r/BBBY/comments/15fmrnj/antithesis_for_fud_the_conditional_disclosure/</a></p>\n\n<p>Fourth</p>\n\n<p>The parties propose changing the Plan from opt-out to opt-in. This is essentially a third party release of liability. Here&#39;s where it gets juicy. </p>\n\n<p>Opt-out: a Plan may have a third-party release <strong>that exempts certain non-debtors from liability.</strong> All creditors would be bound by this release unless they actively file to opt out. What this means is, <strong>the bondholders could not be sued by the shareholders after the bankruptcy</strong> if these allegations were true. </p>\n\n<p>This is how it is currently in this case, opt-out.</p>\n\n<p>Opt-in: the third-party release would only apply to creditors <strong>who actively choose to opt in to the release by checking a box on a ballot.</strong> Creditors who do nothing are not bound. </p>\n\n<p>Because shareholders are Class 9, deemed impaired and automatically vote to reject, <strong>shareholders do not get ballots. By changing the requirement to opt-in, all shareholders would have their possibility to sue preserved,</strong> as they literally could not opt out.</p>\n\n<p>Fifth</p>\n\n<p><em>The Plan.</em> The parties request the that exclusivity period of the Plan be revoked. What does that mean? The exclusivity period right now means that <strong>only BBBY can submit a Plan.</strong> Let&#39;s look at some pros and cons.</p>\n\n<p>Pros:</p>\n\n<ul>\n<li>It gives BBBY time to come up with a plan without the pressure of competition - they can take their time, be thorough and keeps things from getting crazy.</li>\n<li>If there is a Plan that follows the bull thesis, it allows the proxy Sixth Street is representing to comfortably execute their Plan while maintaining control of the outcome.</li>\n</ul>\n\n<p>Cons:</p>\n\n<ul>\n<li>Well, if you believe there is merit to the allegation that the company is part of a conspiracy to sink this bankruptcy, then not having competition basically ensures the shorts win.</li>\n<li><strong>But on the other hand,</strong> if you believe the bull thesis, that there may be a buyer represented by Sixth Street, that would preserve shareholders to maintain the NOL&#39;s by issuing new equity, potentially causing a short squeeze, that would then allow the new entity to sell new equity into said squeeze, to then build a sizeable cash position to launch an amazon competitor, with the fiercely-loyal, lifelong retail shareholder base, <strong>then removing the exclusivity period is equivalent to dropping a tactical nuclear bomb on your bull thesis.</strong></li>\n</ul>\n\n<p>COMMENTS</p>\n\n<p>I believe you can have multiple feelings about this docket at the same time. </p>\n\n<p>For one, potentially a plot has been exposed where bondholders could vote against a Plan, deliberately killing this company to enrich themselves through their hedged swaps and short positions on their own bonds. The trade data verifying this claim is included in this docket and I am of the belief this gives the allegation a much higher level of credibility. </p>\n\n<p>At the same time, I cannot see how removing the period of exclusivity is a logical solution to the presented problem. The opt-in change makes sense. Mandating that voting bondholders close their short positions to avoid conflict of interest makes sense, though I don&#39;t know if it is legal.</p>\n\n<p>I do not believe that the Conditional Disclosure Statement is enough evidence to believe that the debtors are involved in a complex, orchestrated manoeuvre to end this company&#39;s existence, though I must concede it is all the information we have to worth with.</p>\n\n<p>As it stands now, according to docket 1716, <strong>the Plan must be presented by August 18</strong> <strong><em>at the latest</em></strong> and the vote to confirm it is on September 1. Why would these <strong>parties request the exclusivity period be removed, at a maximum three days</strong> before the Plan was to be disclosed? </p>\n\n<p>Why would you not file the objection after the Plan has been released, but before it is confirmed? <strong>There is a two-week opposition period.</strong> I cannot reconcile these facts or otherwise come up with a logical answer as to why r<strong>emoving the exclusivity period now is the correct answer</strong> and I have been thinking about this since the docket had come out. And yes, I have read the docket and the justification; I am referring to the real reasons.</p>\n\n<p>---</p>\n\n<p><strong>I would like to end the post here to give everyone a chance to assess what I have written and come to your own conclusions and opinions. Please engage in good faith discussion, lets brainstorm and debate the merits of both sides and strengthen our personal thesis as a result of it.</strong> </p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "jake2b", "url": "/r/BBBY/comments/15gtihy/ryan_cohen_ascension_of_the_king_part_1_of_3_rc/", "time": 1691035594.0, "subreddit": "r/ThePPShow", "title": "RYAN COHEN: Ascension of the King - Part 1 of 3; RC is in, I can prove it, it was always there.", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "/r/BBBY/comments/15fmrnj/antithesis_for_fud_the_conditional_disclosure/", "time": 1690919442.0, "subreddit": "r/ThePPShow", "title": "Antithesis for FUD: The Conditional Disclosure Statement - What it is, what it isn't, YES it can materially change.", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "jake2b", "url": "https://i.redd.it/0mxk6qpf4ifb1.jpg", "time": 1690896838.0, "subreddit": "r/ThePPShow", "title": "Combat FUD with knowledge: my thoughts about today’s hearing after reviewing the agenda.", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/0mxk6qpf4ifb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/mgoezimbldfb1.jpg", "time": 1690841982.0, "subreddit": "r/ThePPShow", "title": "TSO vs. Float: I believe I have solved the pinnacle question of real shares. The Disclosure Statement confirms previous information to be most current and true:", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mgoezimbldfb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/kl18u5fxdqeb1.jpg", "time": 1690561126.0, "subreddit": "r/ThePPShow", "title": "Addressing the #1 FUD: The Plan, in its current first draft and how it is prematurely being used as bear confirmation", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/kl18u5fxdqeb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/r2is4ile1keb1.jpg", "time": 1690484184.0, "subreddit": "r/ThePPShow", "title": "FUD got you down today? Come here, I’ve got a hug for you.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just want to make sure now that I’m posting more. Is cross posting OK?</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/r2is4ile1keb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://i.redd.it/boxpmnxclieb1.jpg", "time": 1690467095.0, "subreddit": "r/ThePPShow", "title": "OH BABY! Docket 1540 🔥🔥🔥 Judge P accepts debtors and DIP request to shorten time period for notice; COURT 1 Aug, 2:30pm EST - debtor must serve ALL DOCS by 31 July regarding the Plan!!", "text": null, "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/boxpmnxclieb1.jpg\"/></div>"},
{"username": "jake2b", "url": "https://www.reddit.com/r/ThePPShow/comments/15agcj0/unpopular_opinion_stop_telling_people_how_he/", "time": 1690402269.0, "subreddit": "r/ThePPShow", "title": "Unpopular opinion: stop telling people how he should be running his show tonight", "text": "<!-- SC_OFF --><div class=\"md\"><p>Guys and gals, I know we all have the best intentions. </p>\n\n<p>Understandably, it’s been an incredibly exciting afternoon, learning that Bill Pulte will be joining the ppshow as a guest this evening.</p>\n\n<p>This is an enormous accomplishment for ppseeds and he deserves a round of applause. Let’s remember that the show has grown entirely organically, already has appeal, and has always done so with a signature style in terms of commentary, jokes, language, contrarian guests, etc. Let’s all take a step back and allow ppseeds to make his own judgements on how tonight should be handled. </p>\n\n<p>Every element of the stream he has done up until this point has brought him here. I’m sure everyone has good intentions at heart, but I’m reading a lot of posts about who should be allowed on the stream, who should definitely not be invited onto the stream, making sure this language is used, that language is not used. Again, I know everyone has good intentions, because they want to see Mr. Pulte’s appearance be successful.</p>\n\n<p>As someone who has watched from very early on, I have to say it feels very cool seeing the stream grow, how everyone involved has learned, and now a new page where serious guests are coming on. This is a big deal and I will be pouring a glass for pp’s success this far. </p>\n\n<p>But remember, the stream did not get here by chance, let’s hold back our judgement on do/don’t/what/how/when for tonight.</p>\n\n<p>Cheers and see you all tonight in the comments 🫡</p>\n</div><!-- SC_ON -->", "flair": {"text": "🛌 🛀 🌌 🍖", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]