[{"username": "Jarkside", "url": "https://www.reddit.com/r/ThePPShow/comments/15c8cx8/i_am_counting_471_rejected_or_sold_leases/", "time": 1690576354.0, "subreddit": "r/ThePPShow", "title": "I am counting 471 rejected or sold leases…", "text": "<!-- SC_OFF --><div class=\"md\"><p>Friends, I want everyone to get rich, but if you were staying in the play due to the 300 retained leases I really don’t think that argument holds water anymore. </p>\n\n<p>I went through dockets 898, 1127, 1356, 1302, 1539, 1538, 1537, 1114 and 1428.</p>\n\n<p>I am counting 329 rejected leases and 209 sold leases. Some leases (somehow) appeared on more than one list, and I counted 67 of those.</p>\n\n<p>If you add the 329 rejected leases to the 209 sold leases and subtract the 67 duplicates you get 471.</p>\n\n<p>That’s 471 leases sold or rejected. </p>\n\n<p>Now I may have missed a few, and there may be a couple of double counts in there, but the margins don’t really matter - there may be some leases unaccounted for, but if you were assuming a starting point of 500 leases pre-bankruptcy there are not 300 leases remaining.</p>\n\n<p>Any play from here must work without relying on a beachhead of 300 leases as part of the new company.</p>\n\n<p>I hope everyone gets rich, but I really think this one argument should be dropped. Godspeed, good luck, I’m a moron, not financial or legal advice, etc</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jarkside", "url": "https://www.reddit.com/r/ThePPShow/comments/15b24xo/i_am_not_a_shill_but_last_nights_docket_dump/", "time": 1690465081.0, "subreddit": "r/ThePPShow", "title": "I am not a shill, but last nights docket dump debunks the 300 lease theory", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been hanging on for a long time, hoping that the 300 leases would become the base from which a newly emergent Teddy or independent buy buy baby could thrive and grow. But last nights docket dump makes it clear that over 250 leases are being either rejected or terminated. So if the leases are gone, that means there are no stores, and there are no employees. Which begs the question, what’s left?</p>\n\n<p>If you say the NOLs, and that’s the only asset remaining, even those tax benefits are only worth pennies on the dollar. For instance, if you have one dollar worth of NOL and buyers want to buy that at a discount, they might pay 25 cents for that tax benefit. All that is without considering outstanding debt.</p>\n\n<p>So if the leases are rejected or terminated, the employees are all fired, the IP has been sold, what’s left? What is the bull case here?</p>\n\n<p>Again, not trying to shill but last nights dockets have completely changed the game in my mind. What am I missing?</p>\n\n<p>EDIT: I went through the following dockets -</p>\n\n<p>898,1127,1356,1302,1537,1538,1539,705,731,1157,1114, and 1428.</p>\n\n<p>If you add up the Rejected Leases, there are 329 rejected leases. These leases are gone as of next week.</p>\n\n<p>If you add up the sold leases, I get 209. </p>\n\n<p>Some leases showed up in both lists. I counted 67 duplicates.</p>\n\n<p>By adding the sold leases to the rejected leases and subtracting the duplicates, I am getting 471 leases.</p>\n\n<p>I am probably missing a few from this list… but the argument stands… the 300 lease argument is debunked. There are few - if any - leases remaining in BBBYQ’s control.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jarkside", "url": "https://www.charlotteobserver.com/sports/charlotte-hornets/article276480256.html", "time": 1687395507.0, "subreddit": "r/ThePPShow", "title": "Michael Jordan’s Sale of the Hornets to Gabe Plotkin sure is timely", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.charlotteobserver.com/latest-news/8hptxh/picture276479056/alternates/LANDSCAPE_1140/MJ%20012.JPG\"/></div>"}]