[{"username": "Jay-Query", "url": "https://www.reddit.com/r/ThePPShow/comments/16wfzj3/we_won/", "time": 1696103271.0, "subreddit": "r/ThePPShow", "title": "We Won!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday, in a move of unparalleled genius, we <em>annihilated</em> those pesky short positions! That&#39;s right, folks, not a single short left standing!</p>\n\n<p>In our quest to destroy the shorts, our master plan was executed seamlessly and by cancelling shares and selling of everything, we won!</p>\n\n<p>But hey, let&#39;s focus on the positives here: <strong>WE DESTROYED THE SHORTS!</strong></p>\n\n<p>So, gather &#39;round, fellow members and et&#39;s celebrate our pyrrhic victory! We might have lost everything in the process, but at least those shorts got what was coming to &#39;em!</p>\n\n<p>Remember, it&#39;s not about the money or the shares; it&#39;s about sending a message. And boy, did we send one!</p>\n\n<p>Now I encourage you to read <del>the scripture</del> the teddy books to see what message <del>Jesus</del> Ryan Cohen has reserved for us for his next master 69D chess move!</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jay-Query", "url": "https://www.reddit.com/r/ThePPShow/comments/14x5fgd/tax_receivable_agreements_the_hidden_ace_in_the/", "time": 1689113863.0, "subreddit": "r/ThePPShow", "title": "Tax Receivable Agreements: The Hidden Ace in the IPO and M&amp;A Game", "text": "<!-- SC_OFF --><div class=\"md\"><p>Fellow Regards,</p>\n\n<p>I recently read an article on a cheaper way to do an IPO and this paragraph stuck out:<br/>\n&quot;Initial public offerings are an expensive exit route for company owners. Underwriters in the U.S. typically charge 5% to 7% of proceeds. Underpricing of shares takes another 10% to 15%, on average; total costs of $100 million aren’t unusual for large deals. It’s not surprising that many owners pursue other options, especially M&amp;A.&quot;</p>\n\n<p>Bankrupt, saddled with over a billion in Net Operating Losses (NOLs), many might think it&#39;s a lost cause. But here&#39;s where it gets interesting.</p>\n\n<p>We all know IPOs are a money sink. Between underwriter fees and share underpricing, they can burn through cash faster than a fat kid in a candy store. But, there&#39;s this lesser-known strategy, the <strong>&quot;Tax Receivable Agreement&quot; (TRA)</strong>, that can ease the pain.</p>\n\n<p>Here&#39;s the TL;DR on TRAs: They help increase a company&#39;s tax basis post-IPO without adding extra tax costs for the seller. This trick means less income tax on post-IPO profits. And the kicker? The seller gets a large chunk of these future tax savings, usually spread over 15 years. Sweet deal, right?</p>\n\n<p>Now imagine this strategy applied to BBBYQ. An acquiring company (cough: TEDDY) could not only make use of those billion-dollar NOLs (a nice perk, btw) but also leverage a TRA to score considerable future tax savings, thereby making the acquisition a potentially profitable move.</p>\n\n<p>Source: <a href=\"https://hbr.org/2013/11/a-cheaper-way-to-do-ipos\">A Cheaper Way to Do IPOs (hbr.org)</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]