[{"username": "JG-at-Prime", "url": "https://www.reddit.com/r/ThePPShow/comments/1362mi9/why_does_finra_have_a_16_billion_dollar/", "time": 1683066934.0, "subreddit": "r/ThePPShow", "title": "Why Does FINRA Have A 1.6 Billion Dollar Investment Portfolio?", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is in reference to FINRA posting negative bid ask numbers for BBBY. </p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/135xop2/negative_bidask_for_bbby/\">https://www.reddit.com/r/ThePPShow/comments/135xop2/negative_bidask_for_bbby/</a></p>\n\n<p>(Full disclosure, this post was removed twice by the BBBY mods. I think I touched a nerve.)</p>\n\n<p>If FINRA is deliberately commenting fraud to protect their own short position in BBBY, then this is a direct conflict in interest and directly affects BBBY.</p>\n\n<p>The reason that regulatory bodies are not generally allowed to participate in the activities that they regulate is specifically to prevent these sorts of conflicts of interest. </p>\n\n<p>TLDR: FINRA has access to what in any other organization would be considered massive amounts of insider information. It also has a massive conflict of interest in the form of a <strong>1.6 Billion dollar investment portfolio</strong>. </p>\n\n<p>The portfolio of the Self Regulatory Agency is largely unknown and is largely (if not completely) unmonitored by any other regulatory agency(s).</p>\n\n<p>Their actions seem to be very much as if they were desperate to save some shorties ass. <strong>Was it their own ass?</strong></p>\n\n<p>I would be really, really curious to know <strong>how much of that portfolio is short?</strong> And if they do have short positions, are their short positions in BBBY the reason that they continue to otherwise mess around with the stock.</p>\n\n<p>In addition to massive conflicts of interest and minimal supervision from the SEC, FINERA does not appear to be directly accountable to Congress, rather than direct accountability FINRA instead invests a lot of money in lobbying. In 2012, it spent $960,000 as it pushed for legislation that would allow it to expand its regulatory reach to include RIAs, who are now primarily regulated by the SEC.</p>\n\n<p><strong>FINERA should have no ability to halt any stocks or securities while it is invested in the very markets it purports to regulate.</strong></p>\n\n<p><a href=\"https://www.mercatus.org/media/46396/download\">https://www.mercatus.org/media/46396/download</a></p>\n\n<p><strong>”LACK OF ACCOUNTABILITY”</strong></p>\n\n<p><em>”By law, the SEC is in charge of Finra and has the power to approve or reject any rules Finra wants to adopt. But it applies little more than a rubber stamp to Finra’s rules, critics say.”</em></p>\n\n<p><em>“In practice, Finra operates with substantial independence from the SEC,” Hester Peirce, a senior research fellow at the Mercatus Center at George Mason University, noted in a 2015 paper. “Finra rules do not typically attract close attention from the SEC commissioners.”</em></p>\n\n<p><strong>”Finra operates with substantial independence from the SEC.”</strong></p>\n\n<ul>\n<li><em>Hester Peirce</em></li>\n</ul>\n\n<p>(Source deleted)</p>\n\n<p><em>”The Government Accountability Office likewise found that the SEC could be doing a better job of overseeing Finra in a 2012 report and a follow-up report in 2015. In the follow-up report, the GAO said the SEC had improved its monitoring of Finra but that it still needed to develop specific performance goals and measures for Finra oversight, formalize documentation of oversight determinations and perform an assessment of Finra’s internal risks related to staffing and priorities.”</em></p>\n\n<p><a href=\"https://www.investopedia.com/ask/answers/how-does-finra-differ-sec/\">https://www.investopedia.com/ask/answers/how-does-finra-differ-sec/</a></p>\n\n<p><em>“Although it has regulatory powers, FINRA is not part of the government. It is a not-for-profit entity and the largest self-regulatory organization (SRO) in the securities industry within the U.S.”</em></p>\n\n<p><em>”FINRA stands for &quot;Financial Industry Regulatory Authority&quot; and is a not-for-profit organization overseen by the SEC that seeks to protect investors by primarily overseeing all brokers in the securities marketplace. It lays out specific laws and requirements and provides certificates for individuals to be able to operate in the securities market.”</em></p>\n\n<p><em>”FINRA is responsible for overseeing virtually all U.S. stockbrokers and brokerage firms and providing avenues and legal certifications for those individuals to appropriately operate in their specific marketplaces.”</em></p>\n\n<p><a href=\"https://www.wsj.com/articles/wall-street-regulator-is-also-an-investorwith-meager-returns-1507195803\">https://www.wsj.com/articles/wall-street-regulator-is-also-an-investorwith-meager-returns-1507195803</a></p>\n\n<p>”<strong><em>Finra&#39;s $1.6 billion portfolio</em></strong> <em>has returned 3.4% annually, versus 6% for a half-stock, half-bond portfolio.</em>”</p>\n\n<p><a href=\"https://www.investmentnews.com/finra-denies-wsj-report-that-regulator-has-underperforming-portfolio-72391\">https://www.investmentnews.com/finra-denies-wsj-report-that-regulator-has-underperforming-portfolio-72391</a></p>\n\n<p><em>”Finra denies WSJ report that regulator has underperforming portfolio. Regulator says Journal&#39;s analysis makes improper comparison of returns.”</em></p>\n\n<p><em>”From Finra’s origins in 2004 through 2016, the Financial Industry Regulatory Authority’s actively managed $1.6 billion investment portfolio has returned 3.4%, or $440 million less than a 6% return had the self-regulator invested in a balanced mix of global stocks and U.S. bonds, according to Wall Street Journal calculations of figures in Finra’s annual reports.”</em></p>\n\n<p><a href=\"https://www.investmentnews.com/finra-whos-watching-the-watchdog-72102\">https://www.investmentnews.com/finra-whos-watching-the-watchdog-72102</a></p>\n\n<p><em>”Finra wields enormous power over the lives of brokers and broker-dealers. Last year alone, it issued more than 1,400 disciplinary actions and barred more than 500 brokers from the industry. And yet people in the industry know little about how Finra operates, how it spends the millions it collects in membership fees and fines, and how it sets its regulatory agenda. Finra writes its own rules, meets behind closed doors and releases information if and when it deems necessary.”</em></p>\n\n<p><em>”Finra is the watchdog that no one is watching. “It is largely unaccountable to the industry or to the public,” David Burton, a senior fellow in economic policy at the Heritage Foundation, wrote in a February report. “Due process, transparency and regulatory-review protections normally associated with regulators are not present, and its arbitration process is flawed. Reforms are necessary.”</em></p>\n\n<p><em>”In an InvestmentNews survey of 363 readers who are regulated by Finra, nearly half — 48% — said the organization is not doing a good job of regulating brokers, compared with 29% who said it was. Meanwhile, 61% said Finra is not transparent about its finances, and the same percentage said the SEC’s oversight of Finra is inadequate.”</em></p>\n\n<p><em>“Is it [Finra] a government or not a government agency? As long as there’s not a choice for brokers, it’s a monopoly – and monopolies need to be regulated.”</em></p>\n\n<p><em>”Jim R. Webb, CEO, Cape Securities Inc. Jim R. Webb, CEO of broker-dealer Cape Securities Inc., is frustrated that Finra acts like a government agency but does not have to follow the laws that govern public agencies. For example, it is not subject to laws that would allow the public to attend its meetings, nor is it subject to the Freedom of Information Act, which allows anyone to request information about any matter from a federal agency.”</em></p>\n\n<p><em>”Finra protects itself from lawsuits from members by claiming that as an SRO it has absolute immunity from private lawsuits challenging the conduct of its regulatory mission.”</em></p>\n\n<p><em>“There needs to be definition,” Mr. Webb said. “Is it a government agency or not a government agency? As long as there’s not a choice for brokers, it’s a monopoly — and monopolies need to be regulated.”</em></p>\n\n<p>From a seeking alpha article that I cannot link due to Reddit blocking the site. (just search for the title, top result)</p>\n\n<p>Why Does FINRA Have An Investment Portfolio?</p>\n\n<p>Oct. 11, 2017 12:10 PM ET By Roger Nusbaum, AdvisorShares ETF Strategist</p>\n\n<p><em>”FINRA has an investment portfolio with a long track record of underperforming a 50/50 portfolio.”</em></p>\n\n<p><em>”So, here’s a weird one involving FINRA that you might have picked up in the last few days. Apparently, it has a large, $1.6 billion investment portfolio, and the returns have been weak, according to the Wall Street Journal, underperforming a 50/50 equity/fixed income portfolio for quite a few years.”</em></p>\n\n<p><em>”The WSJ article is woefully incomplete. It doesn’t say what the purpose of the portfolio is, it is unclear how it can even have a portfolio, and there are no specifics as to what the portfolio is benchmarked to other than a reference to a custom benchmark. The origin goes back to 2004, and it came out of the blocks trying to emulate the college endowments, which back then were revered. As a side note, the tide may have gone out some for quite a few of the endowments, but there is still plenty to learn about asset allocation from them.”</em></p>\n\n<p><em>”As the story goes, the FINRA portfolio decided to significantly reduce its equity exposure in, um….2009. The article provides no details on how much equity exposure it had back then, but the portfolio underperformed a 50/50 in 2008, or how much it has now, but there is a quote from a spokeswoman about targeting a “much more conservative approach than a 50/50 benchmark.”</em></p>\n\n<p>The rolls and activities of our regulatory agencies needs to be seriously examined and heavily re-evaluated.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]