[{"username": "JiggyJerome2", "url": "https://www.reddit.com/r/ThePPShow/comments/15twump/its_become_clear_a_proof_or_ban_rule_needs_to_be/", "time": 1692299925, "subreddit": "r/ThePPShow", "title": "It’s become clear a ‘proof or ban’ rule needs to be considered.", "text": "The absurd number of shares some on here are claiming to own is getting out of control.  99.9% of these astronomical assertions are being paired with negative, and detrimental undertones.  A bevy of these self proclaimed whales spewing vitriol, and when confronted they immediately state how they’re down 10s of 1,000s of dollars as a way to add credibility and justify their negativity. \n\nSupposedly a number of these “whales” were so convinced in this play that they purchased 100,000+ shares, but they’re now bemoaning how much money they lost now that they’ve supposedly sold them all off.  More experienced traders realize that someone with enough extra cash to buy 100,000+ shares, isn’t at all concerned with losing a measly $20k.  That’s pocket change to someone with that level of wealth, but I believe this kind of nonsense could prove persuasive to those less experienced traders involved here.  \n\nI don’t pretend to know how to run a subreddit, or if enacting a “proof or ban” rule is even feasible.  If it is possible though, I don’t see how that wouldn’t be a pertinent addition to remove what seems to be the go-to option for those wishing to spread FUD here.", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "JiggyJerome2", "url": "https://www.reddit.com/r/ThePPShow/comments/15twump/its_become_clear_a_proof_or_ban_rule_needs_to_be/", "time": 1692299925.0, "subreddit": "r/ThePPShow", "title": "It’s become clear a ‘proof or ban’ rule needs to be considered.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"}]