[{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/17z0yk7/will_we_know_our_fate_tomorrow/", "time": 1700411612.0, "subreddit": "r/ThePPShow", "title": "Will we know our fate tomorrow?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I keep seeing things that point to us needing a credit bid by tomorrow?  I’m sick of going to bed thinking I’m a millionaire, then waking up to a few less zeros in my checking account.  If we can get one thing to come true, the rest of the dominos will fall.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/17b0aht/might_be_on_to_something_here/", "time": 1697660360.0, "subreddit": "r/ThePPShow", "title": "Might be on to something here....", "text": "<!-- SC_OFF --><div class=\"md\"><p>So this morning I posted about my TD Shares being liqudated. I can say, i was a little shocked, almost like the closing the final chapter of a good book.  However, I got to thinking, with all the great minds and strong conviction in here, are we really that far off.  The thesis, if correct, cant come to an end by liquidating our shares, and saying it&#39;s over.  This would be the worst way for a story to end.  It would almost be like saying, &quot;He Dead, The End&quot;.  There&#39;s gotta be more substance to this. So I dug...and here&#39;s what I am looking at.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ri7naueol0vb1.png?width=948&amp;format=png&amp;auto=webp&amp;s=9fe3bfa1a0f33d479789c0ab2787bee8efce12d9\">https://preview.redd.it/ri7naueol0vb1.png?width=948&amp;format=png&amp;auto=webp&amp;s=9fe3bfa1a0f33d479789c0ab2787bee8efce12d9</a></p>\n\n<p>This quote is what I believe what we are seeing.  We are seeing brokerages slowly take back the shares. These requests aren&#39;t coming from brokerages, these requests are coming from the Depository which in our case is Cede &amp; Co.  This why you are seeing Webull, MooMoo and others still being holders of the stock. We knew last week that the DRS&quot;d community had issues with trying to find out where the shares were located, and if we had a transfer agent change.  There has yet to be any clarification on that.  This would also back up my thesis that Cede &amp; Co is trying to get an exact total because there are many that are swimming naked.  What way would be more accurate then halt trading, take back the shares deeming them worthless, only to find the corrupt SOB&#39;s holding the bag.</p>\n\n<p>Secondly, this Tweet by Ryan Cohen my have substance:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jayc9jl1n0vb1.png?width=514&amp;format=png&amp;auto=webp&amp;s=6943fe1961f25658ba4baf21ca950ff5ae0200c9\">https://preview.redd.it/jayc9jl1n0vb1.png?width=514&amp;format=png&amp;auto=webp&amp;s=6943fe1961f25658ba4baf21ca950ff5ae0200c9</a></p>\n\n<p>This might be revering to the Tide going out at night, and coming back in the morning.  RC posted this gem April 13th, 2022.  This date is significant because it represent tide change based on Lunar (Moon) Phases.  The call these spring tides.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/kxwf79e6o0vb1.png?width=1019&amp;format=png&amp;auto=webp&amp;s=a7ecfd80ef3dca9adc3883ee270258c435a2a055\">https://preview.redd.it/kxwf79e6o0vb1.png?width=1019&amp;format=png&amp;auto=webp&amp;s=a7ecfd80ef3dca9adc3883ee270258c435a2a055</a></p>\n\n<p>Hence, I feel we are about to see whose swimming naked.</p>\n\n<p>&#x200B;</p>\n\n<p>Lastly, I wanted to know why all brokerages wouldn&#39;t just delete the shares immediately after the 8-k was filed.  Nothing was changed, and they knew back then what the supposed outcome was, then why wait?  No information has changed.  Who were the mixed messages from?  25$ per share buyout, Options advancing towards 10/20 on all strikes, and a new company name DK-Butterfly with multiple entities.  </p>\n\n<p>Rc Tweets this:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/srzwxlyip0vb1.png?width=559&amp;format=png&amp;auto=webp&amp;s=2a76fb7d2174c4f98813d147d7d095898e9160c8\">https://preview.redd.it/srzwxlyip0vb1.png?width=559&amp;format=png&amp;auto=webp&amp;s=2a76fb7d2174c4f98813d147d7d095898e9160c8</a></p>\n\n<p>In the 1960&#39;s the stock market had turbulent times.  With trading volumes at an all time high, firms had the impossible task of keeping track of all the transactions.  The &quot;Paperwork Crunch&quot; began and as markets began to shift, firms were getting knocked out left and right going broke. Many called it a pillow fight between firms in what was known as the swinging sixties.  Here&#39;s the article:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hlzzet79q0vb1.png?width=769&amp;format=png&amp;auto=webp&amp;s=c880ddcd86a4bc9dc81fbcd0cc8a3e9cdbe86b77\">https://preview.redd.it/hlzzet79q0vb1.png?width=769&amp;format=png&amp;auto=webp&amp;s=c880ddcd86a4bc9dc81fbcd0cc8a3e9cdbe86b77</a></p>\n\n<p>As uncomfortable i am with everything surround this, my conviction remains unwavering.  Of course, if wrong, it will hurt and I will probably need some therapy, but until i figure out who and what DK Butterfly stand for, I remain zen.  This has been a experience of epic proportions.  PP, i thank god I found the show. ABC, you were the Robin to Batman, and your business knowledge and calming sense is priceless. Michael, Travis, Plur, Sal, and Jake2B, you are wise apes capable of creating movements.  No matter what happens in this play, we look forward to the next battle, rich or still trying to get rich.</p>\n\n<p>&#x200B;</p>\n\n<p>Peace out Apes</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/-kfoJW-oTWfoLI5Cfi68mieXjfwPUXwwKdHYE0PykDg.jpg\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://i.redd.it/dq28uecb21sb1.jpg", "time": 1696356358.0, "subreddit": "r/ThePPShow", "title": "Judge Papalia in the house!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>I bet he likes ice cream too!!  Glad to see him back!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dq28uecb21sb1.jpg\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/16vnlmg/s8/", "time": 1696022137.0, "subreddit": "r/ThePPShow", "title": "S-8", "text": "<!-- SC_OFF --><div class=\"md\"><p>S-8 is a newly registered company who is registering stock for employees newly appointed as incentive plans or compensation.  This is bullish, as I know a certain CEO is working for free!  Let’s get it!!! LFG!💯</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/16vnlmg/s8/", "time": 1696022137.0, "subreddit": "r/ThePPShow", "title": "S-8", "text": "<!-- SC_OFF --><div class=\"md\"><p>S-8 is a newly registered company who is registering stock for employees newly appointed as incentive plans or compensation.  This is bullish, as I know a certain CEO is working for free!  Let’s get it!!! LFG!💯</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/gallery/16pi0af", "time": 1695408302.0, "subreddit": "r/ThePPShow", "title": "In two pictures, tell me something is happening, without telling me something is happening…!", "text": "<!-- SC_OFF --><div class=\"md\"><p>When’s the last time you saw these simultaneously trading in unison, by barcoding. Yep, never, whale teeth for the win!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/YZBaeRPiO1xtouUjw34LYsQEo2Nn6U7x-Zr-VA6pCEw.jpg\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/16k905w/need_help_here/", "time": 1694874751.0, "subreddit": "r/ThePPShow", "title": "Need help here…", "text": "<!-- SC_OFF --><div class=\"md\"><p>I am having a hard time registering with AST.  I go to the web page and try to register, but I need a 10 digit account number which I obviously don’t have.</p>\n\n<p>Hood do i obtain an amount number? Can I DRS out of TD or not?  And is it possible that it is too risky to do this with the potential of news any day?  Thoughts?</p>\n\n<p>I never thought I would DRS, but I’m sick of the crime.  This moons, I have a feeling brokers going belly up, liquidating positions without notice is quite possible.  I’m not risking my 500k shares.  I know this is a hot topic should need some help registering as I am not to techy.  TIA</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/16jnzcn/drsing_from_td/", "time": 1694809837.0, "subreddit": "r/ThePPShow", "title": "DRSing from TD", "text": "<!-- SC_OFF --><div class=\"md\"><p>I know most of us are jacked, and I can say I have been relatively calm until today.  I have been trying to DRS several thousands of shares, and between maintenance in the AST air, I could never set anything up. </p>\n\n<p>I transferred all my shares out of RH and went with TD so I could still buy when we went OTC.  I called TD today about DRSing.  They advised me that they are transferring all shareholder accounts to Charles Schwab on November 3rd, and they advised me to wait until my account is secured with CS to DRS.  I asked specifically why would I want to wait, I want to make sure that these shares are mine. </p>\n\n<p>How do I do this?  In a crazy event that most think are likely, what’s the chances brokers get liquidators and no DRS accounts get liquidated, which states in the covenants of every broker?  I have been fucked before but not again.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/16ikx77/why_an_8k/", "time": 1694704172.0, "subreddit": "r/ThePPShow", "title": "Why an 8k….", "text": "<!-- SC_OFF --><div class=\"md\"><p>My theory, why release an 8k if your liquidating, and shareholders are to receive nothing.  The only reason you would file an 8k is to protect the shell of BBBY, and the investors involved just to be compliant.  Yet, this is another bear trap.  Oh shoot, they didn’t file, they go to expert market, and are toast, only to be propped up by an 8k. Boom!!  Shorts never closed.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://i.redd.it/4xada785rr5b1.jpg", "time": 1686655565, "subreddit": "r/ThePPShow", "title": "Stalking horse 21m overstock", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/4xada785rr5b1.jpg\"/></div>"},
{"username": "Jolly-Ad8243", "url": "/r/BBBY/comments/13q150x/us_code_351_and_jack_those_tits_we_are_owned/", "time": 1684876791.0, "subreddit": "r/ThePPShow", "title": "US CODE 351 AND JACK THOSE TITS!!! WE ARE OWNED!", "text": null, "preview": ""},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/13l5x93/teddy_holdings_incplausible_deniability/", "time": 1684432750.0, "subreddit": "r/ThePPShow", "title": "Teddy Holdings Inc...Plausible Deniability", "text": "<!-- SC_OFF --><div class=\"md\"><p>Greetings and Salutations soldiers.  This mission is gathering steam, and wanted to share the what i think is about to happen...</p>\n\n<p>We know many things, but those things come and go, and we lose track of them.  Where is the earnings?  We still have not seem anything or heard anything.  What&#39;s the reason for the delay?</p>\n\n<p>Next, as the title says, Teddy Holdings LLC.  I think RC and his master plan is all coming together.  Teddy Holdings filed Trademarks in the household industry back in August of 2022 right before RC split, causing a panic.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/u81rxo7glm0b1.png?width=944&amp;format=png&amp;auto=webp&amp;s=f63097f867cb03499b8e2480fcb792969ad713fd\">Via trademarks.Justia.com</a></p>\n\n<p>I find this interesting and totally related to BBBY as the applications applied for are mostly of the components that BBBY sells.  Searching under each serial number, gives International Class codes of 21 and 42.  If you dive in, you will find that these are direct providers facilitating goods and services to our beloved company.  Some of the companies that have been added since this trademark were updated less then 30 days ago.  So can someone tell me why Teddy Holdings would file a trademark for Goods and Services, unless they had plans to buy a company that currently sells some of these products?  </p>\n\n<p>After further pondering, I wanted to do a little research on Westpoint Home, Carl Icahn&#39;s conglomerate.  I found that Westpoint Homes uses many of the same International Codes that Teddy applied for.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/h841c0honm0b1.png?width=256&amp;format=png&amp;auto=webp&amp;s=78b772b88ad4e92fe6800f9b202132475c1e9d4b\">https://preview.redd.it/h841c0honm0b1.png?width=256&amp;format=png&amp;auto=webp&amp;s=78b772b88ad4e92fe6800f9b202132475c1e9d4b</a></p>\n\n<p>So, is there a chance that Brett resigning from Newell and selling his stake at a loss, was because Teddy Holdings is going to buy them up as well?  I mean, Carl is getting long toothed so to speak.  This picture might speak a 1000 words.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jgrt064gom0b1.png?width=367&amp;format=png&amp;auto=webp&amp;s=7e54e5bd93a046183bbda0b672ade4a55ce42c3d\">Together again</a></p>\n\n<p>This might be a huge transaction and a far stretch, but what if...what if Icahn sells, RC scoops up both Newell, BBBY, Baby, to start an Amazon like experience?  To me, there is more to this than Just BBBY.  When you think business plan, you don&#39;t think about a certain class to sell goods and service to, you thin about the whole pie.  What better way then to have baby goods, middle class goods, and a higher end to serve all your customers.  I think RC, Larry, Little Icahn and possibly Pulte all have skin in the game.  I am on the fence with Pulte after his screenshot of his DRS&#39;d shares of GME, which could label him as an insider.  Either way, I think we come out smelling like roses.  200k cost basis .0797, 100k DRS&#39;s holding for multi-million dollar status or a Wendy&#39;s dumpster.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/paiz2iispm0b1.png?width=398&amp;format=png&amp;auto=webp&amp;s=d08a9301cf29b3966f460cb303a0866e6acd82e5\">https://preview.redd.it/paiz2iispm0b1.png?width=398&amp;format=png&amp;auto=webp&amp;s=d08a9301cf29b3966f460cb303a0866e6acd82e5</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/k_wSNmxS1q6Ud57NoWkmdX-rRH8n7OC_xN9UKqUMGes.jpg\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/13511pb/carl_icahns_newell_took_a_hit_today_sources/", "time": 1682974639.0, "subreddit": "r/ThePPShow", "title": "Carl Icahn's Newell took a hit today. Sources familiar with the matter think M&amp;A leaked.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just what the above says.  Newell&#39;s price broke down today on limited volume.  The stock usually sees 4-5 millions shares traded, to 13 million today.  Tell me something is up without telling me something is up.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jan2ghej9axa1.png?width=775&amp;format=png&amp;auto=webp&amp;s=71730b444283dbed5c5dbc69fbeda28061939152\">NWL reached a 52-week low today and is continuing decling</a></p>\n\n<p>I am a smooth brained regard, but something tells me that they released share for a M&amp;A.  This is NWL&#39;s largest single day price decrease in 5 years.  Something has to give!  Good Luck Apes!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/cMYLJNgYdI_y2g_iDOXQ_6dkaP_nyLhmEu8-k39RYE4.jpg\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/11zi700/was_carrington_right_legend/", "time": 1623718081, "subreddit": "r/ThePPShow", "title": "Was Carrington right!? Legend?", "text": "Love the show!  Last night was epic!  Hal, ABC, William, Simpson, Pete, KJ, uCopy, Carrington, Person _Someone, Real Eyez, LifeTealtionship we’re all great to listen too.  Carrington made me skeptical, but he has off the wall opinions.  I could sense a little disbelief in him, especially the ban if his hypothesis of mooning today didn’t turn out.  Note we have the new 8k…This has to be it.  But I want to give a big shout out to PP!  If you aren’t donating, subscribing, and thanking this dude, you’re missing out.  There is not another individual that lays it down any better the this guy!  Thanks again, and see you on Uranus!", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Jolly-Ad8243", "url": "https://www.reddit.com/r/ThePPShow/comments/11wull6/when_is_the_next_live_pp/", "time": 1623718081, "subreddit": "r/ThePPShow", "title": "When is the next live PP?", "text": "Waiting until ABC comes back?  Thanks bruh!", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]