[{"username": "Juststellar", "url": "https://i.redd.it/ex9kyvsivqxb1.jpg", "time": 1698848068.0, "subreddit": "r/ThePPShow", "title": "Pump and dump judge reassignment", "text": "<!-- SC_OFF --><div class=\"md\"><p>The case has been reassigned from Judge Paul G. Gardephe to Judge Dale E. Ho.  Anyone have any DD on these judges or speculation on why the case would get reassigned so late in the game?</p>\n</div><!-- SC_ON -->", "flair": {"text": "🦋 $BUTT 🦋", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ex9kyvsivqxb1.jpg\"/></div>"},
{"username": "Juststellar", "url": "https://youtu.be/ApC91MLrg3s?si=3OQwsh-tgwe1bAwR", "time": 1697064168.0, "subreddit": "r/ThePPShow", "title": "Float like a 🦋", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/ApC91MLrg3s/maxresdefault.jpg\"/></div>"},
{"username": "Juststellar", "url": "https://i.redd.it/cqmeswlwqktb1.jpg", "time": 1697030481.0, "subreddit": "r/ThePPShow", "title": "What’s this?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is this the GMEDD guys? Copied from deep house on Twitter.  What info are they after?</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/cqmeswlwqktb1.jpg\"/></div>"},
{"username": "Juststellar", "url": "https://www.reddit.com/r/ThePPShow/comments/16qxgoh/its_bigger_than_you_think/", "time": 1695561194.0, "subreddit": "r/ThePPShow", "title": "It's bigger than you think", "text": "<!-- SC_OFF --><div class=\"md\"><p>I posted this in response to a shill in the other sub and they promptly deleted their comment. I’ve been hanging here lately and I feel this sub gotten bigger than just pp’s show. I enjoy it here, good job guys!  It’s part of a migration from sub to sub, where those who are aware, are free to gather and discuss theories before being infiltrated by nefarious actors.   Unfortunately though… when a sub becomes aware, it’s attacked and crippled.... </p>\n\n<p>These are my own delusions, don&#39;t you know I&#39;m loco....  </p>\n\n<p>I’ve been studying this stuff since December 20’ and have read every DD that’s been written and that has shaped my opinion of what’s going on. I went back and watched every big kitty video, some of them many times over and I feel that I’ve been evolving in my investing path. I first started buying in bed bath in dec21 when Tritton announced that they were way ahead of schedule in their share buybacks in their earnings call. I had no understanding of a balance sheet at the time, and just thought a lower float with that high short interest made it ripe for a squeeze.  Institutional ownership was over 100% at the time. Then the price tanked and I got out for my first loss. Bought back in after the Cohen letter, and had some varying degrees of success playing calls into the cycle run ups, while expecting one of those meme squeezes to purge the shorts that never happened.  </p>\n\n<p>I thought for sure that the board would sell Ryan baby to save the company, but it never materialized, and everyone here knows the story from July on. I like everyone else, started digging deeper into the story, connecting the dots, reading biggie’s dd and coming up with some vague speculation of my own that didn’t happen on the timeline that I expected. The critics will dismiss this as the ramblings of a delusional conspiracy theorist, and they’re not entirely wrong. I feel that’s what makes this play so dangerous to them, as investors in this haven’t made the rational decisions they expected, and are just crazy enough to ride this out to the end.  </p>\n\n<p>I wrote a metaphor on ss back when FTX collapsed, saying that was an earthquake within the financial system sending waves off to the distant shores. I expected this financial tsunami to wash up on the coast and catch everyone by surprise by now, but maybe the friction of the bottom has slowed the waves down enough that we are now at the point were we’re seeing the waters recede before that wave splashes down on us.   </p>\n\n<p>This is not a DD with any sort of data, simply my big picture thoughts and hype post to what’s going on and also a fed up response to a shill asking me what’s the connection between GameStop, roaring kitty being silenced and Bobby with a couple minor additions. Again, they deleted their comment as soon as I wrote this, most likely to bury my comment on the other sub….  </p>\n\n<p>Nothing really, but everything at the same time.  This isn’t about Bobby anymore, Bobby is gone.  If you’re still here, you’re invested in a theory of what’s to come next.  Many people have connected the dots and have ended up with the same picture.  Yes, it’s not explicitly laid out in the filings, but the potential is there. This play is a leap of faith that I’m taking, as so are many others.  This sub is just about as dead as the old bbby stock.  There’s been a coordinated effort to flush out those who are sincere with whiny drivel complaining about different aspects of this situation. It’s the same playbook that’s existed for over 30 years.  Sow the seeds of fear uncertainty and doubt.  It’s a psychological game to affect public opinion by way of discussion and comments, planting the seeds of doubt slowly overtime, so you move in a way that is engineered.  </p>\n\n<p>When people became aware, they were splintered apart and banished from the original bets. They migrated to multiple other subs that were systematically infiltrated by “mods”.  Migrating from sub to sub in the search of freedom all while losing some along the way.  The last 2 subs were this one, and the s-s, which have also been inflated and infected by bitter melt-e’s who are actually nefarious actors and wannabe trolls thinking that they have a superiority complex and are upset with how others are investing their money.  These users try to blend in and many are from financial institutions. They have played this game long before reddit, starting at the birth of the internet, using various message boards, bulletin boards, chat rooms to sow their messaging, whether it’s a pump or a short, we are the players and the ammo that’s used to execute their plans and move their money, ultimately being played in the process.  </p>\n\n<p>The stock market isn’t about fundamentals anymore, Cramer said as much and explained the mechanics over 16 years ago in that infamous interview.  He said, that’s the great thing about the market as it’s detached from the fundamentals and you can move the prices to where you want them.  Fundamentals only matter when they want a reason to pin a stock to a price, for the profit of a few.   </p>\n\n<p>What happened in 21’ is the people became aware, and this became dangerous to those who run this system.  It almost all crashed in 21’ due to this awakening, and an altruistic young man, that was somewhat of a rebel at heart. He threw a wrench into the coordinated private equity / bankruptcy bust out scheme.  The can was then kicked and the system saved, not for the poors or the individuals, but for the status quo.   </p>\n\n<p>If only they could contain this, divide the people, and form a narrative using the owned media and strategically planted insiders. They would be able to maintain this system that has made this small club extremely rich, richer than the politicians, and richer than the ceos’s.  The one flaw in this plan was they needed to make bigger bets to offset those bad bets from 21’ and before. They needed the upmost confidence in these plays to reset their books. I believe this was conceived at the time of the sneeze.  The plan was hatched and implemented as it was a sure thing,  as that one altruistic youngster was a bit naïve in understanding the extent in which the system could be controlled and engineered back into the big bankers club’s favor.   </p>\n\n<p>The problem in this plan is that we are relentless, we made our voices heard, they take our money and we make more, just to buy and hold.  The corrupt at the sec ignored, but there were some that were listening. These people are higher up than the sec, and actually have the ability to enforce the law.  That altruistic young rebel never gave up. He continued to research and form partnerships that would ultimately put him on an unstoppable path, as he has the people by his side who recognize what the fight is actually about, and now knows how to follow the law and flip their rules on them.  It’s not about GameStop becoming profitable and killing the short thesis and it’s not about the stock price of the stock we like here.  It’s about putting an end to this system that preys on the masses to enrich the few at the expense of the public and victim companies that were at crossroads.  There’s something big lurking in the background and some people are aware.  The signs are out there, FTX, Bermuda shell corporations, tokenized stocks, sec crackdowns on market makers, the engineered bankruptcy of bed bath &amp; BEYOND. This big push lately of the vocal resistance, is the last cry of the old guard. There are knights on our side and they’ve been fighting in the shadows.  What happens next, will happen soon, and what was happening in the dark is about to come to light.  Good will prevail. Notes are being taken, history is about to be written. This isn’t about a stock we like, but it starts there and will be the catalyst for change.  Block out the noise and buckle up, cause when shit goes down, ya better be ready.  </p>\n\n<p>TLDR:<br/>\n-shills are a mix of institutional employees and trolls and maybe even executives<br/>\n-they have been playing the misinformation game since aol<br/>\n-RC got in the way of the bust out scheme<br/>\n-they stopped the sneeze by placing bigger bets<br/>\n-RC learned a lot, and got help to see his grand plan through<br/>\n-this stock will break the camels back and usher in change<br/>\n-the noise is loud because we are right, and close<br/>\n-shorts are fucked, they bet more than they could afford to lose.\n-this is bigger than you think </p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]