[{"username": "K7Phi", "url": "https://www.reddit.com/gallery/17uiuw5", "time": 1699904399.0, "subreddit": "r/ThePPShow", "title": "I'd like to challenge the idea that the plan will be modified", "text": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s been lots of conversation that the plan still be modified because it hasn&#39;t been substantially consummated.</p>\n\n<p>If you go to Docket 2169 which is the Amended Chapter 11 plan filed on September 11, 2023, it notes that &quot;Substantial consummation of the plan... shall be deemed to have occurred on the effective date.&quot;</p>\n\n<p>The effective date was September 29, 2023, therefore the plan is deemed to be substantially consummated on September 29, 2023.</p>\n\n<p>Because of this, I think it is pretty unlikely that we will see a modification to the plan.</p>\n\n<p>Now keep in mind it is not the plan that inherently is the issue. </p>\n\n<p>The plan already allows for a liquidation transactions which is defined to include any merger, amalgamation, etc. This is what we want.</p>\n\n<p>The plan also states that any asset sale transaction will be conducted pursuing to the bidding procedures, be approved by the court prior to the effective date, or be otherwise authorized by the plan.</p>\n\n<p>The bidding procedures allows for credit bids.</p>\n\n<p>So the plan as it is is is not actually the issue, it&#39;s only the expected recoveries within the plan that was the issue.</p>\n\n<p>However, consider the scenario where there is an infusion of additional financing creating the ability to satisfy creditors in whole, and subsequently keep shareholders intact as well. Is it possible the nearly 11B claim is instrumental to this? </p>\n\n<p>I&#39;ve also heard the idea that bonds may just be reinstated into the emerging company. That would mean the approx 1B in bond debt can just be carried on and paid out over time, making bondholders whole, and again allowing the opportunity to keep shareholders intact.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/hqAF8O-ztws_781sX35-Pywr0wkGJf5kYBx1nAaC8ms.jpg\"/></div>"},
{"username": "K7Phi", "url": "https://www.reddit.com/gallery/17mctlp", "time": 1698956708.0, "subreddit": "r/ThePPShow", "title": "Response to 8ean post below, potential fee applications outstanding", "text": "<!-- SC_OFF --><div class=\"md\"><p>Docket 2315, most recent MOR report for Bed Bath &amp; Beyond Inc. lists &#39;Debtor&#39;s professionals&#39;.</p>\n\n<p>Final fee statements/compensation apllications have been received for the highlighted firms.</p>\n\n<p>I&#39;m not 100% sure if each of the non-highlighted firms will have to submit their statements.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/kvk4nMNcM3tO8ZpFjsr4ihhVnq0K5UdKYJgGkHFcQEI.jpg\"/></div>"},
{"username": "K7Phi", "url": "https://www.reddit.com/gallery/17ilsj2", "time": 1698523324.0, "subreddit": "r/ThePPShow", "title": "More TSO mystery?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just pointing out some more possible share count discrepancy.</p>\n\n<p>Picture 1 from Docket 36 filed April 23, 2023 on the first day of bankruptcy: This docket is the Declaration of David Kurtz, Vice Chairman and the Global Head of the Restructuring Group of Lazard at the time, in Support of the Debtors&#39; Motion to obtain postpetition (eg. DIP) financing.</p>\n\n<p>Mr. Kurtz reported &quot;On March 30, 2023... the Company exchanged the remaining Preferred Stock Warrants for shares of common stock.&quot;</p>\n\n<p>OK, cool.</p>\n\n<p>Picture 2 from Docket 219 filed May 5, 2023, list of equity security holders:</p>\n\n<p>Cede &amp; Co reports:\n- 776, 404, 408 shares of Common Stock (this is not including the additional shares DRS&#39;d)\n- 180 Preferred Stock\n- 1,234,693 warrants</p>\n\n<p>Pictures 3-5 are from recent Docket 2631 filed October 27, 2023 reporting:</p>\n\n<ul>\n<li><p>701,290,253 shares of Common Stock (approx 75 million less than what Cede &amp; Co reported in May. Did retail holders DRS 75 million shares between May and end of September? Who knows, maybe)</p></li>\n<li><p>170 Preferred Stock (only 10 less than the 180 reported by Cede &amp; Co in May)</p></li>\n<li><p>1,234,693 Common Stock warrants (no change compared to what Cede &amp; Co reported)</p></li>\n</ul>\n\n<p>I&#39;m not making any conclusions about this information, just want to put it out there. </p>\n\n<p>I know there&#39;s been a lot of work and really good posts done about TSO already. For some of you that worked on these posts, I wonder what effects these new numbers might have, if any?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/anuB1ha6Rmvnc0lvRHZ40FSFm503Yj7vXIhVAcPij7g.jpg\"/></div>"},
{"username": "K7Phi", "url": "https://www.reddit.com/gallery/15zrkng", "time": 1692851901.0, "subreddit": "r/ThePPShow", "title": "More info on Sixth Street and other findings from monthly fee statements", "text": "<!-- SC_OFF --><div class=\"md\"><p>User SmoothRevolution (I don&#39;t know how to them them, sorry) put up a post on bbby subreddit tonight about discussions with Sixth Street and baby from AP services June fee statement.</p>\n\n<p>I&#39;ve also been looking through the fee statements tonight and found some interesting nuggets.</p>\n\n<p>I skimmed through the following dockets:</p>\n\n<ul>\n<li>Docket 1497, June fee statement for Kroll Restructuring Administration </li>\n<li>Docket 1516, June fee statement for Cole Schotz</li>\n<li>Docket 1682, June fee statement for Pachulski Stang Ziehl &amp; Jones</li>\n<li>Docket 1683, June fee statement for Alvarez &amp; Marsal</li>\n<li>Docket 1686, June fee statement for Lazard Freres</li>\n<li>Docket 1873, June fee statement for Kirkland &amp; Ellis</li>\n</ul>\n\n<p>I skipped the April and May statement because most of the action of the bids, auctions, and sales were done in June. The only fee statement for July that is currently out is docket 2034 for Kroll, and this has been already discussed some what I believe.</p>\n\n<p>Let&#39;s get to the interesting stuff. First, Sixth Street.</p>\n\n<ol>\n<li><p>Image 1, June 16 - Teleconference with D. Hillman regarding credit bid.</p>\n\n<p>Remember David Hillman is the slick talking bad ass lawyer from Proskauer, representing Sixth Street/DIP lenders.</p></li>\n<li><p>Image 2, June 27 - Draft and revise issues list re Sixth Street&#39;s purchase agreement. (Credit to user PaddlingUpShitCreek for highlighting this in their post yesterday which got me curious about looking further. Again the tagging thing here, sorry)</p></li>\n</ol>\n\n<p>By now most are familiar with the qualified bidder criteria. We&#39;ll, guess what, submitting a purchase agreement was part of that criteria (See docket 92, page 20 of 120, section IV, d. &#39;Same or better terms, Bid documents). </p>\n\n<p>The fact that Sixth Street had a purchase agreement seems to imply they did in fact submit a bid in June. Ultimately, right now we have no idea if that was or wasn&#39;t the case, or what happened to the bid if it was submitted, but it&#39;s certainly interesting to me.</p>\n\n<p>The rest of the pictures are just some other billed services that I also found interesting.</p>\n\n<ol>\n<li><p>Image 3, June 2 - Call with potential financing party. Note this was after DIP financing was already established.</p></li>\n<li><p>Image 4, June 14 - Correspond re transferring employee records.</p></li>\n<li><p>Image 5, June 25 - Review and revise employee leasing agreement.</p></li>\n<li><p>Image 6, June 28 - Review equity transactions for executives.</p></li>\n<li><p>Image 7, June 29 - Review SEC filings re stock issued. This lawyer spent 2.3 hours on this. Yep.</p></li>\n<li><p>Image 8, June 29 - Analyze going concern bids. Bids. Multiple.</p></li>\n</ol>\n\n<p>It&#39;s difficult to draw any meaningful conclusions from the services from images 3-8 as their only a brief snapshot into what has actually happened, and the counter party to each service is not known. It is though some interesting insight into the types of discussions that have been held behind closed doors.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/WiS0_jfwlEEaaRU_TwKDY5rqiPqC2IlwVgHrhdeO7w8.jpg\"/></div>"},
{"username": "K7Phi", "url": "https://www.reddit.com/r/ThePPShow/comments/15yuh1i/workday_discussion/", "time": 1692768969.0, "subreddit": "r/ThePPShow", "title": "Workday discussion", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just heard the discussion on the show about the WorkDay 1.4M accounts payable. I looked quickly through Kroll for dockets and claims related to Workday.</p>\n\n<p>Searching claims by &#39;Workday&#39; shows:\n1. Claim 10474 filed 07/06/23 for $1,435,891\n2. Claim 10469 filed 07/0623 for $104,190\n3. Schedule 5269090, seems related to Claim 10469</p>\n\n<p>Searching dockets by &#39;Workday&#39; shows:\nDocket 1058 filed June 26, 2023 which is a response, on behalf of Workday, to a Notice to contract parties to potentially assumed executory contracts and unexpired leases. (Original notice to contract parties is docket 714)</p>\n\n<p>The docket states a few important things: </p>\n\n<p>&#39;On July 3, 2017, Debtor Bed Bath &amp; Beyond Inc. (“BBBY”) executed a Master Subscription Agreement (as amended, “MSA”) with Workday...&#39;</p>\n\n<p>&#39;The Debtors’ Proposed Cure Amount—$104,190.00—correctly reflects the total prepetition balance...&#39; (same amount as Claim 10469)</p>\n\n<p>It also states &#39;Workday reserves all rights with respect to postpetition invoices...including the right to require payment in full of all postpetition \ninvoices&#39;</p>\n\n<p>Copies of postpetition invoices were included in the docket.</p>\n\n<p>There are 2 postpetition invoices, one for $891,918, and the second for $543,973. Total $1,435,891. (Same as claim 10474, and same amount listed on docket 1958 as amount payable, but not yet due, to Workday)</p>\n\n<p>So, we know BBBY had contracts with Workday since 2017, there is a Workday claim for prepetition balance of $104,190, and there is a Workday claim for postpetition invoices totalling $1,435,891. </p>\n\n<p>This doesn&#39;t really confirm if the Debtors plan to continue using Workday or not, or if Workday is just claiming the amounts that they expected to receive based on the service agreement. I just want to provide some additional info about where these numbers come from.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "K7Phi", "url": "https://www.reddit.com/r/ThePPShow/comments/14bc3zu/biddingauction_info/", "time": 1686960516.0, "subreddit": "r/ThePPShow", "title": "Bidding/auction info", "text": "<!-- SC_OFF --><div class=\"md\"><p>Docket 92 is a good read if you haven&#39;t looked through it. This is the order authorizing bidding and auction procedures, and includes the rules for these procedures attached as exhibits.</p>\n\n<p>Just some key points that are good to know based on my understanding of the docket</p>\n\n<ul>\n<li>If there are multiple bids for a specific asset or for all assets, this MUST be resolved at auction. \n-I think the auction will only be canceled if there were not multiple bids received. Of course if a single bid is received that is astronomical then this is great. Otherwise, auction is likely most fabourable June 27, 2:30 pm EST</li>\n<li>best bids will be determined by multiple factors including monetary value but also overall value and impact to stakeholders as determined by the company and their consulting parties</li>\n<li>highest/best bid at the end of the bid submission deadline that was earlier today will set the floor bid going into auction</li>\n<li>at the auction, to outbid the previous best offer, it must be increased by at least 2%</li>\n<li>results will be announced at the sale hearing</li>\n</ul>\n\n<p>This is my quick takeaway. Seems we likely won&#39;t hear much about who the successful bidders are until the sale hearing which is currently scheduled for June 27 at 2: 30 pmso don&#39;t get discouraged if nothing much comes out until then</p>\n\n<p>Love you all</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]