[{"username": "Kaelderin", "url": "https://www.reddit.com/r/ThePPShow/comments/133688i/363_the_number_to_salvation/", "time": 1682801116.0, "subreddit": "r/ThePPShow", "title": "363 the number to salvation?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello folks,</p>\n\n<p>This is not a financial advice but wanted to share some thoughts this saturday evening. As Bed Bath and Beyond unfortunately filed for chapter 11 a week ago, these news hit shareholders with a saddened heart, me included.</p>\n\n<p>But is it really that bad? The key to all this could be in the number 363.</p>\n\n<p><strong>1.  What is 363?</strong></p>\n\n<p>A 363 sale refers to the sale of an organization’s assets under Section 363 of the US Bankruptcy Code. The sale enables debtors to fulfill their obligations to creditors by selling their assets and using the funds collected to settle their debts.</p>\n\n<p>Source: <a href=\"https://corporatefinanceinstitute.com/resources/valuation/363-sale/\">https://corporatefinanceinstitute.com/resources/valuation/363-sale/</a></p>\n\n<p>I  listened to some jurists holding a seminrar at EmorySchoolofLaw and had the following notices:</p>\n\n<ul>\n<li>A chapter 11 sale under US bankruptcy code 363  sale gives the debtor (company) to negotiate with a potential buyer without the creditors intervention.</li>\n<li>Unlocks value for the company as the buyer can focuse more on the value of assets instead of the debt.</li>\n<li>A buyer in a 363 contract doesnt necessarily have to bring current debt over to the acquiring party. Its free of lien and cleared from debt.</li>\n<li>Creditors cant put pressure on debtor to pay up during a 363 sale.</li>\n<li>A 363 sale is very favourable for the debtor and gives the debtor more flexibility to choose the buyer.</li>\n<li>The debtor announces the succesful bidder and gets a federal court approval. the unsuccesful bidder who lost the bid can&#39;t appeal against the debtor or make any litigation case against the debtor.</li>\n</ul>\n\n<p>Source:<a href=\"https://www.youtube.com/watch?v=bPk4cvdo6aA\">https://www.youtube.com/watch?v=bPk4cvdo6aA</a></p>\n\n<p>From my understanding this is a perfect way out for the board to be able to unlock the real potential value and auction out the company and its assets to sell it for a premium and fair market value without considering the bad debt of the company. And above all no creditor (yes im looking at you JPM) can intervene in the sale process. This bankruptcy code 363 that the board applied further confirms that someone intervened back in January as some redditors been speculating.</p>\n\n<p>The board has to only make sure that creditors of first, second and third lien gets payed accordingly as per law. With a 363 sale they will be able to pay down all creditors. I do assume that the winning buyer will also soon announce a substantial bondholding where they can exchange debt for equity (though speculation). Didnt someone recently buy 500M of debt for 15M?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/bsssuwaxuvwa1.png?width=944&amp;format=png&amp;auto=webp&amp;s=93f9f6f6a6c2c6c8333b440ca66b5d1377b5e978\"> Source: https://bedbathandbeyond.gcs-web.com/news-releases/news-release-details/bed-bath-beyond-inc-files-voluntary-chapter-11-petitions </a></p>\n\n<p><strong>2. The weirdness of this Bed Bath and Beyond board.</strong></p>\n\n<p>Here are some mysterious facts that just doesnt make sense.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>The board had the ability to raise cash in jan-feb spike with a offering but did not. They did have the 150M usd ATM offering active during this two spikes but didnt dilute nor did they announce another offering.</li>\n<li>They started a warrant conversion deal with Hudson Bay but cancelled it.</li>\n<li>They initiated a public market offering of 300M usd worth of shares in the end of march which was impossible to complete in full considering the share price and with the amount of treasury shares being available to issue to the open market. This offering had a deadline of 26th of april.</li>\n<li>They declared a RS split to be announced almost a few days after the ATM offering announcement above but this was delayed up to may 9th. This RS vote should had been held first 2 weeks of april in order to be able to RS the stock and raise more capital but no. It was instead delayed.</li>\n</ul>\n\n<p><strong>3. Arrival of the White Wizard</strong></p>\n\n<p>I was listening to the PPshow (thanks PP <a href=\"/u/ppseeds\">u/ppseeds</a> and ABC <a href=\"/u/honestbeing444\">u/honestbeing444</a> and the rest) for still believing. And thank you AJ for the conviction and for making me read RC’s letter again.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nfjblur0vvwa1.png?width=1675&amp;format=png&amp;auto=webp&amp;s=889f4ad2484757df860d48d3c3b789912411a7eb\">The boys</a></p>\n\n<p>Remember who wanted to pay a fair premium in a potential sale?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/4o7idcphvvwa1.png?width=535&amp;format=png&amp;auto=webp&amp;s=0a818091e8a3269f7933a1191ba1048a7a16aa83\"> \\&quot;Look to my coming on the first light of the fifth day, at dawn look to the east.\\&quot; - Ryan Gandalf Cohen ?</a></p>\n\n<p>Guys are you seeing the following sentence from the letter on page 3-4 ?</p>\n\n<ol>\n<li><em>Evaluate a Full Sale to a Well-Capitalized Acquirer – The final path we want to raise for consideration is a full sale of Bed Bath, in its current form, to one of the many well-capitalized financial sponsors with track records in the retail and consumer sectors and the ability to pay a meaningful premium. The past 10 years have shown that Bed Bath faces a difficult existence in the public market. The market is not giving the Company nearly enough credit for BABY’s value. A sale that can lock in a substantial premium for shareholders and provide Bed Bath the flexibility of the private market could be an ideal outcome for customers, employees and investors. We believe Bed Bath presently satisfies financial sponsors’ interest in specialty retailers with recognizable brands, niche assets and sub-banners, and margin expansion opportunities. A private market participant with a long-term vision could unlock meaningful value by running the core business for cash and initiating a public offering for BABY at the optimal time. After stripping out the sizable costs of being a public company and setting a more focused strategy, we suspect Bed Bath’s core business — excluding BABY — could generate attractive earnings.</em></li>\n</ol>\n\n<p>Read again:</p>\n\n<p><a href=\"https://preview.redd.it/qu8o46kxwvwa1.png?width=635&amp;format=png&amp;auto=webp&amp;s=47e5a18e9a38359aa25e413a3a183400739fdc46\"> Source: RC letter to the BBBY board page 3-4 </a></p>\n\n<p>Maybe RC or the board wants this stock to be delisted from Nasdaq and take it private due to the abusive short selling and give shareholders a fair value of the company after a potential sale of the company?</p>\n\n<p>Edit: I would like to add the following text from from what seems to be a investment association.</p>\n\n<p>&quot;However, the last few years have seen a significant rise in the amount invested in private markets. Private markets are investments made in assets not traded on a public exchange or stock market. This might include, for example, private equity (investments made in private companies), or private debt, when investors lend directly to borrowers where there is no market to trade that debt on. &quot;</p>\n\n<p>Source:   <a href=\"https://www.theia.org/news/saving-matters/private-markets-what-they-are-and-why-they-are-important\">https://www.theia.org/news/saving-matters/private-markets-what-they-are-and-why-they-are-important</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>4. Conclusion</strong></p>\n\n<p>Lets get real. The people on the board arent dumb as they present themselves. If we go per face value that they intentionally drove this company on the ground then I would be absolutely suprised.</p>\n\n<p>What does PP always say? “Something feels strange, it just doesnt add up”</p>\n\n<p>&#x200B;</p>\n\n<p>Feel free to comment and discuss. Would love to hear your input.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ywSaQUIphdRiQ9JsQWLN3MdroOfjM1N1jMaV5Jv_DGc.jpg\"/></div>"},
{"username": "Kaelderin", "url": "https://i.redd.it/hsixkmhb2fua1.jpg", "time": 1681706997.0, "subreddit": "r/ThePPShow", "title": "RC _co_ry just tweeted", "text": "<!-- SC_OFF --><div class=\"md\"><p>👀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/hsixkmhb2fua1.jpg\"/></div>"},
{"username": "Kaelderin", "url": "https://www.reddit.com/r/ThePPShow/comments/12onszm/what_the_heck_is_going_on/", "time": 1681676957.0, "subreddit": "r/ThePPShow", "title": "What the heck is going on?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I took a break from reddit/twitter but saw the  tweet from Roach about the board being compromised and now Kais going ham against Sue?</p>\n\n<p>We need a emergency ppshow <a href=\"/u/ppseeds\">u/ppseeds</a></p>\n\n<p>Are shareholders in deep trouble and is the RS a poison pill? If what above gents says is true then RCs tweet was 99% a direct tweet about BBBY.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]