[{"username": "Kaleen16", "url": "https://i.redd.it/io3ez9hlunzb1.jpg", "time": 1699683132.0, "subreddit": "r/ThePPShow", "title": "FTX token up 257% in 7 days. Completely normal.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ya’ll remember when Brett Harrison went on an interview and confirmed that GME stocks were tokenized? I wonder what is the underlying collateral for some of those tokens could be. </p>\n\n<p>Also, why is that former Kenny bitch boy not being subpoenaed and forced to testify?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/io3ez9hlunzb1.jpg\"/></div>"},
{"username": "Kaleen16", "url": "https://www.reddit.com/r/ThePPShow/comments/17r8aht/2008_flashback_freddie_mac_investigates_top_loan/", "time": 1699517627.0, "subreddit": "r/ThePPShow", "title": "2008 Flashback? Freddie Mac Investigates Top Loan Originator Meridian's Dubious Deals", "text": "<!-- SC_OFF --><div class=\"md\"><p>Title: Meridian Hits a Home Run but Might Strike Out</p>\n\n<p>Body: So Meridian&#39;s been killing it, right? Top dog in Freddie Mac and Fannie Mae loans for seven years straight. But hold up, they just got caught playing dirty. Freddie Mac&#39;s got them under the magnifying glass because of some sketchy loans.</p>\n\n<p>Word on the street is, if these loans don&#39;t meet Freddie&#39;s standards, Meridian might have to buy them back. But here&#39;s the tea: Meridian’s pockets aren&#39;t deep enough for that. They&#39;ve been handing out FHA loans like candy at a parade, except the candy&#39;s bad and the parade&#39;s for properties making bank as rentals.</p>\n\n<p>They&#39;ve been fudging numbers on the down-low. This mess feels like a bad rerun we&#39;ve all seen before, doesn&#39;t it? How come this isn&#39;t blowing up the news? When the music stops and there&#39;s no chair to sit on, who&#39;s gonna clean up this mess? Everyone&#39;s running on fumes.</p>\n\n<p>Also, DTCC just asked for collateral improvement in MBS!!! Here we go boys! The ship is sinking.</p>\n\n<p>Just don’t dance.</p>\n\n<p>They’re all going to start dumping soon.</p>\n\n<p><a href=\"https://commercialobserver.com/2023/11/freddie-mac-halts-dealmaking-for-meridian-capital-launches-probe/\">https://commercialobserver.com/2023/11/freddie-mac-halts-dealmaking-for-meridian-capital-launches-probe/</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Kaleen16", "url": "https://www.reddit.com/gallery/17r5gje", "time": 1699505844.0, "subreddit": "r/ThePPShow", "title": "Doug Cifu is mad. The fact that he replies, let’s you know that he’s fucked. Why does he care about a small bankrupt company.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Something that never made sense to me was that if the stocks are worthless, why do they care so much that we are investors. Simply sad if the stock was worthless why don’t they move on.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/IEQKt3zZfOPtDQo62TXU-mAVZ-aeQlyqWCGWEcFIo9U.jpg\"/></div>"},
{"username": "Kaleen16", "url": "https://www.reddit.com/gallery/17q7iu3", "time": 1699398884.0, "subreddit": "r/ThePPShow", "title": "Bear trap is activated!", "text": "<!-- SC_OFF --><div class=\"md\"><p>There you have it! Bobby is the bear trap. Once we get rocket fuel from our investments in Bobby, we will be able to drs the GME float.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/bEcbxBE5OkriXKIpnc83e91YbEbZnRdG5bwurYq6Bw0.jpg\"/></div>"},
{"username": "Kaleen16", "url": "https://www.reddit.com/gallery/17mgdg6", "time": 1698965904.0, "subreddit": "r/ThePPShow", "title": "Margin Call-Larry Cheng on X", "text": "<!-- SC_OFF --><div class=\"md\"><p>Welp boys, is it what I think it is? If so, I’m doing some wishlist shopping tonight.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ZWnf310J_9qHxAAL8HMhPijI43h5NM6kbIYf3_0MKKQ.jpg\"/></div>"},
{"username": "Kaleen16", "url": "https://www.reddit.com/r/ThePPShow/comments/17hy3s5/tswifts_dad_bank_of_america_executivethe_mystery/", "time": 1698442359.0, "subreddit": "r/ThePPShow", "title": "TSwift’s Dad, Bank of America Executive-The Mystery of Taylor Swift's Dad and the 2008 Financial Crisis", "text": "<!-- SC_OFF --><div class=\"md\"><p>Here’s some black tar for your Friday!</p>\n\n<p>Did you know Taylor Swift&#39;s dad, Scott Kingsley Swift, worked at Merrill Lynch during the 2008 financial meltdown? For those unfamiliar, Merrill had a heavy hand in the crisis due to their subprime mortgage exposure, risky securities (like CDOs), and high leverage. When the housing bubble burst, firms like Merrill faced massive losses, leading to Bank of America acquiring them.</p>\n\n<p>Now, here&#39;s where it gets interesting: Scott Swift, once a VP at Merrill Lynch, currently runs the Swift Group under Bank of America&#39;s Merrill re-brand. What&#39;s peculiar? It seems much of his public info has been wiped from the internet. How does a former VP at such a pivotal firm during a global crisis manage that? 🤔</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Kaleen16", "url": "https://www.reddit.com/r/ThePPShow/comments/17f64zw/btc_is_getting_pumped_so_hard_kenny_will_be/", "time": 1698128272.0, "subreddit": "r/ThePPShow", "title": "BTC is getting pumped so hard, Kenny will be dumping on every retail Crypto investor that is about to fall for his honeypot.", "text": "<!-- SC_OFF --><div class=\"md\"><p>For those who&#39;ve been following both crypto and GME since 2019, you&#39;ll notice a clear correlation between the two. They tend to move in sync. However, it&#39;s intriguing how each downturn coincides with seemingly questionable news articles like &quot;China shuts off miners.&quot; 🤔</p>\n\n<p>Kenny&#39;s algorithm is quite slick, enabling rapid dumps and masking their actions through trending Twitter algorithms. They&#39;ve got the game rigged with predictive tools. </p>\n\n<p>It&#39;s apparent they realize their game is approaching its end, and this crypto surge seems like a desperate breath of air, especially since their tether-backed collateral is unraveling. </p>\n\n<p>The stability of collateral behind tether and circle is crumbling, with issues like Treasuries, Evergrande, and Chinese paper adding to the mix. </p>\n\n<p>Indeed, the landscape is more complex than meets the eye. Not only are we witnessing the unraveling of tether and circle collateral, but there are also concerning signs in other areas. </p>\n\n<p>The subprime car loan market is showing signs of strain, and questionable Airbnb financing adds to the mix. Additionally, the shaky state of commercial real estate holdings and their potential losses is another piece of this intricate puzzle. </p>\n\n<p>It&#39;s a multifaceted situation that demands close attention and scrutiny.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Kaleen16", "url": "https://i.redd.it/b3umu421ymvb1.jpg", "time": 1697928789.0, "subreddit": "r/ThePPShow", "title": "Fuck Vlad, all of a sudden he cares about retail. Fuck him, dry.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Thank you for the sub. This post would be downvoted all bad on SS. </p>\n\n<p>Fuck Vlad. Is it a coincidence that every broker is down for maintenance? Nope, they all have to upgrade their shit to improve transparency. </p>\n\n<p>They know they are fucked.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/b3umu421ymvb1.jpg\"/></div>"}]