[{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/17zvgkk/the_reason_todays_exclusivity_period_ending_is/", "time": 1700505487.0, "subreddit": "r/ThePPShow", "title": "The reason today's exclusivity period ending is significant", "text": "<!-- SC_OFF --><div class=\"md\"><p>Lots of hype for today and tomorrow since the exclusivity period ends today. But why is that significant for BBBYQ?</p>\n\n<p>As we know, the current amended plan has shareholders receiving no recovery. But who can submit a chapter 11 plan, and more importantly who can submit one after the exclusivity period? A creditor. Who&#39;s been mentioned many times as a creditor... oh yeah. RC</p>\n\n<blockquote>\n<p>The debtor (except for a &quot;small business debtor&quot;) has a 120-day period during which it has an exclusive right to file a plan. 11 U.S.C. § 1121(b). This exclusivity period may be extended or reduced by the court. But in no event may the exclusivity period, including all extensions, be longer than 18 months. 11 U.S.C. § 1121(d). After the exclusivity period has expired, a creditor or the case trustee may file a competing plan. The U.S. trustee may not file a plan. 11 U.S.C. § 307.</p>\n</blockquote>\n\n<p>Sauce: <a href=\"https://www.uscourts.gov/services-forms/bankruptcy/bankruptcy-basics/chapter-11-bankruptcy-basics\">https://www.uscourts.gov/services-forms/bankruptcy/bankruptcy-basics/chapter-11-bankruptcy-basics</a></p>\n\n<p>Today or tomorrow feels like it truly is about to be spicy. </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/17xj4l3/does_the_united_states_of_america_attorney/", "time": 1700239199.0, "subreddit": "r/ThePPShow", "title": "Does the United States of America Attorney General and US Depot of Justice always get bankruptcy payment documents?", "text": "<!-- SC_OFF --><div class=\"md\"><p>As the title says. Docket 2701 has copies of final fee payments going to the United States of America Attorney General, which seems odd for a normal bankruptcy, but not for one to prove a lot of illegal trading activates. </p>\n\n<p>Is it common/normal for bankrupt companies to provide copies to the Attorney General?</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/17koiwb/watch_for_bankruptcy_code_1127_and_the/", "time": 1698768304.0, "subreddit": "r/ThePPShow", "title": "Watch for Bankruptcy Code 1127 and the cancellation of shares to be undone", "text": "<!-- SC_OFF --><div class=\"md\"><p>Our beloved ticker is starting to appear again in brokerage searches and on the NASDAQ. I have yet to see anyone with removed shares show their shares back in their brokerage account. </p>\n\n<p>I saw a post titled &quot; <a href=\"https://www.reddit.com/r/ThePPShow/comments/17knsxz/you_cannot_uncancel_cancelled_shares/\">You cannot uncancel cancelled shares?</a> &quot; and that the statement came from one of the lawyers during today&#39;s hearing.</p>\n\n<p><strong>HOWEVER that appears to be false!!!</strong> <em>DISCLAIMER - I am not a lawyer. I can read, kind of.</em> </p>\n\n<p>Bankruptcy Code 1127, specifically section (b). You can read the code here: <a href=\"https://www.law.cornell.edu/uscode/text/11/1127\">https://www.law.cornell.edu/uscode/text/11/1127</a>.</p>\n\n<p>Section (b) states:</p>\n\n<blockquote>\n<p>The proponent of a plan or the reorganized debtor may modify such plan at any time after confirmation of such plan and before <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=11-USC-1318967965-70892687&amp;term_occur=999&amp;term_src=\">substantial consummation</a> of such plan, but may not modify such plan so that such plan as modified fails to meet the requirements of sections <a href=\"https://www.law.cornell.edu/uscode/text/11/1122\">1122</a> and <a href=\"https://www.law.cornell.edu/uscode/text/11/1123\">1123</a> of this title. Such plan as modified under this subsection becomes the plan only if circumstances warrant such modification and the court, after notice and a hearing, confirms such plan as modified, under <a href=\"https://www.law.cornell.edu/uscode/text/11/1129\">section 1129 of this title</a>. </p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>What does this mean? In simple terms, a debtor (or other party in interest) may request modification of a confirmed plan. </p>\n\n<p>Furthermore, A priority claim arising from an Administrative Expense Priority (Admin Priority) may have the right to request modification to a confirmed plan under certain circumstances. Hmmmm, where have we seen an Admin Priority before? Oh yeah, a $10 BILLION dollar claim!</p>\n\n<p>So, regarding the cancellation and issuance of shares, it technically is possible under bankruptcy code 1127 if they do try to amend the confirmed plan. Of course, all of it is subject to legal process/court approval. But if the debtor (company) wants to un-cancel previously cancelled shares, it would need to propose this as part of the modification process under bankruptcy code 1127 (b), which can be done by the parties listed above. </p>\n\n<p>I will reiterate,  I am not a lawyer, and this information is not legal advice nor is any of this information financial advice. </p>\n\n<p>But the ticker appearing again makes me jacked.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/17b0fwb/any_prty_share_holders_have_their_shares_removed/", "time": 1697660761.0, "subreddit": "r/ThePPShow", "title": "Any PRTY Share holders have their shares removed from their accounts?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Since PRTY emerged from bankruptcy and those shares were &quot;cancelled&quot; too, does anyone holding PRTYQ shares still see those in their brokerage accounts or have they been removed? </p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/17az646/a_shot_of_tinfoil_straight_to_the_brain/", "time": 1697657465.0, "subreddit": "r/ThePPShow", "title": "A shot of tinfoil straight to the brain. Bankruptcy code 1127", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is straight tinfoil and even a bit a hopium on my part (since my shares in Fidelity say &quot;expired position&quot; and the few I had in Robinhood were just straight up removed). BUT it&#39;s just crazy enough to work and make sense.</p>\n\n<h1>Part 1: The Tweet</h1>\n\n<p>Starting with <a href=\"https://twitter.com/phantomblack699/status/1714662514984669679?s=46\">Sal&#39;s Tweet</a>. </p>\n\n<blockquote>\n<p><em>&quot;Overstock started using the IP rights within 14 hours of the auction. Why haven’t Dream on me started using such a valuable asset to them?&quot;</em> </p>\n</blockquote>\n\n<p>What an excellent question. BABY was the crown jewel and was the money maker for BBBY the last couple of years in terms of being profitable. It was a focal point of RC in his <a href=\"https://s.wsj.net/public/resources/documents/bbbletter030622.pdf\">initial letter to the board</a>. So that really does beg the question WHY would you not get a $1.5 billion dollar brand up and running (online first) as quickly as possible.</p>\n\n<ul>\n<li>I&#39;m in the ecommerce space and I see websites get built all the time. There are ranging complexities that go into build and I know it&#39;s not as easy as Overstock just rebranding, switching it&#39;s domain and ensuring all the re-directs are in place... <strong>HOWEVER</strong>, I have seen some sites of medium complexity (a handful of key integrations) launch within 90-day. If inventory existed, which I believe it did as there was a video a few months back after DOM won the bid of a fully stocked warehouse, why would this iconic brand not be up and taking orders via the web already. </li>\n<li>We also know the landing page is a Shopify landing page so once a catalog is loaded, they can start transacting fairly quick</li>\n</ul>\n\n<h1>Part 2: The comment</h1>\n\n<p>Now the fun part and I will directly quote a comment from <a href=\"/u/PotentialMotion\">/u/PotentialMotion</a>: </p>\n\n<blockquote>\n<p><em>&quot;My thought is that by spinning out the IP, DOM focused on building while BBBY focused on winding down. This way both could happen in parallel (legally, without revealing anything in bankruptcy docs) only to combine at a later date.&quot;</em></p>\n</blockquote>\n\n<p>That is interesting. Didn&#39;t DOM all of the sudden have some previous BBBY employees who were on the digital team? They did. In fact, BABY&#39;s new VP of Digital Technology (as of August 2023) was at BBBY the 5-years before that doing virtually the same thing. Who better to build and oversee a highly scalable site, that knows the BABY consumer, and can launch from scratch as quickly as possible. </p>\n\n<p>So was DOM involved so that legally they can build and have BuyBuyBaby ready to launch once this thing is fully settled and without disclosing to much via dockets?</p>\n\n<h1>Part 3: The new shares</h1>\n\n<p>Shares are cancelled. We know this from the 8-K. Today, we&#39;ve seen brokers starting to reflect changes by either removing shares from accounts or calling them expired. But I read through bankruptcy law (<strong><em>I am not a lawyer, just a smooth brained APE</em></strong>) specifically for amending a plan <strong>AFTER</strong> it&#39;s been approved. Guess what, it can happen. </p>\n\n<ul>\n<li>11 U.S. Code § 1127 - Modification of plan, specifically section B. <a href=\"https://www.law.cornell.edu/uscode/text/11/1127\">Sauce</a>\n\n<ul>\n<li>(b)The proponent of a plan or the reorganized debtor may modify such plan at any time after confirmation of such plan and before substantial consummation of such plan, but may not modify such plan so that such plan as modified fails to meet the requirements of sections 1122 and 1123 of this title. Such plan as modified under this subsection becomes the plan only if circumstances warrant such modification and the court, after notice and a hearing, confirms such plan as modified, under section 1129 of this title.</li>\n</ul></li>\n<li>Basically, Section 1127 allows for amendments to a confirmed plan, including potentially providing recovery to shareholders, as long as substantial steps toward implementing the original plan have not yet been taken and the changes meet the legal requirements.</li>\n</ul>\n\n<p><em>Keep in mind that any proposed amendments would still need to go through the formal process, which includes notifying relevant parties and obtaining court approval after a hearing.</em></p>\n\n<p>Also, did you know it&#39;s extremely rare for a debtor (company) to change their name during bankruptcy? So how about this for black tar tinfoil. Sixth Street now owns a bulk of the debt (RC is heavily involved) hence the first name change.  Since Sixth Street holds a significant portion of the debt, they can potentially be in a position to propose amendments to a confirmed plan under Section 1127 of the U.S. Bankruptcy Code. This is because they would have a substantial stake in the outcome of the bankruptcy proceedings.</p>\n\n<p>Sixth Street amends the plan to issue new shares of the newly named company to existing holders of BBBY. 20230930-DK-Butterfly-1, Inc. (TEDDY, GMERICA, Insert whatever you want) emerges from Bankruptcy and is ready to fly. They then announce the acquisition of BBBY Acquisition Co, LLC. who appears to be connected to DOM and is running the BABY website. The site is ready to launch and is now a debt free, publicly traded company selling BABY products. </p>\n\n<p><strong><em>Extra tinfoil</em></strong>. This newly formed public company operating BABY acquires the ultimate destination for video games in an all stock transaction.  </p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/179djed/where_is_docket_2468_have_they_skipped_dockets_or/", "time": 1697482365.0, "subreddit": "r/ThePPShow", "title": "Where is docket 2468? Have they skipped dockets or published out of order before?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Docket 2468 is hidden or not published? Have they skipped dockets or published them out of order before?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/szskr43g2mub1.png?width=1159&amp;format=png&amp;auto=webp&amp;s=f1dc4f7a0d80684058098c7726dcaff6b5c1f613\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/szskr43g2mub1.png?width=1159&amp;format=png&amp;auto=webp&amp;s=f1dc4f7a0d80684058098c7726dcaff6b5c1f613\" alt=\"https://preview.redd.it/szskr43g2mub1.png?width=1159&amp;format=png&amp;auto=webp&amp;s=f1dc4f7a0d80684058098c7726dcaff6b5c1f613\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/YY2J4uOdPQDafFeAwTq2LuehFfKy6k2HLM1phSWB9QQ.jpg\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/171dnsw/to_all_the_schills_saying_overstock_is_taking_the/", "time": 1696602263.0, "subreddit": "r/ThePPShow", "title": "To all the schills saying Overstock is taking the BBBY ticker", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is a direct quote from the Overstock (now Bed Bath &amp; Beyond) CEO.</p>\n\n<p>“Whatever it is, we won’t use the BBBY stock ticker the old company used,” he says, which he notes has been tainted by meme traders.  <a href=\"https://businessofhome.com/articles/bed-bath-beyond-lives-on-under-overstock\">Sauce</a>.</p>\n\n<p>Could he be lying? Sure. </p>\n\n<p>Could they change their mind? Sure.</p>\n\n<p>Will they take it? I doubt it.</p>\n\n<p>Fuck you. Pay us.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/16y4lg8/i_think_i_found_it/", "time": 1696272052.0, "subreddit": "r/ThePPShow", "title": "I think I found it!!!", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I was going through FINRA and found the BBBYQ cancellation. However, the comments referred to &quot; See UPC Notice 41-23 for more details.&quot; So I naturally found the corresponding UPC to look into it further. Buckle up.</p>\n\n<p>I present to you 2 FINRA fillings:</p>\n\n<ul>\n<li>Filing 1: BOXD - Chapter 11 bankruptcy and liquidation. Shares cancelled on September 6th, 2023.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ftnlu9ts0urb1.png?width=1335&amp;format=png&amp;auto=webp&amp;s=4fc185f999c15a2c89749b8dc6c1175aafefd1e2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ftnlu9ts0urb1.png?width=1335&amp;format=png&amp;auto=webp&amp;s=4fc185f999c15a2c89749b8dc6c1175aafefd1e2\" alt=\"https://preview.redd.it/ftnlu9ts0urb1.png?width=1335&amp;format=png&amp;auto=webp&amp;s=4fc185f999c15a2c89749b8dc6c1175aafefd1e2\"></a></p>\n\n<ul>\n<li>UPC from Boxed cancellation: <a href=\"https://www.finra.org/sites/default/files/2023-09/UPC-38-2023-%28BOXWQ%2C%20BOXDQ%29.pdf\">https://www.finra.org/sites/default/files/2023-09/UPC-38-2023-%28BOXWQ%2C%20BOXDQ%29.pdf</a>\n\n<ul>\n<li> Notice has been received that the above Company’s Second Amended Combined Joint Chapter 11 Plan of Liquidation and Disclosure Statement became effective on 9/1/2023. Interests in Boxed, Inc. will be canceled, released, and extinguished as of the Effective Date, and will be of no further force or effect, and Holders of Interests in Boxed, Inc. will not receive any distribution on account of such Interests in Boxed, Inc. See the Company’s Second Amended Combined Joint Chapter 11 Plan of Liquidation and Disclosure Statement for more details.1 Members are reminded of their obligations under FINRA Rule 2111 if they continue to engage in transactions in the above security after the effective date. Pursuant to FINRA Rule 11530, members are advised that, among other things, in contracts for securities where a public announcement or publication of general circulation discloses that the securities have been deemed worthless, deliveries shall consist of a) the worthless securities or; or b) a Letter of Indemnity which shall grant the purchaser any rights and privileges which might accrue to the holders of the physical securities. Such deliveries shall operate to close-out the contract and shall be settled at the existing contract price pursuant to FINRA Rule 11530. Questions regarding this notice should be directed to: FINRA Operations- 1-866-776- 0800. </li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Filing 2: BBBYQ- Chapter 11 bankruptcy shares cancelled 10/2/2023.<br/></li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/a69pifxh3urb1.png?width=1332&amp;format=png&amp;auto=webp&amp;s=33bb0d99850f0f5e87abf9759655d83716d6a5cf\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/a69pifxh3urb1.png?width=1332&amp;format=png&amp;auto=webp&amp;s=33bb0d99850f0f5e87abf9759655d83716d6a5cf\" alt=\"https://preview.redd.it/a69pifxh3urb1.png?width=1332&amp;format=png&amp;auto=webp&amp;s=33bb0d99850f0f5e87abf9759655d83716d6a5cf\"></a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>UPC from BBBYQ cancellation (filed today with FINRA): <a href=\"https://www.finra.org/sites/default/files/2023-10/UPC-41-2023-BBBYQ_0.pdf\">https://www.finra.org/sites/default/files/2023-10/UPC-41-2023-BBBYQ_0.pdf</a>\n\n<ul>\n<li> Notice has been received that the above Company’s Second Amended Joint Chapter 11 Plan became effective on 9/29/2023. On the Effective Date, Each Allowed Interest in BBB shall be canceled, released, and extinguished, and will be of no further force or effect and no Holder of Interests in BBB shall be entitled to any recovery or distribution under the Plan on account of such Interests. <strong>Additionally, (CUSIPs 075896AC4, 075896AB6, 075896AA8) In full and final satisfaction, compromise, settlement, release, and discharge of its Claim (unless the applicable Holder agrees to a less favorable treatment), each Holder of an Allowed General Unsecured Claim shall receive its Pro Rata share of (i) the Shared Proceeds Pool, only if such proceeds are available after all senior Claims (other than the DIP Claims and FILO Claims) are paid in full and (ii) any remaining Distributable Proceeds available after payment in full of all senior Claims. See the Company’s Second Amended Joint Chapter 11 Plan for more details.1 Members are reminded of their obligations under FINRA Rule 2111 if they continue to engage in transactions in the above security after the effective date.</strong> Pursuant to FINRA Rule 11530, members are advised that, among other things, in contracts for securities where a public announcement or publication of general circulation discloses that the securities have been deemed worthless, deliveries shall consist of a) the worthless securities or; or b) a Letter of Indemnity which shall grant the purchaser any rights and privileges which might accrue to the holders of the physical securities. Such deliveries shall operate to close-out the contract and shall be settled at the existing contract price pursuant to FINRA Rule 11530. Questions regarding this notice should be directed to: FINRA Market Operations- 1-866- 7760800. </li>\n</ul></li>\n</ul>\n\n<p>READ THE PART IN BOLD AGAIN. It is a paragraph not in the Boxed cancellation.</p>\n\n<blockquote>\n<p>Additionally, (CUSIPs 075896AC4, 075896AB6, 075896AA8) In full and final satisfaction, compromise, settlement, release, and discharge of its Claim (unless the applicable Holder agrees to a less favorable treatment), each Holder of an Allowed General Unsecured Claim shall receive its Pro Rata share of (i) the Shared Proceeds Pool, only if such proceeds are available after all senior Claims (other than the DIP Claims and FILO Claims) are paid in full and (ii) any remaining Distributable Proceeds available after payment in full of all senior Claims. See the Company’s Second Amended Joint Chapter 11 Plan for more details.1 </p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Holder agrees to a less favorable treatment - Can RC, a creditor agree to this? Probably!</li>\n<li>General Unsecured Claim shall receive Pro Rata Share. Sounds like someone might be getting a percentage of a new company\n\n<ul>\n<li>Pro rata is a defined portion in relation to the entirety of an item. Instead of getting all of the items, someone can get a pro rata share, a proportional offering based on how much they are entitled to. For example, if I own 10% of a building, I may expect a pro rata share of 10% of the building&#39;s rental income. (<a href=\"https://www.investopedia.com/terms/p/pro-rata.asp\">Sauce</a>)</li>\n</ul></li>\n<li>The above bullet is only AFTER DIP Claims and FILO Claims are paid in full... Well if speculation is true that RC and Icahn are behind the DIP and FILO, then chances of those being all good are extremally high. </li>\n<li>The <strong>CHERRY ON TOP</strong> (b) from the last paragraph:<br/>\n\n<ul>\n<li> b) a Letter of Indemnity which shall grant the purchaser any rights and privileges which might accrue to the holders of the physical securities. Such deliveries shall operate to close-out the contract and shall be settled at the existing contract price pursuant to FINRA Rule 11530.<br/></li>\n</ul></li>\n<li>FINRA Rule 11530 for anyone who needs it: <a href=\"https://www.finra.org/rules-guidance/rulebooks/finra-rules/11530\">https://www.finra.org/rules-guidance/rulebooks/finra-rules/11530</a></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Trust the process. </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/pkz6Dv1_Ua8fGKf3eeXilCjpQlzfMv-etnFd71V3QPU.jpg\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/16vlozh/cheers/", "time": 1696017611.0, "subreddit": "r/ThePPShow", "title": "Cheers 🍻🍻", "text": "<!-- SC_OFF --><div class=\"md\"><p>Market is closed. Judgement day is tomorrow. Zero or hero but it&#39;s been a fucking wild ride.</p>\n\n<p>Cheers to everyone.</p>\n\n<p><strong>Disclaimer:</strong> Ensure seats and trays tables are in their upright and locked position should the rocket launch unexpectedly!!!  </p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/16sr0p9/so_about_last_nights_stream/", "time": 1695741964.0, "subreddit": "r/ThePPShow", "title": "So about last nights stream", "text": "<!-- SC_OFF --><div class=\"md\"><p>First, shoutout to PP and crew for the stream and Pulte graciously hosting them at his office. The slew of backlash I think was a good way to weed out some bad actors that have been amongst us and starting to flip their tone.</p>\n\n<p>In my opinion I think there was meant to be an announcement yesterday. But like everything in this play and saga, it didn&#39;t go according to plan. </p>\n\n<p>A few observations as to why I think yesterday should have seen something and why at any moment, even today, we might see fireworks:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Everyone was visibly amped up (more than usual and almost as if they knew something might happen)</li>\n<li>Pulte NOT having a position in this play but feeling incredibly strong about the play itself, this community, and openly interacting with us I think is a MASSSIVE tell. Usually people without a position just shit on this play and tell us how regarded we are (despite us already knowing it)</li>\n<li>It felt like a lot of yesterday&#39;s time was spent just killing time. There was a lot of &quot;so what do you want to talk about next&quot;. Yet, the Pulte question thread had tons of questions that didn&#39;t seem to be asked</li>\n<li>Countless bathroom breaks. I get it, when you are older you just got to go. But it was an unusual amount of times and of course, was off camera</li>\n<li>The cherry on top - Pulte defending the stream this morning and calling out the haters. </li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Of course this is all speculation and opinion based on observation. For all I know, he told them the play was dead and we must go on with the stream the best we can.  </p>\n\n<p>But I am a gambling man and I am taking the odds of this company emerging and RC being a massive part in it. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/16ootrj/just_remember_allstock_transaction/", "time": 1695324420.0, "subreddit": "r/ThePPShow", "title": "Just remember \"All-stock\" transaction", "text": "<!-- SC_OFF --><div class=\"md\"><p>BBBYQ has massive squeeze potential (pending a last minute change to the plan) but remember one thing about this play and its complexity... </p>\n\n<p>GME is the crown jewel. GME shills will say BBBYQ was just a distraction. <strong>However, Teddy going public via a reverse merger (BBBYQ shares), the NOLs (which will require BBBYQ shareholders to get something), and well financed backers being part of Teddy is/was the play. WHY!?!?!</strong></p>\n\n<p>Because once Teddy is public and well backed, what can they do? Acquire GME in an ALL-STOCK deal sending the crown jewel where it should have gone 2+ years ago.</p>\n\n<p>The carrot on-top will be BABY coming along too when Teddy acquires Dream on Me, just because. </p>\n\n<p>At this point - everything else seems like noise.</p>\n\n<p><strong>Obligatory: not financial advice</strong> (but does it even matter since us retail folks can&#39;t even buy!?)</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/14smm0z/teddy_baby_gme_and_the_true_moass/", "time": 1688679292.0, "subreddit": "r/ThePPShow", "title": "Teddy, Baby, GME and the true MOASS", "text": "<!-- SC_OFF --><div class=\"md\"><p>So by this point, I think it&#39;s very clear this has been on big bear trap set strategically presumably by Cohen and some of his affiliates. I did some digging on other companies who went bankrupt, but exited with shareholders being made whole and found something interesting.</p>\n\n<p>Role the clocks back 10 years, American Airlines filed for bankruptcy. However, they had a NOL poison pill that was upheld ultimately protecting corporate assets and preventing institutions (or a group) from buying more than 5% of the company. This was put in place as protection against Qatar Airways. You can read about it <a href=\"https://www.theconglomerate.org/2017/06/index.html\">here</a>.</p>\n\n<p>The other thing I found interesting in this article was that the merger between the two companies was a section 382 &quot;change of ownership&quot; which added additional restrictions to the NOLs. Where have we seen that before? Oh yeah, the latest 10-K (<a href=\"https://bedbathandbeyond.gcs-web.com/node/17306/html\">Page 15 of the 10-K</a> references it)!</p>\n\n<p>By going through with the Change of Ownership, it allowed American Airlines to put restrictions on the NOL and shareholders who own over 4.75% of the stock. Do you remember the request for a list of all parties owning over 4.5% of BBBY? Starting to make more sense. </p>\n\n<p>Ok, but KEV what does this have to do with BBBY, Teddy and GME? Great question.</p>\n\n<p>After looking at the merger between U.S. Airways and American, I think it&#39;s safe to say we may be very right about Teddy being the one buying the assets and keeping the business (BABY) as a going concern. However, it will go through the 382 change of ownership so that they can have restrictions on shareholders with over 4.5% ownership. But all shareholders will get shares of the new ticker. My guess is TDDY. This in my opinion will cause a GME like sneeze, maybe higher though since we know how bad this has been shorted. </p>\n\n<p>Now the real fireworks. Once the new ticker is established and we are effectively out of chapter 11, TDDY will perform an all stock or a cash + stock merger acquiring GME causing the real MOASS because we all should know, all stock or cash + stock causes a share recall and anyone swimming naked is fucked. </p>\n\n<p>Good things take time, but this just seems to make to much sense. As many of said, we either got this very wrong, or we had this very very VERY right. </p>\n\n<p>See you on the moon.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/13sdgat/accelerated_cap_filer_10k_would_be_due_today/", "time": 1685108148.0, "subreddit": "r/ThePPShow", "title": "Accelerated Cap filer 10-K would be due today", "text": "<!-- SC_OFF --><div class=\"md\"><p>So a couple of weeks ago <a href=\"https://www.reddit.com/r/ThePPShow/comments/13ep7r8/company_10k_pulte_tweetscomments/\">I posted</a> how the BBBY 10-K should be due if they were a Large Accelerated filer (I still believe it was due 2 weeks ago). </p>\n\n<p>HOWEVER, lets say that BBBY is considered an Accelerated Filer per the definitions on the <a href=\"https://www.investor.gov/introduction-investing/investing-basics/glossary/form-10-q\">Investor Gov page</a> (table added below as well), that makes this 10-K due today with all extensions. Why?</p>\n\n<p>For an Accelerated filer the 10-K is due 75-days after the end of the fiscal year. That was 2/25/2023. BBBY filed a motion for extension which gives them 15-more days. Well guess what 90-days from 2/25/2023 is... yup TODAY!</p>\n\n<p>They are still obligated to file their 10-K and I have not seen any dockets from BK that state they don&#39;t have to file it. We should be seeing this 10-K at some point very soon (possibly today).</p>\n\n<p><strong>Following are the deadlines for companies to file Forms 10-K and 10-Q:</strong></p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>Category of Filer</strong></th>\n<th align=\"left\"><strong>Revised Deadlines For Filing Periodic Reports</strong></th>\n<th align=\"left\"></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\"><strong>Form 10-K Deadline</strong></td>\n<td align=\"left\"><strong>Form 10-Q Deadline</strong></td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Large Accelerated Filer</strong><strong>($700MM or more)</strong></td>\n<td align=\"left\">60 days</td>\n<td align=\"left\">40 days</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Accelerated Filer</strong><strong>($75MM or more and less than $700MM)</strong></td>\n<td align=\"left\">75 days</td>\n<td align=\"left\">40 days</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Non-accelerated Filer</strong><strong>(less than $75MM)</strong></td>\n<td align=\"left\">90 days</td>\n<td align=\"left\">45 days</td>\n</tr>\n</tbody></table>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/13g5kls/3_tweets_from_rc_today/", "time": 1683947438.0, "subreddit": "r/ThePPShow", "title": "3 tweets from RC today", "text": "<!-- SC_OFF --><div class=\"md\"><p>RC replied to 3 tweets today. Plus liked an important one from our guy Pulte. </p>\n\n<p>Im calling it now now. 2 tweets (replies count) tomorrow and 1 Sunday. </p>\n\n<p>3..2..1…🚀🚀🚀</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/13ewgwg/more_pulte_tinfoil_may_the_4th_be_with_you/", "time": 1683831484.0, "subreddit": "r/ThePPShow", "title": "More Pulte Tinfoil, May the 4th be with you", "text": "<!-- SC_OFF --><div class=\"md\"><p>Going along with my post earlier about possibly seeing the 10-K released today, there might also be an 8-K.</p>\n\n<p>Pulte tweeted on May 4th &quot; Got our deal done. Another company under the belt. Details soon. In meantime, let’s help people &lt;3&quot; Sauce: <a href=\"https://twitter.com/pulte/status/1654176728774737924\">https://twitter.com/pulte/status/1654176728774737924</a>. </p>\n\n<p>Companies have 4 business days to file an 8-K for major events that shareholders should know about. </p>\n\n<p>4 business days from that tweet was yesterday, 5/10/2023.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/13ep7r8/company_10k_pulte_tweetscomments/", "time": 1683815752.0, "subreddit": "r/ThePPShow", "title": "Company 10-K &amp; Pulte Tweets/Comments", "text": "<!-- SC_OFF --><div class=\"md\"><p>So BBBY filed an NT 10-K for an extension on their fiscal year reporting. The 10-K was due 60-days after the end of their fiscal year which was 2/25/2023. </p>\n\n<p>NT 10-Ks are granted a 15-day extension which would have made the 10-K filed/due yesterday. Pulte acknowledging this sub and now post on Twitter with his face over the RC interview and a stock chart (Tweet: <a href=\"https://twitter.com/pulte/status/1656664791124160516\">https://twitter.com/pulte/status/1656664791124160516</a>) is pretty incredible and has my tits jacked.</p>\n\n<p>We should see the 10-K released today and a common reason for them being delayed is... M&amp;A!!!!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kevonicuss", "url": "https://www.reddit.com/r/ThePPShow/comments/13en92a/pulte_shows_up_here_and_the_og_sub_removes_all/", "time": 1683811256.0, "subreddit": "r/ThePPShow", "title": "Pulte shows up here and the OG sub removes all posts", "text": "<!-- SC_OFF --><div class=\"md\"><p>I honestly didn&#39;t even know this sub existed but always watched PPs hype videos over on the OG sub. Yesterday I saw a post that Pulte actually acknowledge this sub here and a post talking about the tinfoil actually being true. </p>\n\n<p>Well, oddly enough the main sub has removed ALL posts that try to call attention to it which is highly sus. Glad I found this sub and glad to know the end game is truly near.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]