[{"username": "KingLuckyShepherd", "url": "https://www.reddit.com/r/ThePPShow/comments/15o7o91/back_to_100_game_idk_i_guess_so/", "time": 1691757133, "subreddit": "r/ThePPShow", "title": "Back to 100% Game? Idk I guess so!?", "text": "🤬😭🤣😭😡 Can anyone convince me that at this point, the hype for the stock isn't just a shill HF move to get Apes to waste money on this or old bag holders clinging on? \n\n What is there to merge with or aquire??? I'm about to sell and go back to 100% GameStop again because this is becoming just as bad as popcorn stock. The bed bath sub is completely filled with shills and the DD here is irrelevant docket info, LinkedIn profiles, bad TA & billing hours? Lol... like wtf.\n\n In the most non-fud way possible I've asked Time and Time again, *what is there to merge with and or acquire?* And I can never get a good Answer, theres nothing left as far as I can tell. Do you disagree, ok whats left?! Please! At this point I'm convinced this is either just a *shill move to get Apes to waste money on this trash* or it's just dumb bag holders who are desperately holding on to the edge of a mountain before this thing falls off a cliff. \n\n *Plus perhaps most important, if somehow bed bath corpse does raise from the grave and squeeze, you'd better be damn well sure it'll cause GameStop to squeeze, so, why put any percentage in the bed bath at all? SO YEA BACK TO GAMESTOP FOR ME! BUT PLEASE CONVINCE ME IM WRONG! PLEASE! 🤬😡😭🙏", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "KingLuckyShepherd", "url": "https://i.redd.it/cnosckfttwgb1.jpg", "time": 1691510720, "subreddit": "r/ThePPShow", "title": "Twinning! Wanna *swap* ideas on why?", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/cnosckfttwgb1.jpg\"/></div>"},
{"username": "KingLuckyShepherd", "url": "https://www.reddit.com/r/ThePPShow/comments/15kze2d/im_seeing_intentional_fud_in_regards_to_the_opt/", "time": 1691447575, "subreddit": "r/ThePPShow", "title": "I'm seeing intentional FUD in regards to the Opt Out form. (imo) It's NOT saying share holders get 0!", "text": "Retail stockholders fall under the category of \"Interests in BBB\" (Class 9). In this context, \"Interests in BBB\" refers to the ownership interests of retail stockholders in the company. This class is deemed to be impaired, which means that these stockholders would be considered as rejecting the plan and would not be entitled to any recovery or distribution under the plan.\n\n Im not a lawyer and this isnt financial advice but seems to me the Opt Out form is saying the people who hold debt against Bed Bath are getting 0. Not that the share holders are getting 0... That's the whole point of a bankruptcy. The people who you owe, get little or in this case, get nothing. \n\n So I checked some of the profiles pushing this and they are not BBBYQ holders. One even said in a previous comment when confronted by an actual BBBYQ holder, \"I hope I'm wrong. I want *you all to get your squeeze.*\" Yeah right, I'm sure you do shill! \n\n \"Specifically, under the terms of the Plan, as a Holder of a \r\n*Claim or Interest (as currently asserted against the Debtors)* that is *receiving no distribution under the Plan*, you are \r\ndeemed to reject the Plan... Any objection \r\nto the relief...\" \n\nTLDR: The class 9 holders who are claiming debt against Bed Bath are receiving no distribution. This does not say shareholders are receiving 0.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]