[{"username": "Kitchen-Rain-9986", "url": "https://www.reddit.com/r/ThePPShow/comments/17dxfp4/beware_of_true_manipulation/", "time": 1697992862.0, "subreddit": "r/ThePPShow", "title": "Beware of true manipulation", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello Apes,</p>\n\n<p>I must admit something, I’m an OG DD writer who, at the time, thought I was on to something. I was never a BBBY guy but I did get in on GME and AMC pre squeeze and cashed out quite a bit. I created DD to help others see the picture I was seeing, and hopefully share the wealth. </p>\n\n<p>This was a time before tin foil, or where the tin foil was actually apes just learning how insanely crooked the market is. By… doing my own research, I learned a lot about the market, mainly what I just said above. A lot of what’s seen as illegal or immoral is standard business practice. </p>\n\n<p>Is it right, no.</p>\n\n<p>Will it go away, I hope so but probably no.</p>\n\n<p>Is it fair, no.</p>\n\n<p>But let’s talk about something not more so, but additionally as immoral, and borderline illegal. Manipulating people with the intent to prove your theory is right or wrong.</p>\n\n<p>This manipulation has been strong in the memestock community and you might not realize it. I know because I used it myself at a time, fortunately I was right and a lot of strangers, friends and family made a lot of money from my persuasion. But let’s be clear, you can check my post history, my writing style was written with an intent to market, grip you, and become popular.</p>\n\n<p>If you analyze my post history you can actually see my progression wherein I started attempting to stick purely to the facts and data. I then realized a trend that posts with more of a storyline or theme, almost written in the style of the movie the big short, got more traction and were more popular.</p>\n\n<p>So that’s what I did, I changed my writing style, and put my theories out there.</p>\n\n<p>And it worked</p>\n\n<p>I’m not proud of using that tactic, but I am proud of the people I helped get inspired to educate them selves andmade hand over fist.</p>\n\n<p>I’m not proud of the fact that slowly I realized what I stated above, I’m very uneducated on market structure, and what I may perceive to be manipulation or a connection is really just a nothing burger or status quo for the market.</p>\n\n<p>I traded credibility momentarily for popularity, and I see this happen a lot with this community. I did my follow up due diligence once I actually became educated by people I call friends to this day that actually work in the field and took their time to believe in my potential and invest in me.</p>\n\n<p>I tried to tell others, feeling like a true Cassandra, but outside of the discord I was on (Shout out TrueStock this is RG, if any of you are here you can verify my claims) communities would no accept my plea.</p>\n\n<p>Please beware of grifters, the ppSHOW is not here to educate you, it’s here to entertain and create a sustainable platform for the owner to make money.</p>\n\n<p>The same owner that will delete and censor this post to protect his brand and image.</p>\n\n<p>I’ve been in his shoes, I was told to make a YouTube and become a content creator. I did not and will not because I think it’s again deplorable for anyone who’s not educated to be attempting to influence the masses.</p>\n\n<p>I joined the Army, took my humble winnings from the market to spend 6 months out of working vacationing with my wife and new born son before enlisting and shipping out. And I’m proud of who I am today because of this saga, but the saga is over. The gamma squeezes we say, will not happen again on these tickets. And most importantly BBBYQ is dead. There is no merger, if there is your extinguished, cancelled, liquidated (whatever verb) shares unfortunately will not come back.</p>\n\n<p>“Why do you care it’s not your money you must be a shill” </p>\n\n<p>I’m trying to help, I serve the people of the United States. I do this through empathy and hope that even one person will gain some levity. If you cannot see that, you may be as bad as your perceived enemy who could say the same thing in retaliation when asked how they sleep at night scamming a million retail investors out of their hard earned money.</p>\n\n<p>Imagine if they told your mom, your friends, your colleagues who got upset at them scamming you.</p>\n\n<p>“Why do you care it’s not your money”</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]