[{"username": "KnownEducation", "url": "https://www.reddit.com/r/ThePPShow/comments/17bngkf/the_100_monkey_effect_and_the_plan_to_save_the/", "time": 1697733606.0, "subreddit": "r/ThePPShow", "title": "The 100 monkey effect and the plan to save the world. NCSWIC", "text": "<!-- SC_OFF --><div class=\"md\"><p>The <strong>hundredth monkey effect</strong> is a hypothetical phenomenon in which a new behavior or idea is spread rapidly by unexplained means from one group to all related groups once a critical number of members of one group exhibit the new behavior or acknowledge the new idea. The behavior was said to propagate even to groups that are physically separated and have no apparent means of communicating with each other.</p>\n\n<p>The Great Awakening will involve MOASS, and Wall St. will be broken down to nothing.  The world will learn of the corruption by major industry and government leaders, and will learn that all the markets have been rigged(for some time, see the creation of the federal reserve in 1913).</p>\n\n<p>If you have the eyes to see, the ears to hear,. and the heart to listen, take this:</p>\n\n<p>NOTHING CAN STOP WHAT IS COMING.  Evil will be taken out and the world will learn and heal from the knowledge.  If you hold gme/bbbyq you will be part of the restructuring of the world with evil exposed/removed.   This is a VERY SERIOUS responsibility, which is why we have people like Pulte trying to show everyone how to give back.  Hes doing it early, to plant the seed in all of us to DO THE RIGHT THING. </p>\n\n<p>Enjoy the show folks, this is endgame and we have patriots in control now.</p>\n\n<p>Much love.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "KnownEducation", "url": "https://www.reddit.com/r/ThePPShow/comments/16votu0/form_15_has_the_sauce/", "time": 1696024941.0, "subreddit": "r/ThePPShow", "title": "Form 15 has the sauce.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Alright so looking at that Cornell link, you have to go to section a-1:</p>\n\n<p>&quot;(a) Termination of registration of a class of securities under section 12(g) of the Act (15 U.S.C. 78l(g)) shall take effect 90 days, or such shorter period as the Commission may determine, after the issuer certifies to the Commission on Form 15 (§ 249.323 of this chapter) that the class of securities is held of record by:<br/>\n(1) Fewer than 300 persons, or in the case of a bank; a savings and loan holding company, as such term is defined in section 10 of the Home Owners&#39; Loan Act (12 U.S.C. 1461); <strong>or a bank holding company</strong>, as such term is defined in section 2 of the Bank Holding Company Act of 1956 (12 U.S.C. 1841), 1,200 persons; or&quot;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]