[{"username": "KodSquad", "url": "https://www.reddit.com/r/ThePPShow/comments/17rag13/bit_deeper_into_the_case_cited_in_the_rc_pump_and/", "time": 1699527473.0, "subreddit": "r/ThePPShow", "title": "Bit Deeper into the Case cited in the RC Pump and dump docket", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://casetext.com/case/klein-ex-rel-qlik-techs-inc-v-qlik-techs-inc\">https://casetext.com/case/klein-ex-rel-qlik-techs-inc-v-qlik-techs-inc</a></p>\n\n<p>Please remember, I have no idea what I&#39;m talking about</p>\n\n<p>From the cited case:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/o01rhuudxazb1.png?width=595&amp;format=png&amp;auto=webp&amp;s=40760206af1e410006201de2df015daaaf3e2e11\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/o01rhuudxazb1.png?width=595&amp;format=png&amp;auto=webp&amp;s=40760206af1e410006201de2df015daaaf3e2e11\"></a></p>\n\n<p>It seems like the only reason the case that was cited was dismissed is because it was a cash buyout. If it had been shares, instead it would have allowed litigation to continue. </p>\n\n<p>I think this still may be positive, but much more strongly points to a cash buyout. Or, this precedent may not be the one to get the case dismissed.</p>\n\n<p>From the case cited, within the cited case.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9kou7e0wyazb1.png?width=610&amp;format=png&amp;auto=webp&amp;s=5072b841bf53cd20152f3d35b835f84812769ccb\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/9kou7e0wyazb1.png?width=610&amp;format=png&amp;auto=webp&amp;s=5072b841bf53cd20152f3d35b835f84812769ccb\"></a></p>\n\n<p>In this case, cash and stock was received so litigation was allowed to continue. How does that effect RC if hes involved at a higher level, part of a purchase, merger, butterfly - I dont know.</p>\n\n<p>So really I think we find ourselves in the same position we have been, legal precedents to supports multiple potential different outcomes, but something to be taken and added into the collective knowledge we have, maybe it connects a dot for someone else.</p>\n\n<p>I bring this up because I see a troubling trend, in which simply seeing the word &quot;merger&quot; or &quot;acquisition&quot; in a document is enough to generate hype with absolutely no reason.</p>\n\n<p>Take the next step - I am rather smooth brained, but I can use google and CTRL-F, do one further step of research, false hype on every single utterance of a word related to this whole thing doesnt help us in the long run, and I think works to spread misinformation.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/RBcaD1BNbfdYQzNivzaVsNDoXJe2QkMXCn5t53UvkCQ.jpg\"/></div>"},
{"username": "KodSquad", "url": "https://www.reddit.com/r/ThePPShow/comments/17dj5bq/logically_thinking_about_pulte/", "time": 1697942073.0, "subreddit": "r/ThePPShow", "title": "Logically thinking about Pulte", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been in this play since $12, and have been dumbfounded by the turn of events considered as a whole thus far. </p>\n\n<p>I’ve seen a lot about Pulte lately, whether he knows more than he says, doesn’t actually know anything more than us, is a bad actor, is a good actor, etc.</p>\n\n<p>I saw a post of a clip of him on a space call very recently, and I felt like something clicked. I don’t listen to space calls, never have and I’ve been around this play for a long time. I’m a normal person, he is not my socioeconomic peer, so why is he so active?</p>\n\n<p>If he was chasing some kind of clout or notoriety this is far from the best way to get that. </p>\n\n<p>Perhaps he’s fallen in love with PP, but short of that I can’t imagine his involvement wouldn’t be problematic for him if things fell the wrong way for us, and I think more importantly - he doesn’t need this. He will be rich no matter what happens, he has otherwise no incentive to position himself in the wrong, or unknown side of a passionate groups belief in their thesis.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]