[{"username": "kushVILLE416", "url": "https://www.reddit.com/r/ThePPShow/comments/14vwgaj/why_ndas_why_the_redacted_shit_holly_etlin_david/", "time": 1689001225.0, "subreddit": "r/ThePPShow", "title": "WHY NDA's? WHY THE REDACTED SHIT? HOLLY ETLIN , DAVID KASTIN", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "kushVILLE416", "url": "https://www.reddit.com/r/ThePPShow/comments/13cs65x/pachulski_stang_ziehl_jones_llp_the_law_firm_for/", "time": 1683642974.0, "subreddit": "r/ThePPShow", "title": "Pachulski Stang Ziehl &amp; Jones LLP - The Law Firm for Unsecured Creditors BBBY + TWA (Icahn)", "text": "<!-- SC_OFF --><div class=\"md\"><p>Pachulski Stang Ziehl &amp; Jones LLP has been listed as the lawyers representing the unsecured creditors in the case. Interestingly, this isn&#39;t the first time that the firm has been involved in high-profile bankruptcies, as they have a history of representing creditors in Chapter 11 proceedings.</p>\n\n<p>Source : Docket 270 - <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5ODU3NQ==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5ODU3NQ==&amp;id2=-1</a></p>\n\n<p>One notable example is their representation of Trans World Airlines (TWA) during their bankruptcy in the early 2000s. TWA was struggling financially and filed for Chapter 11 bankruptcy in 2001. Pachulski Stang Ziehl &amp; Jones LLP was hired as the law firm for the unsecured creditors in the case, which included many former employees of the airline who were owed money in pensions and benefits.</p>\n\n<p>During the TWA bankruptcy proceedings, Pachulski Stang Ziehl &amp; Jones LLP fought hard to protect the interests of the unsecured creditors, negotiating with potential buyers and working to ensure that they would receive some form of compensation for their losses. The firm was successful in facilitating the sale of TWA to American Airlines. The unsecured creditors were able to recover some of the money they were owed as part of the sale</p>\n\n<p>Source - Site of Lawfirm - <a href=\"https://www.pszjlaw.com/results-trans-world-airlines.html\">https://www.pszjlaw.com/results-trans-world-airlines.html</a></p>\n\n<p>We all know Big Daddy Icahn was involved during that time with the Sale of TWA London routes and assets to American Airlines.</p>\n\n<p>While it is currently speculative whether there is a direct connection between Pachulski Stang Ziehl &amp; Jones LLP&#39;s representation of unsecured creditors in both the TWA and BBBY bankruptcies and Carl Icahn&#39;s involvement in these cases, it is worth noting that this is a well-respected and well-established law firm. As such, any potential connection to Icahn would require further investigation and confirmation.</p>\n\n<p>Given the high-profile nature of both the TWA and BBBY bankruptcies, it is likely that any potential connections will come to light in due course. Until then, it is important to keep an open mind and wait for further information before drawing any conclusions about the nature of the firm&#39;s involvement in these cases.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kushVILLE416", "url": "https://www.reddit.com/r/ThePPShow/comments/137u5jp/understanding_bankruptcy_auctions_why_the/", "time": 1683221630.0, "subreddit": "r/ThePPShow", "title": "Understanding Bankruptcy Auctions: Why the Stalking Horse Bidder Typically prevails in the auction", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just a little informational post <strong>(not really DD, just info)</strong> with the upcoming Stalking Horse Bid deadline. We may see something before that date but who knows. In my research and findings I have found that the stalking horse bidder is usually will be the winning bidder, not always but in most cases this is true.</p>\n\n<p>Bankruptcy auctions are commonly used to sell off assets or entire businesses as a means of paying off creditors in bankruptcy proceedings. In such auctions, one bidder typically has an advantage over others: the stalking horse bidder.</p>\n\n<p><strong>Stalking Horse Bidder</strong></p>\n\n<p>A stalking horse bidder is the initial bidder in a bankruptcy auction who establishes the minimum bid for the assets up for sale. The debtor typically selects this bidder to guarantee a minimum value for the assets being sold. Additionally, the stalking horse bidder establishes a starting point for other potential bidders to submit their own offers.</p>\n\n<p>With the deadline for the stalking horse bidder fast approaching, it won&#39;t be long until we discover who has the early advantage in the BBBY auction. The stalking horse bidder is typically in a favorable position to acquire the company </p>\n\n<p>So why does the stalking horse bidder usually win in bankruptcy auctions? There are a few reasons:  </p>\n\n<ol>\n<li><strong>Knowledge</strong>: The stalking horse bidder has usually done their homework and knows the value of the assets being sold. They may have already conducted due diligence and have a better understanding of the assets&#39; worth than other bidders. </li>\n<li><strong>Leverage:</strong> The stalking horse bidder has negotiated a purchase agreement with the debtor, which usually includes protections like break-up fees and expense reimbursement. This puts them in a stronger position than other bidders who may not have these protections. 3.</li>\n<li><strong>Perception:</strong> Other bidders may see the stalking horse bidder as a serious and committed buyer, and may be hesitant to bid against them. This can give the stalking horse bidder an advantage in the auction.<br/></li>\n<li><strong>Timing:</strong>  The stalking horse bidder has an advantage in terms of timing. They typically negotiate a purchase agreement with the debtor before the auction, which gives them a head start in the bidding process. They can also choose to include certain conditions in the agreement, such as the ability to walk away if a higher bid is made, which can make them more confident in their bid. Other bidders may not have this advantage and may not have as much time to prepare their bids or negotiate favorable terms </li>\n<li><strong>Relationship with the debtor</strong>: The stalking horse bidder may have an existing relationship with the debtor, such as being a major creditor or supplier. This relationship can give them an advantage in negotiating the purchase agreement and may make them more likely to be selected as the stalking horse bidder. Additionally, the debtor may be more willing to work with a bidder they already know and trust </li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><strong>TLDR: In bankruptcy auctions, the stalking horse bidder is the first bidder who sets the minimum bid and is usually chosen by the debtor. They usually win the auction due to their knowledge, leverage, timing and perceived commitment as a buyer. However, there are exceptions, and other bidders may still make higher offers or the court may reject the stalking horse bidder&#39;s offer.</strong></p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kushVILLE416", "url": "https://i.redd.it/kdl15mtfauxa1.png", "time": 1683217127.0, "subreddit": "r/ThePPShow", "title": "While Everyone is selling, PPseeds is left to do all the heavy lifting for us apes. Shoutout Meme to the man who keeps us entertained while this all plays out :)", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/kdl15mtfauxa1.png\"/></div>"},
{"username": "kushVILLE416", "url": "https://www.reddit.com/r/ThePPShow/comments/13575o9/nasdaq_rule_im51011/", "time": 1682989931.0, "subreddit": "r/ThePPShow", "title": "Nasdaq Rule IM5101-1", "text": "<!-- SC_OFF --><div class=\"md\"><p>Upon examining the 8K filing submitted by BBBY on April 25th, I conducted research on the regulations upon which the delisting of bbby was predicated. During my analysis, I found IM5101-M to be particularly noteworthy.</p>\n\n<p>From 8K “On April 24, the Company received written notice (the “Delisting Notice”) from the Listing Qualifications Department of the Nasdaq Stock Market LLC (“Nasdaq”) notifying the Company that, as a result of the Chapter 11 Cases and in accordance with Nasdaq Listing Rules 5101, 5110(b) and IM-5101-1, Nasdaq had determined that the Company’s common stock will be delisted from Nasdaq. The Company does not intend to appeal this determination”</p>\n\n<p>Source for rule IM5101-1</p>\n\n<p><a href=\"https://listingcenter.nasdaq.com/rulebook/nasdaq/rules/nasdaq-5100-series\">https://listingcenter.nasdaq.com/rulebook/nasdaq/rules/nasdaq-5100-series</a></p>\n\n<p>IM5101-1 Rule 5101 is a rule that allows Nasdaq to deny listing or remove a company from its stock exchange if someone associated with the company has a history of regulatory misconduct. Nasdaq considers various factors when making this determination and may also review the company&#39;s past corporate governance activities. Companies can appeal Nasdaq&#39;s determination through the procedures set forth in the Rule 5800 Series.</p>\n\n<p>In summary, Rule IM-5101-1 is a regulation that allows Nasdaq to use its discretion to deny initial or continued listing to a company if an individual associated with the company has a history of regulatory misconduct. This individual could be an officer, director, substantial shareholder, or consultant to the company. Nasdaq considers a range of factors, including the nature and severity of the conduct, how long ago it occurred, whether it involved fraud or dishonesty, and whether the investing public was affected. Nasdaq may also review a company&#39;s past corporate governance activities to protect investors and the public interest. If Nasdaq determines that there have been violations or evasions of corporate governance standards, it may place restrictions or additional requirements on the listing or deny listing altogether. Remedial measures proposed by the company may be considered by Nasdaq on a case-by-case basis.</p>\n\n<p>Will continue to look further into what this rule may imply for bed bath. I imagine we would see some information regarding it very soon in bankruptcy proceedings . </p>\n\n<p>Cheers :)</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kushVILLE416", "url": "https://www.reddit.com/r/ThePPShow/comments/12xp10i/the_legal_benefits_of_bankruptcy_enhancing/", "time": 1682355355.0, "subreddit": "r/ThePPShow", "title": "The Legal Benefits of Bankruptcy - Enhancing Transparency and Ending Share Dilution for BBBY", "text": "<!-- SC_OFF --><div class=\"md\"><p>I would like to share my perspective on the recent news of BBBY  entering into a &quot;<strong><em>Voluntary Petition for Bankruptcy&quot;</em></strong></p>\n\n<p>I want to highlight some of the benefits that the bankruptcy process can provide to companies like BBBY. One of the key advantages is the enhanced transparency that the judicial process requires.</p>\n\n<p>In the case of BBBY, the bankruptcy process will require comprehensive disclosure of all financial records and operational practices of the company. These records will be thoroughly evaluated by the court and appointed auditors, ensuring that all relevant information is made available to the public. This level of transparency can be particularly valuable for us shareholders, as it allows us to scrutinize the actions of the BOD, and assess whether any bad actors may have been driving the company into bankruptcy. Additionally, we can evaluate whether any good actors were trying to prevent the company&#39;s decline and restructure its operations in a more efficient and profitable manner </p>\n\n<p>Furthermore, bankruptcy can provide a mechanism for addressing poor governance or management practices that may have contributed to the company&#39;s insolvency. By requiring the disclosure of all financial records and operational practices, bankruptcy can shed light on any potential issues that may have been hidden from investors. This can ultimately lead to the correction of these issues, resulting in a more sustainable and profitable business.</p>\n\n<p>Additionally, bankruptcy provides bbby with the opportunity to restructure its debt and operational framework, which may not have been possible otherwise. The reorganization of the company&#39;s financial obligations and operations can be accomplished through a court-approved plan, which will provide for the payment of the company&#39;s creditors, while allowing the company to maintain its viability as a going concern. This strategy provides a path towards a sustainable future for the company, as it can allow the company to shed burdensome obligations and reduce its operational costs.</p>\n\n<p>Furthermore, it is worth noting that bankruptcy can provide a preferable alternative to a reverse stock split, which is often perceived as a strategy to reduce share dilution. However, such a strategy can have long-lasting consequences for the company, and may not address the underlying issues that contributed to the company&#39;s financial difficulties. In contrast, bankruptcy provides an opportunity for the company to address the underlying problems through a comprehensive reorganization plan, which can enable the company to emerge from bankruptcy in a stronger financial position.</p>\n\n<p>I firmly believe that bankruptcy presents numerous benefits for bbby and us as shareholders. While it may appear to be a difficult and challenging process in the short-term, the enhanced transparency, debt relief and operational reorganization provided by bankruptcy can help to promote the long-term sustainability of the company. This is just my opinion and <strong>NFA</strong> but  I would prefer to enter bankruptcy with a clear understanding of the financial situation, rather than undergo substantial dilution of my shares while being uninformed about the company&#39;s operations and financial status. </p>\n\n<p>Cheers :)</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kushVILLE416", "url": "https://www.reddit.com/r/ThePPShow/comments/12t5gp3/the_business_of_media_why_msm_pushes_certain/", "time": 1682005366, "subreddit": "r/ThePPShow", "title": "The Business of Media : Why MSM pushes certain narratives", "text": "Since January I’ve been invested this stock. Like many of you I saw a company that I believed was significantly undervalued and had a potential for a turnaround or acquisition, which is what prompted me to make my initial investment. \n\nOver the course time on Reddit I’ve noticed  that every time an article is published by the MSM, it’s quickly labeled as FUD. Initially, I too believe that the media was biased against BBBY but I never truly understood why.\n\nI think it’s crucial to take a step back and comprehend that the media is, after all, a business with primary goal of attracting viewers and generating revenue. As a result, they tend to propagate specific narratives to cater to their audience and drive up engagement, even if it may seem like they are targeting a specific stock like BBBY. Despite the notion that they might be creating a sense of fear and uncertainty by reporting negative news about the company, it’s pertinent to acknowledge that the sources and information presented thus far have often been correct. \n\nI believe it’s more plausible to assume that the MSM’s ongoing negative portrayal of BBBY is driven by their understanding of substantial social media attention it will generate, rather than ascribing to the theory that implies MSM is being directed by hedge funds to push BBBY into bankruptcy through this narrative. \n\nJust sharing my opinion , irrespective of the content published by MSM or on Reddit or Discord. It's essential that every person conducts their own research and makes investment decisions based on their own due diligence.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "kushVILLE416", "url": "https://www.reddit.com/r/ThePPShow/comments/12kn6vv/speculation_bbby_establishes_new_subsidiary_for/", "time": 1681388423, "subreddit": "r/ThePPShow", "title": "Speculation : BBBY Establishes New Subsidiary for Streamlining Consignment Deal", "text": "My post should be taken as mere speculation and personal opinion since I lack any concrete knowledge of the actual situation. However, based on my best-informed estimate, it appears that the establishment of this new subsidiary is aimed at streamlining the new consignment agreement.\n\nRecently, BBBY has made a credit agreement amendment which includes a section regarding a new subsidiary . I believe that this new sub  will facilitate their new consignment deal. This subsidiary is being set up as a separate legal entity, which will provide BBBY with some significant advantages such as liability protection and ring asset financing.\n\nLiability protection is a significant benefit that the new subsidiary will offer to BBBY. By operating as a separate legal entity, the subsidiary will assume the risks and liabilities associated with the consignment deal. In case of any legal action, the liability will be limited to the assets held by the subsidiary, which protects BBBY from being personally responsible for any damages.\n\nAdditionally, ring asset financing is another significant advantage of the new subsidiary. This type of financing enables the subsidiary to secure financing based on its own assets rather than relying on the parent company's assets. It allows the subsidiary to obtain financing at more favorable terms, which can result in significant cost savings.\n\nIn summary, the new subsidiary established by BBBY will provide the company with liability protection and ring asset financing, which are essential benefits for any company. These benefits will help BBBY to mitigate risk and access financing more efficiently, which will ultimately help the company to achieve its goals and improve its financial position.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]