[{"username": "LastGazelle9548", "url": "https://www.reddit.com/r/ThePPShow/comments/12ziufr/why_file_of_chapter_11_bankruptcy_now_makes/", "time": 1682518375.0, "subreddit": "r/ThePPShow", "title": "WHY FILE OF CHAPTER 11 Bankruptcy NOW? Makes perfect sense.. bear with me....", "text": "<!-- SC_OFF --><div class=\"md\"><p>There is some bond holder (Jake) or creditor (JPM) holding back the sale of BBBY.  already posted by some great DD guys on this reddit.</p>\n\n<p>&#x200B;</p>\n\n<p>By filing BK- the company has  pretty much said they will burn everything down and leave nothing for shareholders and <strong>NOTHING for unsecured bond holders AKA Jake (pennies on the dollar) and JPM</strong>.....I think BBBY was forced into a corner by short sellers where they crashed the price (so BBBY was unable to raise capital through equity) and only turn to horrible loan sharks like JPM and Jake and Hudson Bay.  I won&#39;t be surprised if the short sellers are Jake and JPM.</p>\n\n<p>&#x200B;</p>\n\n<p>By <strong>filing for BK 11-   I think this is a brilliant move</strong> on BBBY&#39;s part.  BBBY is willing to show they can go ALL the way with this threat.  Hence the &quot; closing down stores&quot;, &quot;Shareholders go to zero&quot; etc verbiage.  Now the creditors are also gonna feel the pain of losing.</p>\n\n<p>&#x200B;</p>\n\n<p>If you read between the lines, <strong>it is a threat to JAKE and JPM that BBBY will burn it all down</strong> and go for chapter 7 type liquidation where NO ONE will be made whole, not even the creditors.  To say 4.4 billion in assets is bullshit... they have a salvage value of 720 million dollars+ maybe a 50 million for brand names etc.  Which does NOT allow even the debt holders to fully recover.</p>\n\n<p>&#x200B;</p>\n\n<p>The BK play is smart as FUCK, because now they have the protection on the law to bypass the creditors, who are 1000% behind shorting the equity of this company.</p>\n\n<p>&#x200B;</p>\n\n<p>BBBY needed to make BK hearings sound like the company is in dire straights for a judge to approve BK protection.</p>\n\n<p>&#x200B;</p>\n\n<p>I think BBBY earnings may surprise on the upside and that when IEP (Carl Icahn) will announce the LBO.  An LBO needs to know that the target is cash flow positive/cash flow neutral to make a sound investment.</p>\n\n<p>&#x200B;</p>\n\n<p>I am ready to HODL the line.  I think our Board has  fought tooth and nail against these snakes.</p>\n\n<p>The RC court case was also a fake case to keep him from bidding for BBBY.  I won&#39;t be surprised if it is Jake the Snake behind the lawsuit.</p>\n\n<p>&#x200B;</p>\n\n<p>I think <strong>this play is NOT DONE.</strong>  I believe Kastin said on Linkedin that this was a tough play.  I believe Sue that they are restructuring.  We are at the finish line.  3-4 more weeks.</p>\n\n<p>&#x200B;</p>\n\n<p>I know we will win.</p>\n\n<p>This is just my opinion.  Needed to vent.  Brain is in overdrive.</p>\n\n<p>&#x200B;</p>\n\n<p>PS: I think OTC has less liquidity and less options play.  However, you can buy and sell shares if your broker allows it.   It will take out SHFs as there are few ways to hack the system with fake locates. </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]