[{"username": "LastResortFriend", "url": "https://www.reddit.com/r/ThePPShow/comments/17o7ti6/blackstar_enterprise_group_a_looming_threat/", "time": 1699174309.0, "subreddit": "r/ThePPShow", "title": "BlackStar Enterprise Group: A Looming Threat?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys I&#39;ve been keeping on eye on this ticker for a while now because I&#39;ve suspected them to be a trap of some kind the bad actors would employ at some point. They&#39;ll be getting a patent that seems very important imo.</p>\n\n<p><a href=\"https://archive.fast-edgar.com/20231101/AVLZ622CZ225O2Z2222F22ZZFASWZZY22U52/ex99.htm\">https://archive.fast-edgar.com/20231101/AVLZ622CZ225O2Z2222F22ZZFASWZZY22U52/ex99.htm</a></p>\n\n<p>For those that don&#39;t want to click the link here is the text:</p>\n\n<blockquote>\n<p><strong>BlackStar will Receive a Patent on its Revolutionary Digital Trading Platform: A Blockchain Encrypted Infrastructure Designed to Enable Digital Assets that are Securities to Trade on a Blockchain.</strong>  </p>\n\n<p><strong>BOULDER, CO / October 24, 2023 / BlackStar Enterprise Group, Inc. (“BlackStar”) (OTC Pink: BEGI)</strong> BlackStar on 10/19/2023 received a ‘Notice of Allowance’ from the United States Patent and Trademark Office (USPTO), for a patent application titled “System and Method for Matching Orders and Immutable Blockchain Ledger for all Customer Trading Activity with Settlement into the Broker Dealer Ecosystem.” The technology claimed in the patent application enables trading of common shares of a public company on a blockchain. This revolutionary software is called the BlackStar Digital Trading PlatformTM (“BDTP TM”), a trading platform for electronic fungible shares in book-entry, and compliant at any U.S. Brokerage Firm.  </p>\n\n<p><strong>When asked for comment, BlackStar’s CEO, Joseph E Kurczodyna stated that “this may revolutionize blockchain trading of digital assets that are securities.” When this patent issues in due course at the USPTO, likely in November 2023, BlackStar will have a registered patent that will give BlackStar a 20- year monopoly on digital equity trading of securities on a blockchain.</strong></p>\n</blockquote>\n\n<p>&quot;A 20- year monopoly on digital equity trading of securities on a blockchain.&quot; Is this an attempt to block us from getting new equity on the blockchain, or maybe an attempt to close the doors behind us? Or maybe they&#39;re somehow linked to some good actors?</p>\n\n<p>My attention has been split lately so I would request some wrinkle brains look into this and tell the rest of us if it&#39;s a nothingburger or if it&#39;s something to keep in mind going forward. I know patents are fairly easy to get but these guys have been waiting for years and suddenly it&#39;s gonna happen in November, that&#39;s too much of a coincidence in my eyes.</p>\n\n<p>Shouldn&#39;t overstock already have a patent like this since they already have a platform built? If so maybe it&#39;s a sign that many more companies are starting to see the benefits to going on the blockchain and that things are starting to get built in that regard? I&#39;m curious to know what you guys think.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🗞 Market News 🗞", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "LastResortFriend", "url": "https://www.reddit.com/r/ThePPShow/comments/14rty9x/reminder_we_know_teddy_will_be_more_than_rcs_book/", "time": 1688607214.0, "subreddit": "r/ThePPShow", "title": "Reminder: We know Teddy will be more than RC's book publishing company because of the Trademarks!", "text": "<!-- SC_OFF --><div class=\"md\"><p>PPShow failed to mention to Hannah tonight that the reason we think Teddy will be more than that is because of the Trademark purposes.</p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/14qgu7r/teddy_trademarks/\">https://www.reddit.com/r/ThePPShow/comments/14qgu7r/teddy_trademarks/</a></p>\n\n<p>Come on guys, that should have been an easy win there at the end.</p>\n\n<p>Love you. Not sure what to flair this, pls halp. &lt;3</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "LastResortFriend", "url": "https://www.reddit.com/r/ThePPShow/comments/1406xsj/ghost_in_the_market_advent_of_the_worlds_first/", "time": 1685869241.0, "subreddit": "r/ThePPShow", "title": "Ghost in the Market: Advent of the World's First True Stand Alone Complex", "text": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;ve seen the Gmerica DD.  We&#39;re excited. But I&#39;m so much more jacked now because a realization hit me like a freight train.</p>\n\n<p>Apes were a precursor. The main goal was never to create a central group of people in the know, IE apes, to take on market corruption. It was to manifest a true Stand Alone Complex to do it. The hidden Black Swan.</p>\n\n<p>So what the hell is that?</p>\n\n<p><em>The term &quot;Stand Alone Complex&quot; originates from the anime and manga series &quot;Ghost in the Shell&quot; created by Masamune Shirow. In the series, a Stand Alone Complex (SAC) refers to a social phenomenon that occurs in a networked society.</em></p>\n\n<p><em>In the context of the story, a Stand Alone Complex emerges when a large number of individuals or groups begin to exhibit similar behaviors, beliefs, or actions, seemingly independent of any central coordination or organization. These individuals or groups act based on their own interpretations or perceptions of an event, without direct communication or influence from a central authority. Despite lacking a single source or leader, the Stand Alone Complex displays a collective behavior that mimics a centralized organization.</em></p>\n\n<p><em>The name &quot;Stand Alone Complex&quot; is derived from the idea that these groups appear to be self-sustaining and &quot;stand alone&quot; without external control, even though they are actually interconnected through shared information and ideas. They can spread rapidly through networks, influencing and inspiring others to join in the same behavior or belief.</em></p>\n\n<p><em>A Stand Alone Complex is not merely about multiple copies of a behavior, object, view, etc., existing without an original. It is more about the emergence of a collective phenomenon or behavior that appears to be independent and self-sustaining, even though it lacks a central source or coordination. The phenomenon arises from the actions and interpretations of individuals or groups within a networked society.</em></p>\n\n<p><em>In a Stand Alone Complex, individuals or groups observe a certain behavior, object, view, or event and independently adopt and propagate it based on their own interpretations and perceptions. These individuals are not necessarily copying a single original, but rather creating their own versions of the behavior or belief.</em></p>\n\n<p><em>The Stand Alone Complex is characterized by a network effect, where the behavior or belief spreads rapidly and influences others to adopt it. It is not about isolated copies existing without an original, but rather the collective manifestation of similar behaviors or beliefs emerging from decentralized sources.</em></p>\n\n<p><em>Within a SAC, multiple self-organizing collectives can arise independently, with each collective exhibiting its own internal dynamics and decision-making processes.</em> <strong><em>These self-organizing collectives may have different goals, interests, or focuses, but they contribute to the overall replication and spread of the SAC.</em></strong> </p>\n\n<p>A bit wordy but I had ChatGPT help me explain it fully and the description matches what I know a SAC to be.</p>\n\n<p>Do you not see it now? MOASS represents the perfect event to kick off a truly large scale SAC. Apes were first and our shouting has spread the base ideas far and wide over the world.</p>\n\n<p>There is no stopping it. Too late. The Streisand effect is, will, and has been fueling and accelerating the birth of this wondrous phenomenon. Just one more sneeze level event and it crowns. With the advent of true decentralization Stand Alone Complexes are now able to rise up when a centralized authority acts out.</p>\n\n<p>Personally I think it&#39;s why everyone who seems to be in the know is so unnaturally Zen. It&#39;s why I&#39;ve seen rabid bulldog investigator apes go Zen and quiet with a smile on their face. They all have this idea in mind but outside of the anime mentioned nobody seems to have articulated it very well. </p>\n\n<p>It&#39;s why the shills will lose no matter what positions they put themselves in. They could always see a group like us forming and were somewhat prepared for that outcome. What they never predicted was that group being the catalyst for a fictional phenomenon to actually manifest in the real world.</p>\n\n<p>All of this is just my prediction: Stand Alone Complexes are no longer fictional. A Stand Alone Complex larger than just us will take on the market and we&#39;re all going to make it. But maybe I&#39;m just crazy. I just like the stock.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "LastResortFriend", "url": "https://www.reddit.com/r/ThePPShow/comments/13ytijl/reminder_swap_deals/", "time": 1685748770.0, "subreddit": "r/ThePPShow", "title": "Reminder: Swap Deals", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was looking through the DD of old and was reminded of Swap deals.</p>\n\n<p>There are several kinds of Swap deal to choose from, with more invented every year to serve the unique business needs of our institutional counterparts. Here are some I&#39;ve come to learn of:</p>\n\n<ol>\n<li>Commodity Swaps: Exchange cash flows based on the price fluctuations of commodities (e.g., oil, natural gas, metals). [<a href=\"https://www.investopedia.com/terms/c/commodityswap.asp\">https://www.investopedia.com/terms/c/commodityswap.asp</a>]</li>\n<li>Total Return Swaps: Exchange total return on an underlying asset (e.g., bond, equity index) for fixed or floating rate payments. [<a href=\"https://www.investopedia.com/terms/t/totalreturnswap.asp\">https://www.investopedia.com/terms/t/totalreturnswap.asp</a>]</li>\n<li>Volatility Swaps: Trade or hedge volatility levels of an underlying asset (e.g., stock index, currency). [<a href=\"https://www.investopedia.com/terms/v/volatilityswap.asp#:%7E:text=Key%20Takeaways-,A%20volatility%20swap%20is%20a%20forward%20contract%20with%20a%20payoff,volatility%20and%20the%20volatility%20strike\">https://www.investopedia.com/terms/v/volatilityswap.asp</a>]</li>\n<li>Inflation Swaps: Exchange fixed and floating cash flows based on inflation rates. [<a href=\"https://www.investopedia.com/terms/i/inflation-swap.asp#:%7E:text=An%20inflation%20swap%20is%20a%20transaction%20where%20one%20party%20transfers,break-even\">https://www.investopedia.com/terms/i/inflation-swap.asp</a>]</li>\n<li>Cross-Currency Swaps: Swap interest and principal payments denominated in different currencies, often used to manage foreign exchange risk. [<a href=\"https://www.investopedia.com/terms/c/cross-currency-swap.asp#:%7E:text=What%20Is%20a%20Cross-Currency,denominated%20in%20two%20different%20currencies\">https://www.investopedia.com/terms/c/cross-currency-swap.asp</a>]</li>\n<li>Basis Swaps: Exchange cash flows based on different floating rate indices, allowing participants to adjust the basis or spread between them. [<a href=\"https://www.investopedia.com/terms/b/basisrateswap.asp\">https://www.investopedia.com/terms/b/basisrateswap.asp</a>]</li>\n<li>Constant Maturity Swaps (CMS): Swap fixed interest payments for floating payments based on a reference rate with a constant maturity (e.g., CMS curve). [<a href=\"https://www.investopedia.com/terms/c/cms.asp#:%7E:text=A%20constant%20maturity%20swap%20(CMS\">https://www.investopedia.com/terms/c/cms.asp</a>%20is%20a%20variation%20of%20the,length%20of%20the%20reset%20period)]</li>\n<li>Equity-Linked Swaps: Exchange cash flows based on the performance of an individual stock or a basket of stocks. [<a href=\"https://www.investopedia.com/terms/e/equityswap.asp\">https://www.investopedia.com/terms/e/equityswap.asp</a>]</li>\n<li>Variance Swaps: Trade or hedge the volatility of an underlying asset, typically an equity index or a stock. [<a href=\"https://www.investopedia.com/terms/v/varianceswap.asp#:%7E:text=A%20variance%20swap%20is%20a,result%20and%20the%20actual%20result\">https://www.investopedia.com/terms/v/varianceswap.asp</a>.]</li>\n<li>Dividend Swaps: Exchange cash flows based on expected or realized dividends of an underlying stock or index. [<a href=\"https://fincyclopedia.net/derivatives/d/dividend-swap\">https://fincyclopedia.net/derivatives/d/dividend-swap</a>]</li>\n<li>Callable Swaps: Provide the option to terminate or extend the swap before its original maturity date. [<a href=\"https://www.investopedia.com/terms/c/callable-swap.asp\">https://www.investopedia.com/terms/c/callable-swap.asp</a>]</li>\n<li>Credit Default Swaps (CDS): Derivative contracts that offer protection against the default of a reference entity, allowing investors to hedge credit risk or speculate on changes in creditworthiness. [<a href=\"https://www.investopedia.com/terms/c/creditdefaultswap.asp\">https://www.investopedia.com/terms/c/creditdefaultswap.asp</a>]</li>\n<li>Loan-only Credit Default Swaps (LCDS): Credit default swaps specifically tied to loans, providing protection against the default of a specific loan or loan portfolio. [<a href=\"https://www.investopedia.com/terms/l/loan-credit-default-swap.asp\">https://www.investopedia.com/terms/l/loan-credit-default-swap.asp</a>] </li>\n<li>MCDS: The reference entity is a municipality, and the reference obligation a municipal bond.<br/></li>\n<li>ABCDS: CDS on structured securities (Asset Backed Securities typically) </li>\n<li>Preferred CDS: CDS on Preferreds </li>\n</ol>\n\n<p>Many, if not all of these, can have what&#39;s called a bullet clause which allows the premium on these deals to be paid up front, the payout of the deals to be all at once when triggered, and can sometimes not be cancelable. The deal is fired like a bullet, fast and no take backs.</p>\n\n<p>Understanding Swaps is the key to seeing <strong>everything</strong> is connected. Swap reporting is crippled and will continue to be crippled for this reason, you would literally see it.</p>\n\n<p>Edit: Added 12, 13, and the Bullet clause line. Edit-Edit: Added extra info on CDS types. Source for 12-16: [<a href=\"https://content.markitcdn.com/corporate/Company/Files/DownloadFiles?CMSID=577e364482314b31b158ae2c2cecc89d\">https://content.markitcdn.com/corporate/Company/Files/DownloadFiles?CMSID=577e364482314b31b158ae2c2cecc89d</a>]</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "LastResortFriend", "url": "https://i.redd.it/x561paxoyi3b1.png", "time": 1685676948.0, "subreddit": "r/ThePPShow", "title": "That slow horse has me holding my calls like:", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/x561paxoyi3b1.png\"/></div>"}]