[{"username": "leoschen", "url": "https://www.reddit.com/r/ThePPShow/comments/12z46f1/dumbing_it_down_for_the_smooths_by_a_smooth/", "time": 1682477406.0, "subreddit": "r/ThePPShow", "title": "Dumbing it down for the smooths (by a smooth)", "text": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re still confused about what&#39;s going on, as I am... join in and add some constructive thoughts to straighten out a little, because I think there&#39;s a lot of misinformation flying around.</p>\n\n<p><strong>Very High Risk Hero or Zero</strong></p>\n\n<p>We are in the final curtain of the end game. One route, and one route only: SALE (of some sort).<br/>\nOption A - Sale of some sort, either picked up via distressed merger / buy out bid </p>\n\n<ol>\n<li>We have one last bastion, and that is that there has been a White Knight lying in the backdrop to swoop in at the right time. In which case, we can breathe some sigh of relief perhaps because shareholders could more likely get something (from decent to good or great). We will soon see in about a month&#39;s time as BBBY moves to Stalking Horse bids and auction how this thesis unfolds.</li>\n<li>The latter possibility (more unpleasant reality to consider, and history isn&#39;t exactly on our side with this), is that this does get bought up but shareholders don&#39;t receive anything. GG.</li>\n</ol>\n\n<p>Option B - phase into Chapter 7 and straight liquidation</p>\n\n<ol>\n<li>Doesn&#39;t need much to say, GG... and expect class action lawsuits.</li>\n</ol>\n\n<p><strong>Expectations</strong><br/>\nAs we move closer to the milestone dates, and Chapter 7 becomes increasingly apparent, the price will continue to tank further. Any news coming out on potential bidders or buyouts will stir the pot and provide some green candles for all (results will vary). For some, it may be prudent to swing trade on the volatility to de-risk a little bit. For others, it may work better if they bought in really big at a very low point to DCA to an attainable low bar break-even to get out (if situation&#39;s gotten too hot for them). And others, who are fully convicted on White Knight to come through... to keep HODL&#39;ing.  </p>\n\n<p>*NFA, I&#39;m just an OG ape who&#39;s been HODL&#39;ing GME since Jun &#39;19, &amp; BBBY since Jul &#39;22</p>\n\n<p><strong>Addendum</strong><br/>\nI&#39;ve been noticing a large uptick in blocks and reports from users in bobby and here, if you exerience the same just realize that no one is on your side. You are all individual investors hoping to ultimately make money, and you are responsible for your own investment and trading decisions. You do you.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "leoschen", "url": "https://i.redd.it/zat7m80r39ra1.jpg", "time": 1680327294.0, "subreddit": "r/ThePPShow", "title": "NFA", "text": "<!-- SC_OFF --><div class=\"md\"><p>I don’t know where the bottom of the well is, but it’s not $0. If I’m wrong, I’m wrong. If I’m right, I want to be well positioned to capitalize. Cost avg now down to sub $2. Let’s go.💥</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/zat7m80r39ra1.jpg\"/></div>"}]