[{"username": "LiftingOrGaming", "url": "https://i.redd.it/3hi13qheaphb1.jpg", "time": 1691855289, "subreddit": "r/ThePPShow", "title": "Opt-Out Release Form", "text": "\nIn this Opt-Out form, the release that is being referred to is contained in Article X (D.) of the Bankruptcy Plan.\n\nThe bankruptcy plan is in Docket 1713. You can access this docket by following this link.\n\nhttps://restructuring.ra.kroll.com/bbby/Home-DocketInfo?DocAttribute=4578&DocAttrName=PLANDISCLOSURESTATEMENT_Q&MenuID=10237&AttributeName=Plan%20%26%20Disclosure%20Statement\n\n\nWithin the docket Article X begins on pg. 69 (Nice) and is titled \"Confirmation Of The Plan\". Section D Begins on pg. 71. I copied/pasted the whole section that the Opt-Out Release Form is in regards to below.\n\n     D. Acceptance by Impaired Classes\r\nThe Bankruptcy Code requires, as a condition to confirmation, except as described in the \r\nfollowing section, that each class of claims or equity interests impaired under a plan, accept the \r\nplan. A class that is not “impaired” under a plan is deemed to have accepted the plan and, therefore, \r\nsolicitation of acceptances with respect to such a class is not required. Section 1126(c) of the Bankruptcy Code defines acceptance of a plan by a class of impaired claims as acceptance by Holders of at least two-thirds in a dollar amount and more than one-half in a number of Allowed claims in that class, counting only those claims that have actually voted to accept or to reject the plan. Thus, a class of claims will have voted to accept the plan only if \r\ntwo-thirds in amount and a majority in number actually cast their ballots in favor of acceptance.\n\n\nI'm posting this for clarity and promote more discussion on the recent solicitation of the Opt-Out of the Third-Party Release. Please correct me if I made any mistakes. There has also been a lot of comments that this Opt-Out Release is in regards to releasing a shareholders right to sue. This does not appear to be the case.", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3hi13qheaphb1.jpg\"/></div>"}]