[{"username": "limegreencab", "url": "https://www.reddit.com/r/ThePPShow/comments/174slcg/my_dream_and_my_hope/", "time": 1696963226.0, "subreddit": "r/ThePPShow", "title": "My dream and my hope", "text": "<!-- SC_OFF --><div class=\"md\"><p>I had a weird dream that reminded me of my cousin, Eric. Eric was one  of my first real friends when I moved from Oklahoma to Missouri as a  young elementary aged kid in the mid 90s after my mom remarried. He was a very stabilizing force for me as a kid and certainly was someone who acted as a role model. From video games, to candy, to skateboarding, and he even taught me about masturbation. Eric was the cousin and friend that I grew up idolizing. He was the youngest link to an  otherwise older and foreign (less reachable) step-family. Looking back, his friendship hugely impacted the trajectory of my childhood friendships and interests in my life. Unfortunately, he died when I was  in 8th or 9th grade. He was a senior in high school and had what seemed to be at the time, a potential promising skateboard career ahead of him;  as he had just signed his first semi-pro advertising deal and released  his first skate boarding video with his friends. </p>\n\n<p><em>Until The Day I Die by Story of the Year</em> plays in my head. </p>\n\n<p>Next, I try to find the skateboarding video online. It’s a hopeless attempt as the internet was just starting to pervade my life and it  wasn’t common practice yet to upload every single thing online. I  remember the skate shop that his friends family opened in the nearby town and search for that instead. The shop has a Facebook page that is  inaccessible to me because I’ve long ditched Facebook and no longer have an account. That brings me to this realization inspired party by this wonderful blog post titled Stop Talking to Each Other and Start Buying Things:  Three Decades of Survival in the Desert of Social Media— <a href=\"https://catvalente.substack.com/p/stop-talking-to-each-other-and-start\">https://catvalente.substack.com/p/stop-talking-to-each-other-and-start</a></p>\n\n<p>That’s when I realize there must be a social media that operates differently than the current status quo. Old memories, old connections  have all been harvested in a tragic breach of trust and users have been presented with a proposition: let us monetize you and the platform or move on to the next “promising” platform. These social media companies are a perfect finality of the neoliberal hellscape consuming all public goods. In an alternate universe, YouTube is a video web archive for ALL  humanity where friends, family, artists, historians, etc can come to the  video archive and find not only their memories and the memories of  loved ones, but all memories ever uploaded in video form. When you start  to deconstruct how the internet currently operates and reconstruct this  “utopian” reality you begin to understand just how much public good has  been stolen &amp; robbed from us and all of humanity. The internet  built as a public good, funded by public funds, connecting millions upon  millions of interconnected human relationships has been captured by  those who create paywalls and use family, friend, and fellow human to  extort you, rob you, and ultimately decimate community. Leaving nothing but a toxic neoliberal wasteland in its place.</p>\n\n<p>We know GameStop is involved with web3. We know web3 is supposed to be a decentralized web that puts an end to corporations siphoning all life force from humanity via our growing connection to the digital world. Is it possible that RC, DFV, and others have a plan to bring back the internet as a true public good? I don’t know, but it is my hope.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]