[{"username": "ljsweet", "url": "https://www.reddit.com/r/ThePPShow/comments/13neuug/shooting_stars_of_the_bbbyq/", "time": 1684631800.0, "subreddit": "r/ThePPShow", "title": "Shooting Stars of the BBBYQ", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just want to point out we got the Pete post then after that is a price anchoring post. So I figured I&#39;ll throw this post up with them to add beneficial content.    </p>\n\n<p>I want to show WSJ, our government entities combing through the sub, as well as Ken &amp; Friends that there are apes out there that plan on doing great things if the prophecy holds true. (Margin Call. Cuz ya know our Government and Banks allowed this shit.)  Not all of us want to make a few hundred dollars like Pete. I&#39;m in this play to help aid in the change of our financial market as well as many others. For real. You government entities reading this got to have a clue that this Wealth Gap is fucking fierce these days. Our future generations deserve a hell of a lot better. I dont want to have kids knowing that they&#39;ll be growing up in a trash ass economy filled with greedy corrupt pigs up top with no feelings except for money and power. There is so much more to life than this trash we&#39;re seeing. Unity Brothers &amp; Sisters. </p>\n\n<p>I for one am going to start a charity casino. Build it from the ground up or buy a casino outright w/e works best.. All the profits will go towards helping human beings, our one and only planet, funding cures for diseases, and more... Idk about you all but if ya&#39;ll looked around you can see we got a major mental health crisis happening. If you think its bad now wait 10-15 years. The spirits of Americans need to get lifted. Shit might hit the fan before healing but slowly over time maybe folks might slow there role and take a nice slow steady breath in and then exhale and say &quot;There are people that care about my well being.&quot; </p>\n\n<p>Hopefully one day charity casinos will be littered across the globe. There would be a steady flow of money that could help aid many of different things for the benefit of humanity. That&#39;s what this ape wants to see. I for one want to leave this planet better off than when it was given to me! Oooohk!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ljsweet", "url": "https://www.reddit.com/r/ThePPShow/comments/13l6qux/government_entities_combing_bbbyq_subs_click_here/", "time": 1684434364.0, "subreddit": "r/ThePPShow", "title": "Government Entities combing BBBYQ subs click here", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is there any good porn videos you’d recommend?? I’d like to have peace of mind knowing tax dollars of US Citizens aren’t going to a complete waste. So, please share.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ljsweet", "url": "https://www.reddit.com/r/ThePPShow/comments/12p03ku/etoro_bbby_stuff_n_things/", "time": 1681701736.0, "subreddit": "r/ThePPShow", "title": "Etoro &amp; BBBY stuff n things", "text": "<!-- SC_OFF --><div class=\"md\"><p>Idk about ya&#39;ll but im curious to see this Etoro contraption, if anything would come of it.. Twitter is going to use Etoro from what ive comprehended or incorporate it within the app in some way?? Would I love Ryan Cohen n friends to run the show at Bed Bath and Beyond? Abso-fucking-lutely cuz the man has got a heart and cares about human beings/ the planet and i feel his intentions are good... Is it all bad at this point in time with this  Etoro stuff? Maybe. If this Etoro BBBY partnership/merger rumor happens can it be good? Maybe. Will Sue Gove finally accept my offer to go out on a date? Maybe... Household Investors dont know what&#39;s happening behind the curtain. Even Alladin might not know wtf is going on. Point is shills are swarming the subs. Lets not get divided. Everyone is entitled to their own crayon. Somethign is bound to fucking happen from tomorrow through May 9th. The Final Act of the show has got to be near/here.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ljsweet", "url": "https://www.reddit.com/r/ThePPShow/comments/12kbkuv/the_cory_tweet_the_alt_account_maybe_oohk/", "time": 1681359471.0, "subreddit": "r/ThePPShow", "title": "The Cory tweet. The alt account, maybe oohk.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Put your tinfoil hat on fellow ape and grab some more and wrap it around. You&#39;re going to need it. Put on some more if you like. What im about to tell you is titty jacking to at least myself and I see no ape has mentioned it... Look at Cory most recent tweet. Click on show replies. Keep scrolling until you see the account with the reply from Silvontoff-Drs&#39;d. Look at his reply then look at the shill reply weeknd sremmurd... Tuurble.. Well apes this is where you need to put the tinfoil on. Cory replied to that shill/bot. The gif mustve been deleted pretty quick. I caught a glimpse of the response. It was a women standing on a docked boat with a man sitting next to her. In the gif it catches her motioning to give her beer to the man sitting down with his hand in the air ready to receive said beer with the caption &quot;Hold my beer&quot; </p>\n\n<p>Take the tinfoil for what its worth. I wanted to share cuz i seen no one else brought it up that I am aware of.</p>\n\n<p>I eat crayons. I usually tell Pete to take a hit on stream cuz i know he at least wants to and nag on Carter cuz i know he has a crush on platinumsparkles </p>\n\n<p>Maybe something maybe nothing Oohk and HOONK-HOONK!!  </p>\n\n<p><a href=\"https://twitter.com/FDezenoten\"> </a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]