[{"username": "LlewelynMoss1", "url": "https://www.reddit.com/r/ThePPShow/comments/15pno2k/at_this_point_mooning_is_guaranteed_backup_plan/", "time": 1691895959.0, "subreddit": "r/ThePPShow", "title": "At this point, mooning is guaranteed (backup plan)", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "LlewelynMoss1", "url": "https://www.reddit.com/r/ThePPShow/comments/15pno2k/at_this_point_mooning_is_guaranteed_backup_plan/", "time": 1691895959, "subreddit": "r/ThePPShow", "title": "At this point, mooning is guaranteed (backup plan)", "text": "\nBear with me\n\nPulte  has directly benefited from this sub's collective belief that BBBY is going to moon. \n\nLook at the price of Pulte homes/holdings since he started interacting with the sub. We are mostly responsible for its rise. Apes strong together\n\nI'm still of the strong belief that Pulte, who is a millionaire/billionaire? By birth wouldn't be messing or referencing this stock/PP show if there wasn't more going on. He said that Cohen is still interested in BbBY after calling into the PP show. This directly indicates a theory that Cohen would be having involvement in the future. If you map the stock to this appearance, then you will see shares and volume moving in relation to his comment. \n\nBut on the 2% chance he is just grifting us, there is still a potential way for us to moon \n\nWe could sue Pulte directly for damages based upon either, 1. The potential profit we lost out on (moass /pultes assets)\n\n2. At least our money back.\n\nI'm not us based, so one of the Americans will have to take that route. Unfortunately I'm doing some non profit work in a great, but legally disorganized country that has no ability to make legal action in America. But I imagine that the EU+USA courts might allow other users to have an option to moon off of pultes assets+ a stake in Pulte group holdings?\n\nPulte holdings/homes has a market cap of 18 billion. That is a decent amount to be distributed to the apes that Pulte is either giving hints to, or misleading with his recent behavior and statements\n\nSemi repost of a past post but with a better explanation. My sister is a paralegal and said crazier lawsuits have worked even if we settle out of court. Anyone who has a us base(my sister is also in this unorganized country) want to go ahead and start the legal side of things and I will jump in later if it works. I think it would though even if Pulte just settles with us out of court", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]