[{"username": "Longjumping-Ad6997", "url": "https://i.redd.it/ibaswda8v7vb1.jpg", "time": 1697746243.0, "subreddit": "r/ThePPShow", "title": "🤑🤑🤑", "text": "<!-- SC_OFF --><div class=\"md\"><p>Looks like we’re on track for a ROYAL FLUSH, maybe I should play the lottery! As if I need the money LMAYO</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ibaswda8v7vb1.jpg\"/></div>"},
{"username": "Longjumping-Ad6997", "url": "https://www.reddit.com/r/ThePPShow/comments/165ahog/as_the_last_frontier/", "time": 1693389829.0, "subreddit": "r/ThePPShow", "title": "As The Last Frontier,", "text": "<!-- SC_OFF --><div class=\"md\"><p>As time passes, I realize that Corporate America will continuously devour anything &amp; everything in its path to achieve complete domination. Whether it’s a foreign adversary or it’s own people in the most disingenuous way. It is not a government that seeks equilibrium but a centralized regime that seeks to control everything. I’m sure we all know this by now, but what I want to iterate is how important a role we play in all of this. Shills or misinformed individuals come to this sub and say whatever they think is right knowing they don’t know shit about fuck.</p>\n\n<p>I’m telling you right now as someone who’s been here for a while that this was never about the money. This is about power. Power, power and more power. Any price target you have is practically null &amp; void. These guys wouldn’t still be shorting if this was about the money. I don’t really like saying much often but if you know you know. This stock will be ABSOLUTELY unobtainable &amp; practically priceless. I don’t know how much longer it might take but My God will it be glorious. Completely unfathomable.</p>\n\n<p>I’ll definitely stick around post launch to see what happens next.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Longjumping-Ad6997", "url": "https://www.reddit.com/gallery/14lzrqp", "time": 1688028886.0, "subreddit": "r/ThePPShow", "title": "Did Overstock intentionally acquire BBBY, to absorb more naked shorts?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m am 90% sure the reason Overstock was the purchaser of BBBY was because they have naked shorts of their own. </p>\n\n<p>With a backflip takeover in place, Overstock technically becomes Bed Bath &amp; Beyond, &amp; Overstock shorts become BBBY shorts. And if I’m not mistaken I believe Overstock had a sneeze of its own in 2019, and hasn’t truly squeezed yet due to being naked shorted. On top of the Teddy merger acquisitions.</p>\n\n<p>If what this is leading onto follows suite then shorts are going to have to close positions on multiple companies that they’re massively naked on, causing a never-ending chain reaction that will continue to become increasingly unaffordable the more it ensues.</p>\n\n<p>I don’t know what to say honestly. They’re going to be completely wiped out. RC is genuinely stacking damage buffs.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/pZ9WCgWL5WbCOUM8aJ633GGC57AwkueCN0XesQ-r7g4.jpg\"/></div>"},
{"username": "Longjumping-Ad6997", "url": "https://www.reddit.com/r/ThePPShow/comments/13ijjxo/i_will_singlehandedly_prevent_shorts_from_closing/", "time": 1684182708.0, "subreddit": "r/ThePPShow", "title": "I will single-handedly prevent shorts from closing.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Cede &amp; Co has more shares in the market than in existence.</p>\n\n<p>They can’t close out until my DRSed shares are completely sold, even if it’s only 1 (it’s not just 1).</p>\n\n<p>I will single-handedly never sell any DRSed shares. They can put up any bid price.</p>\n\n<p>They can send men in suits to my house.</p>\n\n<p>They can broadcast a national emergency to find me.</p>\n\n<p>I could be living homeless in the streets &amp; my shares still wouldn’t hit the market.</p>\n\n<p>No price targets.</p>\n\n<p>Just up.</p>\n\n<p>I ain’t selling anything less than infinity.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Longjumping-Ad6997", "url": "https://i.redd.it/y6eb07rhqtxa1.jpg", "time": 1683192168.0, "subreddit": "r/ThePPShow", "title": "OTC stocks can be halted", "text": "<!-- SC_OFF --><div class=\"md\"><p>(1) the OTC Equity Security or the security underlying an American Depository Receipt (&quot;ADR&quot;) that is an OTC Equity Security (&quot;OTC ADR&quot;) is listed on or registered with a foreign securities exchange or market, and the foreign securities exchange, market, or regulatory authority overseeing such issuer, exchange, or market, halts trading in such security for regulatory reasons because of public interest concerns or for news pending; provided, however, that FINRA will not impose a trading and quotation halt if the Foreign Regulatory Halt was imposed solely for a regulatory filing deficiency, or operational reasons (&quot;Foreign Regulatory Halt&quot;);</p>\n\n<p>(2) the OTC Equity Security or the security underlying an OTC ADR is a derivative or component of a security listed on or registered with a national securities exchange or foreign securities exchange or market (&quot;listed security&quot;) and the national securities exchange, or foreign securities exchange or market imposes a trading halt in the listed security (&quot;Derivative Halt&quot;); or\n(3) FINRA determines that an extraordinary event has occurred or is ongoing that has had a material effect on the market for the OTC Equity Security or the security underlying an OTC ADR or has caused or has the potential to cause major disruption to the marketplace or significant uncertainty in the settlement and clearance process (&quot;Extraordinary Event Halt&quot;).</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/y6eb07rhqtxa1.jpg\"/></div>"},
{"username": "Longjumping-Ad6997", "url": "https://www.reddit.com/r/ThePPShow/comments/136g5v3/i_think_otc_is_where_we_squeeze/", "time": 1683108162.0, "subreddit": "r/ThePPShow", "title": "I think OTC is where we squeeze", "text": "<!-- SC_OFF --><div class=\"md\"><p>I mean think about it, most brokers exposed to the massive risk of not having the shares available to meet demand mostly stated they’ll no longer allow the purchasing of BBBY.  </p>\n\n<p>The stock is now contained in a sense to where FOMO traders will be unable to really buy in due to these restrictions. The average joe most likely uses RH or CashApp.</p>\n\n<p>OTC markets are known for being a lot more volatile with much larger spreads with lower liquidity. Something like a nuclear bomb testing site. \nThe only problem is the lack of “regulation” but there’s not much of that anyway in the first place.</p>\n\n<p>I think we are in for a MOASS &amp; not just a short squeeze.</p>\n\n<p>One thing I want people to realize is that our “sneeze” was in August. The next real run up is going to be the MOASS.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]