[{"username": "LYouSeeK", "url": "https://i.redd.it/a75eh3oosuwb1.jpg", "time": 1698459696.0, "subreddit": "r/ThePPShow", "title": "Ice (cream) &amp; 40%", "text": "<!-- SC_OFF --><div class=\"md\"><p>Preface: I did not write the below. It is well written with applicable examples. I provided the link at the bottom. TLDR: we are witnessing supreme tax avoidance (NOL carry-forwards), to do so requires the shareholders be compensated. Relax. You Won. Cheers.</p>\n\n<p>Section 368(A) of the tax code says that if Acquirer Inc. merges with Target Inc. by acquiring Target’s assets in return for stock in Acquirer, the transaction is not a taxable event. If it were taxable, Target’s shareholders would have a capital gain equal to their paper profit (excess of the value of Acquirer shares received over the tax basis for the Target shares they hand in). Also, the merged company would have to pay corporate tax on the difference between the deal value and the book value (for tax purposes) of Target’s assets. In a tax-free deal both shareholder and corporate gains are deferred indefinitely. Target’s shareholders carry over their tax basis to their new position in Acquirer shares.</p>\n\n<p>What if Acquirer pays with a mix of cash and stock? If the 40% minimum is observed, Target’s shareholders must recognize taxable gain only to the extent that they receive cash. The corporate tax can also be avoided.</p>\n\n<p>That 40% figure is found nowhere in Section 368. It is, rather, a rule of thumb growing out of some ancient Supreme Court decisions interpreting this statute. (To give you an idea how ancient: The original landmark case involved the takeover of some ice (cream) companies.) Trying to find a deeper philosophical purpose behind this part of the tax code, the Supremes read into the law a requirement that the shareholders selling out must retain a significant interest in the surviving entity. In this significance test it does not matter what fraction of the surviving company the sellers end up owning. What matters is what fraction of their payout they take as equity.</p>\n\n<p>The horizontal double dummy does a neat end run around the 40% rule, explains Robert Willens, a tax expert at Lehman Brothers. Instead of buying Target directly, Acquirer creates a dummy holding corporation and merges both itself and Target into that dummy. When the dust settles, the dummy can take Acquirer’s original name. It looks for all the world like a merger of Target into Acquirer.</p>\n\n<p>Devon Energy wants to buy gas producer Mitchell Energy &amp; Development . The $3.1 billion merger deal announced in mid-August contemplated a mix of Devon stock and cash worth $60.40 per Mitchell share, a handsome premium over the pre-deal $45.65 price for Mitchell shares. The deal got into serious trouble when Devon shares fell. At their present price the value of the Devon shares as a portion of the total package has fallen below a crucial 40% threshold. If a merger deal drops below that level, it becomes taxable. Bad news for both the selling shareholders and, potentially, the acquiring corporation.</p>\n\n<p>In this situation, Target shareholders need recognize a capital gain only to the extent that they take cash, not shares. Corporate taxes are also avoided. And the 40% rule doesn’t apply. Why not? Because the deal is done under the aegis of Section 351 of the code, which is entirely separate from Section 368. Section 351 is aimed at this kind of situation: You own the Empire State Building, and you want to incorporate. You transfer the building to Empire Holding Co. and take its shares. It was the intent of Congress not to tax this kind of transaction as a sale.</p>\n\n<p>What’s to stop you from using 351 to merge your real estate company with your brother-in-law’s ice company? Nothing, if the statute is read literally. It says that if properties are transferred to a new corporation, and if immediately afterward the people who used to own the properties are in control of the corporation, there is no taxable sale. That would be true if shareholders of Devon and Mitchell transfer their respective shares to Dummy Devon–between them, after all, these sets of holders end up owning all of Dummy Devon. There is no requirement that Mitchell’s former shareholders have a stake of a particular size.</p>\n\n<p>Does all this fancy footwork cut any ice with the taxman? Evidently it does. Northrop Grumman used a horizontal dummy in its $3.8 billion acquisition of shipbuilder Litton Industries in May. Initially, Northrop wanted to do an all-cash deal. But Unitrin, an insurance company with a 28% stake in Litton, balked and said it wanted the deal to be tax- free. Using a dummy and a mix of cash and stock, Northrop avoided a $1.1 billion tax bill of its own and enabled sellers who took shares to avoid capital gain taxes. “It was a great answer for us,” says Gary McKenzie, vice president of tax at Northrop Grumman.</p>\n\n<p>NiSource, the holding company that owns Northern Indiana Public Service, used a horizontal double dummy in its $6 billion deal to acquire Columbia Energy Group a year ago. That move saved it $1.4 billion in taxes.</p>\n\n<p>We don’t know what canny tax lawyer can claim authorship of the double dummy, but the invention seems to date back at least to the 1970s, when it was common in reorganizations of small privately held companies. Lately it has been dusted off by the dealmakers handling giant corporations. Their clients often want to pay largely in cash, in order to avoid dilution of existing shares.</p>\n\n<p>In a typical big-company merger, shareholders of the target are a mix of tax-exempt investors (like pension funds) that don’t care whether a merger is taxable and taxable ones (like Unitrin) that care a lot. The acquirer can offer shareholders of the target a choice between taking cash and taking stock in the surviving company, without compromising the ability of the ones taking stock to defer taxes.</p>\n\n<p>As cash becomes a bigger component of deal values, merging companies are increasingly in jeopardy of owing fat tax bills. The first nine months of this year saw merger values split 50-50 between cash and stock, whereas cash made up only 37% of deals for the same period last year, says Richard J. Peterson, chief market strategist at Thomson Financial. And if stock prices tank between the time of a deal’s announcement and consummation to below 40% of the deal’s value, huge tax bills can emerge. Says Daniel Donoghue, cohead of mergers and acquisitions at U.S. Bancorp Piper Jaffray, “Nowadays the tax implications in any of these transactions are potentially huge deal killers.”</p>\n\n<p><a href=\"https://www.forbes.com/forbes/2001/1029/112.html?sh=1941be232ebf\">https://www.forbes.com/forbes/2001/1029/112.html?sh=1941be232ebf</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/a75eh3oosuwb1.jpg\"/></div>"},
{"username": "LYouSeeK", "url": "https://www.reddit.com/r/ThePPShow/comments/15fjj5j/rc_ventures_stay_the_course/", "time": 1690912098, "subreddit": "r/ThePPShow", "title": "RC Ventures: Stay the course", "text": "From RC’s letter to the BBBY BoD (3/6/22) - TLDR: this has been the plan all along. Don’t expect fireworks from todays BK hearing. RC doesn’t share his plan for obvious reasons.\n\nI’ll end with I work with NDAs all day everyday, and i can assure you RC does not have an NDA restricting his openness about NOT being involved. He could however (given the past “pump & dump”) have an NDA (more probable a legal recommendation) restricting him from stating he IS involved; due to his activist following.\n\n1. In light of our long-term focus, we are not an investor that demands guidance. In fact, we appreciate that Apple, one of our long-term holdings, **suspended guidance amidst pandemic-related uncertainty and has never given away a detailed strategy for all of its competitors to see. We dislike when a management team spends time accommodating Wall Street**, engaging with television pundits and telegraphing forecasts to the competition. **We believe management's time is best spent focusing on execution that drives a better customer experience and tangible value creation.**\n\n2. **Seek to Monetize the Ultimate Destination for Babies - Another path that can streamline Bed Bath's strategy and unlock value trapped within the Company's underperforming shares is a sale or spin-off of the BABY banner**. Given that BABY is estimated to reach $1.5 billion in sales in Fiscal Year 2023 with a double-digit growth profile and at least 50% digital penetration, we believe it is likely much more valuable than the Company's entire market capitalization today Assuming continued growth and low double-digit margins, we estimate that BABY could be valued at a double-digit earnings multiple on a standalone basis. We believe under the right circumstances, BABY could be valued on a revenue multiple, like other ecommerce-focused retailers, and justify a valuation of several billion dollars. **In the event Bed Bath pursued a full or partial sale of BABY, it could position itself to pay off debt, put cash on the balance sheet and continue reducing its share count, thereby creating significant value for shareholders. Spinning off shares of BABY would be an even more efficient way to transfer value to shareholders. Notably, BABY's high online penetration would likely ease operational hurdles. We assume Bed Bath and BABY could still have a shared services agreement to maintain an omnichannel experience for customers.**\n\n3. **Evaluate a Full Sale to a Well-Capitalized Acquirer - The final path we want to raise for consideration is a full sale of Bed Bath, in its current form, to one of the many well-capitalized financial sponsors with track records in the retail and consumer sectors and the ability to pay a meaningful premium.** The past 10 years have shown that Bed Bath faces a difficult existence in the public market. The market is not giving the Company nearly enough credit for BABY's value. **A sale that can lock in a substantial premium for shareholders and provide Bed Bath the flexibility of the private market could be an ideal outcome for customers, employees and investors. We believe Bed Bath presently satisfies financial sponsors' interest in specialty retailers with recognizable brands, niche assets and sub-banners, and margin expansion opportunities. A private market participant with a long-term vision could unlock meaningful value by running the core business for cash and initiating a public offering for BABY at the optimal time. After stripping out the sizable costs of being a public company and setting a more focused strategy, we suspect Bed Bath's core business - excluding BABY - could generate attractive earnings.**\n\n4. Strengthen Leadership's Alignment with Shareholders - We are supportive of corporate leaders receiving significant compensation when they produce superior shareholder returns. But when it comes to Bed Bath, we contend there need to be improvements to the Company's executive compensation structure and a stronger ownership mentality in the boardroom. We believe these improvements should be made regardless of the Company's strategic direction.\n\nHopefully leadership acts with urgency to implement the aforementioned suggestions. Given that I am the Chairman of GameStop and overseeing a systematic transformation, I am not in a position to join Bed Bath's Board and personally drive the initiatives outlined in this letter. **This does not mean, however, that RC Ventures will not seek to hold the Board and management accountable if necessary.**\n\nSincerely,\nRyan Cohen\nManager\nRC Ventures LLC\n\n*the plan never changed. He told us from the beginning what the ending was but it’s not for us to know how we get there.. In RC We Trust.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "LYouSeeK", "url": "https://www.reddit.com/r/ThePPShow/comments/15bz1ko/david_kastin/", "time": 1690554559, "subreddit": "r/ThePPShow", "title": "David Kastin", "text": "One aspect throughout all the FUD that keeps me holding strong is that David Kastin agreed to receive 43,852 shares (he also receives a salary) as part of his compensation. Now why would someone of David’s pedigree & experience accept shares of a company that was planning to liquidate & the shares become worthless? He wouldn’t. Also his salary is low for someone with his experience; just look at Holly Etlin’s salary. BBBY knows an M&A with change of control and new shares issued of new company will 100% happen. \n\nBBBY also wouldn’t even bother issuing shares to Kastin if they truly knew the shares would become worthless. Also he hasn’t sold any shares…\n\nBuckle up. 🩳 🏴‍☠️ \n\nPS: stop with the lease sale FUD. Physical foot prints are not the future. Where we’re going we won’t need 🧱 🏬. BEYOND.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "LYouSeeK", "url": "https://www.reddit.com/gallery/1529f97", "time": 1689617542, "subreddit": "r/ThePPShow", "title": "Dragon Fly / Volition Capital M&amp;A position", "text": "M&A position working with L Catterton, same firm K&E is using. SHF fuck you pay me", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/cK-QE4bXEdTLrOa3IHlJ0pCaOgaEautDJnNiS9ota1c.jpg\"/></div>"}]