[{"username": "Mamuter", "url": "https://www.reddit.com/r/ThePPShow/comments/17shf0o/rc_tinfoil_from_916_stream/", "time": 1699660222.0, "subreddit": "r/ThePPShow", "title": "RC Tinfoil from 9/16 Stream", "text": "<!-- SC_OFF --><div class=\"md\"><p>I skimmed the live stream titled <a href=\"https://www.youtube.com/watch?v=JlPfl_MbXaQ\">9/16/2023</a> video for all the RC comments posted during the stream.  </p>\n\n<p>That episode started late on 9/15/2023 and went late into the night.  </p>\n\n<p>Around 4:21:50 PP mentions it is almost 1 AM in the morning (Central Time) so roughly from that the stream probably started around 8:30. (9:30 EST)</p>\n\n<p>&#x200B;</p>\n\n<p>The first RC private comment was at <a href=\"https://youtu.be/JlPfl_MbXaQ?t=1333\">22:20</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/appvfwe8vlzb1.png?width=346&amp;format=png&amp;auto=webp&amp;s=ceda78f8c625f4338d48bf1343b48b245213b0bc\">https://preview.redd.it/appvfwe8vlzb1.png?width=346&amp;format=png&amp;auto=webp&amp;s=ceda78f8c625f4338d48bf1343b48b245213b0bc</a></p>\n\n<p>The second post was at <a href=\"https://youtu.be/JlPfl_MbXaQ?t=3632\">1:01:00</a></p>\n\n<p><a href=\"https://preview.redd.it/279s7ojgwlzb1.png?width=279&amp;format=png&amp;auto=webp&amp;s=67339810bea162983c4e8337ee28a4023e471e11\">https://preview.redd.it/279s7ojgwlzb1.png?width=279&amp;format=png&amp;auto=webp&amp;s=67339810bea162983c4e8337ee28a4023e471e11</a></p>\n\n<p>Around 4:21:50 PP mentions it is almost 1 AM (Central Time) so roughly from that the stream probably started around 8:30. (9:30 EST)</p>\n\n<p>The last one was at <a href=\"https://youtu.be/JlPfl_MbXaQ?t=11921\">3:18:41</a> (No Picture)</p>\n\n<p>RC said &quot;PP off the record, I&#39;m not Ryan.  Simply an engaged college. We will all make our appearance soon. &quot;</p>\n\n<p>I hope that helps any tinfoil hunters out there.</p>\n\n<p>That is all of them that I found through a quick skim, let me know if I missed any.</p>\n\n<p>&#x200B;</p>\n\n<p>Hope that helps any tinfoil hunters out there.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/slyi6Do3jJr0bJ0x3-T7vFZEfuMzwXIG7ZpxWgmsmG0.jpg\"/></div>"},
{"username": "Mamuter", "url": "https://i.redd.it/pymskkaqg7sb1.jpg", "time": 1696433821.0, "subreddit": "r/ThePPShow", "title": "Pulte Tweet", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/pymskkaqg7sb1.jpg\"/></div>"},
{"username": "Mamuter", "url": "https://i.redd.it/ir8o6b16gyfb1.jpg", "time": 1691094494.0, "subreddit": "r/ThePPShow", "title": "Check out the price action after doc 1728 was posted on the pp sub… Shorts freaking out because now we have proof", "text": "<!-- SC_OFF --><div class=\"md\"><p>Doc 1728 was posted on the PP sub roughly 2 hours before market close. The doc was scanned and not easily machine readable so algos probably had trouble responding to it. But once posted shorts appear to be panic buying. First 🩳 out might have a chance of surviving. ☠️</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ir8o6b16gyfb1.jpg\"/></div>"},
{"username": "Mamuter", "url": "https://www.reddit.com/r/ThePPShow/comments/13gbuvi/mmtlp_story_time/", "time": 1683967064.0, "subreddit": "r/ThePPShow", "title": "MMTLP Story Time", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m Holding the private stock formerly known as MMTLP that can no longer be purchased and currently HOLDING BBBYQ and very bullish. </p>\n\n<p>TLDR: MMTLP has approx 65000 holders and that small group made so much noise (when FINRA unethically U3 halted their stock) that FINRA fears doing anything with BBBYQ because they know how many of us hold the stock and know they can’t fit anymore under the rug. </p>\n\n<p>It’s important to learn from past events. I will try to briefly summarize the MMTLP story to get you up to speed. I know money signs previously mentioned it, but I wanted to share it again to emphasize what we can learn from it. This is all from memory so forgive me if some minor details are off. </p>\n\n<p>Torchlight, an oil company, owned shale in the orogrande basin was under water in 2020 (price of oil was low) and being shorted to death. Meta materials, a Canadian company was looking to get listed on the nasdaq. They merged, and meta materials took over the ticker relisted as MMAT and a preferred dividend was given to torchlight holders that was NOT supposed to be tradable and was a placeholder for a future payment of when the oil rights were sold and money from the sale was distributed to holders. I fomoed in because you weren’t able to get the preferred stock any other way. </p>\n\n<p>About 4 months later after the merge and the preferred share distributed. SHF allegedly got the preferred share illegally trading on the OTC using fraudulent data about the company under the ticker MMTLP. I bought 1000 more shares as the price rose to $1 not knowing what was going on (because the preferred dividend wasn’t supposed to be tradable).  </p>\n\n<p>The stock traded and fluctuated around a 1.50 or so for a long time. The company decided to go private without a buyer (very uncommon because there was no fixed price, just private shares as the dividend, shorts wouldn’t be able to cover). As the date drew near the price surged to about $12 but the last few days the price was shorted down to $2.90. </p>\n\n<p>In the weeks leading up to the date (December 12th, 2022) it was going private. Many holders called their brokers and asked if they were “short” when would they have close their short positions. Various brokers told them that by Dec 9 or 12 or they would be forced to close. Dec 8 was supposed to be the last day to buy to get the private share dividend. </p>\n\n<p>On the morning on December 9th right before the OTC opened, FINRA declared a U3 halt (very rare for USA stocks) and halted trading indefinitely. Trapping shorts in their positions, denying Holders from a squeeze and leaving way too many holders to fit in the seats on the bus of the private company. </p>\n\n<p>FINRA thought they could squash the squeeze. But the events that unfolded showed them how difficult it would be to sweep this under the rug. There were daily space calls on Twitter with thousands of listeners gathering to talk about FINRA screwed MMTLP holders. FINRA had to shut down because they were getting so many complaints and calls they were overwhelmed. Currently the MMTLP holders were making so much noise that many members of congress are asking FINRA questions and demanding the blue sheets for all the MMTLP trades. All coming from an estimated 65,000 holders of MMTLP. </p>\n\n<p>FINRA knows they can’t do the same thing to BBBYQ that they did to MMTLP. We have way more holders than that tiny stock. FINRA knew that if they let MMTLP rip, then it would destroy the stock market as we know it. Imagine what BBBYQ will do when it rips. They NEED you to sell, they FEAR you. </p>\n\n<p>Keep holding, they can’t halt this stock. Too many people are watching. 👀😛👀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Mamuter", "url": "https://www.reddit.com/r/ThePPShow/comments/13betwh/some_numbers_from_doc_219/", "time": 1683523007.0, "subreddit": "r/ThePPShow", "title": "Some Numbers From Doc 219", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure someone has done this and posted it.  But I downloaded the doc and converted it to Excel and here are a few numbers.</p>\n\n<p>(CEDE &amp; CO Removed)</p>\n\n<p>Total DRSed shares: 4,971,109</p>\n\n<p>Total Number of DRS Holders: 2,479</p>\n\n<p>Average Held: 2005.29</p>\n\n<p>&#x200B;</p>\n\n<p>Top Three Holder Positions:</p>\n\n<p>450,000</p>\n\n<p>121,058</p>\n\n<p>107,850</p>\n\n<p>&#x200B;</p>\n\n<p>Number of Single Stock Holders: 149</p>\n\n<p>&#x200B;</p>\n\n<p>Number of X Holders: 450</p>\n\n<p>Number of XX Holders: 632</p>\n\n<p>Number of XXX Holders: 753</p>\n\n<p>Number of X,XXX Holders: 547</p>\n\n<p>Number of XX,XXX Holders: 94</p>\n\n<p>Number of XXX,XXX Hodlers: 3</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Total Common Stock Shares Reported (Including CEDE &amp; CO) in Doc 219: </p>\n\n<p><strong>781,375,517</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Let me know if any other numbers would be of interest.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]