[{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/17qkpjs/it_would_be_nice_if_there_was_some_more_drs/", "time": 1699447029.0, "subreddit": "r/ThePPShow", "title": "It would be nice if there was some more drs education on here.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I feel this sub is leaning more towards the tinfoil side of things lately. When this sub to me has always been the most rounded of all subs. Always had just a little bit of everything. But IMHO, it&#39;s severely lacking in DIRECT REGISTRATION SYSTEM education. I feel there needs to be more education on the purpose and abilities of the DIRECT REGISTRATION SYSTEM. </p>\n\n<p>Like a nice visual chart of how a company goes public. And how the DIRECT REGISTRATION SYSTEM is apart of pretty much every corporate action and is first in line for all of them.  How dividends are handled. How stock splits are handled. How every corporate action is handled. Terms of service. A literal name on each share in the DIRECT REGISTRATION SYSTEM.</p>\n\n<p>And to put it simply. How the shares have already been bought. If the throries of naked short selling are true. Liiterally no more shares need to be bought In the dtcc to prove they&#39;re printing more. Because that doesn&#39;t work. What may work. Is taking those shares out of the dtcc and putting a name and a number on those shares. If the theories are 100% short. The. Only 50.01% of shares need to be drs&#39;d to over drs. If it&#39;s 300% short. Only 33.01% of shares need to be drs&#39;d to be Over Drsd&#39;d</p>\n\n<p>Don&#39;t just DRS it...\nOVER DRS IT!</p>\n\n<p>ABSOLUTELY NOT FINANCIAL ADVICE </p>\n\n<p>But I do recommend being as educated as you possibly can be, on what the DIRECT REGISTRATION SYSTEM actually is </p>\n\n<p>Stop calling it Drs. It under plays what it is. It&#39;s the DIRECT REGISTRATION SYSTEM. I mean just look at the name. I think it pretty kuche xplains what it&#39;s capable of. Naked shorting? Prove it .</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/17ja56a/drs_explained_to_all_the_little_boys_and_girls/", "time": 1698606701.0, "subreddit": "r/ThePPShow", "title": "DRS explained to all the little boys and girls who like to play with dolls", "text": "<!-- SC_OFF --><div class=\"md\"><p>Imagine you have a special dollhouse, and you have some dolls to play with.</p>\n\n<p>DRS (Direct Registration System):\nThink of DRS like a magical way to keep your dolls safe and sound inside your dollhouse. When you use DRS, each doll has its own special spot in the dollhouse. It&#39;s like giving each doll its own room where they can stay and be safe. DRS makes sure you know exactly which doll belongs where, just like a list of who lives in your dollhouse.</p>\n\n<p>DTCC (Depository Trust &amp; Clearing Corporation):\nNow, think of DTCC as a friendly helper who watches over all the dollhouses in the neighborhood. They have a big list of who has which doll and where. So if you ever want to send one of your dolls to a friend&#39;s dollhouse, DTCC helps make sure it gets there safely. It&#39;s like DTCC is the postman who delivers your dolls to your friends&#39; houses while keeping a list of what&#39;s going where.</p>\n\n<p>Naked Shorting:</p>\n\n<p>Imagine if someone borrowed your doll, made a copy of it, and said they would return it. But instead, they kept making more copies and never gave you back your original doll. This is like what happens in the stock market when people sell shares they don&#39;t actually have (naked shorting). They promise to return them but don&#39;t always do so.</p>\n\n<p>Book DRS:</p>\n\n<p>With BOOK DRS, you have a special list of who owns each doll, just like in your dollhouse. Every doll has its own spot, and everyone knows who it belongs to. This is great because it prevents people from borrowing your dolls without asking.</p>\n\n<p>Shares in DTCC:</p>\n\n<p>Now, remember the friendly helper (DTCC) who watches over all the dollhouses? Even with 100% DRS, some people might forget to update DTCC when they move their dolls to new dollhouses. So, DTCC still has a list of dolls that might not match exactly with your dollhouse list.</p>\n\n<p>So, even with 100% DRS, if people keep copying and selling dolls they don&#39;t have (naked shorting), it can create confusion. DTCC might think there are more or less dolls in the neighborhood than there really are. This can be a problem because it&#39;s like having more dolls running around than there should be, and it can make things messy.</p>\n\n<p>In the stock market, this situation can lead to uncertainty and challenges because the number of shares in the system might not match what&#39;s really available. It&#39;s important to keep things organized and make sure that every doll (share) has a rightful owner.</p>\n\n<p>So, DRS helps you keep track of your dolls in your dollhouse, and DTCC helps make sure your dolls can visit other dollhouses safely. They work together to keep your dolls happy and organized!</p>\n\n<p>This one is for all the homies who still play with dolls</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/17j8m7c/if_the_us_stock_market_was_an_airplane/", "time": 1698602515.0, "subreddit": "r/ThePPShow", "title": "If the US Stock Market was an airplane", "text": "<!-- SC_OFF --><div class=\"md\"><p>The US Stock Market allows two types of holdings for trading securities listed on the NASDAQ and NYSE. When a company goes public, they sell seats to their plane, (shares of their company ). These can be held in two distinct places. the first place is at the company&#39;s direct registrar, aka the direct registration system aka DRS, which is priority seating on the airplane. You will always get on the plane first, have a seat and never over booked and asked to board the next flight or given a refund incase there&#39;s no further flights allowed after all the seats are filled. . Or you can be DTCC. And if the airline sold to many seats. You have to wait until DRS gets their priority seating. And then hope you make it onto the plane. Maybe just maybe the airline will have many planes to allow all travelers to fly. Or maybe there is only one plane and it&#39;s first come first serve. Idk bout you but I&#39;ve been asked to take a later flight more than once, as I&#39;m usually seared last on most airlines for some reason. I have never seen a priority seat be asked to delay their flight. Do you trust that the airlines will have multiple planes and all the seats needed? Or do you wanna secure your seat on the companies airline and be guaranteed wherever that company goes. You absolutely get to go also. Whether we crashab first crash or break through the stratosphere is anyone&#39;s guess. All I know is I wanna be on that plane with no questions asked. Hbu?</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/17j40uq/drs_explained_to_those_with_the_mental_capacity/", "time": 1698589524.0, "subreddit": "r/ThePPShow", "title": "Drs explained to those with the mental capacity of a 5 year old", "text": "<!-- SC_OFF --><div class=\"md\"><p>Direct Registration System (DRS) is like having your own special box for your toys. You can see and touch your toys anytime you want, and they are always there for you.</p>\n\n<p>The Depository Trust &amp; Clearing Corporation (DTCC) is like a big toy store where lots of people keep their toys. Sometimes, you need to ask the store to give you the toys you want to play with, and they may not have them in the store all the time.</p>\n\n<p>So, DRS is like having your toys right with you, while DTCC is like borrowing toys from a big store. For some people, having their toys close is better, but it depends on what you like and what makes you feel safe.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/17ip7l4/is_the_direct_registration_system_superior_to_the/", "time": 1698533246.0, "subreddit": "r/ThePPShow", "title": "Is the direct registration system superior to the dtcc, according to chat gpt", "text": "<!-- SC_OFF --><div class=\"md\"><p>User\nIn bulletin points. Why is drs superior to dtcc </p>\n\n<p>ChatGPT\nDirect Registration System (DRS) and the Depository Trust &amp; Clearing Corporation (DTCC) serve different functions in the financial industry, and whether one is superior to the other depends on specific use cases and preferences. Here are some potential advantages of DRS over DTCC in bullet points:</p>\n\n<p>Direct Ownership:\nDRS allows investors to have direct ownership of their securities, which can provide a stronger sense of ownership and control.</p>\n\n<p>Reduced Counterparty Risk:\nDRS reduces counterparty risk since securities are held directly with the issuer, minimizing the risk associated with intermediaries.</p>\n\n<p>Simplified Transfers:\nTransferring securities in DRS is typically simpler and faster because it doesn&#39;t involve the complexities of the DTCC&#39;s centralized clearing and settlement process.\nLower Costs:</p>\n\n<p>DRS can be cost-effective as it may eliminate certain fees associated with DTCC&#39;s services, such as custodial and clearing fees.\nTransparent Ownership:</p>\n\n<p>DRS offers a high level of transparency regarding ownership, with investors able to view their holdings directly with the issuer&#39;s transfer agent.\nReduced Short Selling Availability:</p>\n\n<p>DRS shares may be less available for short selling, potentially making it more challenging and expensive for short sellers to borrow shares.\nIt&#39;s important to note that DRS is not inherently superior to DTCC; it depends on individual preferences, the type of securities being held, and specific investment strategies. DTCC, as a centralized clearinghouse, offers services that are critical for the smooth functioning of financial markets, and it provides efficient clearing, settlement, and risk management for a wide range of securities. The choice between DRS and DTCC depends on the needs and goals of investors and market participants.</p>\n\n<p>Proving naked shorting may be easier with the Direct Registration System (DRS) because DRS offers more transparency and direct ownership of shares, making it simpler to track the number of legitimate shares issued and compare it to the total outstanding shares. This can provide more evidence of any discrepancies and potential instances of naked short selling. However, it&#39;s essential to work with legal authorities, regulators, or experts to investigate and provide concrete proof of such activities.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/17idfvt/its_a_system_wide_disease_there_is_only_one_cure/", "time": 1698498550.0, "subreddit": "r/ThePPShow", "title": "It's a system wide disease... There is only one cure", "text": "<!-- SC_OFF --><div class=\"md\"><p>Tldr;\nIt&#39;s a system wide disease and there is only one cure.... That cure is DRS. And the best thing is. If the market isn&#39;t disease, then drs doesn&#39;t matter, it&#39;s only a cure and not harmful in anyway forseeable . It only does anything if the ticker is diseased. </p>\n\n<p>The US stock market is riddled with disease.... how or why it happened i will not speculate on.</p>\n\n<p>There is a ton of tickers I see on these forums claiming they believe they are massively short, sometimes even over 100% short. </p>\n\n<p>Some tickers even had more volume in 10 days compared to 30 years combined.</p>\n\n<p>Some tickers have court documents showing 225% short </p>\n\n<p>Some tickers are 92% insider ownership with higher than 8% short short intrest. </p>\n\n<p>Some tickers have a 10 mil share outstanding and 20 mil mcap.</p>\n\n<p>Some tickers are being shorted while having no debt. </p>\n\n<p>Every security that claims naked shorting, is experiencing disgusting price depreciation. </p>\n\n<p>Some tickers were on regsho for months at a time all the way up until bankruptcy. </p>\n\n<p>Every active ticker is drs&#39;able. </p>\n\n<p>The dtcc is where everyone claims the fraud occurs, and you have the ability to withdraw from the dtcc. </p>\n\n<p>Drs is the cure for the markets disease. </p>\n\n<p>Paragraphs</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/17i3j1c/the_fox_is_guarding_the_hen_house/", "time": 1698458568.0, "subreddit": "r/ThePPShow", "title": "The fox is guarding the hen house", "text": "<!-- SC_OFF --><div class=\"md\"><p>You do realize the fox is watching the hen house. You are trying to prove theories of naked shorting in a totally non transparent market ran by the same people you believe shorted and exploited it. All the while. There&#39;s this thing called the Direct Registration System. Which is literally so transparent. It Dox&#39;d everyone who had drs&#39;d before the Bbby court hearing. Now that is scary. Don&#39;t get me wrong. Not cool imo. But that&#39;s how truthful drs is. That&#39;s how transparent it is.  Its share verification. It&#39;s a name on the shares. It&#39;s a count of the shares. It&#39;s the most friendly terms of services and the most protection and best benefits given as a share holder. You become priority. Above the dtcc.  Yes, there are fees. But if you traded stocks before Robinhood. You know fees were literally a thing. Every trade. Fees. And heavy ones. So yeah. If you truly believe in naked shorting. Why do you have any shares in the dtcc? Especially if the transfer agent is computershare. Who offers limit sales much higher than any broker I have witnessed. Idk ask yourself these questions. Ask yourself all the questions. Really think about it. Do some soul searching. It&#39;s been 2+ years. And the fox is still guarding the hen house and the prices have only depreciated disgustingly.  Why do I trust the fox. Why? Seriously. If shares that are drs&#39;d are litterally not able to be duplicated/shorts. Then wouldn&#39;t drs be a literal cause for closing short positions? Like hey, I think this thing is so short it&#39;s gunna run to the stratosphere. But no. I won&#39;t drs my shit. Why? Because fees. Or because website is down. I been holding for 2 years. But a few days without access to the web portal. Omgosh. And how bout if it really is 100%+ short. Literally it could take only one week, maybe even one day tbh.  if enough people just were like hmm.. why do I trust the fox?</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/17hludr/all_you_need_to_do_is_look_at_how_drs_comments/", "time": 1698407660.0, "subreddit": "r/ThePPShow", "title": "All you need to do is look at how drs comments and post get downvoted....", "text": "<!-- SC_OFF --><div class=\"md\"><p>All you need to do is look at how drs comments and post get downvoted to know that drs is the wave and shills/shorts absolutely fear it. Anytime I see a Drs post. I see a crazy amount of spam posts, downvoting and yeah. Tons of reasons why not to split people and divide. Bruh. Being in the dtcc while drs exist is the division. Wtf u doing. U wanna prove your theories or not . Dyor,  make your own decisions... nFA</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MangoMuch807", "url": "https://www.reddit.com/r/ThePPShow/comments/16uubfv/is_anyone_using_moomoo_for_buying_rn_question/", "time": 1695941216.0, "subreddit": "r/ThePPShow", "title": "Is anyone using moomoo for buying rn? Question", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I decided to get on moomoo yesterday. Account is fully ready to add money... I&#39;m about to add $100-150 and add ~1000-2000 shares tomorrow as a ef it why not... only thing is I&#39;ll be using margin due funds not landing in time... question is. Will moomoo allow you to buy Bbbyq on margin?</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]