[{"username": "Massive_Nectarine438", "url": "https://www.reddit.com/r/ThePPShow/comments/16ofstz/stopping_the_game_true_decentralization_realized/", "time": 1695302489.0, "subreddit": "r/ThePPShow", "title": "Stopping the game - True Decentralization realized through GameStop", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is a repost of my thesis from superstonk, but I wanted to get eyes from this community on it too since a lot of people in BBBY are also involved in GME and the macro picture encompasses everything.  With BBBY, We&#39;re betting that RC is involved somehow, and I believe RC is well aware of the macro picture.  I personally believe he has plans for BBBY (or some part of it) because in a currency reset event (my thesis), the USD value doesn&#39;t matter.  The stockholders - the voting power - is all that matters, and BBBY has a ton of household voting power from the common stock holders.</p>\n\n<p>------------------------</p>\n\n<p>Sit back, relax, and enjoy the show. GameStop has changed (is changing) the game for everybody in the best possible way. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/uvuvmfnrxlpb1.png?width=485&amp;format=png&amp;auto=webp&amp;s=6bdf31f5e1205b2fcb5f56699da1efd57c96932c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/uvuvmfnrxlpb1.png?width=485&amp;format=png&amp;auto=webp&amp;s=6bdf31f5e1205b2fcb5f56699da1efd57c96932c\"></a></p>\n\n<p>&#x200B;</p>\n\n<p>In my previous pinned post, I went in depth describing the socioeconomic system that we operate in without knowing I was describing the socioeconomic system we operate in. I also mentioned what I thought was the end game based off my research. After almost 5 months of continuous research, my ultimate thesis is not far off. I believe we are in a currency reset event, and I believe GameStop is the key to humanity winning. The key to everything is understanding the monetary system and its socioeconomic impact. <strong>Money is monetized debt. The more debt a system has, the more inflation it has.</strong></p>\n\n<p>------------------------</p>\n\n<p><strong>Part 1: Capitalism</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tirr6y5xxlpb1.png?width=496&amp;format=png&amp;auto=webp&amp;s=f841336ae16e152b6632fa1b812c4e945c2de42e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/tirr6y5xxlpb1.png?width=496&amp;format=png&amp;auto=webp&amp;s=f841336ae16e152b6632fa1b812c4e945c2de42e\"></a></p>\n\n<p>In short, capitalism allows for private ownership. It allows the true free market to determine the value of labor and goods without outside interference. Capitalism is excellent because it allows private ownership for people who, under previous systems, would not be granted such privileges. Businesses require workers. Workers require items (houses, cars, food). Business owners cannot survive without individual laborers working for money, and individual laborers cannot survive without the products produced. You either have to build the house yourself, you have to pay for the skilled laborers to build your house, or you have to force the laborer to build your house for free.</p>\n\n<p>Sound familiar? It should.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/flx48bb1ylpb1.png?width=745&amp;format=png&amp;auto=webp&amp;s=f51c685f07e9c7d7f275121773f0a3e3ea59ae36\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/flx48bb1ylpb1.png?width=745&amp;format=png&amp;auto=webp&amp;s=f51c685f07e9c7d7f275121773f0a3e3ea59ae36\"></a></p>\n\n<p>------------------------</p>\n\n<p><strong>Part 2: The Monetary System</strong></p>\n\n<p>Inflation in itself is not new - history is ripe with instances of inflation rearing its ugly head to the point of kings documented as early as 4000 years ago implementing <a href=\"https://www.lynalden.com/debt-jubilee/\">debt jubilees</a>. All debt is wiped clean and you as a farmer got to keep your farm.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/de0925a9ylpb1.png?width=457&amp;format=png&amp;auto=webp&amp;s=2e54273e80f7436d9141c1ac4bf341b4aa2a6cec\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/de0925a9ylpb1.png?width=457&amp;format=png&amp;auto=webp&amp;s=2e54273e80f7436d9141c1ac4bf341b4aa2a6cec\"></a></p>\n\n<p>Earlier economies ran by asset-backed monetary systems and ones downfall is well documented in the <a href=\"https://medium.com/insider-economy/hyperinflation-in-the-roman-empire-and-its-influence-on-romes-collapse-446486dcda63#:%7E:text=By%20the%20time%20of%20Phillip,prices%20skyrocketed%20over%201000%25!\">hyperinflation of the Roman Denarius</a>. When the Denarius hyperinflated, control of the system was lost and <strong>the empire collapsed.</strong> In 1694 <a href=\"https://www.bankofengland.co.uk/about/history\">The Bank of England</a> created the first unit of currency in the debt based monetary system, and <a href=\"https://www.frbsf.org/education/teacher-resources/what-is-the-fed/history\">in 1913 the United States was blessed with their central bank - the Federal Reserve.</a> A Debt based monetary system by definition is centrally controlled, because the first dollar ever created came from the originating bank...the central bank. The ultimate issue? <strong>The debt based monetary system requires constant growth. It cannot survive without constant growth.</strong> more on this later. Unfortunately for the world, in 1944 the world gained <a href=\"https://www.investopedia.com/terms/b/brettonwoodsagreement.asp\">the Bretton Woods Agreement</a>, which effectively made the Federal Reserve the central bank of the western banking system - <strong>but the debt based monetary system does not require the money to be backed by assets. The debt is the asset.</strong> </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5lmnvicgylpb1.png?width=530&amp;format=png&amp;auto=webp&amp;s=c8906753eb862f2ed37fbcc7210ca50a16bb3d22\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5lmnvicgylpb1.png?width=530&amp;format=png&amp;auto=webp&amp;s=c8906753eb862f2ed37fbcc7210ca50a16bb3d22\"></a></p>\n\n<p>This system allowing private ownership - capitalism - has been hijacked by the &quot;elites&quot; - we can refer to them as Wall Street nowadays - for over 300 years through this currency system. As more money enters the system, more debt enters the system and with more debt comes inflation. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/h3wg7emnylpb1.png?width=745&amp;format=png&amp;auto=webp&amp;s=6b947c8dd16d4847b77f7e43f0adfd1b17298e2c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/h3wg7emnylpb1.png?width=745&amp;format=png&amp;auto=webp&amp;s=6b947c8dd16d4847b77f7e43f0adfd1b17298e2c\"></a></p>\n\n<p>------------------------</p>\n\n<p><strong>Part 3: Socioeconomic impact</strong></p>\n\n<p>Are you noticing a trend here? The problem is not capitalism in and of itself - the problem is the intentional centralization of capitalism by the debt based monetary system. There is clearly enough food and water for everybody on earth, yet <a href=\"https://www.un.org/en/chronicle/article/losing-25000-hunger-every-day\">25,000 people die of starvation every day.</a> There is more than enough land for everybody on earth to have a house, <a href=\"https://make-the-shift.org/homelessnessaction/\">yet globally 150 million people are homeless.</a> The scarcity lies in the money supply itself - not the stuff we eat, drink, live in. There is no inherent value in the money itself. The inequality comes from the money supply. How can a system that&#39;s centrally controlled also be &quot;fair and free&quot;? By definition, it can&#39;t. Commerce is centrally controlled through the financial system.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/35ckpl1uylpb1.png?width=449&amp;format=png&amp;auto=webp&amp;s=79232189cc8e4765551e5c81563636bef4082796\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/35ckpl1uylpb1.png?width=449&amp;format=png&amp;auto=webp&amp;s=79232189cc8e4765551e5c81563636bef4082796\"></a></p>\n\n<p>The centrally controlled system will always come with inherent bias - in this case, bias towards multinational corporations. Or bias towards corporations in general at the expense of the workers and consumers.  <a href=\"https://philoma.org/wp-content/uploads/docs/2009/09_10_24_-_Interview_-_Yes_-_B._Lietaer.pdf\">How many times have you walked past a homeless person sleeping on the sidewalk, or intentionally avoided eye contact with a person on the side of the road begging for money? You want to help, but you can&#39;t.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/uk9zijz1zlpb1.png?width=764&amp;format=png&amp;auto=webp&amp;s=2399448cb34e0ed152fdb814ab9b25192addd450\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/uk9zijz1zlpb1.png?width=764&amp;format=png&amp;auto=webp&amp;s=2399448cb34e0ed152fdb814ab9b25192addd450\"></a></p>\n\n<p>------------------------</p>\n\n<p><strong>Part 4: The Reckoning</strong></p>\n\n<p>In part 2 I described the debt based monetary system in great detail. I explained how inflation comes into being - through debt creation. The debt based monetary system continuing ad infinitum is a mathematical impossibility. It&#39;s impossible for debt to continually be pumped into the system and inflation not rear its ugly head, because inflation comes from money printing and money is printed from debt. How can a system attempt infinite growth in a finite world? Unfortunately, this is where our ever-increasing taxes come in - this is where government waste comes in. This is where wealth inequality comes in. This is where the ever predictable recessions/depressions come in. This is where wars come in and the introduction of new countries to the western banking system - except the &quot;assets&quot; are natural resources, labor, that can be exploited to maximize profit. A strong nation comes into the picture through greed and powerlust, has its currency devalued over the course of ~100 years, and a new currency takes root. <strong>The system never loses control.</strong></p>\n\n<p>This is also why we see 50/100 year business cycles with new monetary system changes. Everything in the system is debt. The money is debt - stocks are debt, the bond market is debt. Auto loans are debt, mortgages are debt. Insurance policies are debt. <strong>Everything. Is. Debt.</strong> Just as 4000 years ago systems became unstable every -50- years because too much debt had built up in the system, the same phenomenon still occurs. The problem? Unless the western banking system goes to war with a nuclear power, <strong>the debt based monetary system cannot expand.</strong> Inflation is eating everyone who lives under a western central bank alive, which means we have too much debt in the system and the system itself has become unstable, which forces us to take out more debt to survive <strong>which prints off more money for the already unstable system</strong> - <strong>the system is imploding.</strong></p>\n\n<p>We know. They know. We know they know. They don&#39;t know we know. <strong>The jig is up.</strong> Everything is controlled by the central banks and implemented via markets through the debt based monetary system. The debt based monetary system is in its death throes, and the social construct of <strong>power</strong> is in jeopardy.</p>\n\n<p>------------------------</p>\n\n<p><strong>Part 5:</strong> <strong>The Power Struggle</strong></p>\n\n<p><em>Team Decentralization: GameStop and the crypto bros (bras??)</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0uu0wbbfzlpb1.png?width=529&amp;format=png&amp;auto=webp&amp;s=2b318e8f1f99ca2c035fa6c6fd27e744641d6a04\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/0uu0wbbfzlpb1.png?width=529&amp;format=png&amp;auto=webp&amp;s=2b318e8f1f99ca2c035fa6c6fd27e744641d6a04\"></a></p>\n\n<p>Like gold, but better. Crypto. Loopring, Immutable X, GameStops NFT Marketplace. Everything GameStop is involved with focuses on extreme decentralization. The same $420.69 you send someone from Loopring that costs .5 cents per transaction costs you a 3% transaction fee through Mastercard. If the store doesnt charge you the 3%, Mastercard still charges the business the 3%. Someone has to pay it. The system requires it. <strong>Everything a bank does, crypto can do as efficient or better at a lower cost.</strong></p>\n\n<p>The same loans we nowadays rely on banks to create can be regulated via smart contracts funded by everybody participating. We would have multiple (crypto)currencies all connected by globally accessible liquidity pools for instant exchange of one currency to another if need be. We have freedom away from inflation, away from control. <a href=\"https://uspto.report/patent/app/20190251627\">The technology now exists for us to wrestle away power from our oppressors.</a></p>\n\n<p><em>Team Centralization: Federal Reserve/Team CBDC</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/h0xcedojzlpb1.png?width=863&amp;format=png&amp;auto=webp&amp;s=3a1bf6f55113bf1f193d7e2bd09e9b58865bdc2b\">  Bank of International Settlements GM Augustin Carstens</a></p>\n\n<p>Centrally controlled currency. (Really, again??) <a href=\"https://www.federalreserve.gov/central-bank-digital-currency.htm\">Unfortunately for humanity, we&#39;re in this same shithole again.</a> We have to answer to our masters - <a href=\"https://www.nytimes.com/2022/02/22/world/americas/canada-protest-finances.html\">if we talk back they lock down our funds and we can&#39;t buy food.</a> Everything bad that has ever been brought to light by centralization can (and if it can, you know it will) be amplified to the extreme by the central bank. Hell, just look at Citadels Balance sheet. Look at the DTCC/NSCC. Look at the obligation warehouse. How many quadrillions of dollars of FTDs are sitting in the obligation warehouse? <strong>The centralization of anything creates greed and powerlust, and the centralization of the money supply centralizes every aspect of the economy because every aspect of the economy trades in the centralized currency.</strong> </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/n4q90fcrzlpb1.png?width=572&amp;format=png&amp;auto=webp&amp;s=8f0dd99a375d9bae65f57ff19d42f0802b5e5b50\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/n4q90fcrzlpb1.png?width=572&amp;format=png&amp;auto=webp&amp;s=8f0dd99a375d9bae65f57ff19d42f0802b5e5b50\"></a></p>\n\n<p>Don&#39;t get me wrong - profit is not inherently bad. Profit is a bedrock of capitalism. If the worker was not paid a profit, he would not have built your house. Thanks to capitalism - which I outlined in part 1 - we as humanity were able to wrestle the privilege of owning property away from our masters. Now thanks to GameStop we as humanity are wrestling the privilege of commerce away from a new set of masters. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/q4kcdl3vzlpb1.png?width=745&amp;format=png&amp;auto=webp&amp;s=6f00e8c8d2b05213b9125f28533d50644418a307\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/q4kcdl3vzlpb1.png?width=745&amp;format=png&amp;auto=webp&amp;s=6f00e8c8d2b05213b9125f28533d50644418a307\"></a></p>\n\n<p>------------------------</p>\n\n<p><strong>Part 6: The Ol&#39; Razzle Dazzle</strong></p>\n\n<p>As I outlined in Part 2, the debt based monetary system requires constant debt to be pumped out into the system to survive. This shows up in the form of inflation, but it also can (and does) show up in the form of obligations on banks balance sheets. Things would get really awkward if there was a company that the <strong>system</strong> was trying to bankrupt, but it actually went debt free.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/vta9o17zzlpb1.png?width=971&amp;format=png&amp;auto=webp&amp;s=4764c38506a9001e3a585576e2e435908ae182a7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/vta9o17zzlpb1.png?width=971&amp;format=png&amp;auto=webp&amp;s=4764c38506a9001e3a585576e2e435908ae182a7\"></a></p>\n\n<p>Now that company has all the time in the world to wait out the <strong>already impending instability in the system</strong>, while it has streamlined its business model and trimmed the fat to an <a href=\"https://investor.gamestop.com/news-releases/news-release-details/gamestop-discloses-second-quarter-2023-results\">almost profitable quarter.</a> GameStop can survive **checks notes** over 100 years at the current cash burn rate. The average debt cycle lasts 50 years and we&#39;re at the end of a major debt cycle now. Do the math - who is gonna blink first?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/at39h6770mpb1.png?width=828&amp;format=png&amp;auto=webp&amp;s=e99baf8c701a786532546dd1a4ed0584997f1ac5\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/at39h6770mpb1.png?width=828&amp;format=png&amp;auto=webp&amp;s=e99baf8c701a786532546dd1a4ed0584997f1ac5\"></a></p>\n\n<p>What happens when the last bank standing goes bankrupt?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ekb3waqf0mpb1.png?width=619&amp;format=png&amp;auto=webp&amp;s=e6d1dd1e40b6664881a1177a8f749e9dbce87ee5\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ekb3waqf0mpb1.png?width=619&amp;format=png&amp;auto=webp&amp;s=e6d1dd1e40b6664881a1177a8f749e9dbce87ee5\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/pYcuPHWbOllEzR248JQrSE1aGwtuEHifIs6W2YjTCoo.jpg\"/></div>"}]