[{"username": "mastermindchilly", "url": "https://www.reddit.com/r/ThePPShow/comments/147o8ke/an_webapplication_engineers_take_on_what_is_going/", "time": 1686576707.0, "subreddit": "r/ThePPShow", "title": "An web-application engineer's take on what is going on with the website", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a senior+ frontend engineer with expertise in frontend (what your see through your browser) and backend (the applications that live on servers) applications. I also have experience with footprinting websites for, uh, &quot;security&quot; purposes (grey hat hacking).</p>\n\n<p>I&#39;ve seen a lot of confusion about the current status of the website. I&#39;d like to paint a picture of what is actually happening and what I believe are the causes.</p>\n\n<h2>1. The illegitimate domain - bedbathandbeyond.website</h2>\n\n<p>I&#39;ve seen several posts about a new domain, bedbathandbeyond.website, and updates to this domain being an indicator of activity. This website is not affiliated with BBBY.</p>\n\n<ul>\n<li>The website is all articles, and with no product pages. This is a common tactic for boosting search algorithms to increase traffic to some of these products.</li>\n<li>The website uses a different domain registrar than bedbathandbeyond.com and buybuybaby.com.</li>\n<li>The SSL cert issuer is different than other BBBY websites</li>\n<li>The .website domain ending (TLD) is very unusual for an internationally known brand.</li>\n<li>The admin user&#39;s username is &quot;vapedeal&quot; (<a href=\"https://bedbathandbeyond.website/wp-json/wp/v2/users\">source</a>) and there is only one user account for the whole site.</li>\n<li>This website&#39;s content was created in a window of March 20-24 (<a href=\"https://bedbathandbeyond.website/wp-json/wp/v2/posts?order=asc&amp;per_page=1\">first post</a>, <a href=\"https://bedbathandbeyond.website/wp-json/wp/v2/posts?order=desc&amp;per_page=1\">last post</a>), 2023, and hasn&#39;t been updated since.</li>\n</ul>\n\n<p>The only domains that we should be paying attention to are:</p>\n\n<ul>\n<li>bedbathandbeyond.com</li>\n<li>buybuybaby.com</li>\n<li>beyond.com</li>\n</ul>\n\n<p>To be frank, whoever is running this website is either being smart about this or lucked into a good position where a ton of backlinks are being formed to this content via misinformation, which will have a positive effect for whatever they are trying to boost. Given their username, I wouldn&#39;t be surprised vape products eventually get introduced on the site to boost the whatever vape site they are shilling.</p>\n\n<h2>2. bedbathandbeyond.com is broken</h2>\n\n<p>When trying to view a product detail page, users are displayed the &quot;Oops! We&#39;ve done some tidying&quot; error message. Ignoring the poor copy-writing, this is happening due to a product not being found in the database. This page is actually a redirect page. Inspecting the traffic of any original product request, you can see where the API response from the server is not finding the product (<a href=\"https://www.bedbathandbeyond.com/apis/services/composite/v1.0/pdp-details/5676541?&amp;siteId=BedBathUS&amp;skuId=&amp;color=&amp;size=&amp;bopisStoreId=&amp;pickup=&amp;sdd=&amp;tz=240&amp;allSkus=true&amp;ssr=true&amp;__amp_source_origin=https%3A%2F%2Fwww.bedbathandbeyond.com\">actual example response</a>). The error message returned from the app is &quot;Product Data Not Found For the given Product Id 5676541 and Site Id BedBathUS&quot;.</p>\n\n<p>So why does this happen to some users an not others? Well, since these products don&#39;t typically change often, it&#39;d be a good idea to have a distributed architecture and put databases close to user&#39;s locations to ensure fast page loads. Studies have shown that increased web performance (the faster a page will load for a user) is directly correlated with increase sales (<a href=\"https://www.cloudflare.com/learning/performance/more/website-performance-conversion-rates/\">source</a>).</p>\n\n<p>I was originally hypothesizing that the database in select data centers are corrupt, or out of sync in a way that is causing this issue for a majority of users. To test this, we can use webpagetest.org to make requests from around the world. I</p>\n\n<ul>\n<li>US (Virginia) - <a href=\"https://www.webpagetest.org/result/230612_AiDcWA_7WM/\">https://www.webpagetest.org/result/230612_AiDcWA_7WM/</a></li>\n<li>US (California) - <a href=\"https://www.webpagetest.org/result/230612_BiDcX0_7PQ/\">https://www.webpagetest.org/result/230612_BiDcX0_7PQ/</a></li>\n<li>Canada (Toronto) - <a href=\"https://www.webpagetest.org/result/230612_BiDcZR_7PS/\">https://www.webpagetest.org/result/230612_BiDcZR_7PS/</a></li>\n<li>Germany (Frankfurt) - <a href=\"https://www.webpagetest.org/result/230612_BiDcMG_7PE/\">https://www.webpagetest.org/result/230612_BiDcMG_7PE/</a></li>\n<li>United Kingdom (London) - <a href=\"https://www.webpagetest.org/result/230612_BiDcZS_7QC/\">https://www.webpagetest.org/result/230612_BiDcZS_7QC/</a></li>\n<li>India (Mumbai) - <a href=\"https://www.webpagetest.org/result/230612_BiDcZS_7QC/\">https://www.webpagetest.org/result/230612_BiDcZS_7QC/</a></li>\n</ul>\n\n<p>I think this rules out a distributed systems error at the present. There is a possibility that these systems where out of sync and eventually got in-sync overnight.</p>\n\n<p>Now it&#39;s time to fuck with the url parameters to see what I can break. The error message mentions the product id and site id not being found. In the following actual product API request <code>/apis/services/composite/v1.0/pdp-details/5676541?&amp;siteId=BedBathUS</code>, <code>5676541</code> is the product id and <code>BedBathUS</code> is the site id.</p>\n\n<p>The error message &quot;Product Data Not Found For the given Product Id 5676541 and Site Id BedBathUS&quot; seems to be a general catch-all error message, intentionally vague. Vague error messages are good so that assholes like me don&#39;t know exactly what is going on. However, messing with these parameters didn&#39;t change the response in any meaningful way.</p>\n\n<p>I was able to find a sitemap for BBBY (<a href=\"https://www.google.com/search?q=site%3Abedbathandbeyond.com+filetype%3Axml&amp;source=hp&amp;ei=yQyHZNveA-ee5NoP29iYyAw&amp;iflsig=AOEireoAAAAAZIca2TVRmkhwBQVAQfeP4gSv1N03voL6&amp;ved=0ahUKEwib59uW273_AhVnD1kFHVssBskQ4dUDCAs&amp;uact=5&amp;oq=site%3Abedbathandbeyond.com+filetype%3Axml&amp;gs_lcp=Cgdnd3Mtd2l6EAM6EAgAEAMQjwEQ6gIQjAMQ5QI6EwguEAMQjwEQ1AIQ6gIQjAMQ5QI6BQgAEIAEOhEILhCABBCxAxCDARDHARDRAzoLCC4QgAQQxwEQ0QM6CwguEIAEELEDEIMBOgsIABCABBCxAxCDAToUCC4QgAQQsQMQgwEQxwEQ0QMQ1AI6DgguEIAEELEDEMcBENEDOgsIABCKBRCxAxCDAToLCC4QigUQsQMQgwE6CwguEIAEELEDENQCOggIABCABBDJAzoOCC4QgAQQkgMQxwEQrwE6CwguEIAEEMcBEK8BOggIABCABBCxAzoOCC4QxwEQsQMQ0QMQgAQ6EQguEIAEELEDEMcBENEDENQCOggILhCABBCxAzoECAAQAzoQCC4QxwEQsQMQ0QMQgAQQCjoHCAAQgAQQClDmA1jXcGDwdGgLcAB4AIABggGIAfockgEENDQuNJgBAKABAbABCg&amp;sclient=gws-wiz\">Google search</a>), which appears to list every product on the website. Sampling random product ids found in the product links results leads to the same error message.</p>\n\n<p>This makes me believe that either every product in the BBBY site has been disabled or deleted from the database, or, the site id has been deleted or disabled from the database. However, it is weird that the products are being listed in the category pages.</p>\n\n<p>Next step - let&#39;s dig into the product category pages.</p>\n\n<p>The product category pages are good candidates for caching since they are a common path that users will take to get to product detail pages. This might be why they still appear to work. The HTTP headers for the request that populates the category products do indicate some level of caching via a <code>X-Cache-Hits</code> header. In fact, the category page&#39;s content requests have an <code>Server: contentstack</code> header, indicating that they are using <a href=\"https://www.contentstack.com/\">ContentStack</a> as their content management system (CMS), which is owned by George Soros. Just kidding about the Soros part. I&#39;m just fucking with those of you with tin foil teeth.</p>\n\n<p>Changing the product sort filter tells a different story though. An API call is made and returns a 502 error response (<a href=\"https://www.bedbathandbeyond.com/apis/services/composite/product-listing/v1.0/all?web3feo=1&amp;site=BedBathUS&amp;currencyCode=USD&amp;country=US&amp;rT=xtCompat&amp;tz=240&amp;displayAdsAt=6&amp;categoryId=13452&amp;categoryType=plp_l2&amp;countOnly=false&amp;higherShippingThreshhold=0.1&amp;pageURI=%2Fstore%2Fcategory%2Fbath%2Fbath-furniture%2F13452&amp;solrCat=true&amp;view=grid&amp;web3feo=true&amp;noFacet=false&amp;facets=%7B%7D&amp;start=0&amp;perPage=48&amp;sws=&amp;sort=RATINGS%20desc%2CREVIEWS%20desc&amp;storeOnlyProducts=false&amp;customPriceRange=false&amp;__amp_source_origin=https%3A%2F%2Fwww.bedbathandbeyond.com\">source</a>).</p>\n\n<p>500-level errors typically happen when a server shits itself and is a sign of that server being unhealthy. Causes of this can range from physical issues like the application running out of memory, having corrupt caches, or who knows the hell what. However, 500-level errors are typically issues that large enterprises tech-teams will respond to really quickly, because they are an indicator of something really fucking up behind the scenes. However, something as simple as rebooting a server could potentially fix the website.</p>\n\n<p>It is a bit weird that the product listing filter switches from the ContentStack data to an in-house API. I&#39;m guessing that the default view is more curated by the marketing team via ContentStack, but their filtering system relies on querying/analyzing actual product data.</p>\n\n<h2>3. The TLS/SSL Cert</h2>\n\n<p>This is a new piece of info I stumbled across while during my research. The website&#39;s SSL cert will expire tomorrow.</p>\n\n<p>The TLS/SSL cert is a public key that is used to encrypt your connection with a website, TLS (transfer layer security) is a newer protocol that is functionally similar to the SSL (secure sockets layer) protocol. However, most folks are more familiar with the term &quot;SSL,&quot; so the terms TLS and SSL are commonly used interchangeably. When a website uses a TLS/SSL certification (cert), the website url will start with <code>https://</code> and browsers will typically display a lock icon of some sort in the url address bar. Without these cert, data sent from your browsers to a website&#39;s servers can be inspected. Especially in e-commerce sites, it&#39;s super important not to leak this information due to payment data being collected. Otherwise, there is a huge risk of theft occurring through a man-in-the-middle attack. This is why you should never use a site that does not have this lock icon!</p>\n\n<p>These certs only last for a given period of time, depending on the parameters used when generating the cert. This rotation of certs helps ensure that compromised certs don&#39;t linger in the for nefarious actors to exploit.</p>\n\n<p>bedbathandbeyond.com&#39;s cert was created on Monday, May 16, 2022 at 8:00:00 PM and will expire on Tuesday, June 13, 2023 at 7:59:59 PM, which just happens to be tomorrow. I believe the date of expiration being tomorrow is coincidental, but it is highly unusual for a major website&#39;s tech team to let a SSL cert get this close to expiration because it will break the shopping experience. Starting tomorrow night at 8:00pm, browsers will start showing a &quot;Your connection is not private&quot; error message (or something similar) when visiting the website.</p>\n\n<p>buybuybaby.com uses the same SSL certificate as bedbathandbeyond.com, so it will behave in the same manor.</p>\n\n<h2>4. Wtf is Beyond+?</h2>\n\n<p>What is this? Is this a new program?</p>\n\n<p>I found some Terms and Conditions for this program. <a href=\"https://www.bedbathandbeyond.com/store/static/bplustnc2\">https://www.bedbathandbeyond.com/store/static/bplustnc2</a></p>\n\n<p>Per <a href=\"https://www.forbes.com/sites/forbes-personal-shopper/2022/10/06/bed-bath-beyond-welcome-rewards/?sh=7e5784104430\">Forbes</a> Beyond+ was a program that was eventually replaced by the newer Welcome Rewards program.</p>\n\n<p>So why is Beyond+ showing now?</p>\n\n<p>The only place I&#39;ve seen the Beyond+ branding is on the 404 not found page, which then links to the <a href=\"https://www.bedbathandbeyond.com/store/loyalty/beyondplus/?icid=404_byr_1_im_join\">landing page</a> that we have all seen. These pages are easy to forget about updating from a content perspective. My guess is that the website maintainers simply forgot to remove this banner from the &quot;item not found&quot; page and now a lot more users are experiencing it because the product pages no longer work.</p>\n\n<p>Also, in the source of the landing page, there is indication that the build time of this page was Mon Oct 17 2022 09:59:13 GMT+0000. This page has been out there a while and was just never cleaned up.</p>\n\n<h2>Conclusion:</h2>\n\n<p>Given this all these factors, I&#39;m guessing the site has just been left to rot during this process and systems are starting to fall over. The certs about to expire are another strong indicator of this.</p>\n\n<p>I doubt the tech team is working on anything new at this point in time, just because new ownership will pivot strategy. If anything, they are preparing to hit the ground running to scale up quickly. However, I wouldn&#39;t be surprised if the tech team is now dedicated to mining data about their current web users to sale to other companies within the confines of their privacy policy and international regulations. Realistically, the website data is just part of the picture. In-store data insights (location data, registry data, foot traffic data) coupled with web traffic and physical mailer patterns is the most valuable tech asset they have right now.</p>\n\n<p>Generally, I think any speculation based off changes to the website is super premature at this time. If anything, the changing of registrars for the domain name would be the most bullish indicator of positive news in my mind.</p>\n\n<p>If you have any questions or critiques about certain topics, just let me know. I&#39;ll be glad to take a stab at answering them as I have time.</p>\n\n<p>UPDATE 1: <a href=\"/u/E-Vangelist\">u/E-Vangelist</a> inquired about beyond.com and any activity related to its usage. I pulled a WHOIS registry history of the domain and &quot;LIBERTY PROCUREMENT CO. INC&quot; has been associated with beyond.com since March 1, 2018.</p>\n\n<p><a href=\"https://pdfhost.io/v/MYoRZudQe_Historical_WHOIS_report_for_beyondcom\">https://pdfhost.io/v/MYoRZudQe_Historical_WHOIS_report_for_beyondcom</a></p>\n\n<p>UPDATE 2: <a href=\"/u/slacklabrador\">u/slacklabrador</a> points out that the TLS/SSL cert has been updated as of this afternoon! The biggest takeaway from this is that someone on the tech team is paying attention to the website to some degree. Keep in mind that there may also be legal obligations to keep this cert valid to ensure adherence to international regulations, like GDPR.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]