[{"username": "Matt54987", "url": "https://www.reddit.com/r/ThePPShow/comments/16664cv/ast_creating_login_for_portal/", "time": 1693473567.0, "subreddit": "r/ThePPShow", "title": "AST - Creating Login for Portal", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m curious to hear some other experiences with this from our community. I&#39;ve transferred about XX,XXX BBBYQ from Fidelity to AST and went to create my first time login. I received a &quot;you&#39;re locked out message&quot;, just inputting my own personal information. Okay... So, I called AST about it, he said, &quot;I&#39;ll unlock it, but this is your last attempt before you&#39;re locked out.&quot; Reiterating what I&#39;ve heard in this community, or PPshow, I don&#39;t remember. Anyways, with a AST rep on the phone, I confirmed all of MY OWN personal information for the second attempt before hitting submit. Still, rejected. She then proceeds to apologize profusely, and she felt powerless to help me. At that point, she states, &quot;You&#39;ll just have to write in, call, email, or fax if you want to make changes with  you shares or anything. I&#39;m so sorry... Etc.&quot;</p>\n\n<p>Has this happened to anyone else? I&#39;m left feeling uneasy about the whole thing. I was looking forward to having online account access and now I&#39;m just at the mercy of making phone calls and some middle man process that I&#39;ll need to broach before getting what I need accomplished. Anyone else have a similar experience? Wondering if others have concerns about it? Etc.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Matt54987", "url": "https://www.reddit.com/r/ThePPShow/comments/14wypla/question_im_from_ss/", "time": 1689098805.0, "subreddit": "r/ThePPShow", "title": "Question I'm from SS", "text": "<!-- SC_OFF --><div class=\"md\"><p>Are you guys DRS-ed for your BBBY shares or riding the squeeze play out in a brokerage? ...I DRS-ed my GME, but my newly acquired BBBY I&#39;m undecided how to handle. Thoughts...? (I had no idea how to label this with a flair.)</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]