[{"username": "MauiZaddy", "url": "https://v.redd.it/3oregzzztcdb1", "time": 1689961100.0, "subreddit": "r/ThePPShow", "title": "Happy Birthday PP 🥳 let’s celebrate the legend 🎉 ", "text": "<!-- SC_OFF --><div class=\"md\"><p>Thank you for providing a valuable platform!</p>\n\n<p>Be careful of the brown juice on your 🎂 day. \nHope you get your birthday wish 🧸 🚀 </p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/OGlodGwyd3p0Y2RiMQtdNQcK7lF_ZwZHSjxO2WAbs-DJPIK6xhv2HRqZGaBe.png?width=140&amp;height=78&amp;crop=140:78,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=931fe4b0d199181f0533d1ce9d05cba6cd505864\"/></div>"},
{"username": "MauiZaddy", "url": "https://i.redd.it/d0btqvga0fbb1.jpg", "time": 1689115733.0, "subreddit": "r/ThePPShow", "title": "Final Boss to exit BK on July 18th 🧸🚀", "text": "<!-- SC_OFF --><div class=\"md\"><p>Finally!  We have come to the fuck around and find out part of this play.\nFinal Boss to exit BK and Sixth Street Parthers is in control by converting the debt to capital to acquire the company.</p>\n\n<p>Who is 6th Street representing?  Hopefully it is Teddy, RC Ventures, IEP or a combination of activist investors.\nJust waiting on that sweet Teddy S-1 to drop and find out how this Teddy SPAC is going public.\n6th Street Partners could drop a reorganization plan so we can finally get some transparency in this transaction?!?</p>\n\n<p>Power to the Players!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/d0btqvga0fbb1.jpg\"/></div>"},
{"username": "MauiZaddy", "url": "https://www.reddit.com/r/ThePPShow/comments/14w1iv6/pp_and_company_are_keeping_this_play_together/", "time": 1689012612.0, "subreddit": "r/ThePPShow", "title": "PP and Company are keeping this play together! Thank you 🙏", "text": "<!-- SC_OFF --><div class=\"md\"><p>That dude with the bullshit “PP and company are not your friends” post has Paperhand Pete shill vibes.  I don’t know why these micro-dicks have to keep rage posting us.  Touch grass, bro! You want some smoke, we’ll come for you little bitch.  I’m so happy that the mod team decided to keep that posting up so we can jump his ass in the comments.  I mean, who doesn’t use paragraphs to make it easier to read?  </p>\n\n<p>Motive:  Why you so interested in our investment?  Seems super sus!  You don’t know us and you couldn’t care a fuck about what we invest in. Nobody is buying it.  Not even CNBC when they do a (sponsored) “report” on bed bath and directly call it a “hit piece”.  Whoops, they weren’t supposed to say the quiet part out loud. </p>\n\n<p>Let’s pretend for a minute that you are so worried about retail investor, then why don’t you talk about the real crime going on?  THE ILLEGAL NAKED SHORTING AND SYNTHETIC SHARES! The reason we are in this position at sub $1 is because your associates are shorting a security that they don’t even own.  You are borrowing shares or creating synthetic shares to bankrupt this company, so you don’t have to close your short positions.  No cell, no sell - people should go to jail for these crimes, since they wouldn’t just let the brand sell in February.  Had to push it into BK, cause it always worked before.  But now there are a lot more eyes on this play than you could have ever expected. 👀 </p>\n\n<p>This BK protection was the best thing to happen to BBQ because we now have the naked short selling of synthetic shares exposed in court.  I wonder why the judge on day 1 asked for a list of investors with 4.5% or higher.  How many multiples is this stock shorted?  What crimes have you guys been up to?  </p>\n\n<p>All the MSM FUD is amazing for the algo to process and keep it cheap so we can all gain a large concentration of shares.  Besides, whoever is being represented by Sixth Street Partners can use the debt as capital and will most likely own the company.  I might have been worried a bit, because I don’t trust that the bad actors could get control of the company and shut it down but you wouldn’t be here with your rage paragraph, because the company paying you to shill would already control this process.  The new owners don’t even need the auction because we were able to sell a massive amount of inventory, make some money off the IP, shed unprofitable leases, free ourselves from the predatory debtors and swapped it out for friendly activist investors that will emerge from the BK ashes like a phoenix rising.  You will never forget this bear trap 🐻 🪤 </p>\n\n<p>Why?  Because you can profit off the stumble of an American company.  The greed in this play by the market makers and hedge funds is incredible. How are the investment companies all making huge profits when the markets have been down for 18 months?  It’s reported that $115 billion has been made off shorting this company, compared to our $200 million in retail investors to counter your illegal activities and buy it up on the cheap.  Thanks for that, and now we have you right where we want you.  🎯 </p>\n\n<p>You need to look at this from another perspective, we are not trapped in this play with you, as much as you are trapped in here with us.  If you watch the show, you wouldn’t want to be trapped in here with us degens. We have nothing to lose, because your unstoppable greed took our profits. </p>\n\n<p>This show is the glue that binds us.  Entertaining and you might just learn a little about what is really going on behind the curtain.  Thank you PP and Co for providing a platform for retail investors to hear directly from the DD sources.  It provides the authenticity we need to sus out the bad actors.  BTW the securities crime investigator (OKbet) you had on Friday was outstanding!  Please more of this!  (but maybe put the drunk guy backstage so he isn’t interrupting a contributor with valuable information).  Wrinkle my brain 🧠</p>\n\n<p>Hey shill 👋the one thing that you didn’t plan for with your algo is that risk adverse people would flood into this play and you would have to keep propping it up.  If you are so fucking worried about our investment, why don’t you get them to turn off the algorithm that is suppressing the stock?  Let’s see the real price of Teddy in an “open market” where the casino isn’t cheating.  💸 </p>\n\n<p>Icahn wait for these Cohen-cidences to turn into fireworks.  We will find out who is going to win on this play real soon and by your fear, I can tell it has you shook to your crumbling foundation.  You’re rage didn’t make one person sell their shares, but what it did do is make a lot of people realize that we are getting closer.  🧸🚀</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MauiZaddy", "url": "https://i.redd.it/gox9p77gh6wa1.jpg", "time": 1682474820.0, "subreddit": "r/ThePPShow", "title": "Who is representing the common stock shareholders through the BK process?", "text": "<!-- SC_OFF --><div class=\"md\"><p>There are a lot of lawyers:\n1. The company is obviously represented\n2. The creditors have representation \n3. The landlord has representation\n4. The vendors have representation \n5. But who TF is representing the common stock shareholders (retail) that were shorted to the tune of $115 billion?</p>\n\n<p>Will the court hear any motions about the illegal naked short selling, the illegal cellar boxing, the dark pool manipulation of the price discovery, the short ladder attacks, or how many synthetic shares are outstanding?  Or does all this illegal activity get buried at the end of the BK process? </p>\n\n<p>What are our options here before the next hearing?  Do we have any lawyers who have $BBBY stock and want to represent the retail investors.  Let’s constructively brainstorm on how we can fight back!</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/gox9p77gh6wa1.jpg\"/></div>"},
{"username": "MauiZaddy", "url": "https://youtu.be/re9Uon4fNNw", "time": 1680560786, "subreddit": "r/ThePPShow", "title": "ABC - How to be a Millionaire", "text": "ABC is teaching us ‘How to Be a Millioniare’! \n\nHow to be (how to be) a millionaire\nMillionaire, billionaire, trillionaire\n\nhttps://youtu.be/re9Uon4fNNw", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/re9Uon4fNNw/hqdefault.jpg\"/></div>"},
{"username": "MauiZaddy", "url": "https://www.reddit.com/gallery/12ay5je", "time": 1680556573.0, "subreddit": "r/ThePPShow", "title": "Towelie Tattoo Suggestion", "text": "<!-- SC_OFF --><div class=\"md\"><p>While I still think you should get a whale tattoo for this tattoo bet, the next tattoo bet will increase in intensity:<br/>\n  1.  Whale tattoo \n  2.  Towelie tattoo \n  3.  Bobby from King of the Hill tattoo\n  4.  RC tattoo\n  5.  Icahn tattoo\n  6. Roach 🪳 Motel\n  7.  Rocket 🚀 on your 🍑 </p>\n\n<p>Have I missed any of the levels of intensity?  Degens will chime in with suggestions.</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/eLYfe4awjxOvCMiJFDmFbiZZxEVGyHXKP4__VjOy7Jk.jpg\"/></div>"}]