[{"username": "Maunderlust", "url": "https://www.reddit.com/r/ThePPShow/comments/15gln9i/gmerica_v_corporate_raiders/", "time": 1691014290.0, "subreddit": "r/ThePPShow", "title": "GMERICA v. Corporate Raiders", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was originally content to post this on the main sub, but it&#39;s been set to hidden twice now, presumably by a mod (I didn&#39;t do it). That seemed rather silly, and just a little suspect. So, the contrarian in me is posting it here for even more visibility. I hope it&#39;s insightful, or useful, or just amusing. I don&#39;t think it breaks any sub rules but I&#39;ll take it down if so. Maybe I&#39;m being paranoid but I think the main takeaway is that there may be something suspect going on with the mods over there.</p>\n\n<p>&#x200B;</p>\n\n<p>The original post in its entirety:</p>\n\n<p>UPDATE: Someone on the original post commented there’s a special something on part 2 at 5’ 10” (“Full speed ahead Mr. Cohen!”)</p>\n\n<p>Here&#39;s some light-hearted tinfoil for you all as we navigate this process. It may have already happened, though I haven&#39;t seen anyone post about this particular item yet.</p>\n\n<p>So, Ryan Cohen&#39;s <a href=\"https://twitter.com/ryancohen/status/1493951577887019015\">pirate flag tweet</a> is often attributed to <a href=\"https://mashable.com/article/apple-pirate-flag-40th-anniversary\">Apple&#39;s pirate flag</a>. This seems like a pretty fair interpretation. But as my mind was wandering this morning I suddenly remembered this two-part <a href=\"https://www.youtube.com/results?search_query=monty+python+corporate+raiders\">Monty Python sketch</a> which, in retrospect, seems to thrust (so to speak) to the heart of the current matter at hand- Squashing the shorts via mergers and acquisitions. Double entendres.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=aSO9OFJNMBA\">Part 1</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=lNlYBNTCBG8\">Part 2</a></p>\n\n<p>&#x200B;</p>\n\n<p>EDITS: Nothing major. Just grammar, wording, links.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]