[{"username": "meoraine", "url": "https://www.reddit.com/r/ThePPShow/comments/170ihpz/well_this_is_an_interesting_development/", "time": 1696513733.0, "subreddit": "r/ThePPShow", "title": "Well this is an interesting development...", "text": "<!-- SC_OFF --><div class=\"md\"><p>Some of my call options on TDA are reflecting 1,000,000%+ increase. See screenshot.</p>\n\n<p>This was not there yesterday. However, I did receive notification yesterday that my call options were all being switched to cash-settled and expedited to 10/20. According to Jake2b research, this is an indication that a buyout date/price was agreed on and all options will settle on or near that date, based on the cash offer.</p>\n\n<p>Not trying to spread unwarranted hype, and I&#39;m a fond believer that anything below $420.69 is an unfair payout - but this is certainly an interesting development.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/c3g9y2d42esb1.png?width=1486&amp;format=png&amp;auto=webp&amp;s=16ec2a21badf4ec95b2b5caf5442a4ef5448f320\">Call Option Change &#37;</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/qL5fqxv0yjpkpFly2OjFQPVElKLphoVGIF_tVsKp8u8.jpg\"/></div>"},
{"username": "meoraine", "url": "https://www.reddit.com/r/ThePPShow/comments/16yy5fn/options_settlement_type/", "time": 1696354466.0, "subreddit": "r/ThePPShow", "title": "Options Settlement Type", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys. So I have a shit ton of LEAPs that expire 2024/2025. So all the recent news about the options-chain changing the &#39;settlement type&#39; got me really intrigued.</p>\n\n<p>Then I saw this awesome post by <a href=\"/u/No_Pie_2109\">u/No_Pie_2109</a> :</p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/16y0t7g/info_about_options_as_per_the_occ/?share_id=XGkZlGWInlC6zxjPnZRF7\">https://www.reddit.com/r/ThePPShow/comments/16y0t7g/info_about_options_as_per_the_occ/?share_id=XGkZlGWInlC6zxjPnZRF7</a></p>\n\n<p>I recommend everyone read over it, since it comes directly from the options exchange.</p>\n\n<p>After finding that post, I did some digging and research and just wanted to share my findings. A lot of people are wondering if this change is bullish or bearish, or what it could possibly mean, and I think I can explain it simply.</p>\n\n<p>It turns out that changing an options contract to cash-settlement is something that happens automatically, as soon as a stock ceases trading. It isn&#39;t something the company would initiate, it would be initiated by either the Options Exchanges, or by the SEC.</p>\n\n<p>Why and when does this occur?</p>\n\n<p>The most common reason that an Options Type would be changed to Cash-Settlement is due to Lack of the available underlying asset for trading. Options derive their value from the underlaying asset. If for any reason, a ticker is no longer available for trading (as is our case) - the options contracts will revert to Cash-Settlement by default. No shares available for trading, then no delivery of those shares can be expected upon exercise, so a cash-settlement is enacted.</p>\n\n<p>Again, because the stock cannot currently be traded, the options default to this cash-settlement type.</p>\n\n<p>HOWEVER, If we end up undergoing a corporate action before 10/20/2023, such as a merger, or share exchange ---- Then a new options chain for the new underlying asset, would be available again as normal, resulting in delivery of the underlying assets upon exercise. So if butterfly or teddy, or any other entity, does an exchange offer with shareholders, these options would revert back to their normal state.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]