[{"username": "MichealJardon", "url": "https://www.reddit.com/r/ThePPShow/comments/16ljhk9/is_there_any_way_a_publicly_traded_company_can/", "time": 1695004427.0, "subreddit": "r/ThePPShow", "title": "Is there any way a publicly traded company can request cooperation of every brokerage holding any of its stock to find out the names of individuals who own shares in street name - for example in an ongoing RICO investigation?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Was listening to <a href=\"/u/jake2b\">u/jake2b</a>&#39;s very informative <a href=\"https://x.com/sboho/status/1703564012787519641?s=20\">State of the $BBBYQ: Chapter 11 summary, current and near-term theory</a> X space from earlier today and right about the 1:27:00 time stamp it is mentioned that attorney <strong>Michael I. Goldberg</strong> is plan administrator, and that attorney <strong>George R. Calhoun</strong> has entered the scene just recently (as per docket 2168).</p>\n\n<p>About <a href=\"https://www.akerman.com/en/people/michael-goldberg.html\">Michael I. Goldberg</a>: <em>...Michael Goldberg chairs Akerman’s Fraud and Recovery Practice, an experienced team of lawyers focused on unraveling high-profile investor fraud, including Ponzi schemes... Michael has managed some of the largest Ponzi scheme liquidation recoveries in U.S. history. As a qualified expert witness on the topic, he is highly sought after and routinely testifies in federal and state court cases throughout the country and internationally.</em></p>\n\n<p>About <a href=\"https://www.ifrahlaw.com/attorneys/george-r-calhoun/\">George R. Calhoun</a>: <em>George’s practice primarily focuses on the litigation of complex disputes for clients in a broad array of disciplines, including contracts, cryptocurrency, securities, bankruptcy, fraud, RICO and other business claims. He has an extensive background in dispute resolution, having appeared before numerous state and federal courts on behalf of clients including large multi-national corporations, insurers, and individuals. ... In addition, George represents a major U.S. company in collecting a multi-billion judgment, having assisted in the recovery of over $1.2 billion through a determined international effort spanning over a dozen countries.</em></p>\n\n<p>Calhoun seems to be a big player and it&#39;s quite interesting that he is being introduced so late in the game. I&#39;m wondering if there is a possibility that they are requesting the names of individuals who have shares registered in street name via brokerage, as part of an ongoing RICO investigation. </p>\n\n<p>This would have the potential of painting a clearer picture: on one side we know exactly how many registered shares exist per AST, on the other side we could find out how many naked short positions exist in brokerages (albeit just a snapshot in time).</p>\n\n<p>This whole saga will expose financial crime far beyond Bed Bath alone, and I have a feeling that this master plan they have conceived will ensure that <strong>every</strong> holder gets paid, and that this time around there will be jail time for all nefarious actors involved.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MichealJardon", "url": "https://www.reddit.com/r/ThePPShow/comments/16knwiz/what_happens_to_bbbyq_shares_that_are_not_sold/", "time": 1694913790.0, "subreddit": "r/ThePPShow", "title": "What happens to BBBYQ shares that are not sold after merger/acquisition?", "text": "<!-- SC_OFF --><div class=\"md\"><p>When a merger/acquisition is announced, is it correct that a certain time thereafter the BBBYQ ticker will be obsolete and eventually disappear?</p>\n\n<p>If so, what happens to shares that Apes are not selling at all, or shares that are sitting with AST, not intended to be sold? Do these eventually turn into a new ticker? I&#39;m asking because I&#39;m looking to get a better understanding of the &quot;I&#39;ll hold XXXX BBBYQ shares in AST&quot; argument. What is the upside of doing that, rather than selling into a squeeze?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MichealJardon", "url": "https://www.reddit.com/r/ThePPShow/comments/166k9ll/drsing_from_canada_answers_from_ast/", "time": 1693509629.0, "subreddit": "r/ThePPShow", "title": "DRS'ing from Canada: Answers from AST", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just had a chat with AST and thought I&#39;d share some of the answers:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>It might take up to <strong>4-6 weeks</strong> to transfer your shares from your broker to AST</li>\n<li>Your broker needs to initiate the transfer to AST, AST will then create your account and send you the information; just mentioning this here because my broker suggested that I need to set up the account with AST, then AST initiates the transaction by sending my account information to my broker, which is incorrect</li>\n<li>Selling via AST costs a <strong>$15</strong> flat fee, plus $<strong>0.12 per share</strong></li>\n<li>There are <strong>no sell limits</strong> on AST and there are <strong>no same day sales</strong></li>\n<li>Sales can take up to <strong>48 hours</strong>; since you can not set a sell limit, you could call them one day when the stock is at <strong>$500</strong> to initiate the sale, but they might end up selling a day later, when it is at <strong>$200</strong></li>\n<li>Lastly, the website is not down, as many here falsely keep repeating, but it is true that it is under maintenance and selling stock requires calling them; <strong>the online platform does not allow for share sales for the time being</strong><br/></li>\n</ul>\n\n<p>A couple of notes:  </p>\n\n<ul>\n<li>This is all based on talking to <strong>one AST representative</strong>, so if any of this is incorrect, please call it out</li>\n<li>I&#39;ve specifically asked about using AST <strong>from Canada</strong>, so I&#39;m not sure if all/any of this applies to anyone from the US/elsewhere<br/></li>\n</ul>\n\n<p>Please share if any of this is incorrect and if you have any personal experience DRS&#39;ing from Canada.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]