[{"username": "mideast", "url": "https://www.reddit.com/r/ThePPShow/comments/17nqsn7/all_11_dom_buybuybaby_grand_opening_events/", "time": 1699119486.0, "subreddit": "r/ThePPShow", "title": "All 11 DOM buybuyBABY Grand Opening Events", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/d73jabpbadyb1.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c46a120644aa2876ac47c6d0b738308cf1ca7de7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/d73jabpbadyb1.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c46a120644aa2876ac47c6d0b738308cf1ca7de7\" alt=\"Eventbrite web page\"></a></p>\n\n<p>buybuy BABY have posted some event details for the Grand Opening celebration on Eventbrite!</p>\n\n<p>All 11 Dream on Me locations are set to open on November 18</p>\n\n<p>Source: <a href=\"https://www.eventbrite.com/o/buybuy-baby-42145285233\">https://www.eventbrite.com/o/buybuy-baby-42145285233</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/bAG3jde5TvOVawbVvDbFYi734NkNuQn-6EgiqNAJ-6k.jpg\"/></div>"},
{"username": "mideast", "url": "https://www.reddit.com/gallery/17a5bj8", "time": 1697567958.0, "subreddit": "r/ThePPShow", "title": "Toys R Us Gift Card via Macy’s? Never seen this", "text": "<!-- SC_OFF --><div class=\"md\"><p>Happy Birthday Geoffrey!!! 🎉 ❤️</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/2Li949nwS_Wscl79ezzEM2lH4XB1ZlwrzZMIs0rvm9Q.jpg\"/></div>"},
{"username": "mideast", "url": "https://i.redd.it/wvvz5p9f4xpb1.jpg", "time": 1695436919.0, "subreddit": "r/ThePPShow", "title": "RC Cory liked Pulte’s tweet", "text": "<!-- SC_OFF --><div class=\"md\"><p>👀</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/wvvz5p9f4xpb1.jpg\"/></div>"},
{"username": "mideast", "url": "https://www.reddit.com/gallery/16phrc0", "time": 1695407668.0, "subreddit": "r/ThePPShow", "title": "buybuy BABY Paramus, NJ opening end of October", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I decided to visit buybuy BABY in Paramus, NJ today since tomorrow is the first day of Fall.</p>\n\n<p>The only store open in the building is TJ Maxx on the second floor, the first floor is Bed Bath &amp; Beyond with the closing sale signs still up.</p>\n\n<p>I took the elevator to the third floor and when it opened there were two women talking who noticed me, because obviously there’s nowhere open to shop where I was getting out.</p>\n\n<p>I waved and one woman came to the gate to talk to me, I asked when they expected to open.</p>\n\n<p>She said they expect to have a soft opening at the end of October and a grand opening the first week of November.</p>\n\n<p>She said “exciting huh?” and I said “very exciting!”</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/vBSi6q-ClX-1MJUkp1qc-JpDil1emt964X_dGdRCBno.jpg\"/></div>"},
{"username": "mideast", "url": "https://www.reddit.com/gallery/16chtbx", "time": 1694098206.0, "subreddit": "r/ThePPShow", "title": "Sears, brick-and-mortar malls, NJ, BBBY and the GMErica metaverse", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sears first found success distributing their catalogs and shipping their customer’s orders via railroad routes. </p>\n\n<p>It was considered a modern convenience at the time, in the late 1800s, to order from home and have it shipped to you. They were known for selling a variety of goods such as appliances, tools, and even pre-fabricated houses you could build yourself!</p>\n\n<p>Later in 1925, when automobiles became more common in American society, they opened their first brick and mortar stores in the outskirts, or suburbs, of cities. They were quite successful as an anchor store in malls for decades, but eventually met their decline and their stores are now but a memory.</p>\n\n<p>Now, we all know the activity of in-person shopping has been severely affected by the likes of Amazon, and subsequently years later,  the COVID-19 pandemic. But what state still has a thriving mall culture? </p>\n\n<p>Yes, New Jersey, home of Bed, Bath and Beyond. You ever see the movie Mallrats? That’s based in NJ.</p>\n\n<p>So I ask you this question, why is Dream on Me re-opening four buybuy BABY stores, more than in any other state, in New Jersey this upcoming Fall? </p>\n\n<p>Maybe because New Jersey would be a great testing ground for Teddy, especially since Dream on Me have that huge warehouse that looks ready to go!</p>\n\n<p>The Paramus store is in affluent Bergen County, and can be visited from NYC easily. The Woodbridge store is just over the bridge from Staten Island. The Cherry Hill store is 15 minutes from Philadelphia, and the town of Bridgewater borders Franklin Township, where the Dream on Me warehouse is located. </p>\n\n<p>So, what about web3? </p>\n\n<p>Ryan Cohen, just like Sears, seeks to combine in-person sales with at-home sales. </p>\n\n<p>Teddy, GameStop, Chewy, Overstock, Blockbuster and Toys R Us have all applied for NFT trademarks. Something’s going on, guys.</p>\n\n<p>GameStop dropped their BETA NFT marketplace in the Summer of last year, as a proof of concept, and then started focusing on their brick-and-mortar presence again, that Winter. </p>\n\n<p>Mainstream media took the opportunity to conclude that GameStop was abandoning their “unprofitable” NFT marketplace. But were they?</p>\n\n<p>We live in a society where gig-based driving apps like DoorDash, Instacart, Grub Hub and Uber Eats are facilitating courier based delivery services very successfully. </p>\n\n<p>Is it hard to believe that you could create an order on the GMErica app and then get your same-day delivery, picked up via courier, from your local GameStop? There are 4,000 of them last time I checked.</p>\n\n<p>So what’s this GMErica that GameStop and RC have mentioned in their tweets? Just a stupid gif NFT collection? A look at their trademark shows it covers on-line retail store services. </p>\n\n<p>A GMErica blockchain-based mall could surely accommodate the likes of any retailer willing to join the Teddy basket. As long as they are properly onboarded by Dragonfly and given a custom plan to allow their good or service to benefit from the upcoming metaverse and the world of digital ownership in web3. </p>\n\n<p>Remember when every company, and their mother, was creating their very own world wide web domain? Or when it became essential for all businesses to create a social media presence?</p>\n\n<p>Did the metaverse and NFTs really die shortly after it was all dreamed up, like mainstream media has been telling us?</p>\n\n<p>The last few photos are of Toys R Us, who have also embraced the web3 and IRL model. They’ve released an NFT collection and talk about having “virtual stores in your favorite games” in the future, on their website.</p>\n\n<p>For those of you who think they are just added competition for buybuy BABY 2.0, I say:</p>\n\n<p>Ryan Cohen isn’t afraid of some healthy competition. Especially from such a nostalgic, iconic brand as Toys R Us.</p>\n\n<p>They, and Babies R Us, have opened flagship stores in New Jersey’s largest mall, American Dream.</p>\n\n<p>P.S. I’ll leave you with this: </p>\n\n<p>Last images are Dream on Me’s Facebook follows, which are Sears, Kmart (who purchased, and merged with Sears), and Toys R Us. </p>\n\n<p>They also like Amazon.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/tWTQgzmBTryzA2ozmAUNlJnIkhnbmDwBWrtIwkLEjag.jpg\"/></div>"},
{"username": "mideast", "url": "https://www.reddit.com/gallery/16bn5if", "time": 1694013955.0, "subreddit": "r/ThePPShow", "title": "For those who don’t believe Apple is involved: I give you every RC Apple tweet", "text": "<!-- SC_OFF --><div class=\"md\"><p>Add to that the couple times he’s used the pirate flag 🏴‍☠️, which was used by Apple in the early days and is still symbolic to them.</p>\n\n<p>Also Ryan Cohen is Apple’s largest individual shareholder.</p>\n\n<p>I also believe Teddy always calling his grandkids Cowboy is a reference to the metaverse being the new frontier where anything’s possible. The new Wild West, if you would.</p>\n\n<p>NFTs, in my opinion, are essential to the Teddy thesis. As they allow secure digital ownership and open up the way for a metaversal society where people can interact socially and make purchases online like never before.</p>\n\n<p>GameStop has the NFT marketplace, which is still in beta. And Apple has the upcoming Apple Reality Pro, which could lead to the mass adoption of virtual reality which has been a dream of our society since the 90s.</p>\n\n<p>Something, something, the greatest time to be alive.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/0FHFtvj02fZmIXO_W_kfXGRBGdL_ksXQ7MhQPBphT88.jpg\"/></div>"},
{"username": "mideast", "url": "https://www.reddit.com/gallery/15lxzw1", "time": 1691537025.0, "subreddit": "r/ThePPShow", "title": "Why did BBBY placeholder page reference 7/12/23 BBBY Acquisition LLC Date?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m interested to know other people’s opinion on this.</p>\n\n<p>I remember before Aug 1 when Overstock had the placeholder page on the BedBathBeyond website, the file names were interesting to me. </p>\n\n<p>The html file it forwarded you to was called “Oh No Maintenance” and when you downloaded the house with the rooms vector file it had the number 07122023 in it.</p>\n\n<p>Why would Overstock reference the date BBBY Acquisition Co LLC, which Mark Serure of Dream on Me signs for?</p>\n\n<p>Oh no!</p>\n\n<p>Are Overstock and DOM truly in cahoots?</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/u0ScA5Z5pVKXs6bsvyFykIOOhDRWea1xJkPeLxreTP0.jpg\"/></div>"}]