[{"username": "Milkpowder44", "url": "https://www.reddit.com/gallery/17zjkgc", "time": 1700467456.0, "subreddit": "r/ThePPShow", "title": "Jake's Night Cap DD - take two", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://twitter.com/sboho/status/1726490702706577863?t=VAdfN13_MRX07BThUQn1gQ&amp;s=19\">https://twitter.com/sboho/status/1726490702706577863?t=VAdfN13_MRX07BThUQn1gQ&amp;s=19</a></p>\n\n<p>For those who can&#39;t wait for Jake&#39;s upcoming post.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍼Got milk?🥛🐄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/em3stPO1W6SkSK_ZfAigDGpsTR16b2DX0fVfXRrOAB0.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://i.redd.it/gjjrblyruazb1.png", "time": 1699525804.0, "subreddit": "r/ThePPShow", "title": "Immutable (GME web3 partner) partners with Ubisoft", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://twitter.com/0xferg/status/1722495714411139335?t=HNLHU9H3HkcsgyuZTCiH-w&amp;s=19\">https://twitter.com/0xferg/status/1722495714411139335?t=HNLHU9H3HkcsgyuZTCiH-w&amp;s=19</a></p>\n\n<p>Repost because of rules.</p>\n\n<p>Ubisoft is a huge gaming company, who makes Assassin&#39;s Creed, among others.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍼Got milk?🥛🐄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/gjjrblyruazb1.png\"/></div>"},
{"username": "Milkpowder44", "url": "https://twitter.com/0xferg/status/1722495714411139335?t=PwCnmHV04W4Nn1QD43KEgA&amp;s=19", "time": 1699520899.0, "subreddit": "r/ThePPShow", "title": "Immutable partners with Ubisoft", "text": "<!-- SC_OFF --><div class=\"md\"><p>I guess this is allowed since Immutable is also partnered with GME?</p>\n\n<p>Bullish for Web3 either way.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍼Got milk?🥛🐄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/rNks-UQUyuZeYeSqzL5OOD5OrGdwP3JgDt3sjBvaHBQ.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://twitter.com/PatrickByrne/status/1720186617481027628?t=ZIngEjA4ALYU1fVF49Dp0w&amp;s=19", "time": 1698965721.0, "subreddit": "r/ThePPShow", "title": "Patrick Byrne replies to tweet by Kais about naked shorts causing BBBY to go to infinity", "text": null, "flair": {"text": "🍼Got milk?🥛🐄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/aVE40F_G_KJkC7tdKRR2HqWlNzBHd10DpiDBsxsPxPM.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://www.reddit.com/r/ThePPShow/comments/17massc/the_most_bullish_find_of_yesterdays_ppshow/", "time": 1698951381.0, "subreddit": "r/ThePPShow", "title": "The most bullish find of yesterdays PPshow", "text": "<!-- SC_OFF --><div class=\"md\"><p>The leases where Ryan Cohen is noted as a co-debtor and on the utility bills were NOT sold! </p>\n\n<p>Thank you Travis and Jake for this conclusion. Was an epic moment.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍼Got milk?🥛🐄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Milkpowder44", "url": "https://open.spotify.com/episode/7edwvm2c6Ieuzun4xtFYCJ?si=3DWNQBVCQjGxdPVhioDUdg&amp;t=9545", "time": 1698791624.0, "subreddit": "r/ThePPShow", "title": "Tinfoil alert; Joe Rogan brings up the transition from caterpillar to butterfly in podcast with Elon Musk", "text": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s about AI, but interesting that he brought this up nonetheless</p>\n\n<p>It starts at 2.39.06 (in Spotify).</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍼Got milk?🥛🐄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/s-5sza1w5rCU916kf16hVVhQjtTLhTqeizBV2ui_A20.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://twitter.com/sboho/status/1719379906117693584?t=VPJtDEfaB4RqYKFkhlaQfw&amp;s=19", "time": 1698773721.0, "subreddit": "r/ThePPShow", "title": "Tweet by Jake regarding the return of shares", "text": null, "flair": {"text": "🍼Got milk?🥛🐄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/r6wLJTTDdSWQO3T59xdEIzYHzZ6iGi0NY-kp-iKYKxA.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://i.redd.it/xb93z54k8fvb1.jpg", "time": 1697835475.0, "subreddit": "r/ThePPShow", "title": "Are we still doing GameStop X replies to Bobbies?", "text": null, "flair": {"text": "🍼Got milk?🥛🐄", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/xb93z54k8fvb1.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://v.redd.it/43wcfnh7e9ob1", "time": 1694713868.0, "subreddit": "r/ThePPShow", "title": "Let's go to the moon!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Older meme vid that I had in my folder. I didn&#39;t make this one. Couldn&#39;t find it back online - figured you guys might like it.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": ""},
{"username": "Milkpowder44", "url": "https://v.redd.it/fm1kfk6uz8ob1", "time": 1694709206.0, "subreddit": "r/ThePPShow", "title": "Let's go to the moon!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: I didn&#39;t make this one but had it in my meme folder and couldn&#39;t find it online anymore. Figured you guys might enjoy this one.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/M3F2cWdmeXR6OG9iMciRKBiqOmvqCfc3TE1IFayIaBGKWkw5hEM5faV8kpVM.png?width=140&amp;height=78&amp;crop=140:78,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=b58db8eb92adc99994c88e28760c32ae9196dc00\"/></div>"},
{"username": "Milkpowder44", "url": "https://i.redd.it/3hkhi3brrsnb1.jpg", "time": 1694512538.0, "subreddit": "r/ThePPShow", "title": "When AMC is brought up on the PP show", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3hkhi3brrsnb1.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://v.redd.it/1737164ikmnb1", "time": 1694439399.0, "subreddit": "r/ThePPShow", "title": "They HATE when GameStop is brought up 😭😭", "text": null, "flair": {"text": "MSM FUD ", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/bXprZjZhdWhrbW5iMVGMdMunSMMW1Q12hNeBQk_ML7hLFYFCwi6qv__Uh5xD.png?width=140&amp;height=78&amp;crop=140:78,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=7724f2c0f1034f477e2d40d2a28adb2ec7f60022\"/></div>"},
{"username": "Milkpowder44", "url": "https://v.redd.it/f1di343vvinb1", "time": 1694392920.0, "subreddit": "r/ThePPShow", "title": "Apes after MOASS - Make sure you enjoy the moment! 🥰", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/31ogsw3V6pSFJ3VNJxVlTYzPGrJnJxeV_CLOb5MYOXo.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://i.redd.it/jwgv1cc0onmb1.jpg", "time": 1694014892.0, "subreddit": "r/ThePPShow", "title": "Just so you know - Pulte will join a spaces call by ChadMojo on GME earnings", "text": null, "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/jwgv1cc0onmb1.jpg\"/></div>"},
{"username": "Milkpowder44", "url": "https://www.reddit.com/r/ThePPShow/comments/167c1p8/lambo_or_loony_bin_20_why_this_sub_thinks_bbbyq/", "time": 1693586183.0, "subreddit": "r/ThePPShow", "title": "Lambo or Loony Bin 2.0 - Why this sub thinks BBBY(Q) is going to go Boom Boom - The Updated Version", "text": "<!-- SC_OFF --><div class=\"md\"><p>What&#39;s up fellow PP&#39;s! Posted the list last week and got some great feedback and extra points to add. A lot of cool bullish news and findings have come out since then, which I tried to add as well. Also decided to group several points into categories that fit together a bit. Will be joining the show tonight to discuss them all and recap the play. Let&#39;s dispel the FUD you awesome pp&#39;s.</p>\n\n<p>Once again, let me know if you have additional points or tweaks. Could use a lot of help on the connections part.</p>\n\n<p>Tinfoil at the bottom. Make sure to protect your nippy&#39;s before reading.</p>\n\n<p>----------------------</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Media FUD, shills &amp; bots</strong></p>\n\n<ul>\n<li>Fake news media/shills/Cramer telling me to sell everyday - ‘SELL OR DIE’</li>\n<li>Paid(!) shills and bots infiltrating Reddit to destroy communities and create FUD, therefore having to migrate every once in a while. When GME/BBBY runs, media always only mention &#39;WSB crowd&#39;</li>\n<li>MSM only dragged GME and BBBY through the mud while pushing that RC bought Alibaba and Nordström. Similar to when MSM/WSB pumped silver during the GME sneeze. RC reacts with the &#39;RC buys all stocks&#39; meme.</li>\n<li>People who were obviously and probably deliberately wrong about the Plan v Book DRS debate, also bash BBBY. Like Pulte said, it&#39;s a great counter-indicator<br/></li>\n</ul>\n\n<p><strong>RC’s personality, vision, why we think he chose to get in BBBY and why we think he didn’t screw us over by selling in August.</strong></p>\n\n<p>RC&#39;s:</p>\n\n<ul>\n<li>long term vision/strategy</li>\n<li>keeping his strategy close to the chest</li>\n<li>reputation and wanting to preserve dad&#39;s legacy, naming his company Teddy after him.</li>\n<li>work ethic (&#39;when I go for something, I swing for the fences&#39;)</li>\n<li>customer delight, pro shareholder</li>\n<li>shared disdain for overpaid execs (Tritton) and shortsellers with Icahn</li>\n<li>found Chewy because he loved his pet and people are willing to spend for what&#39;s the best for them. Guess what people love even more? Babies. RC has young kids.</li>\n<li>not wanting to start a new business from the ground up</li>\n<li>initial investment in BBBY being 40% higher than his initial investment in GME -&gt; 121M!! He walked away with around a billion from Chewy, so it&#39;s not chump change for him at all.</li>\n<li>filing of Teddy trademarks (very similar to BBBY) just before he sold, while his proxies were still on the board</li>\n<li>RC Ventures SIC code updated to match Bed Bath &amp; Beyond’s late 2022</li>\n<li>being very selective with capital allocation. Still hasn&#39;t touched the 1.2B GME warchest</li>\n<li>never sold GME during the sneeze and doesn&#39;t have a salary. He isn&#39;t in it for a quick buck.</li>\n<li>writing a letter to BBBY saying that Baby is a multiple billion dollar company at the time</li>\n<li>loving the memes and reading things in the community (he used to stay up all night reading Chewy reviews, guess what he does now) - he would signal if he was out imo.</li>\n<li>picture/meeting with Icahn and him being an idol to him</li>\n<li>long-time connection with Matt Finestone and web3 stock/NFT marketplace</li>\n<li>ability to recruit huge list of top talent from Amazon, Chewy etc. to GameStop -&gt; RC probably had a good sales pitch for his vision</li>\n<li>RC joined the board of Dragonfly (where Larry Cheng was also on the board) August 2022. Their mission statement highlights their vision to build a next-generation e-commerce platform’ through their investments. The same day he joined, he tweeted that short sellers are the dumb stormtroopers of the galaxy.</li>\n<li>Like Pulte said: either you trust him or you don&#39;t</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Why RC is probably still in</strong></p>\n\n<ul>\n<li>After RC &#39;sold&#39;, Sixth Street swooped in a couple days later with very close to 2 times the amount RC sold for.</li>\n<li>Sixth Street also offered capital through a First In Last Out (FILO) loan. These are commonly used in Leveraged Buyouts (LBOs)</li>\n<li>He bought under his personal name in January 2023, confirmed in court case</li>\n<li>listed as a creditor and interested party in recent dockets</li>\n<li>his name being listed as a co-debtor (as himself but also RC Ventures) in lawsuits about leases (and water bills?)</li>\n<li>form 4 dated 8/16/2022 states that he still had 2.78M shares. RC checked the box acknowledging that he wasn’t subject to section 16 of SEC regulations. Therefore not requiring him to report</li>\n<li>Shelly Lombard (RC&#39;s pick &amp; bond degen lol) still on the board</li>\n<li>RC tweets about BBBY with a moon emoji the same day he filed the Teddy trademarks - a couple days before he &#39;sold&#39;</li>\n<li>Pitchbook showing RC Ventures exited their invested interest in BBBY up until April 23rd, right before Ch.11 filing. </li>\n<li>Pulte said at the PPshow that if he was a betting man, he believes RC is still very much in.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Teddy facts &amp; vision</strong></p>\n\n<ul>\n<li>RC has affinity with building big (e-commerce, customer centric) businesses -&gt; what he did with Chewy, he can do in any category -&gt; he wants to build an Amazon competitor</li>\n<li>Teddy started as an online book store, which Amazon was first as well</li>\n<li>Teddy.com&#39;s terms of service being Amazon-like</li>\n<li>Amazon sells &#39;debranded&#39; stuff, mostly cheap shit and offers no customer support. Huge opportunity to step in as a competitor (Teddy) that sells good products with brand recognition and top customer service.</li>\n<li>Teddy is registered as a bank / financial holding company. They are able to hold NFT securities as custodial assets. Will Teddy be the new Berkshire Hathaway?</li>\n<li>Teddy trademarks went live while BBBYQ was auctioning assets</li>\n<li>Teddy filed global trademarks, going live in Madrid, China, UK among others</li>\n<li>Matt Furlong leaves GameStop after 2 years (ending his non-compete with Amazon), but no sign of where he went next. &#39;Not for long&#39; tweet by RC. RC chose him after an extensive recruiting period, interviewing around 50 candidates, so the tweet is probably not a dig at him. Teddy CEO incoming?</li>\n<li>Teddi trademark</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Which other parties may be in, and why?</strong></p>\n\n<ul>\n<li>Icahn planning something &#39;the shorts will never forget&#39; after the Hindenberg report and attack on IEP</li>\n<li>This play being pretty similar to earlier activist investing plays by Icahn, like Tropicana Casino. He likes to buy companies &#39;when nobody wants them&#39;.</li>\n<li>GameStop (1.1B with RC at the helm of capital allocation), Larry Cheng (675M) and Icahn (3B loan) all building their war chests while hinting towards an acquisition. Haven&#39;t seem to have used them yet (NDA?)</li>\n<li>IEP had a filing where only 16 out of 17 holdings were disclosed. One with a 25b budget was filed to the SEC to be redacted</li>\n<li>Larry Cheng (Dragonfly), RC (Dragonfly) and Brett Icahn (Newell) leaving the board of those companies - Brett selling Newell with 50% loss</li>\n<li>(Tinfoil? / NFT) connections with Lego, Blockbuster, Sears, GameStop, Toys R Us and more. Chewy recently filed NFT trademarks as well.</li>\n<li>Chewy filed for Tylee&#39;s (RC&#39;s late dog&#39;s name) trademarks</li>\n<li>Dream On Me (private company) very obviously had big funding and built a huge warehouse/distribution center. DOM having Jewish/Montreal(15 min distance)/Linkedin connection with RC and they both love baby-businesses</li>\n<li>Dragonfly recently importing a bunch of baby stuff from China while Dream On Me reduced their imports from China sharply</li>\n<li>Overstock have a disdain for shortsellers as well and set a precedent with a NFT dividend. They also own 55% of tZERO.</li>\n<li>GameStop and Loopring now only partner on the NFT Marketplace, and earlier the wallet, but Loopring can operate as a decentralized stock exchange (which they have patents for)</li>\n<li>GameStop has shown that you can fund your warchest by selling some shares during a short squeeze as well as getting a lot of free advertising</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Connections between important actors - NEEDS MORE WORK! Pls help</strong></p>\n\n<p>Board/lawyer/financier connections to Icahn and RC, some notable ones:</p>\n\n<ul>\n<li>RC hiring Icahn’s proxy solicitor Harkins Kovler</li>\n<li>Holly Etlin - Chief Restructuring Officer - Managing Director at AlixPartners (position formerly held by current CEO of IEP)</li>\n<li>Carol Flaton - joined Bbby board - Managing Director at AlixPartners - Former Icahn Associate &amp; was involved in the HP-Xerox hostile takeover</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Fuckery with the price and the total shares outstanding etc.</strong></p>\n\n<ul>\n<li>SHF&#39;s attacking GameStop/BBBY and the baskets’ stock price and more recently IEP. Sometimes the stock price goes straight down in a line.</li>\n<li>Buy/sell ratio being 70/30 or better nearly every day - often being 90/10</li>\n<li>Huge short %, Cost-to-borrow and Failures to deliver (we were on RegSho for over 2 months). Like Mark Cuban said to us in WSB, their goal is to never close their shorts.</li>\n<li>Moments of insane trading volume and price swings on no news.</li>\n<li>Price looking like a barcode at times</li>\n<li>Chart following GME-basket and more recently IEP</li>\n<li>Lawyers billing hours analyzing the share count</li>\n<li>Cede &amp; Co reporting to hold more shares than exist according to all reported TSO counts</li>\n<li>More than a 100M shares owned by under 2000 users on the PP-show sub (disclaimer: these are some of the most hardcore BBBYQ addicts)</li>\n<li>Four shareholders reported to be involved in &gt;4.5% TSO transaction according to dockets</li>\n<li>Possibly a much lower amount of total shares outstanding than expected (VW/Porsche squeeze started because of this!). We were drilled down during dilution news/rumors that can be interpreted multiple ways, like the HBC deal and the B.Riley offering </li>\n<li>DeGiro (EU) showing BBBY as the most traded stock in multiple countries, certain months, despite the EU not even having BBBY stores, nor products sold there. Mr. Worldwide baby.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Why chapter 11 is chosen strategically, and is a good thing for the company</strong>. </p>\n\n<ul>\n<li>🚀🚀JPM ABL being paid earlier than the rest during Ch.11🚀🚀</li>\n<li>In fact: when bankruptcy was announced on a Sunday, the ABL was still there. That Monday at 2 PM in court, the ABL was paid off, by Sixth Street, years in advance. </li>\n<li>Ch.11 moving really fast, some things about it looking pre-packaged</li>\n<li>Kirkland and Ellis lawyer proudly claiming a chance for a ‘successful’ exit out of ch.11</li>\n<li>Ch.11 opening statement by Holly Etlin says outcome to be beneficial for all stakeholders (thus including shareholders). ‘BBBY has pulled long shot transactions in the past and don’t believe we won’t be able to in the future.’</li>\n<li>It&#39;s very common for businesses attempting to do a reverse merger, i.e. merging a private (Teddy) and a public/shell (BBBYQ) company to cheaply go public, to do so during ch.11</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Why the board probably isn’t acting nefariously and why this isn’t a simple chapter 7 - sell all your shit to the highest bidder - bankruptcy</strong></p>\n\n<ul>\n<li>Three weeks after RC wrote his letter to the BBBY board, he reached a cooperation agreement with them, adding his proxies to the board. This can be seen as pretty fast in the activist investing world.</li>\n<li>A LOT of stuff being under NDA  - a lot of lawyer hours billed for confidentiality reasons</li>\n<li>One of the rules of the qualified bid was that you can&#39;t have had a short position in the company</li>\n<li>World class and expensive lawyer team (Kastin, Etlin and more) and M&amp;A specialists are in play - their reputation means a lot to them. Top lawyers don&#39;t just take random assignments, they need a clear scope of work. Why go for an assignment for a 50 year old specialty linen company that’s just closing down its stores? Come on man.</li>\n<li>Sue Gove buying shares (with 200K of her own money) and Kastin getting paid (partly) in shares (vested over January 2024, 2025 and 2026)</li>\n<li>Paying forward Workday (expensive ERP/HR system) and Deloitte for multiple years during ch.11 (once again, judge has to approve payments)</li>\n<li>Lawyer/Lazard fees being higher than the (super low) shared-IP sales of BBBY and Buy Buy Baby</li>\n<li>They still own the distribution center(s) and didn&#39;t auction all the leases</li>\n<li>The first ATM offering was never fully used.</li>\n<li>Dream on Me was the second highest bidder. Why not sell to the highest one?</li>\n<li>Sue Gove was selected by agreement with RC for the BABY strategy committee</li>\n<li>Sue Gove interview days before bankruptcy with a vote in confidence in how company is doing, talking about their multi-year strategy</li>\n<li>David Kastin making positive &amp; optimistic comments about the situation on LinkedIn when the situation was looking dire to the community</li>\n<li>Lazard, who have to broker a deal, still getting paid monthly fees in July - job’s not done</li>\n<li>If shares were getting wiped out by September 12th, why aren’t we trading much closer to zero already?</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Why a merger/acquisition/carve-out is in play</strong></p>\n\n<ul>\n<li>Pitchbook (~25k/year data source) showing company going private through merger/LBO per January 13th 2023</li>\n<li>Payments to Lazard and price action (from $1.48 to $5.47) lining up with that Pitchbook data</li>\n<li>The ABL loan was defaulted on. One of the reasons for a default is a change of control</li>\n<li>The cooperation agreement was never terminated, not even after RC sold. It was reiterated by Sue Gove in an 8k filing August 31.</li>\n<li>RC reserves the right to hold the board accountable per his letter, but he never did. He also held the right to assign new board members but he never did - implying job’s done?</li>\n<li>Making a qualified bid was made extremely difficult (on purpose because a deal&#39;s already on the table?)</li>\n<li>Canceling the auctions (same reason?)</li>\n<li>Lawyers billed 600+ hours for M&amp;A activity. Lazard billing 44 hours in July</li>\n<li>Lawyers billed 8.5 hours for ‘prepare disclosure schedules for carveout asset purchase agreement’ </li>\n<li>Bankruptcy court has to approve all payments</li>\n<li>Sue Gove having a terrible poker face saying &#39;I haven&#39;t heard about those rumors&#39; when asked about M&amp;A in the E-Toro interview (that was filed to the SEC)</li>\n<li>Buy Buy Baby 2.0 relaunching under new ownership - hiring (former) Baby execs. Some of those left in 2021.</li>\n<li>Lawyers billing hours on 7/11 drafting correspondence regarding &#39;closing of BABY acquisition&#39;</li>\n<li>Lazard billing hours for &#39;sale process workstreams (data transition)’ under the M&amp;A code</li>\n<li>Lazard billing hours for &#39;transition call with going concern buyers&#39;, 4 days after the going concern auction was cancelled</li>\n<li>Lawyers billing hours &#39;drafting correspondence re 10-K disclosures on share issuance&#39; (so it can&#39;t be about the previously filed 10-K). 10-K&#39;s can be used to disclose terms of M&amp;A&#39;s</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Why shareholders aren’t going to be wiped out.</strong></p>\n\n<ul>\n<li>Shareholders can&#39;t be wiped out if the company wants to preserve the 1.6B (and possibly much larger) NOL&#39;s. These are a very valuable asset, confirmed by company in a 10k</li>\n<li>Bondholders agreeing to a 0 to 2.5% cash return. Will they be made whole with equity swap?</li>\n<li>Lawyers billing hours for &#39;voluntary delisting&#39;, which can happen after merger/acquisition, and more hours billed for activities regarding legacy shares</li>\n<li>Lawyers billing hours for analyzing creditors &amp; entities regarding Supplemental Plan. Supplemental Plan can add shareholder recovery. Who are the entities?</li>\n<li>Lawyers billing hours late July 2023, &#39;instructing AST&#39; </li>\n<li>Lawyers billing hours &#39;corresponding with AST and directors re issuance of common stock per awards exercise&#39;</li>\n<li>Lawyers billing hours reviewing and analyzing disclosure agreements and the delisting process (if you issue new shares you have to delist the old ones)</li>\n<li>On 7/31, lawyers addressed the SEC objection to the plan. Travis/Jake do not foresee the SEC objecting anything that has to do with liquidation. Shares are in play.</li>\n<li>Lawyers billing hours for writing a new 8-K in late July. 8-K&#39;s are to announce significant events relevant to shareholders</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Other</strong></p>\n\n<ul>\n<li>Great community and ultra loyal diamond handed shareholders with some huge wrinkled brains posting and peer-reviewing every little piece of info every single day and coming to a common understanding.</li>\n<li>Holly Etlin saying in court that BBBY is a 5 billion dollar company</li>\n<li>Holly Etlin saying “there will be a story told about what happened here but it&#39;s not my story to tell right now”</li>\n<li>Sixth Street expanded the FILO loan in February by $100 million despite already knowing that Lazard and the board were soliciting going concern buyers in December.</li>\n<li>BBBY drastingly reduced debt from 5+ to around 1.5 billion during ch.11. 1B in unsecured bonds and 473M in secured debt. Possibly reducing even more debt after debt-to-equity conversion?</li>\n<li>Mysterious bond buying in large quantities by somebody for pennies on the dollar</li>\n<li>RC having some of the same lawyers as Pulte. Pulte’s also one of the only ones that RC interacts with.</li>\n<li>Pulte, who’s also big on his reputation, joined the pp show with a terrible poker face. Praising PPseeds and Kais later on and the community as a whole, saying that we are the future presidents and CEO’s - why would he do all that if we&#39;re going to zero?</li>\n<li>Pulte interacting in subreddits like Superstonk, Beyond Uranus and ThePPshow, even when they had a lot less subs. Also interacting on twitter and joining spaces calls with hardcore BBBY figures.</li>\n<li>Currently the valuation of BBBYQ seems like it&#39;s based on ch. 7 bankruptcy. EVEN IF RC and Icahn aren&#39;t in, but we still emerge from ch.11 successfully, we moon.</li>\n<li>There’s still a lot of brand value</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>The holy grail a.k.a. de Nachtwacht a.k.a. God-tier DD</strong></p>\n\n<ul>\n<li>Tumbleweed DD</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Some of the most fun tinfoil:</strong></p>\n\n<ul>\n<li>RC&#39;s first buy-in was at January 13th 2022, 1 million shares with an average of 14,769 (741 backwards and 69)</li>\n<li>RC tweet “You know you’ve made it when you buy a turtleneck” around the January 13 2023 events</li>\n<li>RC liked the Shorts Strike Back tweet (with photoshopped heads of Etlin, Icahn, Pulte, RC and more).</li>\n<li>Pulte tweet that RC liked of a meme of them sitting on a horse before a BBBY store with Icahn behind it</li>\n<li>Pulte replying eyes emoji to a tweet saying “Pulte says what RC can’t. Just know this”</li>\n<li>Pulte confirms that Only the Young is about RC and other young leaders who will transform the market</li>\n<li>Pulte with the cigar tweet. Can&#39;t tell about it since he&#39;s under NDA.</li>\n<li>Pulte during the PP show saying that he recently invested in a guy *we would all know*, that&#39;s going to be worth 100B in the future, but can&#39;t tell who it is because of an NDA. He said he hasn&#39;t invested in BBBYQ (yet), but maybe he did invest in Teddy? A dude potentially worth 100B must be building a conglomerate.</li>\n<li>Only the young song lyrics</li>\n<li>RC winking when talking about shorts in the GMEdd interview</li>\n<li>Icahn and RC with the Jewish connection and going to the same synagogue in Florida</li>\n<li>‘RC buys all the stocks tweet’ having 4:07 timestamp in it, posted around the time that BBBY’s price was also (around) $4.07</li>\n<li>The GameStop/Gmerica NFT having a winking Teddy Roosevelt</li>\n<li>Patty Wu and Pulte quoting Teddy Roosevelt</li>\n<li>Teddy bear showing up everywhere - most notably during on top of a towel during a court hearing</li>\n<li>&quot;All in Teddi&quot; trademark live, filed by Teddy holdings</li>\n<li>The &#39;13&#39; belt in the Teddy books - hinting at the January 13th transaction?</li>\n<li>Kingston and Princeton from the Teddy Books named after the towns close to the DOM distribution centre?</li>\n<li>Protocol Gemini tweeting BBBY emoji&#39;s after we went up for a little bit</li>\n<li>741 = 369 (Nikola Tesla). GameStop sneeze was 33,333 days after Black tuesday in 1929</li>\n<li>Icahn showing the clock with 1:47 PM on it, exactly at 7.41 seconds in a video and having a bahamas map behind him</li>\n<li>Pirate flag emoji&#39;s posted by RC and some prominent Loopring and NFT Marketplace people - hostile takeover?</li>\n<li>Tweets between Blockbuster and RC signaling they may come back from the dead</li>\n<li>RC tweeting Benjamin Franklin two weeks after property on 45 Veronica Ave, Franklin Twp (DOM) was sold to Miami Acquisition LLC</li>\n<li>Larry Cheng included ‘and beyond’ in a tweet about Volition Capital funds, which he didn’t include on LinkedIn. Posted 10 minutes after BBBYQ extended 10Q was filed, after not tweeting for 5 months</li>\n<li>RC tweeting Animals and babies must be protected at all costs</li>\n<li>David Kastin’s Instagram story, tapping (high alcohol%) drinks with Holly Etlin and more around 11 A.M. after a court hearing(?)</li>\n<li>GameStop tweeting a horse at the exact deadline of the stalking horse bid</li>\n<li>Gamestop NFT strangely worded tweet ‘The BBQs are stocked and fireworks are ready’ in a tweet</li>\n<li>Michael has seen the GMErican dream</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Short sellers have INFINITE RISK.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>All just cohencidences?</strong> </p>\n\n<p><strong>Lambo or Loony bin. No cell no sell.</strong></p>\n\n<p><strong>The best time to be alive is now.</strong></p>\n\n<p><strong>Not financial advice.</strong></p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Milkpowder44", "url": "https://www.reddit.com/r/ThePPShow/comments/1623sll/lambo_or_loony_bin_a_comprehensive_list_of/", "time": 1693077069.0, "subreddit": "r/ThePPShow", "title": "Lambo or Loony Bin - A comprehensive list of reasons why this community thinks BBBY(Q) is going to go Boom Boom. Input/feedback appreciated.", "text": "<!-- SC_OFF --><div class=\"md\"><p>So yesterday in another post, I started typing a list of reasons why I&#39;m still buying and holding the stock, and more and more reasons came to me. PP read it yesterday at the end of the show and just messaged me that as I keep updating the list, we can go over the list on a weekly basis. </p>\n\n<p>If you have some stuff to add or want to poke some holes here and there, please let me know! I will try to do this myself as well. Please note, as you can read in the list, that the points I go over are pretty much big picture and I try not to get too lost in the details writing these.</p>\n\n<p>Any feedback on the presentation would be welcome as well. Should we sort by category or put the most undeniable Mona Lisa pieces of evidence at the top, for example? </p>\n\n<p>&#x200B;</p>\n\n<p>So here comes the list:</p>\n\n<p>Pitchbook data (\\~25k/year data source) showing company going private through merger/LBO per January 13th</p>\n\n<p>Payments to Lazard lining up with Pitchbook data</p>\n\n<p>RC&#39;s:</p>\n\n<p>* long term vision/strategy</p>\n\n<p>* keeping his strategy close to the chest</p>\n\n<p>* reputation and wanting to preserve dad&#39;s legacy, naming his company after him.</p>\n\n<p>* work ethic (&#39;when I go for something, I swing for the fences&#39;)</p>\n\n<p>* customer delight, pro shareholder</p>\n\n<p>* shared disdain for overpaid execs (Tritton) and shortsellers with Icahn</p>\n\n<p>* filing of Teddy trademarks (very similar to BBBY) while his proxies are still on the board</p>\n\n<p>* found Chewy because he loved his pet and people are willing to spend for what&#39;s the best for them. Guess what people love even more? Babies.</p>\n\n<p>* affinity with building big (e-commerce, customer centric) businesses -&gt; what he did with Chewy, he can do in any category -&gt; Amazon competitor</p>\n\n<p>* not wanting to start a new business from the ground up</p>\n\n<p>* initial investment in BBBY being \\~50% higher than his initial investment in GME -&gt; 124M!! He walked away with around a billion from Chewy, so it&#39;s not chump change for him at all.</p>\n\n<p>* never sold GME during the sneeze. He isn&#39;t in it for a quick buck.</p>\n\n<p>* writing a letter to BBBY saying that Baby is a multiple billion dollar company at the time</p>\n\n<p>* buying under his personal name in January 2023</p>\n\n<p>* listed as a creditor and interested party in dockets</p>\n\n<p>* loving the memes and reading things in the community (he used to stay up all night reading Chewy reviews, guess what he does now)</p>\n\n<p>* picture/meeting with Icahn and him being an idol to him</p>\n\n<p>* long-time connection with Matt Finestone and web3 stock/NFT marketplace</p>\n\n<p>* ability to recruit huge list of top talent from Amazon, Chewy etc. to GameStop -&gt; RC probably had a good sales pitch for his vision</p>\n\n<p>After RC &#39;sold&#39;, Sixth Street swooped in a couple days later with exactly 2 times the amount RC sold for.</p>\n\n<p>Fake news media/shills/Cramer telling me to sell everyday - ‘SELL OR DIE’</p>\n\n<p>MSM only dragged GME and BBBY through the mud while pushing that RC bought Alibaba and Nordström. Similar to when media/WSB pumped silver during the GME sneeze. RC reacts with the &#39;RC buys all stocks&#39; meme.</p>\n\n<p>Shills infiltrating on Reddit to destroy communities and create FUD, therefore having to migrate every once in a while.</p>\n\n<p>SHF&#39;s attacking RC/GameStop/BBBY stock price and more recently IEP</p>\n\n<p>Shareholders can&#39;t be wiped out if company wants to preserve NOL&#39;s (very valuable asset)</p>\n\n<p>Making a qualified bid was made extremely difficult (on purpose because a deal&#39;s already on the table?)</p>\n\n<p>Canceling the auctions (same reason?)</p>\n\n<p>World class lawyer team (Kastin, Etlin and more) - their reputation means a lot to them. Top lawyers don&#39;t just take random assignments, they need a clear scope of work.</p>\n\n<p>Sue Gove buying shares (with 200K of her own money) and Kastin getting paid (partly) in shares</p>\n\n<p>Holly Etlin saying in court she feels this is a $5 B company still</p>\n\n<p>Lawyers billed 600+ hours for M&amp;A activity</p>\n\n<p>Board/lawyer/financier connections to Icahn and RC</p>\n\n<p>Lawyer/Lazard fees being higher than the (super low) IP sales of BBBY and Buy Buy Baby</p>\n\n<p>Judge having to approve all payments in bankruptcy court</p>\n\n<p>🚀🚀JPM ABL being paid earlier than the rest during Ch.11🚀🚀</p>\n\n<p>* In fact: bankruptcy was announced on a Sunday, the ABL was still there. That Monday at 2 PM in court, the ABL was paid off (by Sixth Street). Thus ch.11 was strategic</p>\n\n<p>Ch.11 outcome said to be beneficial for all stakeholders (thus including shareholders)</p>\n\n<p>It&#39;s very common for businesses attempting to do a reverse merger, i.e. merging a private (Teddy) and a public/shell (BBBYQ) company to cheaply go public, to do so during ch.11</p>\n\n<p>BBBY drastingly reduced debt from 5+ to around 1-1.5 billion during ch.11. Possibly debt-free after debt-to-equity conversion?</p>\n\n<p>Teddy.com&#39;s terms of service being Amazon-like</p>\n\n<p>Teddy is registered as a bank and/or financial holding company</p>\n\n<p>Teddy trademarks going live while BBBYQ was auctioning assets</p>\n\n<p>RC Ventures SIC code updated to match Bed Bath &amp; Beyond’s late 2022</p>\n\n<p>Mysterious bond buying in large quantities by somebody for pennies on the dollar</p>\n\n<p>Shelly Lombard (RC&#39;s pick) still on the board</p>\n\n<p>RC having some of the same lawyers as Pulte</p>\n\n<p>Pulte, who RC sometimes communicates with (on Twitter), joining the pp show with a terrible poker face, and praising PPseeds and Kais later on - why would he do that if we&#39;re going to zero?</p>\n\n<p>Sue Gove having a terrible poker face saying &#39;I haven&#39;t heard about those rumors&#39; when asked about M&amp;A in the E-Toro interview (that was filed to the SEC)</p>\n\n<p>Sue Gove interview days before bankruptcy with a vote in confidence in how company is doing.</p>\n\n<p>Icahn planning something &#39;the shorts will never forget&#39;</p>\n\n<p>This play being pretty similar to earlier activist investing plays by Icahn. He likes to buy companies &#39;when nobody wants them&#39;.</p>\n\n<p>GameStop (with RC at the helm of capital allocation), Larry Cheng and Icahn all building their war chests while hinting towards an acquisition. Haven&#39;t seem to used them yet (NDA?)</p>\n\n<p>When RC joined Dragonfly board, he tweeted the same day that short sellers are the dumb stormtroopers of the galaxy</p>\n\n<p>RC tweets about BBBY with a moon emoji 5 days before he ‘sold’</p>\n\n<p>Larry Cheng, RC and Brett Icahn leaving other boards (Dragonfly, Newell) - Brett selling with 50% loss</p>\n\n<p>Matt Furlong leaving GME but no sign of where he went next. &#39;Not for long&#39; tweet by RC. RC chose him after an extensive recruiting period, interviewing around 50 candidates, so the tweet is probably not a dig at him. Teddy CEO incoming?</p>\n\n<p>Buy/sell ratio being 70/30 or better nearly every day - often being 90/10</p>\n\n<p>Huge short %, Cost-to-borrow and Failures to deliver (we were on RegSho for over 2 months)</p>\n\n<p>Insane trading volume at times</p>\n\n<p>Possibly a much lower amount of total shares outstanding than expected. We were drilled down during dilution news/rumors that can be interpreted multiple ways.</p>\n\n<p>Chart following GME/basket and more recently IEP</p>\n\n<p>A LOT of stuff being under NDA - if you ctrl+F in some dockets and look for M&amp;A, a lot of stuff is hidden</p>\n\n<p>Paying forward Workday (expensive ERP/HR system) and Deloitte for multiple years during ch.11 (once again, judge has to approve payments)</p>\n\n<p>Great community and ultra loyal diamond handed shareholders - with some huge wrinkled brains posting and peer-reviewing every little piece of info every single fucking day and coming to a common understanding.</p>\n\n<p>More than a 100M shares owned by under 2000 users on the PP-show sub (disclaimer: these are some of the most hardcore BBBYQ addicts)</p>\n\n<p>Dream On Me (private company) very obviously had big funding and built a huge warehouse/distribution center. DOM having Jewish/Montreal(15 min distance)/Linkedin connection with RC and they both love baby-businesses</p>\n\n<p>Dragonfly recently importing a bunch of baby stuff from China while Dream On Me reduced their imports from China sharply</p>\n\n<p>Buy Buy Baby 2.0 relaunching under new ownership - hiring (former) Baby execs</p>\n\n<p>Icahn and RC with the Jewish connection and going to the same synagogue in Florida</p>\n\n<p>(Tinfoil? / NFT) connections with Lego, Blockbuster, Sears, GameStop, Toys R Us and more</p>\n\n<p>Overstock have a disdain for shortsellers as well and set precedent with a NFT dividend</p>\n\n<p>GameStop has shown that you can fund your warchest by selling some shares during a short squeeze</p>\n\n<p>Amazon sells &#39;debranded&#39; stuff, mostly cheap shit there and no customer support. Huge opportunity to step in as a competitor (Teddy) that sells good products with brand recognition and top customer service.</p>\n\n<p>If the shares are getting canceled/liquidated/whatever, why aren’t we trading at 0 or pennies yet?</p>\n\n<p>Currently the valuation of BBBYQ seems like it&#39;s based on ch. 7 liquidation. EVEN IF RC and Icahn aren&#39;t in, but we still emerge from ch.11 successfully, we moon.</p>\n\n<p>TA by U-Copy</p>\n\n<p>&amp;#x200B;</p>\n\n<p>Pretty much none of this DD is my own so thanks again to all the great DD writers and wrinkle brains in the comments on this sub.</p>\n\n<p>&amp;#x200B;</p>\n\n<p>Some of the most fun tinfoil:</p>\n\n<p>* RC&#39;s first buy-in was at January 13th 2022, 1 million shares with an average of 14,769 (741 backwards and 69)</p>\n\n<p>* RC liking the Shorts Strike Back tweet (with photoshopped heads of Etlin, Icahn, Pulte, RC and more).</p>\n\n<p>* The GameStop/Gmerica NFT having a winking Teddy Roosevelt</p>\n\n<p>* Patty Wu and Pulte quoting Teddy Roosevelt</p>\n\n<p>* Teddy bear showing up everywhere - most notably during a court hearing</p>\n\n<p>* The &#39;13&#39; belt in the Teddy books - hinting at the January 13th transaction?</p>\n\n<p>* Kingston and Princeton from the Teddy Books named after the towns close to the DOM distribution centre?</p>\n\n<p>* Protocol Gemini tweeting BBBY emoji&#39;s after we went up for a little bit</p>\n\n<p>* 741 = 369 (Nikola Tesla). GameStop sneeze was 33,333 days after Black tuesday in 1929</p>\n\n<p>* Icahn showing the clock with 1:47 PM on it, exactly at 7.41 seconds in a video and having a bahamas calendar(?) behind him</p>\n\n<p>* Pirate flag emoji&#39;s posted by RC and some prominent Loopring and NFT Marketplace people</p>\n\n<p>* Tweets between Blockbuster and RC signaling they may come back from the dead</p>\n\n<p>* RC tweeting Benjamin Franklin two weeks after property on 45 Veronica Ave, Franklin Twp (DOM) was sold to Miami Acquisition LLC</p>\n\n<p>* RC tweeting Animals and babies must be protected at all costs</p>\n\n<p>* GameStop tweeting a horse at the exact deadline of the stalking horse bid</p>\n\n<p>* Pulte with the cigar tweet. Can&#39;t tell about it since he&#39;s under NDA.</p>\n\n<p>* Pulte during the PP show saying that he recently invested in a guy *we would all know*, that&#39;s going to be worth 100B in the future, but can&#39;t tell who it is because of NDA. He said he hasn&#39;t invested in BBBYQ (yet), but maybe he did invest in Teddy?</p>\n\n<p>* Michael has seen the GMErican dream</p>\n\n<p>&amp;#x200B;</p>\n\n<p>Lambo or Loony bin. Not financial advice.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Milkpowder44", "url": "https://i.redd.it/794w2hhk44fb1.png", "time": 1690727420.0, "subreddit": "r/ThePPShow", "title": "Patty Wu is 'excited to see David rebuild the buybuy BABY retail team as they relaunch with new ownership.' 👀👀👀", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/794w2hhk44fb1.png\"/></div>"}]