[{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17wiix3/the_chairwoman_of_beyond_allison_abraham_needs_to/", "time": 1700125654.0, "subreddit": "r/ThePPShow", "title": "The Chairwoman of Beyond Allison Abraham needs to step down!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Allison Abraham, is your work at $BYON $OTSK going to be scrubbed from your resume just like your work as president and director at Lifeminders? It would be sad to see Overstock on a list next to one of the biggest scams in history, Enron, and other notable pump and dump schemes just as Lifeminders is. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5yl7m7ieeo0c1.png?width=854&amp;format=png&amp;auto=webp&amp;s=76221ee67e478f84f4b2199269bfa66f9ecaa908\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5yl7m7ieeo0c1.png?width=854&amp;format=png&amp;auto=webp&amp;s=76221ee67e478f84f4b2199269bfa66f9ecaa908\" alt=\"https://preview.redd.it/5yl7m7ieeo0c1.png?width=854&amp;format=png&amp;auto=webp&amp;s=76221ee67e478f84f4b2199269bfa66f9ecaa908\"></a></p>\n\n<p>You joined Overstock right as it went public in 2002, and in 2006 when incontrovertible evidence of proxy voting disruption, what did you do?</p>\n\n<p>To say it nicely, it seems you have taken a very passive, possibly complicit even, role in the company, and the performance of the company reflects the structure that supported that approach. It is something you almost seem proud of. </p>\n\n<p>You have said many times, “The most important thing a board member can do is pick a CEO.”</p>\n\n<p>When a board is run well and everyone is competent and engaged, who the CEO is, is rather arbitrary. It is obvious that many members of the board are either not competent or engaged, and that shareholder values are not considered.</p>\n\n<p>In a recent interview you said:</p>\n\n<p>“I think for me, and this is kind of the buzzword at the moment, really trying to be intentional. I look back at my career and I wish I had been more intentional in those moments. So, when you take how I joined the overstock board, that was not intentional. That was a good opportunity, but not intentional. Staying on the board was intentional, because there were many times I thought, ‘maybe I should not be doing this…’ I have that tendency to get caught up in the day-to-day. I am super busy; I am very productive; I don’t get enough done; I’m exhausted at the end of the day; I want to make sure I accomplish something, but the problem with that is that time goes by and you may or may have not accomplished what you set out to do. You were busy, but you may not have, you know, intentionally chosen a path, and then not executed on that path.”</p>\n\n<p>For context, you explained how you got on the board, “So back in 2002 one afternoon I got a phone call and it was from a current board member of Overstock who I had worked with a couple years prior(which was Lifeminders. Conveniently she didn&#39;t say the name of the person or the company) and he said, ‘hey, we need a women who’s got internet experience to join our board because we are going public. You know, are you interested?’&quot; </p>\n\n<p>&quot;So I really didn’t know anything about overstock and you know I was kind of flattered, and I thought that was a good opportunity. Explain to me a little bit. And I said, you know, I would like to think about that. So I thought I was going to have time to do some research  and you know, look at the industry, and think a little bit about. Would that be a good opportunity for me? And less than an hour later, the CEO of Overstock called me and said, ‘Glad you are joining the board, we’ve already done all the paperwork. Our first board meeting is Friday. Someone will call you to tell you how to join.  Our in person board meeting is in June, and I need you to fly to Salt Lake City.’ I explained to him that I was 8 months pregnant at the time and he just said, don’t worry about it, bring it along, it will all be fine. And so I had my first call that week, it was a complete whirlwind…”</p>\n\n<p>It seems painfully obvious the trend here. I almost don’t even want to point it out, but it can’t be swept under the rug. It seems you were appointed to the board just to make sure the CEO stayed in power, and they were willing to pay you 300k a year to do just that. You were there, just like in the interview, to support the then CEO Johnathan Johnson who was making $3 million dollars a year. There is a reason he mentioned growth by revenue, because Beyond has lost tens of millions of dollars the last 5 quarters, and lost a lot of money 3 out of the last 5 years. The anomaly of the pandemic seems to be the only time Beyond actually made money. </p>\n\n<p>This interview was only a year ago. I understand that we are all human, but as a shareholder, your own words and your track record do not instill any confidence that you can successfully run a company with so much potential like Beyond. You should just focus on the only thing you said you did intentionally which was start your private school...in Virginia...a long way away from the headquarters of Beyond.</p>\n\n<p>If you drag your feet in passing the torch to a very competent, very enthusiastic person such as Marcus Lemonis, the breach of your fiduciary responsibility will be undeniable. There are likely several members of the board who were placed in the same position as you, to serve the same role. Those positions should be refreshed as well. </p>\n\n<p>This is not a trivial matter. Things have changed since the financial wild west of the 2000s. 2008 has made people look at accountability a lot different now. People are watching. Do the right thing!</p>\n\n<p>Here is the <a href=\"https://youtu.be/lJYg5B9SGmQ?si=wioj8YwcNSuan2Tl\">interview</a> if any shareholders are unaware who is steering the ship at Beyond as Chairwoman. </p>\n\n<p>Here is the <a href=\"https://x.com/MindandEmotion7/status/1725076722285248784?s=20\">tweet thread</a> </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/F9PiIo1iLrBQXRoKZFZnBKDdrYNOTz_c8DMwhiQ5leo.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17w1col/is_the_exclusivity_period_ending_something_to/", "time": 1700076061.0, "subreddit": "r/ThePPShow", "title": "Is the exclusivity period ending something to worry about?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Can a bad actor come in and buy bbbyq November 20th when the exclusivity period ends to stop MOASS?\nNo. \nWith the 10.8 Billion dollar claim, any bidder would have to bid more than that. The debt currently is less than 2 billion, and so any amount more than that would mean money would have to go to shareholders. No class can get more than 100% if any class remains impaired. \nObjections to the plan have to be submitted by November 21st, so we might not be able to know anything until then. The court hearing for those objections will be the 30th. \nBuyBuy Baby opens their doors November 18th, and though they own the leases, they don&#39;t own the staff, also, they only purchased the rights to the website and to use trademarks online. However, they are guarantures. With DOM as guarantures and Sixth Street as debtor in possession, we are in good hands. Our shares are still sitting in a trust, and chapter 11 restructuring is not over yet. \nWith bbbyq returning to business before chapter 11 is over, that means that distrubution will be recalculated. They wouldn&#39;t have left that door open if the plan was to wipe out shareholders. There have been several reorganization plans, each involving AST and the SEC. Each has had objections, but also each time those objections have been delt with and a new ammended reorganization plan comes out. \nIt&#39;s not a matter of if but when the reorganization plan goes through. If a debt to equity happens, then any bid more than 300m would keep us intacted. Without a debt to equity conversion any bid more than 2b would keep us intact. If that bid is offered in equity, then shorts would have to cover.\nWhat are the odds that someone will want to bid more than $2b for a company that poorly run last year was doing $5b of revenue? \nAdd on top of that 1.6B of Net Operating Loss carry forwards just from 2022, and likely a similar amount from 2021 and 2023. Add on that ability to raise money without the long process of an IPO, by doing a reverse merger into a company with the most loyal shareholders, and potentially well over 100% of the total shares outstanding in borrowed shares. That means guaranteed buyers in a secondary offering. \nBbby is not just a shell company though. It might contain several shell companies that can be carved out, but it does have an experienced staff ready to go. Patty Wu, right before chapter 11 went around to each store and met all the employees of buybuy baby. The best of the best could have been noticed then and now handpicked for this new grand reopening. \nBBBY will emerge ready for an omni-channel experience the likes of which have never been seen. Patnered now with Overstock/Beyond, and with potential partners like Riteaide, Party city, Sears, Gamestop, Flexport, Prologis, and more, it will be a level above any competition. \nKnow what you hold!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17shbxw/tangential_topics_for_the_show_tonight/", "time": 1699659979.0, "subreddit": "r/ThePPShow", "title": "Tangential topics for the show tonight", "text": "<!-- SC_OFF --><div class=\"md\"><p>The BBBY thesis has never been just about a big box towel store. Ryan Cohen is aiming to build the Ultimate destination for each sector of the market, both brick and mortar and online. What this will look like I feel might have quite a bit of room for what people like us want it to look like, and so I think we should discuss it. </p>\n\n<p>We would love to have people come and share their opinion on the PPshow tonight. </p>\n\n<p>What topics are you most interest in. </p>\n\n<p><a href=\"https://www.reddit.com/poll/17shbxw\">View Poll</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17qs49i/dont_lose_sight_the_war_is_real/", "time": 1699468208.0, "subreddit": "r/ThePPShow", "title": "Don't lose sight! The war is real!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Some of you have never been in a real fight and it shows. \nIn war each side has their troops and their warchest. \nI understand the importance of not falling for a distraction set out by the enemy, but that shouldn&#39;t come at the expense of not looking for current or potential allies critical to winning the war.\nI realize that much of the hate or trolling is legitimate paid shills, but if you are not a shill and yet your thesis is &quot;worthless shares in an echo chamber + RC or Icahn = Infinite Tendies&quot; then you might want to expand your perspective. Goldman Sachs, Citadel, Virtu, and all the overpaid executives and consultants are not just going to roll over and die. If you think they are not in all out war, and their is billions or trillions of dollars at stake, then I don&#39;t know what to tell you. \nCan anyone name me one public company that doesn&#39;t have the board full of puppets from McKinsey, BCG or Bain Capital consultants? \nDo you realize that every board member puppet they have is a very strategically placed soldier, who controls the resources and can build the war chest? \nFor any one single person or company to have a chance against the current financial regime, they would have at least have to have influence in at least one of each sector of the financial world to even have a change. You would need at least one friendly bank, one friendly big tech company, one media company, and one of every major sector of the market. The ppshow and community is doing an excellent job of becoming a viable challenger to mainstream financial news, but alone we are nothing. Luckily we do have people ready with a war chest supporting the show and the community. Every time we help a community member who falls on hard times or give a super chat even small, it shows the allies we are there for each other and it shows the enemy that we are ready for war. \nSeeing how many people donate, and how many people are ready and willing to throw down $500 was impressive and inspiring. I imagine the enemy realized we are not the poor stupid degens they characterize us as. That was the best part of the Pulte meet up. Every person there was fiercely intelligent and heart-warmingly genuine. That is why the enemy will lose, is because they have no friends. They have no one who when push comes to shove won&#39;t betray them. We are pushing them close to the tipping point. It would be a shame to crumble right before they do. \nI think we have already won, we are holding a royal flush, but that does not mean the enemy can&#39;t just flip the table. \nHow are they going to flip the table? They are going to make it seem like we are just an outlier, and that the system doesn&#39;t need to change.\nThey need to know that we aree an outlier nor is Bed Bath and Beyond. We are growing, there are people fed up with the rigged system and are learning how to take matters into their own hands. The time of no one noticing wallstret corruption is ending. We have figured out their game and we are getting the word out. We are realizing that we have be trained to feel helpless and that there is some invisible barrier between us and the people on the boards of the public companies we hold. I have met a lot of people in this community who not only are more than capable enough but will actually be on the boards of big companies. Mark my words Searsforever will be on the board of Sears, Redacted will be on the board of Riteaide, and many more! \nThink bigger! Believe in yourselves! And look for the allies, because there are many out there! I have only seen a few of those allies in person, but I have seen more than enough to feel confident who I am fighting shoulder to shoulder with. If you haven&#39;t met Bill Pulte in person yet you might not understand, but I have and I can tell you, that at the end of the day there are really only two sides in this nation-level battle, there are warriors like Bill Pulte and Dumbass Parasites like Ryan Marshall. I have not yet met Marcus Lemonis in person but I have a hunch he is a warrior as well. \nMany people do not seem to understand how Bill feels about PHM. I am not speakiny for him, it is just obvious to anyone who has taken more than a second to think about it. He is watching some parasitic piece of shit and his wallstreet cartel which infects the entire market get stronger day after day on the blood of the company his grandfather built from the ground up. \nIf you can&#39;t see the importance of one of the top three biggest homebuilder companies to the health of the entire economy you might want to learn something about 2008. If you can&#39;t see the importance of looking for the people that are building a better world in contrast to the people who are tearing it down, just look into any time in history where everything crashed.\nFight the good fight or get out of the way.</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17ophez/i_feel_so_validated_by_gamestop_right_now_i_also/", "time": 1699228447.0, "subreddit": "r/ThePPShow", "title": "I feel so validated by GameStop right now! I also feel more than ever we are either in a simulation or this whole play has been in the works for a long time.", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/y03anvv9amyb1.png?width=902&amp;format=png&amp;auto=webp&amp;s=c133b85c935dd76bfaff215eb44f18b1554d534c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/y03anvv9amyb1.png?width=902&amp;format=png&amp;auto=webp&amp;s=c133b85c935dd76bfaff215eb44f18b1554d534c\" alt=\"https://preview.redd.it/y03anvv9amyb1.png?width=902&amp;format=png&amp;auto=webp&amp;s=c133b85c935dd76bfaff215eb44f18b1554d534c\"></a></p>\n\n<p><a href=\"https://preview.redd.it/ygufrqi3amyb1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=4a5ffcfd91d174fe037209f1b808d4f404d6be3c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ygufrqi3amyb1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=4a5ffcfd91d174fe037209f1b808d4f404d6be3c\" alt=\"https://preview.redd.it/ygufrqi3amyb1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=4a5ffcfd91d174fe037209f1b808d4f404d6be3c\"></a></p>\n\n<p><a href=\"https://x.com/GameStop/status/1721312094119759944?s=20\">https://x.com/GameStop/status/1721312094119759944?s=20</a> </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/wJ9uPXBQB1YisDspMsBacanAvt_gYQRx0SOqF778bN4.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/8qs0ljlkptxb1.jpg", "time": 1698882401.0, "subreddit": "r/ThePPShow", "title": "Why the Cactus?", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/8qs0ljlkptxb1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17loxdb/why_a_cactus_rc_tin/", "time": 1698879718.0, "subreddit": "r/ThePPShow", "title": "Why a cactus? RC Tin", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/pin3k8bwgtxb1.png?width=1460&amp;format=png&amp;auto=webp&amp;s=9fb1a563a771bcd2f64e6db5d218ca254abd67ab\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/pin3k8bwgtxb1.png?width=1460&amp;format=png&amp;auto=webp&amp;s=9fb1a563a771bcd2f64e6db5d218ca254abd67ab\" alt=\"https://preview.redd.it/pin3k8bwgtxb1.png?width=1460&amp;format=png&amp;auto=webp&amp;s=9fb1a563a771bcd2f64e6db5d218ca254abd67ab\"></a></p>\n\n<p>Cactus inc? &quot;Fewer trips into the cellar? </p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/U-qiH_EwDLjrfxIdlaB7IlJ5qTl2bC0q8QBffOsowZA.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17lid2y/rc_tweet_tin_flex_port/", "time": 1698862259.0, "subreddit": "r/ThePPShow", "title": "RC Tweet Tin: Flex Port?", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/p7dndud1zrxb1.png?width=751&amp;format=png&amp;auto=webp&amp;s=c222555ac8c195e1a6816859976f2ab9c16207fd\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/p7dndud1zrxb1.png?width=751&amp;format=png&amp;auto=webp&amp;s=c222555ac8c195e1a6816859976f2ab9c16207fd\" alt=\"https://preview.redd.it/p7dndud1zrxb1.png?width=751&amp;format=png&amp;auto=webp&amp;s=c222555ac8c195e1a6816859976f2ab9c16207fd\"></a></p>\n\n<p>Arm Ball? Flex Ball?</p>\n\n<p>&quot;Ball Port&quot; = V-Port Ball Valves.</p>\n\n<p>Ball valves are commonly used in industrial and residential piping systems to control the flow of liquids and gases. Ball valves are classified into full port, reduced port, standard port, and v-port ball valves based on their bore design and diameter.</p>\n\n<p>I realize this is a total stretch, but dtcc is the piping of the stock market, but also Flexport is the piping of commerce. </p>\n\n<p>Also, to strong-arm someone is to force them to do something. And so it could be &quot;strong-arm the Game.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nlx8qctf0sxb1.png?width=542&amp;format=png&amp;auto=webp&amp;s=246f0c837cb2fef2208d857f801e9f841a2dcd79\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/nlx8qctf0sxb1.png?width=542&amp;format=png&amp;auto=webp&amp;s=246f0c837cb2fef2208d857f801e9f841a2dcd79\" alt=\"https://preview.redd.it/nlx8qctf0sxb1.png?width=542&amp;format=png&amp;auto=webp&amp;s=246f0c837cb2fef2208d857f801e9f841a2dcd79\"></a></p>\n\n<p>Pizza shape? End of the World Pizza? Get a piece of the pie? </p>\n\n<p>Playing Into the Cyberverse on <a href=\"https://spatial.io\">spatial.io</a>  by Protocol Gemini has got me into the habit of looking for hidden messages everywhere. </p>\n\n<p>This could be nothing, but there might be something there.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/t6LIWnKyA_VSjhEtN8AhlKlbrXVrn4HFhWUKQLI4Zoo.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/1qr6q2xpd3xb1.jpg", "time": 1698563645.0, "subreddit": "r/ThePPShow", "title": "A Tale of Two Hoodies: The Yin and the Yang", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/1qr6q2xpd3xb1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17esv93/all_i_can_say_is_that_rc_is_very_active_in_the/", "time": 1698089468.0, "subreddit": "r/ThePPShow", "title": "\"All I can say is that RC is very active in the situation.\"", "text": "<!-- SC_OFF --><div class=\"md\"><p>This docket just came out. </p>\n\n<p><a href=\"https://preview.redd.it/bw48dd1s60wb1.png?width=899&amp;format=png&amp;auto=webp&amp;s=5d1e3c3ab55d41a140dc05b3954e5620dd495886\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/bw48dd1s60wb1.png?width=899&amp;format=png&amp;auto=webp&amp;s=5d1e3c3ab55d41a140dc05b3954e5620dd495886\" alt=\"https://preview.redd.it/bw48dd1s60wb1.png?width=899&amp;format=png&amp;auto=webp&amp;s=5d1e3c3ab55d41a140dc05b3954e5620dd495886\"></a></p>\n\n<p>What came out hours before it?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ctdc1hu070wb1.png?width=763&amp;format=png&amp;auto=webp&amp;s=b52ff7d822241d7b1e86688a2b45a560c6ad33c7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ctdc1hu070wb1.png?width=763&amp;format=png&amp;auto=webp&amp;s=b52ff7d822241d7b1e86688a2b45a560c6ad33c7\" alt=\"https://preview.redd.it/ctdc1hu070wb1.png?width=763&amp;format=png&amp;auto=webp&amp;s=b52ff7d822241d7b1e86688a2b45a560c6ad33c7\"></a></p>\n\n<p>I am not a big sports fan, but I can imagine it somewhat unlikely that a Canadian from Florida would care about Texas Sports. However in this tweet it says, &quot;responded&quot; and &quot;go and take it.&quot; </p>\n\n<p>If you are seeing this post Ryan, just know I appreciate all that you do. We can&#39;t buy or sell, so it really shouldn&#39;t matter, but still you make the effort. You&#39;re kindness will never be forgotten.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/sB6JsIonxpspTh319nBX0UisKU_HPgfx_Z6uUhrbcD8.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/17a84bw/protocolgemini_debuts_intothecyberverse_chalked/", "time": 1697575246.0, "subreddit": "r/ThePPShow", "title": "@ProtocolGemini debuts #IntotheCyberverse chalked full of Tinfoil", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/u/ProtocolGemini\">u/ProtocolGemini</a> debuts #IntotheCyberverse </p>\n\n<p>Watch the stream on:</p>\n\n<p>Youtube:</p>\n\n<p><a href=\"https://youtube.com/live/-tzFqoYVwGs?feature=share\">https://youtube.com/live/-tzFqoYVwGs?feature=share</a></p>\n\n<p>X:</p>\n\n<p><a href=\"https://x.com/MindandEmotion7/status/1714379544936013872?s=20\">https://x.com/MindandEmotion7/status/1714379544936013872?s=20</a></p>\n\n<p>Twitch:</p>\n\n<p><a href=\"https://www.twitch.tv/mindandemotion7\">https://www.twitch.tv/mindandemotion7</a></p>\n\n<p>Kick:</p>\n\n<p><a href=\"https://kick.com/mindandemotion7\">https://kick.com/mindandemotion7</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://youtube.com/live/-uozPQa0NuA?feature=share", "time": 1696528648.0, "subreddit": "r/ThePPShow", "title": "Transfer Agent Tinfoil Livestream", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/16tpx0e/pp_live/", "time": 1695833920.0, "subreddit": "r/ThePPShow", "title": "PP live", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.youtube.com/watch?v=dfV6-tJEgcE\">https://www.youtube.com/watch?v=dfV6-tJEgcE</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/9gsljiupnfqb1.jpg", "time": 1695661330.0, "subreddit": "r/ThePPShow", "title": "This back seat is too small. Headingtothe show", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9gsljiupnfqb1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.youtube.com/live/xlQ9q8H1OUk?si=K--B5HZpCkMMqNvC", "time": 1695504205.0, "subreddit": "r/ThePPShow", "title": "Getting set up for the ppshow livestream: any tech advice appreciated", "text": null, "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/360n5jclgrpb1.jpg", "time": 1695368370.0, "subreddit": "r/ThePPShow", "title": "The price doesn't matter, seriously. We've already won.", "text": "<!-- SC_OFF --><div class=\"md\"><p>No one wants to wake up to see their account down, even if for a long time we have gotten used to saying thenprice doesn&#39;t matter. This time is different, it literally doesn&#39;t matter at all. No one can buy, yet people can&#39;t still short it. Where would the price go?\nI had people say that it wasn&#39;t true, it was possible to buy on moomoo. I did not believe it, but actually confirmed it myself. I am not sure exactly what I bought, definitely not real shares, lol, but I did buy something labeled bbbyq. Hopefully, those shares I bought will be worth something, but I know that they are not affecting the share price. If anything, each time I bought it just made another locate to short. How do I know this? Look at the cost to borrow.\nSomeone is shorting bbbyq still. I hope it is not our friend Phil. \nI thought that the plan was to get back on otc, but after talking to Bets, he said that otc is not the ideal place. He says that expert market is the only way to go, and he&#39;s the expert so I trust that. He says that the next step for Bed Bath is to move to T-zero/BSTX, and to do that, they need to do a final share count, and to do that, they need the buy button to be off. Bullish!\nIt couls be that reason why someone is still shorting bbbyq, just to filibuster the share count. It doesn&#39;t matter, it is happening. \nTo move to t-zero, they needed 10 days, and don&#39;t have to announce it to anyone. The first day they could have done it is Thursday when the lien was lifted after the 14% bondholder&#39;s claims got wiped out. That means any time after this Saturday we could get the good news!\nThe new shares we are getting don&#39;t have to come by the effective day, although I think they will. \nThere is nothing to worry. At some point we will get the good news, and will get instructions for onboarding to T-zero, and then you will log in and just like any other broker, you will be able to transfer pver your shares from another broker. Those shares will be transferred, then converted. \nRyan is in complete control. It is not a matter of if it is just a matter of when. \nSee you all on the moon! \nLove you all!</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/360n5jclgrpb1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/beyond_uranus/comments/16kkj50/care_to_join_me_in_a_thought_experiment/", "time": 1695092898.0, "subreddit": "r/ThePPShow", "title": "Legit read from Beyond Uranus", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://preview.redd.it/care-to-join-me-in-a-thought-experiment-revisiting-bbbyqs-v0-xsjk74n45pob1.jpg?width=640&crop=smart&auto=webp&s=7b2614919e0d4d044120da92a813e8c72de28103\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/16hyruh/what_happens_behind_the_curtain_is_apparently/", "time": 1694639026.0, "subreddit": "r/ThePPShow", "title": "What happens behind the curtain is apparently stronger than the fear of the Expert market. TA update", "text": "<!-- SC_OFF --><div class=\"md\"><p>Each side of this battle is not putting their cards on the table until they have to. This is why we haven&#39;t seen RC yet, but it is also why the insurance skepticism BS the other unsecured creditor was bringing up as a reason to reject the plan, didn&#39;t appear till the day before court when they had to file it. If that opposition would have prevailed, it would have put us lower than the first day of court, which it did, but only until our man Judge Kaplan proposed a solution. Under a confidentiality agreement, they would show who the mysterious financer of this whole thing is. I have no idea who that person is...but Baby is fully staffed with an excellent team and ready to go once the lien is lifted. The lien is lifted when all unsecured claims are wiped out.  Just at the attorney said, who knows, maybe once the lien is lifted, there will be plenty to go around for all the unsecured creditors. </p>\n\n<p>According to the chart, it is better than a coinflip which way this will go. Knowing RC is likely &quot;very active in the situation,&quot; as Pulte said, I think he has a plan, and it is going along as planned. Even the Attorney said when the judge suggested 48 hours and asked if that was okay, he said, it was better than they had anticipated, they had assumed it would take a week. I don&#39;t know if that means that RC is going to stick to the assumed week plan for it to work out on the day he had projected, or whether he will just move forward as soon as the lien is lifted tomorrow. Either way, we have made it. If expert market couldn&#39;t take us down to zero, when you can&#39;t even buy without calling your broker, I don&#39;t know what could. I didn&#39;t think I could be more bullish than I was yesterday during the hearing, but the chart is confirming that behind the scenes, what made me bullish yesterday is still at play. </p>\n\n<p>You are in the rocket ship, buckled in, and the countdown has begun! See you all on the moon my friends!</p>\n\n<p>Stay Zen!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/l34qdqxq73ob1.jpg?width=2376&amp;format=pjpg&amp;auto=webp&amp;s=d7c6cbeb026ab1460871bbeabaaf37a4cc76e6c2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/l34qdqxq73ob1.jpg?width=2376&amp;format=pjpg&amp;auto=webp&amp;s=d7c6cbeb026ab1460871bbeabaaf37a4cc76e6c2\" alt=\"https://preview.redd.it/l34qdqxq73ob1.jpg?width=2376&amp;format=pjpg&amp;auto=webp&amp;s=d7c6cbeb026ab1460871bbeabaaf37a4cc76e6c2\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nsx55c9t73ob1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=cd4014d2107e52743d23cebe6efd34618645a8ec\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/nsx55c9t73ob1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=cd4014d2107e52743d23cebe6efd34618645a8ec\" alt=\"https://preview.redd.it/nsx55c9t73ob1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=cd4014d2107e52743d23cebe6efd34618645a8ec\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/kQNnbclxO6qOwsYPbEko-iqtRJnhV1ApW3pMIweDpyc.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/16h2873/the_plan_makes_sense_now_some_unsecured_creditors/", "time": 1694550783.0, "subreddit": "r/ThePPShow", "title": "The plan makes sense now: some unsecured creditors have a lien on baby, so baby can't be carved out and sold until the unsecured creditor's claim on it is wiped out.", "text": "<!-- SC_OFF --><div class=\"md\"><p>There is a roadmap to Ryan getting the Baby, and the main hurdle is lifting the lien placed on it. Hold on everyone, Thursday the plan will likely get confirmed, and then Ryan can come for his Baby. There is a reason there is confidentiality with the person offering the credit line mentioned in court today.</p>\n\n<p>Also according to the chart, if it means anything, it suggests we are in a better spot than we were in the last court hearing. Baby steps, but we are getting there. Change happens slowly at first, and then all at once. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/zhprnafexvnb1.png?width=1524&amp;format=png&amp;auto=webp&amp;s=28d23e2744ac486628de833e11ee5ba6a2e65fe9\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/zhprnafexvnb1.png?width=1524&amp;format=png&amp;auto=webp&amp;s=28d23e2744ac486628de833e11ee5ba6a2e65fe9\" alt=\"https://preview.redd.it/zhprnafexvnb1.png?width=1524&amp;format=png&amp;auto=webp&amp;s=28d23e2744ac486628de833e11ee5ba6a2e65fe9\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/abl38kggxvnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=5bbb609f93e9ab0c68aeb510591de4781758439d\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/abl38kggxvnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=5bbb609f93e9ab0c68aeb510591de4781758439d\" alt=\"https://preview.redd.it/abl38kggxvnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=5bbb609f93e9ab0c68aeb510591de4781758439d\"></a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/WPqhiOG97cduVVgVEX3TV6564dE3Wus42_yOX2SnaDQ.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/16gaeu7/peaking_behind_the_curtain_to_find_santa_you_look/", "time": 1694473236.0, "subreddit": "r/ThePPShow", "title": "Peaking behind the Curtain: To find Santa you look for cookie crumbs", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is there any significance to the run 10% run this afternoon? Coincidentally, anything submitted to the court, for example an amended plan, should be submitted at least 24 hours before. I am not saying that the clerk at the court say the amended plan with RC&#39;s name on it, and went all in on bbbyq, or that there was insider trading. It could just be that the algo needed to test the upper limit of the channel and lower limit of the channel, as it approaches the decision point. I have no idea which it could be. What it couldn&#39;t be however is just dumb money chasing a pipe dream. </p>\n\n<p>The cost to borrow is another cookie crumb. Pitchbook gets their leaks from somewhere, and I bet anyone with leaked information is going to capitalize on it before they sell it to pitchbook. If there was a leak about shareholders getting wiped out, bbbyq would be shorted to a cost to borrow of over 1000% just like AMC was before the unprecedented court decision. Currently bbbyq cost to borrow is 85%. That seems like the perfect number, because it means the short hedge funds are trapped here with us, but also means that they don&#39;t have any solid evidence to suggest we are going to zero. If we were, it would be free money. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5sgejpnmipnb1.jpg?width=2381&amp;format=pjpg&amp;auto=webp&amp;s=04f4714fe4b95bbf8001e423fa2614f206c0e565\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5sgejpnmipnb1.jpg?width=2381&amp;format=pjpg&amp;auto=webp&amp;s=04f4714fe4b95bbf8001e423fa2614f206c0e565\" alt=\"https://preview.redd.it/5sgejpnmipnb1.jpg?width=2381&amp;format=pjpg&amp;auto=webp&amp;s=04f4714fe4b95bbf8001e423fa2614f206c0e565\"></a></p>\n\n<p>Zooming into the chart today, we see that within the upward trend returning to the bullish theses are smaller upward trends. It isn&#39;t even testing the lower bounds of the channel but appearing to respond to slight higher trends. I realize that seems like projecting on something that isn&#39;t there, but so far, it went right to the point where I predicted weeks ago. I wasn&#39;t even factoring in any court dates or anything, I was just looking at points on the chart where the price movement reacts strongly by changing direction. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5j40jp0ripnb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=7c841bcd97e32f4d2d53768912441318a3cf5b75\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5j40jp0ripnb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=7c841bcd97e32f4d2d53768912441318a3cf5b75\" alt=\"https://preview.redd.it/5j40jp0ripnb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=7c841bcd97e32f4d2d53768912441318a3cf5b75\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cuzo99csipnb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=36bc36495411c8901321ad23b16d896c0a16479e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/cuzo99csipnb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=36bc36495411c8901321ad23b16d896c0a16479e\" alt=\"https://preview.redd.it/cuzo99csipnb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=36bc36495411c8901321ad23b16d896c0a16479e\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/stjfarotipnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=6dcbacd0af5adcd0d268e861df371500554e8f68\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/stjfarotipnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=6dcbacd0af5adcd0d268e861df371500554e8f68\" alt=\"https://preview.redd.it/stjfarotipnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=6dcbacd0af5adcd0d268e861df371500554e8f68\"></a></p>\n\n<p>There is still a chance that the confirmation date that is weeks or even further out and we might not know anything till then, but something bullish is happing behind the curtain, and it&#39;s just a matter of time till we find out. During this time, if you want something to keep you zen, watch the ppshow episode with </p>\n\n<p>Pulte: <a href=\"https://www.youtube.com/live/0zgpMt5J8Co?si=vrA70Zmln_IUDQZt\">https://www.youtube.com/live/0zgpMt5J8Co?si=vrA70Zmln_IUDQZt</a></p>\n\n<p>&#x200B;</p>\n\n<p>Ross Brown: <a href=\"https://youtu.be/-2_g1Nz23oA?si=GRYGTbh70va1W8aH\">https://youtu.be/-2_g1Nz23oA?si=GRYGTbh70va1W8aH</a></p>\n\n<p>Watch Mark Vadon: <a href=\"https://youtu.be/inihYcHRsc0?si=6Ojoykox-5YpfIrS\">https://youtu.be/inihYcHRsc0?si=6Ojoykox-5YpfIrS</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Ayh2gZz8kvmv9Yi4-wsv3jU_iO0TTR6wf1ZCfsAizZk.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/16gaeu7/peaking_behind_the_curtain_to_find_santa_you_look/", "time": 1694473236.0, "subreddit": "r/ThePPShow", "title": "Peaking behind the Curtain: To find Santa you look for cookie crumbs", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is there any significance to the run 10% run this afternoon? Coincidentally, anything submitted to the court, for example an amended plan, should be submitted at least 24 hours before. I am not saying that the clerk at the court say the amended plan with RC&#39;s name on it, and went all in on bbbyq, or that there was insider trading. It could just be that the algo needed to test the upper limit of the channel and lower limit of the channel, as it approaches the decision point. I have no idea which it could be. What it couldn&#39;t be however is just dumb money chasing a pipe dream. </p>\n\n<p>The cost to borrow is another cookie crumb. Pitchbook gets their leaks from somewhere, and I bet anyone with leaked information is going to capitalize on it before they sell it to pitchbook. If there was a leak about shareholders getting wiped out, bbbyq would be shorted to a cost to borrow of over 1000% just like AMC was before the unprecedented court decision. Currently bbbyq cost to borrow is 85%. That seems like the perfect number, because it means the short hedge funds are trapped here with us, but also means that they don&#39;t have any solid evidence to suggest we are going to zero. If we were, it would be free money. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5sgejpnmipnb1.jpg?width=2381&amp;format=pjpg&amp;auto=webp&amp;s=04f4714fe4b95bbf8001e423fa2614f206c0e565\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5sgejpnmipnb1.jpg?width=2381&amp;format=pjpg&amp;auto=webp&amp;s=04f4714fe4b95bbf8001e423fa2614f206c0e565\" alt=\"https://preview.redd.it/5sgejpnmipnb1.jpg?width=2381&amp;format=pjpg&amp;auto=webp&amp;s=04f4714fe4b95bbf8001e423fa2614f206c0e565\"></a></p>\n\n<p>Zooming into the chart today, we see that within the upward trend returning to the bullish theses are smaller upward trends. It isn&#39;t even testing the lower bounds of the channel but appearing to respond to slight higher trends. I realize that seems like projecting on something that isn&#39;t there, but so far, it went right to the point where I predicted weeks ago. I wasn&#39;t even factoring in any court dates or anything, I was just looking at points on the chart where the price movement reacts strongly by changing direction. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5j40jp0ripnb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=7c841bcd97e32f4d2d53768912441318a3cf5b75\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/5j40jp0ripnb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=7c841bcd97e32f4d2d53768912441318a3cf5b75\" alt=\"https://preview.redd.it/5j40jp0ripnb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=7c841bcd97e32f4d2d53768912441318a3cf5b75\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cuzo99csipnb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=36bc36495411c8901321ad23b16d896c0a16479e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/cuzo99csipnb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=36bc36495411c8901321ad23b16d896c0a16479e\" alt=\"https://preview.redd.it/cuzo99csipnb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=36bc36495411c8901321ad23b16d896c0a16479e\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/stjfarotipnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=6dcbacd0af5adcd0d268e861df371500554e8f68\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/stjfarotipnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=6dcbacd0af5adcd0d268e861df371500554e8f68\" alt=\"https://preview.redd.it/stjfarotipnb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=6dcbacd0af5adcd0d268e861df371500554e8f68\"></a></p>\n\n<p>There is still a chance that the confirmation date that is weeks or even further out and we might not know anything till then, but something bullish is happing behind the curtain, and it&#39;s just a matter of time till we find out. During this time, if you want something to keep you zen, watch the ppshow episode with </p>\n\n<p>Pulte: <a href=\"https://www.youtube.com/live/0zgpMt5J8Co?si=vrA70Zmln_IUDQZt\">https://www.youtube.com/live/0zgpMt5J8Co?si=vrA70Zmln_IUDQZt</a></p>\n\n<p>&#x200B;</p>\n\n<p>Ross Brown: <a href=\"https://youtu.be/-2_g1Nz23oA?si=GRYGTbh70va1W8aH\">https://youtu.be/-2_g1Nz23oA?si=GRYGTbh70va1W8aH</a></p>\n\n<p>Watch Mark Vadon: <a href=\"https://youtu.be/inihYcHRsc0?si=6Ojoykox-5YpfIrS\">https://youtu.be/inihYcHRsc0?si=6Ojoykox-5YpfIrS</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Ayh2gZz8kvmv9Yi4-wsv3jU_iO0TTR6wf1ZCfsAizZk.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/gallery/16g4dux", "time": 1694459877.0, "subreddit": "r/ThePPShow", "title": "TA update. I still could be wrong, but so IDK, seems to have gone exactly where I thought it would.", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/MTrqQsfuecw30avPZ_4eemZ5lu-q4j120rDHi4XM4qs.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/gallery/16g49ob", "time": 1694459622.0, "subreddit": "r/ThePPShow", "title": "Just a little TA update. I still could be wrong, but up to now, it couldn't have been more spot on!", "text": null, "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/su6XsuIgZZMbhWzdJhL_5tq7URgbfACHFxdl9-A_x0g.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/16fg167/in_a_discussion_to_two_former_sec_employees_i/", "time": 1694390198.0, "subreddit": "r/ThePPShow", "title": "In a discussion to two former SEC employees, I explained the difference between a MEME stock and a Deep Value play. I don't know if it will make a difference, but it at least chips away at their excuse that we don't know what we are doing.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The phrase &quot;Past performance does not predict future results,&quot; goes both ways. Ryan Cohen proved that with Chewy after the Pets. com era, again with GameStop, and he will do it again with Bed Bath and beyond! </p>\n\n<p>Here is a link to our conversation:</p>\n\n<p><a href=\"https://youtu.be/W185aIH5fBI\">https://youtu.be/W185aIH5fBI</a></p>\n\n<p>I defended GME as well. Here is a post I did on it on SuperStonk:</p>\n\n<p><a href=\"https://www.reddit.com/r/Superstonk/comments/16ffs31/conversation_with_former_sec_employees_about_the/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/Superstonk/comments/16ffs31/conversation_with_former_sec_employees_about_the/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "MSM FUD ", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/16cumlp/mark_vadon_a_mentor_of_ryan_cohen_spelled_out_our/", "time": 1694130447.0, "subreddit": "r/ThePPShow", "title": "Mark Vadon, a mentor of Ryan Cohen, spelled out our situation right now very well! TLDR: We MOON SOON!", "text": "<!-- SC_OFF --><div class=\"md\"><p>There are several key elements to Teddy in my opinion, one, Solid Brands who are tired of getting shafted by Amazon, and Passionate Customers who want to support a positive change in how the economy operates.</p>\n\n<p>Mark Vadon&#39;s Interview back in 2014 has a lot of gems, I did a tldr for you, but the whole interview is here:</p>\n\n<p><a href=\"https://youtu.be/inihYcHRsc0?si=DLPTBksN-I_mBp7m\">https://youtu.be/inihYcHRsc0?si=DLPTBksN-I_mBp7m</a></p>\n\n<p>“How can we work with vendors? How can we find a space where there are lots of fragmentation of vendors? Very Small vendors having trouble getting distribution or getting to market.&quot;</p>\n\n<p>Big brands are getting lost in the sea of cheap crap on amazon, and the bigger amazon gets the less they care about vendor support. For each brand to create their own online presence and keep up their own flow of foot traffic is too much in a time where all-in-one ecosystems are so convenient. </p>\n\n<p>&quot;We started combing through retail and looking for where to find very high fragmentation, very high purchase frequency, very social customers. Each of us had two very young kids and we’re seeing box after box of kids stuff coming into the front door from the internet and we centered in on it and did it. And from day one, out mindset in general we want to work on something that’s going to get really big.&quot;</p>\n\n<p>Chewy taking on PetSmart who just had a few bad quarters seemed more appealing at the time, but the goal was to get to the baby market. GameStop similarly also just fell into Ryan&#39;s lap, it was hard to pass up, but still the Baby market was the target the whole time. </p>\n\n<p>“If you are doing really well you want to be quiet… Unless you are having trouble fund-raising. If you are drilling and you hit an oil patch, the last thing you want is other people coming in and drilling right next to you. So the longer you can put that off the better…they’ll all find out what you are doing when you file the S-1. We are big fans of being incredibly quiet as a startup.&quot;</p>\n\n<p>Seems a lot like how quiet Ryan has been ever since he had BBBY in the bag. Sixth Street secured control of baby less than a week after Ryan sold. He only sold because of the buy backs and that putting him over the standstill agreement. </p>\n\n<p>&quot;We are looking for a big customer base that is passionate and things that are relevant to that customer base. In the long term, we want to be one of the more meaningful internet businesses in the whole landscape, and I think M/A will be part of that at some point.&quot;</p>\n\n<p>Who is more passionate than us? Seriously? </p>\n\n<p>Our day is here! Relish it!</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/16cq6zr/ta_update_bed_bath_and_beyond_has_seen_the_door/", "time": 1694120142.0, "subreddit": "r/ThePPShow", "title": "TA update: Bed Bath and Beyond has seen the door out of ch 11 for a long time and it looks like it wants to go through it!", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ylfmz3a0awmb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=dbf68667ed14fecca9d1d9a3f6016c8a1138781e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ylfmz3a0awmb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=dbf68667ed14fecca9d1d9a3f6016c8a1138781e\" alt=\"https://preview.redd.it/ylfmz3a0awmb1.jpg?width=2330&amp;format=pjpg&amp;auto=webp&amp;s=dbf68667ed14fecca9d1d9a3f6016c8a1138781e\"></a></p>\n\n<p>I think that the algos or investor mentality is programmed to aim the price at the percentage of the Total addressable market that a company likely will take given the plan they currently have. Each plan or thesis either: seems to be on track, possibly is on track, or likely not on track. You can see by how many times the chart seems to be strongly reacting to something as if it is bouncing off of it, or struggling to get past it. I think it is evaluations based on business plans and the current market share they are shooting at. </p>\n\n<p>It just helps me know what to look for. If the chart moves substantially there is a reason, if other charts move with it, that can give clues. If bbby is the only chart moving a certain direction, I look to see if another chart is mirroring the opposite. If there is, there could be a correlation to look into. If there is not, there is likely something behind the curtains inside the business going on. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rze4yaz5bwmb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=0096e8835c8e2c9a5553362ef7486251a5810aa4\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/rze4yaz5bwmb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=0096e8835c8e2c9a5553362ef7486251a5810aa4\" alt=\"https://preview.redd.it/rze4yaz5bwmb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=0096e8835c8e2c9a5553362ef7486251a5810aa4\"></a></p>\n\n<p>One thing is for sure, the thesis we are no where close to is the Liquidation thesis. If there was definitive or even substantial speculative evidence, like blood in the water some hedge fund would have found out and been shorting bbbyq with both hands. it would be free money at that point. Insiders knew for example that against all precedence and legal judgement that the Judge would side with corruption on the AMC case, and that is why the cost to borrow was over 1000%. BBBYQ&#39;s cost to borrow is currently 82% which means they thought they had some corrupt maneuver in the bag a while ago, and now just can&#39;t get out. </p>\n\n<p>I bring up what I see in the charts just to say that it is more than us who think Sept 12th is going to be a big day. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ight0t1rcwmb1.png?width=646&amp;format=png&amp;auto=webp&amp;s=92f9243e0036b5183866bf24b180f145075849b8\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ight0t1rcwmb1.png?width=646&amp;format=png&amp;auto=webp&amp;s=92f9243e0036b5183866bf24b180f145075849b8\" alt=\"https://preview.redd.it/ight0t1rcwmb1.png?width=646&amp;format=png&amp;auto=webp&amp;s=92f9243e0036b5183866bf24b180f145075849b8\"></a></p>\n\n<p>Stay Zen my Friends!</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/VVzMwx7Z5VW-KPqnWMVqX14pKTfG0qwse-SNlhlIiqQ.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/gallery/16bnzzc", "time": 1694015962.0, "subreddit": "r/ThePPShow", "title": "TA update for anyone curious. The Thesis still holds strong!", "text": null, "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/BV8Z9Vxm6n6P-86gzVFkfELQo3bNHAQaN3ldcmM-fyI.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/glg49xpef6mb1.jpg", "time": 1693806185.0, "subreddit": "r/ThePPShow", "title": "I think the magnifying glass means it's somethingbwe should look at. I don't know which meaning is right, but they are all bullish!", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/glg49xpef6mb1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/169axuj/the_week_ahead_deep_dive_on_the_chart/", "time": 1693781464.0, "subreddit": "r/ThePPShow", "title": "The Week Ahead! Deep dive on the Chart", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3t00scgfd4mb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=a238bae874584a1fda029289a1e679184cc20071\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/3t00scgfd4mb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=a238bae874584a1fda029289a1e679184cc20071\" alt=\"https://preview.redd.it/3t00scgfd4mb1.jpg?width=2332&amp;format=pjpg&amp;auto=webp&amp;s=a238bae874584a1fda029289a1e679184cc20071\"></a></p>\n\n<p><a href=\"https://youtube.com/live/44vvNk3X6mc?feature=share\">https://youtube.com/live/44vvNk3X6mc?feature=share</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/lr5UbkSJp8XwHtr0G7HGAKjuJVFbXwNXzUz70BQruBo.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/yy9caoq7uvlb1.jpg", "time": 1693677986.0, "subreddit": "r/ThePPShow", "title": "There is a chance Ryan Cohen would show up to the poker tournament in Vegas. Let's make it happen!", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://twitter.com/MindandEmotion7/status/1697766850959184159?t=173koLBZiml7kUg1yFoqXw&amp;s=19\">https://twitter.com/MindandEmotion7/status/1697766850959184159?t=173koLBZiml7kUg1yFoqXw&amp;s=19</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/yy9caoq7uvlb1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://forms.gle/Pm1ZG7kUgvtnM9zs5", "time": 1693614536.0, "subreddit": "r/ThePPShow", "title": "Pulte Ape Community Charity Poker Tournament! We are planning a poker tournament to bring awareness to the Ape cause of a more fair and transparent market, and raise money for charity. Here is a sign up if you would like to be part of it!", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://lh6.googleusercontent.com/8RWTNHLYOssJnp-I30OyN81Apdhf78GQXJrRsUhNeVnBL0VBxyna2_kt5nGjoJi76gSKLv3yC2w=w1200-h630-p\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/5qes479afqlb1.jpg", "time": 1693612494.0, "subreddit": "r/ThePPShow", "title": "The Chart doesn't tell it all, but it does seem to be suggesting a lot! A Battle of Theses", "text": null, "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/5qes479afqlb1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/gallery/165uu8e", "time": 1693439472.0, "subreddit": "r/ThePPShow", "title": "A little Tin for the PPshow tonight", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/CE1NEE3JaWvoMFYq57hPhG02tEqW4nrb0FclQEkex4U.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/gallery/1656pnp", "time": 1693376365.0, "subreddit": "r/ThePPShow", "title": "Teddy book: Piggy Bank rough draft. Explanations were on the ppshow at the end.", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/dHL0R5MaegPZMw6oidcU3oODH0qmeW_ZtojuDxvCJHM.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://youtube.com/live/K-G8YyuqQLM?feature=share", "time": 1692415451.0, "subreddit": "r/ThePPShow", "title": "Livestream: Pulte Homes and the Future of Housing.", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://forms.gle/JdzcsCrV1kbC8F7s5", "time": 1692396213.0, "subreddit": "r/ThePPShow", "title": "There is some connection between Pulte and BBBY and I think one possibility is how new housing developments are designed. If you could take this survey about it I would appreciate it. Pulte I'm sure would appreciate it too, because he has a lot of houses to build for us to buy after MOASS!", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://lh6.googleusercontent.com/irngtShqK6M0bpz99T_HpahDOM14ncuXBS4a4kp7ByqeLz0n-I37APZYzu1FV3fCfhvQrT5K1Bg=w1200-h630-p\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.youtube.com/live/qw5XMP3Qwfo?feature=share", "time": 1691971269.0, "subreddit": "r/ThePPShow", "title": "Buying a house after MOASS livestream starting now! General housing market speculation and some light shilling for $phm and Pulte.", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/15ovqcm/docket_1865_schitzo_rant_or_secret_message/", "time": 1691817783.0, "subreddit": "r/ThePPShow", "title": "Docket 1865 schitzo rant or secret message. Loopring revolution?", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is going to sound crazy, but I think I stumbled into something from docket 1865 that is weirding me out. In the movie A Series of Unfortunate events for example code is written by purposeful mistakes. I know someone that used to be part of the Anonymous hacker group, and so this kind of thing looks up their alley. Or maybe someone else, but it looks like it is threatening the court and SEC that if the shareholders get wiped out that there will be a revolution and a decentralized exchange put in place.</p>\n\n<p>It starts off:</p>\n\n<p>&quot;We are many.&quot; as in &quot;We are legion, we are many.&quot; Which is an anonymous tagline.</p>\n\n<p>&quot;Our proposal is clear. To point 1.5 billion investors to leave America. We want this case or any other to work. This is a deal or we all just revolt against the market. We want to create a better yield system. Bed Bath and Beyond will be the future of self banks. This is do-able. Now it&#39;s different. We are looking at profit sharing. We are looking to enhance brokers. Wallstreet needs a kick in the butt to restart. We have talked to the SEC commission. Bed Bath and Beyond does not need the market. It needs a game-changer.</p>\n\n<p>This part I think refers to not having knowledge or short positions or synthetic shares. Then it says what seems the most critical part. &quot;This is where a misfit takes the chance to place the idea of TERMS WITHIN SECURITIES. (Blockchain Exchange)</p>\n\n<p>&quot;The famous words are no deal and get revolution. I was in the courts&quot;</p>\n\n<p>Not sure the next part, then says, &quot; There is a lot of disrespect to investors. Market value goes into ominous self incentive.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>I don&#39;t know man. I don&#39;t know if it is just some schizo person in their basement or some literal dark web army, and I don&#39;t know that I am translating it right, but there is definitely something cryptic in it.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wty8dp55amhb1.jpg?width=1037&amp;format=pjpg&amp;auto=webp&amp;s=2b8b14cdac08d6d072d00e7ad576cf5c749717a0\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/wty8dp55amhb1.jpg?width=1037&amp;format=pjpg&amp;auto=webp&amp;s=2b8b14cdac08d6d072d00e7ad576cf5c749717a0\" alt=\"https://preview.redd.it/wty8dp55amhb1.jpg?width=1037&amp;format=pjpg&amp;auto=webp&amp;s=2b8b14cdac08d6d072d00e7ad576cf5c749717a0\"></a></p>\n\n<p><a href=\"https://preview.redd.it/8p7azr55amhb1.jpg?width=867&amp;format=pjpg&amp;auto=webp&amp;s=4f12a2236d6c0fb66da0f4d046c1514a710e4253\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/8p7azr55amhb1.jpg?width=867&amp;format=pjpg&amp;auto=webp&amp;s=4f12a2236d6c0fb66da0f4d046c1514a710e4253\" alt=\"https://preview.redd.it/8p7azr55amhb1.jpg?width=867&amp;format=pjpg&amp;auto=webp&amp;s=4f12a2236d6c0fb66da0f4d046c1514a710e4253\"></a></p>\n\n<p><a href=\"https://preview.redd.it/27000y55amhb1.jpg?width=814&amp;format=pjpg&amp;auto=webp&amp;s=9de48b2abe723eac9f0a3fa4990a3f90fb00925b\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/27000y55amhb1.jpg?width=814&amp;format=pjpg&amp;auto=webp&amp;s=9de48b2abe723eac9f0a3fa4990a3f90fb00925b\" alt=\"https://preview.redd.it/27000y55amhb1.jpg?width=814&amp;format=pjpg&amp;auto=webp&amp;s=9de48b2abe723eac9f0a3fa4990a3f90fb00925b\"></a></p>\n\n<p><a href=\"https://preview.redd.it/72zlz065amhb1.jpg?width=854&amp;format=pjpg&amp;auto=webp&amp;s=2b3980c3a0926120c5543c5a3e5df8a95a0ad3a6\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/72zlz065amhb1.jpg?width=854&amp;format=pjpg&amp;auto=webp&amp;s=2b3980c3a0926120c5543c5a3e5df8a95a0ad3a6\" alt=\"https://preview.redd.it/72zlz065amhb1.jpg?width=854&amp;format=pjpg&amp;auto=webp&amp;s=2b3980c3a0926120c5543c5a3e5df8a95a0ad3a6\"></a></p>\n\n<p><a href=\"https://preview.redd.it/ypcam465amhb1.jpg?width=879&amp;format=pjpg&amp;auto=webp&amp;s=feaca7aad3f3a4762bd5344f387514a38dd1275b\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ypcam465amhb1.jpg?width=879&amp;format=pjpg&amp;auto=webp&amp;s=feaca7aad3f3a4762bd5344f387514a38dd1275b\" alt=\"https://preview.redd.it/ypcam465amhb1.jpg?width=879&amp;format=pjpg&amp;auto=webp&amp;s=feaca7aad3f3a4762bd5344f387514a38dd1275b\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/pOPaTv4neJdYDJl1boafazXrvRWIG8ifNBzGg_kldgk.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/15mpujn/the_future_of_bed_bath_and_beyond_physical_stores/", "time": 1691611363.0, "subreddit": "r/ThePPShow", "title": "The Future of Bed Bath and Beyond Physical Stores", "text": "<!-- SC_OFF --><div class=\"md\"><p>Standalone stores I think are being phased out. You can see the evolution of Walmart and Target adding on Groceries. Now I think the grocery stores are fighting back. Super centers are convenient because buying groceries is something that people do on a regular basis, and so it increases foot traffic towards other items.</p>\n\n<p>I think Buybuy Baby will have many physical stores, but I think that buybuy baby and bed bath and beyond will also be incorporated into Kroger stores like Fred Meyers.</p>\n\n<p>For anyone who hasn&#39;t seen what a Fred Meyers looks like, here is a video walk through. The home goods is at 7 min mark if you want to skip to it. <a href=\"https://youtu.be/6w004EiFaOI\">https://youtu.be/6w004EiFaOI</a></p>\n\n<p>Edit: Also, economy of scale is important. And sharing staff with a grocery reduces the number of people you need, and increases the number of hours you can be open. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/15kzpyx/gamestop_nft_tinfoil/", "time": 1691448338.0, "subreddit": "r/ThePPShow", "title": "GameStop NFT Tinfoil", "text": "<!-- SC_OFF --><div class=\"md\"><p>May 2023 BBBY when into restructuring, at this point, many people thought RC was out, that he had made a U-turn on his gmerica plan involving Teddy. I didn&#39;t notice the Gamestop NFT that came out at that time that clearly says, &quot;No U-turns.&quot; <a href=\"https://nft.gamestop.com/token/0x0c589fcd20f99a4a1fe031f50079cfc630015184/0xed387bedfab930c5e1bf267c84bad2ff1e296a1c1ebd0a96a3268615f630867e\">https://nft.gamestop.com/token/0x0c589fcd20f99a4a1fe031f50079cfc630015184/0xed387bedfab930c5e1bf267c84bad2ff1e296a1c1ebd0a96a3268615f630867e</a></p>\n\n<p>&#x200B;</p>\n\n<p>At least 2 Gamestop NFTs also reference T0, which could be a reference to the crypto platform. </p>\n\n<p>In the Vegas strip nft, there is a tiger. Tiger is an acronym in finance. </p>\n\n<p><a href=\"https://nft.gamestop.com/token/0x0c589fcd20f99a4a1fe031f50079cfc630015184/0xf9a0895dcab7bf9afb72c4949aba765d5fee084ac0c1ef6ac602ed50b0d8eefe\">https://nft.gamestop.com/token/0x0c589fcd20f99a4a1fe031f50079cfc630015184/0xf9a0895dcab7bf9afb72c4949aba765d5fee084ac0c1ef6ac602ed50b0d8eefe</a></p>\n\n<p>&quot;Treasury Investment Growth Receipt: A Treasury security whose coupons have been stripped by Merrill Lynch. TIGRs therefore pay no interest. They are sold at a significant discount from par and mature at par. TIGRs fluctuate in price, sometimes dramatically, because changes in interest rates have made them more or less desirable. TIGRs can be invested IRAs and other pension accounts; they are also <strong>exempt from state and local taxes</strong>. They were originally issued between 1982 and 1986, becoming more-or-less obsolete when the U.S. Treasury began issuing its own stripped bonds. They still exist, but are fairly uncommon investments. See also: zero-coupon bonds, STRIPS.&quot;</p>\n\n<p>Tiger and strip in the same definition? Is this a reference to BBBY&#39;s NOLs? </p>\n\n<p>It could also be a reference to a tiger economy:</p>\n\n<p>&quot;A tiger economy is a term commonly used to describe several booming economies in Southeast Asia. </p>\n\n<p>The Asian tiger economies typically include Singapore, Hong Kong, South Korea, and Taiwan.</p>\n\n<p>The economic growth in each of the Asian tiger nations is usually export-led but with <strong>sophisticated financial and trading hubs</strong>.</p>\n\n<p>The phrase &quot;tiger economy&quot; has since been expanded to describe any <strong>small, outperforming economy that has undergone rapid development.</strong>&quot;</p>\n\n<p>T-zero referenced in the nft and a tiger being a &quot;sophisticated financial and trading hub&quot; is quite interesting. </p>\n\n<p>Alamo</p>\n\n<p><a href=\"https://nft.gamestop.com/token/0x0c589fcd20f99a4a1fe031f50079cfc630015184/0x9a0824e000fec6dab77e57c555245d347bb58c5f16d6dfcbfd243338e12fb72b\">https://nft.gamestop.com/token/0x0c589fcd20f99a4a1fe031f50079cfc630015184/0x9a0824e000fec6dab77e57c555245d347bb58c5f16d6dfcbfd243338e12fb72b</a></p>\n\n<p>Look into the history of Alamo with comparing the Spanish colonizers to Wallstreet corruption. You have in the NFT someone playing a game where they shoot shadowy characters that pop up for just a split second. It makes me think or dark pools, which is you hit you win the game. </p>\n\n<p>&#x200B;</p>\n\n<p>New York NFT</p>\n\n<p><a href=\"https://nft.gamestop.com/token/0x0c589fcd20f99a4a1fe031f50079cfc630015184/0xa1be0aeeda52ec12f3d2a9b0f8371a111548d42bb2109312027d3c52c7de5bc5\">https://nft.gamestop.com/token/0x0c589fcd20f99a4a1fe031f50079cfc630015184/0xa1be0aeeda52ec12f3d2a9b0f8371a111548d42bb2109312027d3c52c7de5bc5</a></p>\n\n<p>I haven&#39;t been to New York, but skiing is not what I imagine happening around the statue of liberty, which suggests that it might be symbolic. </p>\n\n<p>Here is a article from the New York Magazine:</p>\n\n<p>&quot;Where Did the Phrase ‘Over His Skis’ Come From?</p>\n\n<p>Actually, the phrase’s metaphorical use seems to have begun in the finance world. Its first non-skiing print usages came in the early nineties, in publications like Investment Dealers’ Digest. For instance, a 1991 article quoted a “market source” describing a race between Goldman Sachs’ and Lehman Bros.’ preferred stock desk. “Someone said [Lehman] couldn’t get a clean legal opinion on it. They may have been out over their skis a little bit with their structure.” It makes sense that investment bankers would let their weekend hobbies inform their workday slang. It’s still a favorite in the finance world — far more than in political spheres — and so maybe it’s something Obama’s picked up from all his time hanging out with the Larry Summers and Tim Geithners of the world, <strong>trying to clean up the mess of a national economy that got a bit over its skis a few years back.</strong>&quot;</p>\n\n<p>If you notice, if doesn&#39;t even look like the skis are even touching the water. Maybe this is synthetic shares? </p>\n\n<p>Space needle NFT</p>\n\n<p>&quot;Built for the 1962 World&#39;s Fair—the Century 21 Exposition whose theme was “The Age of Space”—the tower&#39;s futuristic design was inspired by the idea that the fair needed a structure to symbolize humanity&#39;s Space Age aspirations.&quot;</p>\n\n<p>Aspirations of taking on Amazon. World Fair? 20 sided dice = Ryan is Chaotic good. </p>\n\n<p>Boston NFT = Dumping tea into the Boston harbor?</p>\n\n<p>I wasn&#39;t planning on going down the gamestop nft rabbithole, I just saw them post on twitter. I am glad I did however. Everything is lined up and ready to go!</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://youtube.com/live/DVn6SBzYBNE?feature=share", "time": 1691195717.0, "subreddit": "r/ThePPShow", "title": "Patty Wu's Pirate Crew Party. BuyBuy Baby BBBY BBBYQ Livestream", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.youtube.com/live/Fkv_9ezPKLk?feature=share", "time": 1691013648.0, "subreddit": "r/ThePPShow", "title": "BBBY BBBYQ Extinguished Allowed Interest Explained", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.youtube.com/live/VAOe5osr-94?feature=share", "time": 1690918895, "subreddit": "r/ThePPShow", "title": "bbbyq Post-court discussion August 1st", "text": "", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.youtube.com/live/VAOe5osr-94?feature=share", "time": 1690918895.0, "subreddit": "r/ThePPShow", "title": "bbbyq Post-court discussion August 1st", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.youtube.com/live/JhXC_AOtqAY?feature=share", "time": 1690829872.0, "subreddit": "r/ThePPShow", "title": "Dream on me situation chat", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.youtube.com/live/6EnIAS0dbqc?feature=share", "time": 1690741518.0, "subreddit": "r/ThePPShow", "title": "Teddy and G'merica weekend stream!", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "mjonesgcms", "url": "https://youtu.be/WHJqswzR08c", "time": 1690484958.0, "subreddit": "r/ThePPShow", "title": "Bbby update reupload", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/WHJqswzR08c/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AHOBYACgAqKAgwIABABGGUgUChLMA8=&rs=AOn4CLAHMXzGTueVq2ggddy6oUHW6j5hgg\"/></div>"},
{"username": "mjonesgcms", "url": "https://youtu.be/GwGbtOh3R6E", "time": 1690481255, "subreddit": "r/ThePPShow", "title": "Some weapons-grade hopium for today. More details later on the ppshow", "text": "", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/GwGbtOh3R6E/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYZSBTKE0wDw==&rs=AOn4CLCR-bm94UNvceVP8AGuLNTKPt1lpw\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/15aecyc/pulte_interview_stay_focused_on_the_goal_everyone/", "time": 1690397727, "subreddit": "r/ThePPShow", "title": "Pulte Interview. Stay focused on the goal everyone.", "text": "Just a reminder to consider the implications of your questions. Don't be like Marantz who was so focused on getting him to denounce his position in bbby that he didn't even ask him what value he saw in gamestop. \nI know we are all curious about his position, but we don't want to put him in an awkward or legally tenuous situation. It was interesting to see what about bbby appealed to Ross Brown, like how up-to-date the distribution centers were. I want to see what value Pulte sees rather than just confirming specific details. That would be insider information. And if you need confirmation at this point, you haven't been reading the dockets. \nMake us look good tonight! Yes, we are somewhat of degenerates, but that should be just because the deep value we see is burried under wallstreet corruption and that's what makes it a gamble. \nRemember, we might be able to hide behind an anonymous username, but Pulte has a public image to uphold and lots of people that would love to slander him, so let's make this a win-win for him! See you all tonight!", "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/156xhjf/teddy_will_take_on_amazon_and_do_it_quickly/", "time": 1690065367.0, "subreddit": "r/ThePPShow", "title": "Teddy will take on Amazon and do it quickly!", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rhzphgiafldb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=5cd101b3797eabcc6ad3c7758005f8da98811b92\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/rhzphgiafldb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=5cd101b3797eabcc6ad3c7758005f8da98811b92\" alt=\"https://preview.redd.it/rhzphgiafldb1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=5cd101b3797eabcc6ad3c7758005f8da98811b92\"></a></p>\n\n<p>This is probably only a small part of what Ryan Cohen has planned. They are just brands that already seem connected. I bet a lot area ready or will jump on board.</p>\n\n<p>Larry Cheng recently suggested that we should spend time considering contrarian ideas. </p>\n\n<p>It will be on this channel. <a href=\"https://youtu.be/14Ox9ttnics\">https://youtu.be/14Ox9ttnics</a></p>\n\n<p>Edit: here is the live link! <a href=\"https://youtube.com/live/7chBMiggzrw?feature=share\">https://youtube.com/live/7chBMiggzrw?feature=share</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/QTfKv6GQxhzKlJmK00pFWM-KccqhVJoq0mR9D3IDZ7I.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://youtu.be/14Ox9ttnics", "time": 1689750812.0, "subreddit": "r/ThePPShow", "title": "A 3 min video overview of where bbbyq is at! Enjoy!", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/14Ox9ttnics/maxresdefault.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/1511l6d/why_did_ryan_cohen_initially_buy_into_bbby/", "time": 1689498937.0, "subreddit": "r/ThePPShow", "title": "Why did Ryan Cohen initially buy into BBBY?", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14yw7cs/how_does_bbby_actually_compare_to_amazon_and/", "time": 1689281725.0, "subreddit": "r/ThePPShow", "title": "How does BBBY actually compare to Amazon and Wayfair?", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/Superstonk/comments/14xdv7y/perhaps_suggesting_something_sorry_if_its_been/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=1", "time": 1689200341.0, "subreddit": "r/ThePPShow", "title": "I made a pretty good comment on a superstonk thread. If we could get some love there, I think we can win some hearts. I already was messaged by one.", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://preview.redd.it/perhaps-suggesting-something-sorry-if-its-been-posted-here-v0-h5udravlogbb1.jpg?width=640&crop=smart&auto=webp&s=2854a21813d7acb3a9ec0908133a1dcdeafe40d4\"/></div>"},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14x6c2n/i_havent_cracked_it_yet_but_i_think_i_found/", "time": 1689116059.0, "subreddit": "r/ThePPShow", "title": "I haven't cracked it yet, but I think I found something interesting...if you are into Tinfoil.", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": ""},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14sy19q/youve_already_won_and_you_should_already_know/", "time": 1688708961.0, "subreddit": "r/ThePPShow", "title": "You've already won and you should already know it...if you've been reading the filings.", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/14rlrwr/new_high_on_ctb_what_does_it_mean_if_ctb_and_ftds/", "time": 1688587637.0, "subreddit": "r/ThePPShow", "title": "New high on CTB! What does it mean if CTB and FTDs go up(by 1m) and the share price does as well? We are winning! Tomorrow 4.6m FTD have to cover!", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nlpmx4wkd7ab1.png?width=535&amp;format=png&amp;auto=webp&amp;s=927842cf4683b36b61828540627506e3dccf7b17\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/nlpmx4wkd7ab1.png?width=535&amp;format=png&amp;auto=webp&amp;s=927842cf4683b36b61828540627506e3dccf7b17\" alt=\"https://preview.redd.it/nlpmx4wkd7ab1.png?width=535&amp;format=png&amp;auto=webp&amp;s=927842cf4683b36b61828540627506e3dccf7b17\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/SZ4-gnQXhAmZbttMU7hKg6pu-9UzUoRMQlwaQ5l2xoI.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/gallery/14qr6ji", "time": 1688505260.0, "subreddit": "r/ThePPShow", "title": "It's not even tinfoil at this point! Those sun rays mean there is a baby!", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/1NbzxyuHpRxnsqVlSx0CHPbYLKfB5DDo0SvcKjVMYOM.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/1ssqaxwu8v9b1.jpg", "time": 1688440934.0, "subreddit": "r/ThePPShow", "title": "Shorts have run out of rope! They can't close their naked shorts and now they don't have shares available to borrow that they need to keep drowning us in Infinite Liquidity Pool! Overlay this timeline with all of the huge catalysts lined up, and the stage is set for fireworks!", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/1ssqaxwu8v9b1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14l1xnl/docket_1114_is_bullish/", "time": 1687934399.0, "subreddit": "r/ThePPShow", "title": "Docket 1114 is Bullish!", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "mjonesgcms", "url": "https://i.redd.it/aelzlrzcjl8b1.jpg", "time": 1687887281.0, "subreddit": "r/ThePPShow", "title": "It looks like the price action today could have just been shorts trying to scare us at their own expense.", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/aelzlrzcjl8b1.jpg\"/></div>"},
{"username": "mjonesgcms", "url": "https://www.reddit.com/gallery/14ihg9l", "time": 1687683688.0, "subreddit": "r/ThePPShow", "title": "Cigar butt investing", "text": null, "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.redditstatic.com/desktop2x/img/renderTimingPixel.png\"/></div>"},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14id04j/ban_me_if_i_am_wrong_remind_1_week/", "time": 1687668170.0, "subreddit": "r/ThePPShow", "title": "Ban me if I am wrong (Remind! 1 week)", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": ""},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14gfl84/the_plan_is_unfolding_as_planned/", "time": 1687469258.0, "subreddit": "r/ThePPShow", "title": "The plan is unfolding as planned!", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14fxbh2/docket_877_overstock_has_been_a_part_of_the_plan/", "time": 1687421338.0, "subreddit": "r/ThePPShow", "title": "Docket 877 Overstock has been a part of the plan apparently for a while", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": ""},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14fn5x1/docket_971_why_overstock/", "time": 1687390684.0, "subreddit": "r/ThePPShow", "title": "Docket 971 why Overstock?", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": ""},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14fn5x1/docket_971_why_overstock/", "time": 1687390684, "subreddit": "r/ThePPShow", "title": "Docket 971 why Overstock?", "text": "", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": ""},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14d9csp/shorts_never_covered_and_they_wont_ever_get_the/", "time": 1687165788.0, "subreddit": "r/ThePPShow", "title": "Shorts Never Covered... and they won't ever get the chance because it's only up, up, up!", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "mjonesgcms", "url": "/r/BBBY/comments/14bkbzc/a_whole_new_world_bbbyq_and_beyond/", "time": 1686986417.0, "subreddit": "r/ThePPShow", "title": "A Whole New World: BBBYQ and Beyond", "text": null, "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": ""},
{"username": "mjonesgcms", "url": "https://www.reddit.com/r/ThePPShow/comments/143uuce/what_if_pulte_owns_bonds_not_shares/", "time": 1686186236.0, "subreddit": "r/ThePPShow", "title": "What if Pulte owns bonds not shares?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Pulte said he doesn&#39;t own any shares, but what if he owns bonds.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mjonesgcms", "url": "https://i.redd.it/nxgodt9aiz1b1.jpg", "time": 1685005440.0, "subreddit": "r/ThePPShow", "title": "This is probably nothing...", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/nxgodt9aiz1b1.jpg\"/></div>"}]