[{"username": "mmtlp_throwaway", "url": "https://www.reddit.com/r/ThePPShow/comments/1769tx4/reading_between_the_lines_of_some_of_brenden/", "time": 1697124925.0, "subreddit": "r/ThePPShow", "title": "Reading between the lines of some of Brenden Dearie's answers", "text": "<!-- SC_OFF --><div class=\"md\"><p>Last night, PPShow interviewed Brenden Dearie, CEO of Protocol Gemini and Cybercrew.  There are a lot of good nuggets, and I&#39;d highly recommend watching it for yourself.  Below are some of the highlights that stood out to me.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.youtube.com/live/OjxxtfIjO1s?si=vjaZ5MeS76rHNt8V&amp;t=1738\">Interview - timestamp: 28:58</a></p>\n\n<p><strong>PP:</strong> Are you under any NDAs with Gamestop itself?</p>\n\n<p><strong>Dearie:</strong> Um... yes, I have NDAs in place. I think everyone can tell. Some- sometimes, I&#39;ll stutter or be guarded with my words, but I try my best to be as transparent as possible, but yeah, you know, there&#39;s definitely things in place that don&#39;t allow me to say certain things.</p>\n\n<p><strong>PP:</strong> Sure. Do you, for instance, work directly with Ryan Cohen is there like a branch as to how you work, if you can answer that within your NDA?</p>\n\n<p><strong>Dearie:</strong> Um... no, I don&#39;t have direct conversations with Ryan Cohen.</p>\n\n<p><strong><em>My interpretation:</em></strong> <em>Dearie has let us know that he is bound by an NDA or possibly multiple NDAs. He did not specifically say it is a Gamestop NDA. He also carefully stated that he does not have direct conversations with RC, but it sounds like he probably still works with RC in some capacity.</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.youtube.com/live/OjxxtfIjO1s?si=vjaZ5MeS76rHNt8V&amp;t=1738\">Interview - timestamp: 47:40</a></p>\n\n<p><strong>PP:</strong> Brenden, if you don&#39;t mind us asking, you know of course we&#39;re Bed Bath guys, so a lot of people in the community have wondered for a long time if this tweet from Protocol Gemini has anything to do with, obviously, it seems to be, it says Bed Bath Beyond almost like a congratulations. What does this mean, Brenden, of course if you&#39;re comfortable answering it, a lot of people in the community have been curious.</p>\n\n<p><strong>The emojis in the tweet:</strong></p>\n\n<p>🎉🛏️🛁🚀</p>\n\n<p><strong>Dearie:</strong> Yeah. Um.. you know, I&#39;ll be honest, I&#39;m kind of a shit poster, and I like emojis, and I think that this one, depending on the timing, could have been related tooooo... Meta gates, uh.... which you know, we&#39;re passionate about. We&#39;ve released some really cool designs of some of what we call props. Now, there&#39;s a cool purple circle bed with Protocol Gemini sheets... I don&#39;t know if anyone really knows how to fold a circle sheet. I can barely fold a normal fitted sheet. Um... but, this is kind of like a reminder to celebrate your victories, you know, get lots of rest, take care of yourself, and then, you know, the other one. I&#39;m a big Andre 3000 fan. He says spaceships don&#39;t come equipped with rearview mirrors.</p>\n\n<p><strong><em>My interpretation:</em></strong> <em>Seriously, go watch this one for yourself. Travis and Michael can&#39;t keep from cracking up while Dearie does his best attempt to explain the tweet.</em>  </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.youtube.com/live/OjxxtfIjO1s?si=2Ds4zL8Zac2y2O9i&amp;t=2965\">Interview - timestamp: 49:25</a></p>\n\n<p><strong>PP:</strong> Just out of curiosity, you don&#39;t have any NDAs with Teddy Holdings or Bed Bath or Overstock, for instance, Dream on Me. Do you have any NDAs out of those four?</p>\n\n<p><strong>Dearie:</strong> [pause while staring at the ceiling] Uh... If I did, I wouldn&#39;t be able to mention them.</p>\n\n<p><strong><em>My Interpretation:</em></strong> <em>you can see as soon as PP starts forming the question that Dearie is thinking about how to answer the question. He&#39;s staring at the ceiling while formulating the answer in his head, and the answer itself is incredibly telling.</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.youtube.com/live/OjxxtfIjO1s?si=629ULzg2ZjFiCN5k&amp;t=4151\">Interview - timestamp: 1:09:11</a></p>\n\n<p><strong>PP:</strong> Do you have any Bed Bath &amp; Beyond shares, Brenden? Do you have a holding in Bed Bath &amp; Beyond at all?</p>\n\n<p><strong>Dearie:</strong> Uh, yes, I&#39;ve invested in that, Gamestop, you know, I&#39;m a degen, you know... I&#39;m not saying I&#39;m smart for it, either, right.</p>\n\n<p><strong><em>My interpretation:</em></strong> <em>Dearie knows some of the inner workings and has NDAs with entities surrounding RC. He knows things we don&#39;t, and he&#39;s a BOBBY.</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.youtube.com/live/OjxxtfIjO1s?si=R1It35yhy_17kbPi&amp;t=4226\">Interview - timestamp: 1:10:26</a></p>\n\n<p><strong>PP:</strong> If you don&#39;t mind a &quot;yes&quot; or &quot;no&quot; or &quot;I can&#39;t answer&quot;, do you have an NDA with Dream on Me?</p>\n\n<p><strong>Dearie:</strong> I don&#39;t know what Dream on Me is. No</p>\n\n<p><strong>PP:</strong> Do you have an NDA with Teddy Holdings?</p>\n\n<p><strong>Dearie:</strong> [pausing and looking up to think] N.. no.</p>\n\n<p><strong>PP:</strong> Do you have an NDA with Overstock?</p>\n\n<p><strong>Dearie:</strong> [pausing longer and looking up to think while Travis cracks up] No.</p>\n\n<p><strong>PP:</strong> Do you have any prior or current NDAs with Bed Bath &amp; Beyond ie. Butterfly?</p>\n\n<p><strong>Dearie:</strong> [long pause to think] Nnnno.</p>\n\n<p><strong><em>My interpretation:</em></strong> <em>The way he had to pause to think about it and make sure he didn&#39;t answer untruthfully makes me think he definitely has an NDA with some entity involved here. Perhaps he has an NDA with RC Ventures, Hudson Bay, or some other entity, but he had to stop and think about it each time.</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.youtube.com/live/OjxxtfIjO1s?si=UNvTEKXuouVuRgzc&amp;t=4880\">Interview - timestamp: 1:21:20</a></p>\n\n<p><strong>PP:</strong> You mentioned you have a position in Bed Bath &amp; Beyond... I&#39;m assuming you&#39;re still holding that position, and if you are, what are your thoughts on where equity is going with the stock for instance? Do you have any opinions in general?</p>\n\n<p><strong>Dearie:</strong> Um... I&#39;m gonna stay away from that question.</p>\n\n<p><strong>PP:</strong> Alright, is there any reason why?</p>\n\n<p><strong>Dearie:</strong> I... I&#39;m not really in a position that I can speak on any specific financial advice or anything. I say do your own research. Come to your own conclusion, and that&#39;s my responsible answer.</p>\n\n<p><strong>PP:</strong> What&#39;s your cost basis for your position?</p>\n\n<p><strong>Dearie:</strong> [pause] Uh... different ones?</p>\n\n<p><strong><em>My interpretation:</em></strong> <em>Dearie was uncomfortable and was very careful to not say too much here. He definitely knows something and does not want violate any NDAs.</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.youtube.com/live/OjxxtfIjO1s?si=yIuprQd4FsTK31Nq&amp;t=5408\">Interview - timestamp: 1:30:08</a></p>\n\n<p><strong>PP:</strong> If there&#39;s anything else that you want to add, Brenden, before we let you go, we&#39;d love to hear it.</p>\n\n<p><strong>Dearie:</strong> I&#39;ll leave you guys with a bit of positivity. I think that right now, there&#39;s a lot of people stressed out about a lot of things. Um... and you know, I think that... a lot of times, situations can seem bleak, and again, this isn&#39;t financially related or advice on buying stocks or you know. Please don&#39;t read into this anything below the surface level. I just want to kind of encourage people that you know, they&#39;ve got this thing called the Wheel of Fortune, the Wheel of Fortuna, right? and it&#39;s basically, you&#39;ve basically got this big wheel of good luck/bad luck, right? And if you hit bad luck so many times, the way I like to look at it is, you know, I got all of that bad luck out of the way. Now, I can start getting some good luck.</p>\n\n<p><strong>PP:</strong> One final question before you leave, Brenden. A lot of us in Bed Bath &amp; Beyond are super tin foil guys. In you&#39;re own opinion, again it&#39;s speculative, is the tin foil so crazy after all, or what?</p>\n\n<p><strong>Dearie:</strong> Um... I&#39;ll politely decline to answer that question.</p>\n\n<p><strong><em>My interpretation:</em></strong> <em>My tits are so fucking jacked.</em></p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mmtlp_throwaway", "url": "https://www.reddit.com/r/ThePPShow/comments/170mp94/notes_from_salvtores_space_last_night/", "time": 1696524137.0, "subreddit": "r/ThePPShow", "title": "Notes from Salvtore's space last night", "text": "<!-- SC_OFF --><div class=\"md\"><p>You can listen to the space call here: <a href=\"https://twitter.com/i/spaces/1OyKAWPvzygJb?s=20\">https://twitter.com/i/spaces/1OyKAWPvzygJb?s=20</a> </p>\n\n<p>Some of the important notes for people who don&#39;t have time to listen to the full 2 hours:</p>\n\n<ul>\n<li>jake2b and Okbet are very bullish about the fact that AST has been fired as the transfer agent. This opens up the possibilities including the possibility that BBBYQ (or whatever it will be) could be moved to blockchain. They said this is one of the largest developments to date.</li>\n<li>OKbet speculates that M3 is likely involved in some way, but not sure exactly in what way. M3 has dealt with many bankrupt companies in the past. </li>\n<li>We&#39;ve heard discussion that Form 25 (the form to delist securities) has to be filed for 90 days before the equity can be delisted (and new equity issued in its place). Some people theorized there&#39;s an additional 10-waiting period on top of that. Okbet clarified that the 10-day window does not apply and that shares will be delisted on October 8. This must happen before new equity can be issued.</li>\n<li>Okbet also noted that the October 26 court hearing does not need to take place if they settle it out of court. This could easily be done at any point.</li>\n<li>jake2b and Okbet went over some docket language about a liquidating trust and section 1145 exemption which would only be included in the docket and approved by the judge if they were planning to issue new securities.</li>\n</ul>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mmtlp_throwaway", "url": "https://www.reddit.com/r/ThePPShow/comments/16z3fps/docket_2402_dropped/", "time": 1696367056.0, "subreddit": "r/ThePPShow", "title": "DOCKET 2402 dropped", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjU2OTcyNw==&amp;id2=-1\">Notice of Hearing for: Evidentiary Hearing regarding Store Number 1107. (related document:1025 Limited Objection to the Notice to Contract Parties to Potentially Assumed Executory Contracts and Unexpired Leases, filed by Keri P. Ebeck on behalf of Realty Income Corporation.; 1360 Objection to Debtors&#39; Motion for Order Authorizing Debtors to Assume and Assign Real Property Lease for Store 1107 (related document:714, filed by Keri P. Ebeck on behalf of Realty Income Corporation. (Attachments: # 1 Certificate of Service) filed by Creditor Realty Income Corporation). The following parties were served: Debtor, Debtor&#39;s Attorney, US Trustee and any other party having filed a Notice of Appearance in this case. Evidentiary Hearing scheduled for 10/26/2023 at 10:00 AM, to be heard by Judge Christine M. Gravelle at VFP - Courtroom 3B, Newark.</a> </p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mmtlp_throwaway", "url": "https://www.reddit.com/r/ThePPShow/comments/16mzz8w/okbet_on_a_twitter_space_right_now_with_an_alt/", "time": 1695151719.0, "subreddit": "r/ThePPShow", "title": "OKBet on a Twitter Space right now with an alt account", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://twitter.com/i/spaces/1lDxLPvqBLkxm?s=20\">https://twitter.com/i/spaces/1lDxLPvqBLkxm?s=20</a> </p>\n</div><!-- SC_ON -->", "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]