[{"username": "mommastonks", "url": "https://www.reddit.com/r/ThePPShow/comments/17oi6xf/too_many_questions_whats_with_this_10_billion_how/", "time": 1699208874.0, "subreddit": "r/ThePPShow", "title": "Too many questions: what’s with this $10 billion, how much do we get in equity, and other matters of fact and speculation", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen a lot of people ask about the $10 billion, and cash payouts, and a looooot of speculation that’s a off, so consider this a high level summary of where we stand today (there’s also been some discussion on Spaces and elsewhere in more detail by professionals—I defer to them and any other expert on any conclusions I’m drawing here that are different. This is not financial advice, merely my own personal opinion).</p>\n\n<p>So. Question one:</p>\n\n<h1>Will the $10 billion pay everyone off, including us?</h1>\n\n<p>Yes, it is enough to, But NO, it very likely <em>won’t</em> be used for that (at least not in full).</p>\n\n<p>As we know, when exiting bankruptcy with NOLs intact (&gt;50% of new company keeps old shareholders AND qualified creditors), any remaining claims <em>do</em> need to be somehow settled up. More on that below, but at a minimum other claimants need to be settled up before we get paid. Additionally, the company as a going concern (also needed for NOLs) is worth a lot more to us AND everyone else involved in the bankruptcy if they don’t pay off anyone they don’t need to.</p>\n\n<h1>So how much of that money <em>do</em> we get paid?</h1>\n\n<p>Unknown, but could range from $0 to much higher.</p>\n\n<p>Why is zero a possibility? To get the NOLs, the business needs to remaining intact. Anything in that bucket that doesn’t go to paying us will set up the ongoing concern for additional success (ie I wouldn’t expect to see the <em>entire</em> $10b split across the share count)</p>\n\n<h1>So if they keep it all, is the company just worth zero still because they have all assets offset?</h1>\n\n<p>The fun thing about money in business is that $10b injected into a company <em>doesn’t</em> make the company worth $10b. It also doesn’t keep it worth $0, unless you’re only measuring by actual dollars. $10 billion cash in hand with $10 in debt is worth quite a bit more than $0 (even if it fully balances out), and is also worth more than $10 billion. You can see this in action when money is injected to buy equity in companies (in the valuation multipliers on any operating company, but especially on venture capital—the value in most companies is in the expectation of to capturing <em>future</em> revenue, not just current). For a fully operating business, you can get a more consistent valuation based on the business’s income over the last year of revenue, + what the market you operate in is expected to do (these are those industry estimates you see on earnings).</p>\n\n<p>As examples, Amazon has a price to earnings ratio of ~94, which is <em>really</em> high (as the expectation is that it will continue to expand in current and future markets).</p>\n\n<p>Best Buy, as a <em>better</em> example of normal, has a price to earnings ratio of ~10.</p>\n\n<p>But what if it’s not fully operating, and value is only in operating potential, not in actual earnings? This is where we’d be looking at a discounted cash flow analysis, which is how many startups are valued when injecting in cash many multiples greater than actual current revenue.</p>\n\n<p>In <em>our</em> case though, Butterfly’s potential valuation is trickier than either of these. We have actual stores that have operated within the last year, someone’s injected 10b in assets in, PLUS the NOLs, plus the existing vendor relationships/warehouses/stores, plus the backing (presumably) of very knowledgeable leadership. Plus none of the naturally accumulated bad business commitments that grow slowly over time in any business, but usually create drag because carving them out would be an enormous effort while the business is operating. Scaling is less of a problem, because the backbone is all there, and operational inefficiencies have been carved out at scale through the Chapter 11 process.</p>\n\n<h1>How much value does that actually net out to for us?</h1>\n\n<p>No one knows yet, but it should be considerable, and that’s ignoring those of you who only came to the party for the potential short squeeze. We don’t know what the equity split will be with us as shareholders, AND we don’t know how they’re going to sell off/split the businesses apart. As long as they allow shareholders and qualified creditors (qualified defined as they’ve held the debts for more than 3 years, OR the debts rose in the normal course of business) to keep at least 50% of the equity during reorg, they keep however many NOLs have been racked up, and the actual worth (and what payout shareholders might get for a spinoff, via redoing the plan to make this happen) is, as in any Chapter 11 with a potential going concern, a giant question mark.</p>\n\n<h1>So why is everyone so excited?</h1>\n\n<p>Even forgetting the NOLs as a source of value that incentivizes someone to both take advantage of them, as that’s really what requires preserving value for retail, there’s something a LOT more concrete.</p>\n\n<p>One of those pre-bankruptcy creditors, Hudson Bay, opted for <em>common stock</em> ownership (ie: one of us) after bankruptcy had been initiated. </p>\n\n<p>They OPTED INTO dropping their priority in the creditor claims, AND already agreed on what price point they bought their equity at. If there were numerous other qualified creditors expected to dilute it further, this makes no sense, even if you took into consideration the going concern and NOLs.</p>\n\n<p>However <em>improbable</em>, the <em>simplest</em> reason for doing this would be that <em>if</em> there isn’t any (or much) additional dilution expected, that is the path that would make the most sense for them to take.</p>\n\n<h1>A more rare question: “But how do we know this $10 billion is a good thing for us? It’s showing up as a debt, how do we know they weren’t forced into something after the IP sales didn’t raise enough”</h1>\n\n<p>You can’t force someone to accept money. This money gives whoever provided it priority claim, AND if only paid out, removes every other claimant from being paid out. Whichever stakeholders have been running this crazy weird show are the same ones who accepted it, and there was no reason to hold the assets back that they did unless someone wanted them. If it was an eleventh hour bid practically under duress, they wouldn’t have needed to (or bothered to!) set up the whole show to need a buy out like that. If it didn’t appear then you’re on the hook for wasting more than half billion dollars of claimant owed money on things that weren’t needed.</p>\n\n<h1>tl;dr</h1>\n\n<p>I’m trusting the process. No one knows how much, or even when, but decisions post bankruptcy point to some very good things for how much/little dilution we can expect to see.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🟢 Big Momma 📈 Stonks 🦋", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mommastonks", "url": "https://www.reddit.com/gallery/17gc29z", "time": 1698259895.0, "subreddit": "r/ThePPShow", "title": "Personally I would expect you to protect your rights as you see fit, especially when you’re being informed that you’re being opted out of them. Document, document, document.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The Plan doesn’t declare your securities worthless in the eyes of your broker unless you do too. No bankruptcy plans do, that’s why bankrupt companies frequently continue to trade, even at stupidly low volume and dollar value. It’s still an ownership right to a particular thing—even if the current perceived value of that is nothing, that doesn’t mean you lose your rights to it. You can <em>give it up</em>. But it can’t be taken from you without giving it up.</p>\n\n<p>Either something is coming soon, or the DTC and our brokers are trying to pull some fast shit without having jurisdiction for it.</p>\n\n<p>I’m expecting the former but if it’s the latter it only increases the amount of fraud I’m sure is already being investigated.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/5OaNNmYHaWpdluwQuByJT9FmxmgYQ3LgpwlsZ2mvIRs.jpg\"/></div>"},
{"username": "mommastonks", "url": "https://www.reddit.com/gallery/17a80h0", "time": 1697574959.0, "subreddit": "r/ThePPShow", "title": "New ticker 0HMI, the London Stock Exchange, and moving to...a Global Equity Segment? (Part 1)", "text": null, "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/wjlh3k5e_dIPRSJGOC31noNXixGv9ha9M31p32mBzuo.jpg\"/></div>"},
{"username": "mommastonks", "url": "https://youtu.be/8liOzxWSlzM?si=2HTOBcdpLSeHNuVC", "time": 1697460719.0, "subreddit": "r/ThePPShow", "title": "It’s morning everyone, today’s the day!!", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/8liOzxWSlzM/maxresdefault.jpg\"/></div>"},
{"username": "mommastonks", "url": "https://www.reddit.com/r/ThePPShow/comments/1793unn/yall_have_fun_in_vegas_ill_be_at_the_ohio/", "time": 1697455956.0, "subreddit": "r/ThePPShow", "title": "Y’all have fun in Vegas, I’ll be at the Ohio Renaissance Faire this weekend", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m East coast and have kids, I’ll be in Miami in November for Pulte’s thing so last minute travel is probably not in the cards for me—but if we fly this week then I’m going for a drive and going to cosplay not being a BBBY ape for a hot minute because I am so ready to breathe.</p>\n\n<p>Only for a minute though, because y’all know what happens to our OG love story with Jimmy if we all get nothing but cash.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mommastonks", "url": "https://youtu.be/8liOzxWSlzM?feature=shared", "time": 1696591368.0, "subreddit": "r/ThePPShow", "title": "It’s morning everyone, today’s the day!!", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/8liOzxWSlzM/maxresdefault.jpg\"/></div>"}]