[{"username": "Moribunde", "url": "https://i.redd.it/pyttsp8lv61c1.png", "time": 1700349375.0, "subreddit": "r/ThePPShow", "title": "Sometimes I wonder if the scale I am considering this on is realistic.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/pyttsp8lv61c1.png\"/></div>"},
{"username": "Moribunde", "url": "https://www.reddit.com/r/ThePPShow/comments/17j9hgm/canadiape_questions/", "time": 1698604900.0, "subreddit": "r/ThePPShow", "title": "Canadiape questions", "text": "<!-- SC_OFF --><div class=\"md\"><p>So, registered accounts can&#39;t hold OTC stocks. Non-registered accounts should get a tax benefit for tax loss. If we get new shares, on a registered account would we still be considered OTC or would the shares be off OTC? On a non-registered do we still have the ability to take advantage of the tax loss? Any other considerations to be made?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Moribunde", "url": "https://www.reddit.com/r/ThePPShow/comments/17dlh8h/so_are_we_about_to_eat_the_brits_and_will_there/", "time": 1697950233.0, "subreddit": "r/ThePPShow", "title": "So are we about to eat the Brits? and will there be more?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Unlimited rehypothecation being forced to close on one ticker through corporate action. I&#39;ll let that sentence sink in.</p>\n\n<p>At the poker table that only the biggest players sit, countries bet their economies through their financial systems. A game of fiscal risk that is paid for by its citizens for the years to come. If unlimited rehypothecation of shares is allowed through the London Stock Exchange, one of the oldest and largest institutions in the world, and primary of the UK. It would be of no surprise to see such an institution collapse in on itself as it calls for closure of such positions. </p>\n\n<p>But does it end there? I&#39;ve seen all too often a country falls financially, then MSM files in and paints the game over and the source of the failure identified for the giant ass correction it causes. No. I think there&#39;s more. The counterparty, SHFs and whatever other group dumb enough to short naked, they&#39;ll eventually be revealed when they normally get away with it. </p>\n\n<p>Naturally I expect to find Citadel, but I get the feeling that there&#39;s other countries involved like Russia and China. Which would explain the War in Ukraine and China&#39;s failing real estate ponzi. All of this suggests there&#39;s a ceiling to MOASS, as eventually these countries and counter parties will fail and the blackhole that is MOASS will have nothing to feed on. </p>\n\n<p>To me this is where Infinity will be born. A new system will be forced into existence that utilizes DRSd GME and maybe even the DRSd ?BUTTFQ? as a form of gold standard for new currency. So HODL my bully boys, HODL. Not for money, not for cell, not for change; for all of it comes if you hold for INFINITY.</p>\n\n<p>&#x200B;</p>\n\n<p>PS Yeah, this is the blackest of tarry tinfoil, but damn it makes so much sense to me.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Moribunde", "url": "https://www.reddit.com/r/ThePPShow/comments/16u7a4m/moass_starts_with_a_spark_babies_will_grow_up_to/", "time": 1695878456.0, "subreddit": "r/ThePPShow", "title": "MOASS starts with a spark. Babies will grow up to love games.", "text": "<!-- SC_OFF --><div class=\"md\"><p>My fellow apes. We stand at the cusp of greatness or defeat. When we shall eventually enter the darkness on this 3 day countdown, we individual apevestors will fuck around and find out. </p>\n\n<p>Baby is invaluable as what products are absolutely vital in a growing society? Big daddy government needs to keep the population going to keep the economic engine rolling. An acquisition of such an entity will be purchasing a guaranteed money maker. Like Pulte says, good idea to buy something that makes money, and Baby just makes sense.</p>\n\n<p>The coming of the end will likely result in the closing of shorts, I suspect that the resulting chaos may force a controlled price on the sale as this is all tied to legal proceedings. As much as I would like 2 infinity pools this is my speculation for the end game. Regardless I&#39;ve got DRS just in case. Ultimately this value gain will be what pays for the full or significant DRS of GameStop, resulting in MOASS.</p>\n\n<p>But hey, y&#39;no not financial advice, shit can go south etc. I personally just like the stocks and might be very wrong. Guess I&#39;ll just fuck around and find out.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Moribunde", "url": "https://i.redd.it/ukf2cbvqrxpb1.png", "time": 1695444799.0, "subreddit": "r/ThePPShow", "title": "Institutions knew about something they'd need to pay for since September of 2022 and the Earnings Remittance DUMPED. Cohencidence? Icahn't believe it.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ukf2cbvqrxpb1.png\"/></div>"},
{"username": "Moribunde", "url": "https://www.reddit.com/r/ThePPShow/comments/159tlz6/the_shillstock_has_been_running_overtime/", "time": 1690340330.0, "subreddit": "r/ThePPShow", "title": "The Shillstock has been running overtime. Psychology of the play explained.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Moribunde", "url": "https://www.reddit.com/r/ThePPShow/comments/159tlz6/the_shillstock_has_been_running_overtime/", "time": 1690340330, "subreddit": "r/ThePPShow", "title": "The Shillstock has been running overtime. Psychology of the play explained.", "text": "I've recently been inundated with news of the Judas stock, the liar of the basket, popcorn puppet of AA who has a SHF hand shoved up his ass. That AA who declared he would be vetoing the vote on the dilution of their shares. If you haven't clued in, this has to do with the basket of stocks that GME is in, and popcorn is being thrown at... me at least left right and centre. Can anyone else concur?\n\nI've ignored shillstock ever since AA came out and said he's going to dilute 84 years ago. It was clear we had different leadership. I've noticed for the last few days popcorn has kept appearing in my feed, and I find popcorn only good for a movie, not my reddit. \n\nThe numbers are absolutely ridiculous, CTB off the charts, FTDs at dumb levels, but the letter that AA published to say he'd be vetoing the vote on the dilution of shares? Can't find it. Apparently a vote happened that went against converting APE into popcorn which would have lead to dilution, and AA said popcorn needed money so we're doing it anyways in that letter. \n\nThen what? Does it die down and everyone fucks off cause that's a dick move? No, it goes into overdrive! They start pounding out these ridiculous stats and hide the problem, you just saw it spike AH on friday last week (cause dilution was off the table apparently?), then AA shoots out a letter to say yo we gon be pissing in the pool anyway, and that letter gets hidden on the search while they advertise like crazy?\n\nMan... please don't tempt me with your diluted popcorn butter, that's gross. There's only one true Gamestopper.\n\nP.S. it doesn't matter if the stats are crazy if they can print shares from the source. they want you to buy popcorn cause that's where they have a leak in the memebasket.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]