[{"username": "mountainoftea", "url": "https://www.reddit.com/r/ThePPShow/comments/17cnk4o/a_benefit_to_shares_being_declared/", "time": 1697841487.0, "subreddit": "r/ThePPShow", "title": "A benefit to shares being declared \"worthless\"/disappearing from accounts/etc....", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just had what a wrinkle-brane might call, &quot;a thought.&quot;  </p>\n\n<p>No one who has hodled up to this point will be harangued by their SO to sell their position to come up with cash for whatever - &quot;cute&quot; shoes, a night out on the town, life-saving medical care, etc.     </p>\n\n<p>As there are no shares in the accounts, there&#39;s truly nothing (currently) to sell.    </p>\n\n<p>Your investment is safe from those around you who would like you to sell it to fund their projects.  </p>\n\n<p>Congratulations!  </p>\n\n<p>As previously discussed - <a href=\"https://www.reddit.com/r/ThePPShow/comments/172bwi3/comment/k3x305r/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\">might wanna be REAL quiet about this after it moons.</a>  </p>\n\n<p>Just sayin&#39;.  </p>\n\n<p>Stay Zen!  </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mountainoftea", "url": "https://www.reddit.com/r/ThePPShow/comments/16z38uo/counting_the_chickens_before_they_hatch_a_thought/", "time": 1696366622.0, "subreddit": "r/ThePPShow", "title": "Counting The Chickens Before They Hatch - A Thought Experiment", "text": "<!-- SC_OFF --><div class=\"md\"><p>Greetings, Comrade Smoothbranes!</p>\n\n<p>&#x200B;</p>\n\n<p>There is the possibility that some of you Crayon-munchers may come into a sizeable chunk of change in the following weeks or months.</p>\n\n<p>&#x200B;</p>\n\n<p>So, before that happens, let&#39;s play a free game called, &quot;What If,&quot; or &quot;You Gonna Eat All Those Tendies On Your Plate In One Sitting?&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>A little background...</p>\n\n<p>&#x200B;</p>\n\n<p>Recently, a friend of mine became a multimillionaire.    </p>\n\n<p>Not their fault.  It just happened.    </p>\n\n<p>Fortunately, it wasn&#39;t through some process like the lottery, so there was no public announcement.  Said friend grew up in a poor but good, honest, working class family, and while extremely intelligent, is not necessarily financially savvy.</p>\n\n<p>So, I dusted off this old chestnut and sent it to said friend, who claims to have read it and told me they have told no one (well, I know, but I was privy to the circumstances when this all came about, so I was kinda in the know by accident and fortunately for my friend I&#39;m completely uninterested in said friend&#39;s newfound wealth beyond the issue of making sure it doesn&#39;t ruin my friend&#39;s life):</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://old.reddit.com/r/AskReddit/comments/24vo34/whats_the_happiest_5word_sentence_you_could_hear/chb4yin/?context=3\">https://old.reddit.com/r/AskReddit/comments/24vo34/whats_the_happiest_5word_sentence_you_could_hear/chb4yin/?context=3</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>[Personally, I feel the happiest 5-word sentence is, &quot;You Are Not The Father&quot; - tip of the hat to Maury Povich - but I digress.]</p>\n\n<p>&#x200B;</p>\n\n<p>I figure the above post is a good starting point for this topic.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;ve seen a lot of Regards writing on these forums about what they may do if they end up with wheelbarrows filled with Krugerrands - donate to charity, help people out, Hookers &amp; Blow, etc.  All well and good.</p>\n\n<p>&#x200B;</p>\n\n<p>Still, I feel it is really, truly important to take some time while sitting in the closet where your wife&#39;s boyfriend put you while they oil each other up and have their daily playpen party to think about what comes next if your bank account is suddenly filled to bursting.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>~~~~~~~~~~</p>\n\n<p>&#x200B;</p>\n\n<p>As for me - I&#39;m really boring.  </p>\n\n<p>&#x200B;</p>\n\n<p>Old, no kids.  </p>\n\n<p>&#x200B;</p>\n\n<p>I don&#39;t need much, and the sorts of things that are really expensive (yachts, sports cars, private islands, personal jets, Hookers &amp; Blow, etc.) don&#39;t appeal to me.  If this play blows up, I&#39;ll most likely take the proceeds from it and put into super-safe investments which will pay out on an annual basis, and that will supplement my current status.  </p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;ll probably upgrade my healthcare plan, buy a bigger deep freeze, and hire a maid to come in every once in a while.  </p>\n\n<p>&#x200B;</p>\n\n<p>When I croak, whatever funds are left (probably the initial principle will still be not only intact, but will have grown) will go to various and sundry museums and charities I support already.  There&#39;s one person I may leave some things to, but that&#39;s it.  Pretty simple.</p>\n\n<p>&#x200B;</p>\n\n<p>~~~~~~~~~~</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Do you have a plan?  If so, great!  Feel free to share.</p>\n\n<p>&#x200B;</p>\n\n<p>Don&#39;t have a plan?  If so, that&#39;s okay, too!  Time to start formulating one.</p>\n\n<p>&#x200B;</p>\n\n<p>Feel free to talk amongst yourselves.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]