[{"username": "Mrkrabsisgangsta", "url": "https://www.reddit.com/r/ThePPShow/comments/16pybea/only_the_hung/", "time": 1695455254.0, "subreddit": "r/ThePPShow", "title": "Only the hung", "text": "<!-- SC_OFF --><div class=\"md\"><p>born a degenerate, it was all the rage\nWatchin TV and playin Nintendo. Introvert in a cage.\nI finally went out and found people like me, now I&#39;ve grown up weird loving memes, gaming and reddit baby.</p>\n\n<p>Only the young, only the hung,\nThat&#39;s how our story has begun\nWe&#39;re being played its fucked up you see.\nMaking us all pay, its free for them but not for me. </p>\n\n<p>In a world of shadows, where corruption runs deep,\nShoutout to the pornhub loving SEC, your talk is cheap. Gary Gensler do your fucking job you creep. \nNo one is looking out for us, so it&#39;s time for a change.\nOnly the young, only the hung, its only begun, our emotions are numb.</p>\n\n<p>Ryan,Bill and Icahn cant you see, we&#39;re ready and 741 is still a mystery</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Mrkrabsisgangsta", "url": "https://www.reddit.com/r/ThePPShow/comments/16m238e/in_times_like_these_we_need_to_remember/", "time": 1695059111.0, "subreddit": "r/ThePPShow", "title": "In times like these we need to remember", "text": "<!-- SC_OFF --><div class=\"md\"><p>Alright you degenerate fuckers. \nI&#39;m writing a post to remind you that when this pops very very soon we be retarded and hold till crazy numbers start to appear. The volatility will be the craziest ever viewed by most of you. You will cry with happiness and sadness in different intervals. You will think surely this is the peak of this absolute mountain of green then BAM it goes down 30% then 10 minutes later it will again begin to skyrocket. \nIt will be a rememberable week and we will celebrate with aftermath photos of melons and we finally get that feeling knowing those people who doubted us will see the news and we get to shove it down their throats.</p>\n\n<p>Peace.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]