[{"username": "mrsaltyrocks", "url": "https://www.reddit.com/gallery/17hz1i3", "time": 1698444907.0, "subreddit": "r/ThePPShow", "title": "Two different theories", "text": "<!-- SC_OFF --><div class=\"md\"><p>Picture 1 is <a href=\"/u/Region-Formal\">u/Region-Formal</a>&#39;s hypothesis, which suggests that Butterfly will be utilized in Ichan&#39;s portion of the transaction </p>\n\n<p>Picture 2 is <a href=\"/u/TK-421doUcopy\">u/TK-421doUcopy</a>&#39;s hypothesis, which suggests that Butterfly will be utilized in RC&#39;s portion of the transaction </p>\n\n<p>Thoughts?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/rLYQA3bLEk7YTphPYTLosjt0QYxYwXLHO23EBJGziYM.jpg\"/></div>"},
{"username": "mrsaltyrocks", "url": "https://www.reddit.com/r/ThePPShow/comments/170m832/trust_me_bro_ast_shares_can_be_resurrected/", "time": 1696523017.0, "subreddit": "r/ThePPShow", "title": "Trust me bro: AST shares \"can\" be resurrected", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just another trust me bro chiming in to keep our hope candles lit as we transition through this &quot;going dark&quot; period. </p>\n\n<p>I called AST today and spoke with a 2 representitives. The first one was a complete fucktard who barely knew up from down. She literally told me my shares were gone and that I should call BBBY investor relations to find for them, which I did and got ahold of another clueless dimwit, who I could of sworn was his first day. Completely useless. So, I called AST back and got connected with this dude who seemed to not just know his shit, but was also super confident and up-to-date with bbby&#39;s situation. </p>\n\n<p>This was a summary of our convo;</p>\n\n<p>First, he was able to verify that my shares were in my account, but because the shares are technically worthless right now, the account is kinda frozen. </p>\n\n<p>To make things more difficult, I sent my shares to AST 3 weeks ago but still haven&#39;t received the account activation envelope to set up my account yet. So my shares are technically still in limbo. </p>\n\n<p>He reassured me that my shares had arrived and we&#39;re safe. He then said to just hold tight until they get more info and/or instructions, mentioning that this was somewhat common with bankruptcies. </p>\n\n<p>I pressed him a little harder by asking him &quot;What is the point of waiting if my shares are worthless now? the 8K says BBBY shares have no value. How can they become valuable again?&quot; (Just for the record, this is not what I believe. I simply wanted to see what he would say)</p>\n\n<p>Here&#39;s comes the bullish part. </p>\n\n<p>He responded by saying that it depends on the restructuring plan and how BK plays out. Even in this stage of BK, a new company or buyer can come in and offer cash or equity for our shares, which would resurrect them and give them value again. He also said its possible another company, like computershare, (for example - his words) could take over as the new registered agent. AST would then move our shares there. He emphasized again that this was an example.</p>\n\n<p>Now, I know this next part might sound unbelieveable, so take it or leave it, but I swear, he also said, &quot;dont beleive 99% of what you hear online because people are just parroting what they here from the media. I personaly think there are people online trying to spread confusion.&quot; He then wrapped up our conversation by reminding me that my shares were safe with AST while we wait for new developments. </p>\n\n<p>Bullish AF, baby </p>\n\n<p>TLDR: shares are just &quot;temporarily&quot; worthless as our stock transitions through this akward holding pattern. Essentially confirming that our shares can still become valuable again. Just more proof that the fuckwad meltdowners can&#39;t read legalese for shit. </p>\n\n<p>LFG!!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]