[{"username": "mutualfriend323", "url": "https://www.reddit.com/r/ThePPShow/comments/17sclul/mr_cohen_is_nothing_but_a_crook/", "time": 1699647006.0, "subreddit": "r/ThePPShow", "title": "Mr. Cohen is nothing but a crook", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.reuters.com/legal/government/column-meme-king-ryan-cohen-moves-toss-novel-insider-trading-case-by-bed-bath-2023-11-09/?utm_source=reddit.com\">https://www.reuters.com/legal/government/column-meme-king-ryan-cohen-moves-toss-novel-insider-trading-case-by-bed-bath-2023-11-09/?utm_source=reddit.com</a></p>\n\n<p>Based of the quotes from the article about the ongoing pump and dump case about Mr. Cohen. I’m starting to believe that he is just as corrupt and a bad actor as anyone else in the corrupt and greedy corporate world. He knew all in well what kinda twitter and Reddit following he had. He may of had a plan in the beginning but decided it wasn’t gonna work. As far as we know Pulte is here trying to help save Cohens ass in the court case brought against him. Don’t lay to much hope on Pulte. I’m impressed with GameStops earnings and turnaround results, especially for a decaying brick and mortar trend but has shown to do nothing with BBBY. I wouldn’t expect much before, during, or after the December 14th meetup. I believe it will just be another hype/nothing burger situation. This play has been nothing but a countuing lead on and nothing to really show for it besides a growing  community and great entertainment from the PP show. I believe PP and the guys believe in what the spill on the show, which in a sense can be more dangerous. You have a lot of inexperienced retail investors in this play with a lot of money. We’re desperate and hungry. And I believe any glimmer of hope to retrieve something in return is what we’re digging for. I’ve accepted that nothing with come back and my investment is dead. This is starting to become mentally unstable for me and has put a dent in more important goals and events of my life. I respect the people that have come on the PP show and have given all they can to find the needle in the hay stack. As for me, I’m checking out of this mess and going to explore new realms of making a living. If this is your first big loss or first time being an investor. Just know that this was very and clearly and unusual circumstance with high net worth individuals involved that have a reputation of doing bold moves in the markets and business world and or being a good individual (Pulte &amp; Cohen). Just be aware that the term Ponzi stems not from a made up definition but an individuals last name who did fool many good people into high hopes and good things to come. Good luck folks and I hope what ever is to end, ends well for all of us.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mutualfriend323", "url": "https://www.reddit.com/gallery/17qvjlk", "time": 1699477305.0, "subreddit": "r/ThePPShow", "title": "More tinfoil for this Wednesday.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I mean come ON!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/LTiuYBSmwbYBqVbXDTk10HfgJkr8nRIW4VT2epGmJkQ.jpg\"/></div>"},
{"username": "mutualfriend323", "url": "https://www.reddit.com/r/ThePPShow/comments/17p7wu8/simple_tribute_to_fellow_bobbees/", "time": 1699291481.0, "subreddit": "r/ThePPShow", "title": "Simple tribute to fellow BoB-BEEs.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mutualfriend323", "url": "https://v.redd.it/9vkmsqph2zxb1", "time": 1698947266.0, "subreddit": "r/ThePPShow", "title": "Thoughts on this statement? I want us to be right and win just like anyone else on “The PPShow” and this sub.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m on the same boat as everyone else is right now with our shares in limbo. I’m very optimistic that there will in fact be light on the other side but I cannot ignore statements like this from the official courts. What is everyone’s thoughts on this? </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/cDF3eDV4bmgyenhiMXX4JFqZY6_j3LvMHsPln3cBrIgTqeumGUNvSaJ-HTYW.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=20975e74a57faf08882d8f84f23d6454bad3461f\"/></div>"},
{"username": "mutualfriend323", "url": "https://www.reddit.com/gallery/17k2t0j", "time": 1698697640.0, "subreddit": "r/ThePPShow", "title": "Did RC know the share buy backs were not in favor of the shareholders?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Why did the CFO take such a drastic action to take his own life in the timing of the alleged pump and dump case? RC seems to troll Mr. Tritton often. I’m curious if the board at the time offered RC a greenmail deal to repurchase the shares he had in order to steer RC away from their corporate corruption. RC maybe knew they would try and do this but needed it to happen to expose something else.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/IRiJlG7-9bMANiYEnWt_tVw1RzgwGPipuKAF-5JS3hg.jpg\"/></div>"},
{"username": "mutualfriend323", "url": "https://www.reddit.com/gallery/17k1tg6", "time": 1698695128.0, "subreddit": "r/ThePPShow", "title": "Interesting speculation.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Makes you wonder why RC targets Mr. Tritton so much and why he points out the share buy backs in the interview with Joe Fonicello.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/H0_7cAsuRhQ1CoMVmmjUZxfMUEnUNqoTphBwlKalxfQ.jpg\"/></div>"}]