[{"username": "MWM-Mason", "url": "https://www.reddit.com/r/ThePPShow/comments/17wp6pn/i_havehad_an_idea/", "time": 1700147485.0, "subreddit": "r/ThePPShow", "title": "I have/had an idea.", "text": "<!-- SC_OFF --><div class=\"md\"><p>You guys know the Elks Lodge? </p>\n\n<p>“Benevolent and Protective Order of Elks of the U.S.A.\nA Fraternal Organization. </p>\n\n<p>To inculcate the principles of Charity, Justice, Brotherly Love and Fidelity; to recognize a belief in God; to promote the welfare and enhance the happiness of its Members; to quicken the spirit of American patriotism; to cultivate good fellowship; to perpetuate itself as a fraternal organization, and to provide for its government, the Benevolent and Protective Order of Elks of the United States of America will serve the people and communities through benevolent programs, demonstrating that Elks Care and Elks Share.” </p>\n\n<p>Well I had the super 5000% IQ idea of the “Apes Lodge”. I like the idea of the elks lodge. Some of their mission stuff less so. But I like the idea of an Apes Lodge. </p>\n\n<p>Regardless a while ago I purchased the domains for apeslodge.com and .org. I guess I wanted to get your guys opinion on this idea. The only rule I would absolutely want is a way to verify that somehow someway you are an ape via share ownership. I dont know how that would happen, but I would want to keep it secure as far as members would go.</p>\n\n<p>Or if anyone else whom is trusted with this community wants to start it up <em>cough</em> pp crew <em>cough</em>, I can transfer these domains off to them.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MWM-Mason", "url": "https://www.reddit.com/r/ThePPShow/comments/17wp688/i_havehad_an_idea/", "time": 1700147450.0, "subreddit": "r/ThePPShow", "title": "I have/had an idea.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"}]