[{"username": "MycoReactor", "url": "https://i.redd.it/z9nbet0mjb0c1.png", "time": 1699970002.0, "subreddit": "r/ThePPShow", "title": "DTC Issues?", "text": "<!-- SC_OFF --><div class=\"md\"><p>They were having issues on 9/23 with the DTC? Hmmm???</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/z9nbet0mjb0c1.png\"/></div>"},
{"username": "MycoReactor", "url": "https://i.redd.it/ky2if5c6inzb1.png", "time": 1699678954.0, "subreddit": "r/ThePPShow", "title": "Activist investor = Ryan Cohen", "text": "<!-- SC_OFF --><div class=\"md\"><p>Tons of mentions here of an &quot;Activist investor&quot; in AUGUST. It&#39;s obviously RC.</p>\n\n<p>&quot;Prepare summary re: events leading to bankruptcy date/activist investor actions.&quot; Meaning RC likely had a hand in BBBY declaring bankruptcy. Bullish AF.</p>\n\n<p>&quot;Summarize activist investor lawsuit.&quot; Hmmm. Now why would RC&#39;s lawsuit be relevant to the bankruptcy attorneys? Bull thesis verified right here. If they&#39;re discussing his lawsuit it means he&#39;s (obviously) involved still.</p>\n\n<p>Buckle up, ladies and gentlemen. This shit is getting real exciting.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ky2if5c6inzb1.png\"/></div>"},
{"username": "MycoReactor", "url": "https://www.reddit.com/r/ThePPShow/comments/17nyxlz/brandon_meadows_a_connection_to_dream_on_me/", "time": 1699141417.0, "subreddit": "r/ThePPShow", "title": "Brandon Meadows - A Connection to Dream on Me?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Thinking about things today, I realized I hadn&#39;t seen much research on Brandon Adam Meadows, the person responsible for submitting the $10.8b claim against the debtor last week (geez, was it only last week?!?). There&#39;s a lot we don&#39;t know about the claim - Who is behind Brandon Meadows? What is their intent? Are the a good actor? When will their identity be known? As this claim has quickly become the best chance for the bull thesis to come true, I decided to see what I could come up with.</p>\n\n<h1>TLDR:</h1>\n\n<p>Brandon Adam Meadows of Addison Holdings, LLC, submitted the $10.8b claim. Addison Holdings MAY (and that&#39;s a big MAY) have ties to Sapphire Investment Group, which MAY have ties to Dream on Me. In other words, this MAY be our connection. Whoever is acquiring the company MAY be doing so via Dream on Me, which confirms lots of speculation and DD. 🚀🚀🚀🚀🍆💦💦💦🤑🤑🤑🤑</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rag8hpxhseyb1.jpg?width=259&amp;format=pjpg&amp;auto=webp&amp;s=e70c80cbf53bbe5f30429550eb0396e8a91891aa\">Let&#39;s check out Brandon Adam Meadows</a></p>\n\n<p>Ok, so now for the how I got there - What we do know: BAM is the Executive Vice President for Addison Holdings, LLC. Addison Holdings is based in Park City, UT. According to their website, they &quot;Make domestic investments across the capital structure,&quot; whatever that means.</p>\n\n<p>I did some searches for Addison Holdings and Cohen, Addison Holdings and Icahn... No dice.</p>\n\n<p>But searching for Addison Holdings LLC on its own, several entries down, led me to an interesting find: </p>\n\n<p><a href=\"https://preview.redd.it/3yszdcb3ueyb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=1701bfb452e1318ae856007e2c5c470e0abaa1c1\">Something called Dream Addison Holdings LLC in Austin, TX on Bizapedia</a></p>\n\n<p>Dream Addison Holdings. Hold on a second. Like Dream on Me + Addison Holdings? Maybe? Here&#39;s the information on the page:</p>\n\n<p><a href=\"https://preview.redd.it/68y8bhmsueyb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=191782584e67fc8a15b9b54a7fa7ec8a6588045e\">Dream Addison Holdings on Bizapedia</a></p>\n\n<p>Now, admittedly, I don&#39;t know if Bizapedia is reputable, so this should be taken with a grain of salt, but... We know GameStop is headquartered in Grapevine, TX, so I was very interested in this entry. Filed January 9th? Didn&#39;t RC first buy into BBBY in January 2023? And take a look at the contact on record: Dovid Rabinowicz from Brooklyn, NY. And ALSO, look at the &quot;Domestic State.&quot; New Jersey! Hmmmmm...</p>\n\n<p>Searching for &quot;&#39;Dovid Rabinowicz&#39; &#39;Addison Holdings&#39;&quot; comes up with VERY little:</p>\n\n<p><a href=\"https://preview.redd.it/qp39fcpeweyb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=bdbfbe60ba874d35cb11bc6273a105c2ff6111d2\">Only three results. And the last one we should all recognize :)</a></p>\n\n<p>What&#39;s this? Another Dream Addison Holdings in NEW JERSEY??? The same state where Dream on Me is headquartered??? Let&#39;s take a look:</p>\n\n<p><a href=\"https://preview.redd.it/3gui9ukuweyb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=dfffb4f566dbe3f70af341a3ef7f05837ac3e2cc\">Dream Addison Holdings of New Jersey</a></p>\n\n<p>Ok, so we have two Dream Addison Holdings. One in TX, and one in NJ. Gamestop&#39;s HQ state and Dream on Me&#39;s HQ state. Cohencidence? I&#39;m not sure. The contact info for the NJ Dream Addison Holdings is the same Dovid Rabinowicz, but this time it gives an address in Lakewood, NJ. </p>\n\n<p>Searching for Dovid Rabinowicz, I found two entries, who could very likely be the same individual:</p>\n\n<p>One Linkedin profile for a CPA, with very little other information, and...</p>\n\n<p><a href=\"https://preview.redd.it/3xyttftgzeyb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=5ea4a9520c0059cf8b682bce2fd5da2ee0fdba61\">Sapphire Investment Group</a></p>\n\n<p>Dovid Rabinowicz, CFO of Sapphire Investment Group, which, according to their Contact information, is Headquartered in Lakewood, NJ. Ok, so this is definitely the same Dovid Rabinowicz.</p>\n\n<p>Sapphire Investment Group, according to their website, is a &quot;real estate investment firm based in New York City.&quot; Are they related in any way to Dream on Me? I don&#39;t know. But I do know that Lakewood, NJ is 38.8 miles from Somerset, NJ (DoM HQ).</p>\n\n<p>Back to Addison Holdings and BAM. I looked to see if they have ever partnered with any real estate investment firms, and guess what?</p>\n\n<p><a href=\"https://preview.redd.it/v8frwate1fyb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=917d4b2ae2aa14731508db146d94696984b04427\">BAM! Madison Realty Capital</a></p>\n\n<p>There it is. Addison Holdings partnered with Madison Realty Capital. Soooooooo...</p>\n\n<p>Is it possible that Dream Addison Holdings is related to Addison Holdings LLC? Yes, anything is possible. But is it likely? I&#39;m not sure I would say that. But it is certainly interesting. And we know that Addison Holdings, LLC has partnered with real estate investment firms in the past, so it&#39;s not that big of a stretch.</p>\n\n<p>Hopefully this gets your juices flowing, and someone can pick up where I left off.</p>\n\n<p>Oh, and IF Addison Holdings, LLC provided the $10.8b via Dream on Me, then that means very VERY good things for us. Like, see you on the other side of Uranus, good things.</p>\n\n<p>Peace, PPs</p>\n\n<p>Myco</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/0aHlWbf5pU2cBHAGFAoMi9OuOvddR2BDI2euLtxhBfs.jpg\"/></div>"},
{"username": "MycoReactor", "url": "https://www.reddit.com/r/ThePPShow/comments/17iounb/shills_freaking_out_in_the_meltdown_sub/", "time": 1698532167.0, "subreddit": "r/ThePPShow", "title": "Shills freaking out in the meltdown sub", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.reddit.com/r/houstonwade/s/nwyG4MSUsZ\">https://www.reddit.com/r/houstonwade/s/nwyG4MSUsZ</a></p>\n\n<p>I posted the original here. One of the meltdowners screen captured it and now they&#39;re freaking out on the meltdown sub. Houston dishing it out pretty good over there (after they started tagging him and giving him shit). If you want something to do with your thumbs, I know Houston would appreciate the support.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MycoReactor", "url": "https://www.reddit.com/r/bbby_remastered/s/9l2jnjPvrn", "time": 1698531749.0, "subreddit": "r/ThePPShow", "title": "Wow, check out the meltdowners!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://preview.redd.it/a-cope-post-with-nothing-useful-but-theres-one-point-i-v0-j3g10ysz3zwb1.png?width=640&crop=smart&auto=webp&s=d4610d80b95a4033c84381689a736737f3d73c7e\"/></div>"},
{"username": "MycoReactor", "url": "https://www.reddit.com/r/ThePPShow/comments/17igasn/countering_the_recent_docket_fud/", "time": 1698507363.0, "subreddit": "r/ThePPShow", "title": "Countering the Recent Docket FUD", "text": "<!-- SC_OFF --><div class=\"md\"><p>Lots of FUD going around about the recent docket where the plan administrator responds to Neelay Das. I read the docket. At first glance, and on the surface, it looks very bleak. References to the shares being worthless, with no replacement shares coming. I read it and immediately thought &quot;Well, shit. This ain&#39;t good.&quot;</p>\n\n<p>But I, as well as many of us on the sub, fell victim to something called the recency bias. This type of flawed thinking weighs recent information more heavily than prior, often conflicting, information. Because this is the most recent thing out, we tend to look at it in a vacuum, to the exclusion of other conflicting information.</p>\n\n<p>One of the main reasons we&#39;re all here is to enhance the sharing of information, and to crowd-source this puzzle. We have dissenting opinions. Others who will help us in breaking out of our biased thought patterns.</p>\n\n<p>Big shout out to Houston Wade (<a href=\"/u/Houstman\">u/Houstman</a>) for breaking me out of this one. His comment on a post about the Das docket helped me unforget (remember?) All the reasons I still believe in this play:</p>\n\n<blockquote>\n<p>Thats not at all what the plan administrator says. He says they will not get any of the worthless shares and that no more worthless shares in the old company will go out. The old company of Bed Bath &amp; Beyond ceases to exist, the going concern of Butterfly now reigns supreme.</p>\n\n<p>Do you think Hudson Bay dropped $300 million (at a premium!) to exercise warrants just to have it all vaporize a few weeks later? Hell no! Why on Earth would a creditor like them seek a plan that destroys hundreds of millions in value for them?</p>\n</blockquote>\n\n<p>Don&#39;t forget everything you&#39;ve learned up to this point! Just because there&#39;s negativity out there, don&#39;t let it cause you to lose faith!</p>\n\n<p>Peace to all the PPs! 🚀🍆💦</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "MycoReactor", "url": "https://www.reddit.com/gallery/14y3vej", "time": 1689203429.0, "subreddit": "r/ThePPShow", "title": "Alternative Transaction Mentioned in 8K", "text": "<!-- SC_OFF --><div class=\"md\"><p>Seller can terminate the agreement with an Alternative Transaction. The definition of an alternative transaction? Could be a merger, the sale of assets or equity, or a plan of reorganization... Didn&#39;t the lawyer in the latest hearing that they would deliver their reorganization plan in the coming days???🚀🚀🚀🚀🚀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/TT674FQ7qELNV1M8XjuRu3v71g7IX2EWezuT2P42EbE.jpg\"/></div>"}]