[{"username": "mystery_model", "url": "https://i.redd.it/al6u6zlo2mxb1.jpg", "time": 1698789942.0, "subreddit": "r/ThePPShow", "title": "Happy Halloween!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Had to buy the suit because of PP, I went and got a helmet to match!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/al6u6zlo2mxb1.jpg\"/></div>"},
{"username": "mystery_model", "url": "https://i.redd.it/d9j3v3mdr1sb1.jpg", "time": 1696364762.0, "subreddit": "r/ThePPShow", "title": "Here is a coloring sheet to keep busy while the big brains write DD", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/d9j3v3mdr1sb1.jpg\"/></div>"},
{"username": "mystery_model", "url": "https://i.redd.it/iogicky47erb1.jpg", "time": 1696079496.0, "subreddit": "r/ThePPShow", "title": "Don't forget to report the person for sending these", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/iogicky47erb1.jpg\"/></div>"},
{"username": "mystery_model", "url": "https://i.redd.it/xqm6y5pgf1rb1.jpg", "time": 1695924908.0, "subreddit": "r/ThePPShow", "title": "I'll be ready when the time comes...", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/xqm6y5pgf1rb1.jpg\"/></div>"},
{"username": "mystery_model", "url": "https://www.reddit.com/r/ThePPShow/comments/16svvxa/only_the_young/", "time": 1695753128.0, "subreddit": "r/ThePPShow", "title": "Only the Young", "text": "<!-- SC_OFF --><div class=\"md\"><p>After watching both streams with Pulte in it, I started to see the bigger picture. It really makes me wonder why everyone is so set in their ways and hyperfocused on one stock. Yes alot of on here have alot of money in on Bed Bath and possibly other stocks, but let me ask you this... why are we so divided between subreddits and stocks. If I were a hedge manager, I would want to see people focus on one stock and not look at the others. It makes it easier to have people fold. We are the next generation and last thing I want to hear is my future kids asking me why we didn&#39;t do anything about the corrupt system. We are the young. We aren&#39;t a huge corrupt hedge fund. We are the future and need to make the future work out the way we want it to be.</p>\n\n<p>There is tons of potential for the PP Show. No matter what happens in the future with Bed Bath we know we should expand our horizons and out reach. It couldn&#39;t be more obvious that we should put our eggs in multiple baskets. And we could be more balanced in investments everywhere. I could make it more obvious for others if you guys need some pictures or drawings. Maybe we need pivot our expectations amd goald where we cam have our money to work for us. Just imagine we had the combined strength of all &quot;meme stock holders&quot; sharing information and having a large stake in multiple companies. You wouldn&#39;t be sweating so much about the outcome of Bed Bath if you also had money in other stocks while other stock holders also had money in Bed Bath.</p>\n\n<p>Maybe someone can help me out but I don&#39;t understand why we are so divided into our own stock communities. We need a way to unify and spread our focus across multiple stocks. With long term goals and experts that do stay up to date and informed on different stocks, news, rumors, and dockets. We literally have the chance to start something new and we are getting in our own way.  I hope this makes sense guys, I understand it&#39;s end game for BBBYQ and everyone is worried about what is going to happen next and the fear of the unknown. No matter the outcome of the stock, hearing &quot;I told you so&quot; will just divide people further. Let&#39;s move forward and discuss what ideas on how we can progress the stock exchange to give more power to the people!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "mystery_model", "url": "https://i.redd.it/x4cme3mu18qb1.jpg", "time": 1695569228.0, "subreddit": "r/ThePPShow", "title": "Beds, Baths, and Beyond!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Front page here we go!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/x4cme3mu18qb1.jpg\"/></div>"},
{"username": "mystery_model", "url": "https://v.redd.it/cgkpkptr6upb1", "time": 1695401390.0, "subreddit": "r/ThePPShow", "title": "10k+ can we do it?", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is clear and cut the bare minimum of what we should expect from Monday&#39;s Stream. We need to promote this show and get that 10k+ viewers!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/cjI0aWF5cHI2dXBiMUWX9ujg-Kem9guKNd-n5UPwLBiMPQwheBdvAscGA_60.png?width=140&amp;height=77&amp;crop=140:77,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=b862f8054a9ff7b3316e685ee1739f826938816a\"/></div>"},
{"username": "mystery_model", "url": "https://www.reddit.com/r/ThePPShow/comments/16osbzx/my_take_on_next_mondays_stream/", "time": 1695332617.0, "subreddit": "r/ThePPShow", "title": "My take on next Monday's Stream", "text": "<!-- SC_OFF --><div class=\"md\"><p>I tried replying to PP&#39;s post but for some reason this didnt come through so I making a post hoping he will see my message.</p>\n\n<p>I&#39;d say no matter what outcome happens with bed bath and beyond if there really is a big announcement or not. I would take it as a great opportunity and reward for all the hard work you have done over the past year. Coming into the worst-case scenario, that bed bath is gone forever, and we lose tons of money. Being lucky to go out to meet with him is an honor that will stick with you. </p>\n\n<p>This starts a new chapter for the PP show where you can continue to spend time talking about the stock market rain or shine and prove that you&#39;ve got people in high places to back you up. I say assume thus to be a nothing burger and use this as a time to be yourself, hang with the man the myth the legend and promote the show. With Monday, you have an amazing chance to catch a wider audience. You can hype it up and get yourself a boost in viewership. It&#39;s cool to hope that something great comes out of it, but the best you can do is avoid hyping up any big announcement because if there isn&#39;t one. You will have a lot of viewers that may feel let down. Definitely promote this special event and get people drawn because this will be fun and exciting to do!</p>\n\n<p>MONDAY IS FOR THE BOYS! Get some smoking jackets with the PP logo on them,  cigars, and drinks. Kick back and shoot the shit. The best thing you can do is be real and talk and not be a mouthpiece like shilly Cramer. &lt;3 You worked hard for this PP and the gang!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]