[{"username": "n-Ro", "url": "https://www.reddit.com/r/ThePPShow/comments/16lia5l/inspired_by_post_from_u8ean_in_bbby_sub/", "time": 1695000945.0, "subreddit": "r/ThePPShow", "title": "Inspired by post from u-8ean in bbby sub", "text": "<!-- SC_OFF --><div class=\"md\"><p>First read the post about holly Et saving broker shares, it might make more sense that way. Some of us are in panic mode given the DRS/broker shares liquidation chatter.</p>\n\n<p>This is what blood in the streets looks like.</p>\n\n<p>I had a fantastic professor in one of my finance classes. I&#39;ll never forget the 3 bullet points he gave us early on. This is for determining whether the risk you take for a gut shot investment that requires high conviction is worth it. (Note this guy didn&#39;t need to teach classes - he already made it. He was in his thirties, very unpretentious and unassuming, and he clearly had the love to teach anyone who would absorb.)</p>\n\n<p>1) it starts with an inference. You notice anything in your day to day life that could really catch on, given the context of the particular market that would respond to your inference. Chewy already took out Amazon&#39;s pet section. Ryan wants to take amazon out of the picture. This is the inference here ✅</p>\n\n<p>2) would you profit from said inference? If you thought Pokemon Go would become as big as it did, would you have done well by buying Nintendo stock? Well... how much other business does Nintendo do? How do they profit from Pokemon go? What difference would that make on their balance sheet? Is that enough to move the needle and make any impact on the stock price? Absolutely ✅. This needle is so thin, market cap so small, prime target for stock appreciation if bbby transforms into any sort of cog in the amazon-killing machine.</p>\n\n<p>3) he said if we checked the last two, we should have the conviction to go against the crowd when there is blood in the streets. He encouraged us to set a specific ratio to manage risk. Ex: if potential upside outweighs your downside risk by 3:1...he would go for it. He would buy as much as he could while everyone else sold. With this play, the ratio of potential upside to downside is far more lopsided. We are on the fringes of the high risk/high reward spectrum...I&#39;d say the ratio is 150:1. Absolute prime target for a short squeeze. It&#39;s a blessing for us that everyone and their mother thinks BBBY is an easy short. If you believe the Amazon killer inference and you believe bbby will be a part of it... you need to be going against the crowd!</p>\n\n<p>Professor Goolgasian, your lesson hasn&#39;t left me. I know you&#39;d love to see a former student profit from what might become one of the more exciting case studies in your future classes. I smell blood in the streets! I&#39;m putting my balls on the line! I think i have some friends doing the same. Love you guys and gals!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]