[{"username": "NaiveEstablishment14", "url": "https://www.reddit.com/r/ThePPShow/comments/15nsonn/life_relationship_could_have_waited_to_sue_once/", "time": 1691711737, "subreddit": "r/ThePPShow", "title": "LIFE RELATIONSHIP could have waited to sue once the plan was released. Why interfere now?", "text": "Can someone smarter than me please explain this?\n\nI am worried it will cause delays or derail the outcome. \n\nBy sending this out, it will cause the Court to pause (potentially) and look into matters (Ala Glenn).\n\n&#x200B;\n\n&#x200B;", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "NaiveEstablishment14", "url": "https://www.reddit.com/r/ThePPShow/comments/15nsonn/life_relationship_could_have_waited_to_sue_once/", "time": 1691711737.0, "subreddit": "r/ThePPShow", "title": "LIFE RELATIONSHIP could have waited to sue once the plan was released. Why interfere now?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "NaiveEstablishment14", "url": "https://www.reddit.com/r/ThePPShow/comments/14u4qsg/you_guys_are_the_best_ateam_to_assemble/", "time": 1688824042.0, "subreddit": "r/ThePPShow", "title": "You guys are the best A-team to assemble!", "text": "<!-- SC_OFF --><div class=\"md\"><p>It feels like a war between us and the SHFs, MSM, GME elitists, WSB guys- Us against the world. </p>\n\n<p>Our soldiers ( if i may call you that) are PP, ABC, Michael, AJ, Carter, runningwithbearz, Plur, the british guy who doesnt sleep ( sorry blanking on your name friend) stripper Travis, No pie, u copy, region formal, real eyez, life- relationship, whoopass etc etc.  </p>\n\n<p>We may not individually be the smartest in the room- but collectively we are a force to be reckoned with.   You guys have become more than entertainment- you guys have become a mission statement. </p>\n\n<p>We see the play- NOLs, RC as creditor and interested party, redacted sixth street lending, and the A team in the c-suite ( holly is my girl), icahn involvement, Teddy, Gmerica. An outsider looks at us like we belong in an asylum. But we see the deepest fuckin value play there ever was.  We see- because we are open minded to read between the lines. </p>\n\n<p>If we win- no one can call it a fluke or dumb money. We know what we have endured.<br/>\nThe fud, the incessant price drops- and we have held the line. </p>\n\n<p>If we lose- we learned alot and made some great friends along the way.  So really there was no real losing. </p>\n\n<p>I salute all you guys doing the hardwork.  </p>\n\n<p>God Speed. May victory be ours. </p>\n\n<p>Ps- im sorry if I left anyone out- i just had to purge this emotional bs and say how much I love you guys!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "NaiveEstablishment14", "url": "https://www.reddit.com/r/ThePPShow/comments/138bwc1/why_i_think_there_are_no_shares_in_the_market/", "time": 1683264774.0, "subreddit": "r/ThePPShow", "title": "Why I think there are NO shares in the market.....", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was a short seller of BBBY in Dec 2022.  I sold naked calls at strike 3 and 4... for expiry March &#39;23 and November 2023.  When the run up in Jan 2023 happened, stock price went to 5-6 dollars and I was asked to DELIVER shares even though my expiry was March and November.  I LOST heavily.  </p>\n\n<p>I was short BBBY due to the fundamentals, More debt than equity, negative cash flow, high cash burn etc. </p>\n\n<p>So after I lost SOOO much money in Jan, I started digging deeper as to why there was this spike?  I dug in and decided to learn more about BBBY.   I decided I had missed some part of the picture.  </p>\n\n<p>1-The Brand names Baby and BBBY would not be found on the balance sheets of the company (like Coca Cola cannot value the brand name COKE on its own balance sheet)</p>\n\n<p>2- The New board was stellar and was doing the right operational things to turn things around. </p>\n\n<p>3- I saw the RC conenction (I never cared to dig deeper before)</p>\n\n<p>&#x200B;</p>\n\n<p><strong>SO THEN I WENT LONG..... I sold puts (means bullish)</strong>, strike 1 for April 2023 and strike 0.50 for November and December... I picked up some decent premium. </p>\n\n<p>Now here is the funny part.....Share price dropped to 10 cents....10 fucking cents... <strong>and NO ONE has delivered me shares.</strong>  I got delivered for April 23, strike 1usd on expiry, but not for November and December.   WHYYYY???</p>\n\n<p>Usually when the stock price is 90-95% down, one would expect delivery of shares no matter how far out the strike is..... <strong>BUT I GOT NO SHARES delivered to me for the far out expiries of contracts.  But when I had sold calls, they forced me to deliver shares!!!!</strong></p>\n\n<p>I am more convinced than ever- that we are on the right path- I&#39;m with AJ... just hold and expect 10X of your target price is. </p>\n\n<p>&#x200B;</p>\n\n<p>TLDR: THERE ARE NO SHARES IN THE MARKET... THE FLOAT IS LOCKED.</p>\n\n<p>NFA.  I am speaking from my own real experience.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "NaiveEstablishment14", "url": "https://www.reddit.com/r/ThePPShow/comments/12yrtwm/why_the_rs_vote_random_thought/", "time": 1682447668.0, "subreddit": "r/ThePPShow", "title": "WHY THE RS vote? random thought", "text": "<!-- SC_OFF --><div class=\"md\"><p>I think BBBY needed to see how many shares were naked shorted.  No way for the board to know without asking for a vote of some type.</p>\n\n<p>Say the board knows that 450 Million shares are held by B Riley or another entity and is NOT in the float....not tradeable.</p>\n\n<p>Once the vote happened.. IF for example - they got the count of 600 Million votes from retail buyers... NOW they know the Short interest is more than the outstanding shares.  They told us that EVERY VOTE mattered for a reason.  (YES OR NO- did not matter)</p>\n\n<p>I believe the SOLE purpose of the RS vote was to know the share count with retail.   Once they knew it was sold multiple times, they file BK (free the asset from Creditors) and then sell  BABY.</p>\n\n<p>BBBY could not risk this process without confirmation that SI was over a certain threshhold.</p>\n\n<p>This is the ONLY reason the RS vote was done- TO FIND OUT THE SHARE COUNT AND SI.</p>\n\n<p>my opinion.  not advice.</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "NaiveEstablishment14", "url": "https://www.reddit.com/r/ThePPShow/comments/12m9l5n/kais_is_acting_stalkerish/", "time": 1681499703, "subreddit": "r/ThePPShow", "title": "Kais is acting stalkerish...", "text": "Sorry to point out that Kais is coming across as unhinged and in need of help. \n\nAppreciate the way the show is hosted PP, but encouraging Kais is adding to his mental instability.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]