[{"username": "Necessary_Scarcity92", "url": "https://www.reddit.com/r/ThePPShow/comments/122tcp8/bbby_altman_z_score_indicates_the_company_is_in/", "time": 1607552337, "subreddit": "r/ThePPShow", "title": "BBBY Altman Z Score indicates the company is in the safe zone.", "text": "\\[1\\] It's a measure that can predict bankruptcy with an accuracy between 82-94%. Scores below 1.8 indicate the company is likely to go bankrupt, scores of 3.0 or higher indicate the company is not likely to go bankrupt.\n\n\\[2\\] It's calculated as follows:\n\n Altman Z-Score = 1.2A + 1.4B + 3.3C + 0.6D + 1.0E\n\nWhere:\n\n* A = working capital / total assets\n* B = retained earnings / total assets\n* C = earnings before interest and tax / total assets\n* D = market value of equity / total liabilities\n* E = sales / total assets\n\n\\[3\\] Applying this formula to BBBY, I get a score of 3.26:\n\n&#x200B;\n\n[Do your own math, not financial advice.](https://preview.redd.it/z5lyk4hra4qa1.png?width=607&format=png&auto=webp&v=enabled&s=b5a3a1aa0ec30ec9ac4a327d1b5d5e667a7575fe)\n\n**Sources:**\n\n\\[1\\]:  NYU Stern. \"[Predicting Financial Distress of Companies: Revisiting the Z-Score and Zeta Models](http://pages.stern.nyu.edu/~ealtman/Zscores.pdf),\" Page 18. Accessed Nov. 19, 2021.\n\n\\[2\\] [https://www.investopedia.com/terms/a/altman.asp#citation-7](https://www.investopedia.com/terms/a/altman.asp#citation-7)\n\n\\[3\\] My calculation, SeekingAlpha figures. SA lists Altman Z score at 3.37, a little higher than my calc. \n\n**TLDR: Another indicator BK \\*probably\\* not imminent.**", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/I-3TQzA7XX6Jx8ranHWAD2YwDQqHcNthJej3-0Xfr-c.jpg\"/></div>"},
{"username": "Necessary_Scarcity92", "url": "https://www.reddit.com/r/ThePPShow/comments/11ysr4k/turnaround_viability_brain_dump/", "time": 1607552337, "subreddit": "r/ThePPShow", "title": "Turnaround Viability Brain Dump", "text": "Hi. I too like the stock, but I don't mess around with tinfoil too much. I stick my meat straight on the grill and ramble incoherently until I self-validate my investment decisions.\n\n**Disclaimer:** I thought I'd post my ramblings here and see what y'all think --- Maybe this is the wrong place to post, IDK. Sorry if it is. Obviously **none of this is financial advice - this is all for entertainment purposes only** \\- do your own research and don't trust anything you read on the internet. **Some of this stuff might be wrong, I might be telling an incomplete story, etc.** Please let me know where this might be erroneous or misleading.\n\nThis post is not about squeezing, technical stock price movements, or anything like that... I'm just looking at the reasonableness for going long on BBBY just based on the fundamentals.\n\nBear with me here, because I think it's important to start with the ugly past before contemplating a glorious future.\n\n# 1. BBBY's Financial History & The Company's Downfall\n\nYou don't have to be a rocket scientist to see the long-term historical trend. It's not great:\n\n[Source: SA Profitability \\(EBITDAR is Earnings Before Interest, Taxes, Depreciation & Amortization, and Rent\\)](https://preview.redd.it/8h677ccu1bpa1.png?width=1822&format=png&auto=webp&v=enabled&s=187ab53355cd0f7ad5d33dc4d311485d5b2fe9a7)\n\nTotal revenue grew each year until Fiscal Year Ended (\"FYE\") March 2018, at which point it started dropping.  Gross margins have been shrinking each year, and OpEx as a % of Revenue has been steadily climbing:\n\n[Source: SA, BBBY Common-Size Financials](https://preview.redd.it/fdh042ob3bpa1.png?width=1785&format=png&auto=webp&v=enabled&s=e8e5a0c332d435cc5a81ed8c2516b06e176428f9)\n\nAnd, amid this environment, the company spent huge amounts of cash on repurchasing its stock:\n\n[Source: SA, BBBY Cash Flow](https://preview.redd.it/m2kp49h95bpa1.png?width=1518&format=png&auto=webp&v=enabled&s=e6e1cdb917dc32daf983f5197b8cdad909b111e5)\n\nAs we stand today, BBBY has a weak balance sheet (cash was poured into stock buybacks) and a weak P&L as the Company has been unable to mitigate the downward trend in profitability that has been occurring since 2013. (Note: Despite the equity offering and potential future slugs of cash, I still think BBBY has a pretty weak balance sheet, although the equity offering saved BBBY from a certain death IMO.)\n\nI've heard people citing Mark Tritton's involvement, the switch to private label brands, etc. as factors contributing to BBBY's decline. I think the macroeconomic story is more important: e-Commerce has been taking market share from brick-and-mortars for years.\n\n*e.g., this article lays out how Wayfair has been taking market share from BBBY and has been - in my view - basically price gouging brick-and-mortar home furnishing retailers to gain market share at the expense of profitability:* [*https://www.fool.com/investing/2022/09/04/the-hidden-reason-behind-bed-bath-beyonds-demise/*](https://www.fool.com/investing/2022/09/04/the-hidden-reason-behind-bed-bath-beyonds-demise/)\n\n*As a side note, Wayfair's been hemorrhaging more cash than BBBY for years. Covid is the only driver that made Wayfair have positive EBITDA in 2020 (and barely positive EBITDA in 2021), because everybody and their mother's mother was 1) buying online and 2) redoing their houses.*\n\n# 2. BBBY e-Commerce\n\nThis article, despite being incredibly bearish, says 37% of BBBY's revenue is online:\n\n[https://www.modernretail.co/operations/trying-to-put-a-band-aid-over-a-hemorrhaging-wound-why-bed-bath-beyonds-downfall-is-years-in-the-making/](https://www.modernretail.co/operations/trying-to-put-a-band-aid-over-a-hemorrhaging-wound-why-bed-bath-beyonds-downfall-is-years-in-the-making/)\n\n37% of 2022 Revenue of $6.2B is $2.3B.\n\nThat's close-ish to this article, which projects BBBY's e-commerce revenue was $2.05B for FYE 2/28/22 and $2.62B for FYE 2/28/21:\n\n[https://www.digitalcommerce360.com/2022/04/14/bed-bath-beyond-reports-plunging-ecommerce-sales/](https://www.digitalcommerce360.com/2022/04/14/bed-bath-beyond-reports-plunging-ecommerce-sales/)\n\nWe already said COVID (2020/2021) was an anomaly for e-commerce sales. Maybe somewhere in the ballpark of $1.8B to $2.0B is a more reasonable baseline for going-forward e-commerce sales. That's not considering that BBBY ***might*** lose some of that e-commerce revenue since physical store count likely drives that revenue to ***some*** degree.\n\nInterestingly, though, BBBY's website traffic has increased ***significantly*** lately:\n\n[Source: Ubersuggest.](https://preview.redd.it/cmf3zueacbpa1.png?width=1746&format=png&auto=webp&v=enabled&s=8920a1e0e208fd8cee3f1f3a53fc1d6f79fbdad6)\n\nThis might be because redditors have been clicking \"investor relations\" a million times a day--- I don't think it's fair to say online sales will increase ratably, but **it still looks bullish as hell to me.**\n\n# 3. Management's Turnaround Plan\n\nLet's start with what BBBY's management team has represented in SEC Filings.  **If you're only going to read one, read the Cleansing Materials on 2/6.** You can skip to TLDR below these comments to see what I took away:\n\n**1/10/23: Q3 Results**\n\n>“At the beginning of the third quarter, we initiated a turnaround plan anchored on serving our loyal customers, following a period when our merchandise and strategy had veered away from their preferences. Although we moved quickly and effectively to change the assortment and other merchandising and marketing strategies, inventory was constrained and we did not achieve our goals. We will continue to rebalance our assortment towards National Brands and refine our Owned Brands mix to reflect the deep understanding of our customer, along with the selection and value only we can offer in the Home and Baby markets. We are actively pursuing higher in-stock levels to meet proven demand.”  \n>  \n>Ms. Gove continued, “We are implementing our plan expeditiously while managing our financial position in a changing landscape. We are delivering on our aggressive second half commitment of $250 million in SG&A optimization, or $500 million in annualized savings. We are also on track to achieve the 150 store closures that we previously outlined, which will further enable us to allocate resources according to customer demand. Our organization is more streamlined and we have adopted a more focused infrastructure that reflects our current business.”\n\nSource: [https://www.sec.gov/Archives/edgar/data/886158/000088615823000002/exhibit991-pressreleaseq32.htm](https://www.sec.gov/Archives/edgar/data/886158/000088615823000002/exhibit991-pressreleaseq32.htm)\n\n**2/6/23: Cleansing Materials**\n\n>**\"Plans for current store fleet optimization program to be expanded to more than 400, including closure of an approximately 150 additional lower-producing Bed Bath & Beyond stores, which builds on closure of approximately 200 Bed Bath & Beyond stores and approximately 50 standalone Harmon stores in the U.S.**  \n>  \n>**Plans for Fiscal 2023 Comparable Sales in mid- to high-single digit range based on Comparable Sales down 30 percent to 40 percent in the fiscal first quarter and sequential, quarterly sales improvement thereafter.**  \n>  \n>**Plans for improving inventory position with in-stocks at historical operating levels by Back-to-College 2023.**  \n>  \n>**Plans for Fiscal 2023 Adjusted Gross Margin in the low-30 percent range throughout the fiscal year, inclusive of cost savings from supply chain network initiatives.**  \n>  \n>**Plans for Fiscal 2023 Adjusted SG&A expense reduction of up to $1 billion, reflecting annualized cost optimization initiatives that began in fiscal 2022, as well as incremental cost reductions associated with additional store closures, as well as corporate and operating expense realignment to occur by early fiscal 2023.**  \n>  \n>**Plans for Fiscal 2023 Adjusted EBITDA Margin in mid-single-digit range, based on achievement of aforementioned assumptions and reflecting negative Adjusted EBITDA Margins in the fiscal first quarter and a return to positive Adjusted EBITDA Margins beginning in the fiscal second quarter.\"**\n\nSource: [https://www.sec.gov/Archives/edgar/data/886158/000119312523025748/d441746dex992.htm](https://www.sec.gov/Archives/edgar/data/886158/000119312523025748/d441746dex992.htm)\n\n**2/7/23: Completion of Public Equity Offering and Provides Strategic Update**\n\n>\"The Company will continue to execute its customer-focused turnaround plans by optimizing its store footprint, investing in inventory, and pursuing infrastructure improvements. Specifically, the Company has initiated incremental store closures in its Bed Bath & Beyond banner with an ultimate operating goal of approximately 360 stores, in addition to approximately 120 buybuy BABY stores, across the U.S. In response to evolving shopping preferences today, this target store base includes the Company’s most profitable locations and best geographic presence for customers that can enable an optimal omni-experience. The digital channel is expected to rise to a higher proportion of sales with improved channel profitability.\"\n\nSource: [https://www.sec.gov/Archives/edgar/data/886158/000119312523027117/d455173dex991.htm](https://www.sec.gov/Archives/edgar/data/886158/000119312523027117/d455173dex991.htm)\n\n**3/8/23:  Receives Additional Proceeds from Previously Announced Public Equity Offering**\n\n>“Over the past month, we have been rebuilding our financial and operational positioning to execute our customer-focused turnaround plans. Since closing our equity financing last month, we have engaged with suppliers to improve our inventory positioning and we have continued to optimize our brick-and-mortar footprint through store closures to align with customer preference. Additionally, as announced last week, we paid the outstanding interest due on all Senior Notes, which has been acknowledged by key constituents such as credit agencies. We continue to work with determination and diligence to fulfill both our near- and long-term goals of maximizing prospects for all stakeholders.”\n\nSource: [https://www.sec.gov/Archives/edgar/data/886158/000119312523063828/d821169dex991.htm](https://www.sec.gov/Archives/edgar/data/886158/000119312523063828/d821169dex991.htm)\n\n**TLDR of BBBY Management Comments:**\n\n1. Expecting e-commerce sales to become a higher portion of sales mix going forward.\n2. Delivering $250M H2 SGA optimization ($500M in annualized savings). Fiscal 2023 total SG&A savings up to $1B. *Note: I interpret this to mean $2.7B SG&A last year -$1B SG&A Savings = $1.7B SG&A for fiscal 2023.*\n3. Right-sizing to 360 BBBY stores and 120 buybuy BABY stores (480 total stores).\n4. 'Engaged with suppliers' to improve inventory positioning with a goal to be back at historical operating levels by Back-to-College 2023.\n5. Planning for Fiscal 2023 Adjusted Gross Margin in the low-30 percent range throughout the fiscal year, inclusive of cost savings from supply chain network initiatives.\n6. Planning for Fiscal 2023 Adjusted EBITDA Margin in mid-single-digit range, based on achievement of aforementioned assumptions and reflecting negative Adjusted EBITDA Margins in the fiscal first quarter and a return to positive Adjusted EBITDA Margins beginning in the fiscal second quarter. **Based on this, I'd say let's not plan on seeing profitability until fiscal Q2 2023 (quarter ended Aug 2023).**\n\n# 4. Macro-Economic Outlook\n\nOverall, it looks like brick and mortars might be making a bit of a comeback in terms of stealing back some market share from e-commerce, albeit amidst headways from a slowing economy and high inflation.\n\nI think this is pretty obvious, but banks collapsing would screw over consumer spending and would likely nix any shot of a comeback BBBY has, though.\n\nHere's a bunch of articles:\n\n[https://www.alconlighting.com/blog/lighting-news/retail-comeback-brick-and-mortar-store-experience/#:\\~:text=Business%20and%20economics%20analysts%20predict,worry%20about%20returns%2C%20for%20instance](https://www.alconlighting.com/blog/lighting-news/retail-comeback-brick-and-mortar-store-experience/#:~:text=Business%20and%20economics%20analysts%20predict,worry%20about%20returns%2C%20for%20instance)\n\n[https://www.forbes.com/sites/gregpetro/2022/09/16/are-physical-stores-making-a-comeback-is-it-all-about-the-product/?sh=40557f421f78](https://www.forbes.com/sites/gregpetro/2022/09/16/are-physical-stores-making-a-comeback-is-it-all-about-the-product/?sh=40557f421f78)\n\n[https://www.fastcompany.com/90834188/barnes-and-noble-brand-makeover-comeback](https://www.fastcompany.com/90834188/barnes-and-noble-brand-makeover-comeback)\n\n[https://www2.deloitte.com/us/en/pages/consumer-business/articles/retail-distribution-industry-outlook.html](https://www2.deloitte.com/us/en/pages/consumer-business/articles/retail-distribution-industry-outlook.html)\n\n**In a nutshell, I think there are pros and cons here. If we experience total economic collapse, of course BBBY will suffer.**\n\n# 5. A Note on Store Closures\n\nHere's historical store count, as far as I can tell:\n\n[Source: Me, looking at SEC filings. These numbers could be all totally wrong. Do your own research.](https://preview.redd.it/dtjecdmpibpa1.png?width=968&format=png&auto=webp&v=enabled&s=9d67f9945b2a9f04d661310c72bf9e3120fb3552)\n\nSo we know BBBY plans to get down to 480 stores - from 927 at end of Q3 2022. My first thought was damn: That's a lot of leases to get out of.\n\nFor the longest time, that was my biggest fear with this investment. Then I read this article:\n\n[https://www.cnn.com/2023/03/21/business/bed-bath-beyond-stores-closing-real-estate/index.html](https://www.cnn.com/2023/03/21/business/bed-bath-beyond-stores-closing-real-estate/index.html)\n\n...and I was pretty relieved. I'm sure there will still be plenty of expenses related to getting out of these leases, but I think less than I initially expected. That article also seems to suggest brick-and-mortar optimism.\n\n# 6. Gut-Check on Turnaround Viability\n\nManagement's plan sounds great, but the obvious question is whether they can execute.\n\nProfitability data re: stores being closed vs. retained is not publicly available, so that really makes this a big guessing game. You can look at average data per store and how that trended over time, but there's not any way to get a good guess on how these 480 stores will perform compared to the average of the 900+ stores the company had to choose from.\n\nI don't think we have any idea how much more profitable the stores being kept are in comparison to the stores being closed, but I think it's fair to say the company would only keep the cream of the crop, so for fiscal 2023 we should see higher revenue and gross profit per store figures. There will also be a higher load of SG&A overhead allocated per store, even with cost savings.\n\nHere's some numbers. The blue ones I totally made up and are in no way a guarantee of what will happen. This is basically napkin math:\n\n&#x200B;\n\n[These are numbers I made up and are not financial advice. Do your own due diligence and talk to a financial advisor. You're responsible for your own investments.](https://preview.redd.it/dx6j0vko0cpa1.png?width=620&format=png&auto=webp&v=enabled&s=2398b85b11efcd3155f7ae68b47bce038896076f)\n\nMy glasses are a bit more rose-colored than analysts that seem to have a consensus EPS estimate of -$1.96 for Q4. Of course, their numbers include depreciation and mine does not, so that's kind of like comparing apples to oranges.\n\nBut all-in-all, I used this napkin math to try and look at the reasonableness of the turnaround plan. I wasn't able to reasonably see 'mid-single-digit EBITDA margins' for fiscal 2023, but it seems doable so long as:\n\n1. The company receives additional capital through the equity offering to make it through restructuring to cash flow neutral (fiscal Q2, by management's estimate).\n2. The economy doesn't totally collapse before then.\n3. Probably a million other things.\n\nIf BBBY turns around and continues to take market share, there could really be some value here. The company \"just\" has to get there.\n\nSay, in this crazy hypothetical world where BBBY successfully turns around, net margins get up to 5.0% by 2024.\n\n5% on $5.1B of revenue is $255M Net Income. Toss sector median P/E multiple on that and you're at....$3.8B market cap?\n\nI lose a lot of people because I think dilution has happened, but I'm fine with that. Nobody likes dilution, but it's the cost of getting through a turnaround. Let's assume 900M shares outstanding by 2024.\n\nDivide $3.8B market cap by 900M shares and you're looking at... $4.25/share. I'm not saying that's what the stock is worth today, just a little exercise in what could possibly be a reasonable value after a very successful turnaround assuming full dilution.\n\n# TLDR: IDK? BBBY's turnaround seems viable if Management can execute the plan. There might be some actual deep value here if brick-and-mortars take back some market share... even if there's no squeeze and no M&A activity. Not financial advice.\n\n**3.30.23 EDIT: Update for tentative results from operations:**\n\nRevenues missed my guesstimate by approximately $240 million, or about 16.6% of my guesstimate of $1.44B for last quarter. That's a pretty damn big miss.\n\nThanks for these other illuminating comments, Sue:\n\n*\"Continuation of Negative Operating Losses\"*\n\n*\"Modest Free Cash Flow Usage\"*\n\nThat's the high risk part of this investment :)", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/D3vLoHbF7yVsrHNzONNH6u0nZCKGUjEpLl5_AXKSqKE.jpg\"/></div>"}]