[{"username": "No_Affect_5541", "url": "https://i.redd.it/92tqh6n611kb1.jpg", "time": 1692869168.0, "subreddit": "r/ThePPShow", "title": "Docket 2043", "text": "<!-- SC_OFF --><div class=\"md\"><p>Help, why would Dream on me be labelled as a creditor now. Seems strange but I&#39;m sure someone could shed light on this turn, maybe to do with the &#39;sale&#39; ?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/92tqh6n611kb1.jpg\"/></div>"},
{"username": "No_Affect_5541", "url": "https://i.redd.it/p630a9wdm3ab1.jpg", "time": 1688542031.0, "subreddit": "r/ThePPShow", "title": "Just love the headline for once.", "text": "<!-- SC_OFF --><div class=\"md\"><p>BBBYQ Stock: Short Sellers Face High Borrowing Fees and Positive Sentiment Threats\nSeveral potential positive catalysts could pose a threat to Bed Bath &amp; Beyond’s short sellers during the retailer’s ongoing restructuring process.\nBERNARD ZAMBONINJUL 3, 2023 3:39 AM EDT\nBed Bath &amp; Beyond&#39;s bankruptcy - originally a boon for short sellers - has now created some risks, including high borrow fees and positive sentiment catalysts.\nThe company&#39;s restructuring involves a sale of assets, excluding physical stores.\nDebtor-in-possession lender Sixth Street Specialty Lending has expressed interest in a credit bid; a successful credit bid could potentially reduce Bed Bath’s debt burden.</p>\n\n<p>Johnny Milano | Bloomberg | Getty Images</p>\n\n<p>Mixed Feelings on the Bankruptcy Process\nIt&#39;s not surprising that many short sellers continue to bet against Bed Bath &amp; Beyond  (BBBY) - Get Free Report shares. Since filing for Chapter 11, the company has been going through its assets sales process, which involves significant risks.</p>\n\n<p>The largest buyer to date for BBBYQ’s assets has been Overstock (OSTK) - Get Free Report, which has acquired some of the home goods retailer’s key intellectual property.</p>\n\n<p>No sales have thus been made, however, for Bed Bath &amp; Beyond&#39;s physical stores, including store leases, inventory, warehousing, and logistics infrastructure. Bed Bath &amp; Beyond’s buy buy Baby chain – considered by some investors to be the company’s crown jewel – as well as its Harmon banners have also been heretofore excluded from any transactions but are now awaiting bidders.</p>\n\n<p>Debtor-in-possession (DIP) lender Sixth Street Speciality Lending expressed interest in conducting a credit bid on some of Bed Bath &amp; Beyond&#39;s assets during a recent, mid-June court hearing. As of January of this year, Bed Bath owed $550 million under its asset-backed loan with JP Morgan and $375 million to lender Sixth Street.</p>\n\n<p>During the Chapter 11 process, a secured creditor is allowed to use outstanding debt they are owed as a form of payment to acquire a bankrupt company&#39;s assets. This creates an alternative to using cash in the bidding process, though it is subject to approval by the bankruptcy court.</p>\n\n<p>The potential downside with this scenario is that, if Sixth Street makes a credit bid it may discourage competition from cash bidders. This, in turn, could result in an overall lower bid price.</p>\n\n<p>On the other hand, if the credit bid is accepted, the outstanding debt owed to that creditor is effectively reduced by the bid amount. This can alleviate some of the financial burdens on the bankrupt company, especially if outstanding debt is a significant portion of the company’s liabilities.</p>\n\n<p>So far, a recent filing shows the bankrupt company&#39;s total debts have slimmed to $1.7 billion from $1.9 billion. This $200 million liability drop helped drive up BBBYQ’s share price by 70% over just a few days.</p>\n\n<p>Borrowing Fees At All-Time Highs\nThose wishing to short Bed Bath &amp; Beyond shares - investors who are betting the company is not worth its current $203.55 million market cap and/or that its restructuring plan will collapse - are now paying through the nose to borrow shares. Borrow fees are sitting at a whopping 100% annualized.</p>\n\n<p>Driven by supply and demand, borrowing fees vary according to the availability of shares on loan and the number of short sellers interested in betting against a stock. As the chart below shows, since mid-June, the availability of BBBYQ shares has become quite scarce, resulting in borrowing fees peaking at almost 130% recently.</p>\n\n<p>Stocksera</p>\n\n<p>While they do imply a generally bearish sentiment, high borrow fees can also increase a stock’s chance of being squeezed.</p>\n\n<p>And Bed Bath &amp; Beyond&#39;s stock is no stranger to short squeezes. Over the past several years, BBBYQ (formerly trading as BBBY) underwent several short squeezes as positive catalysts drove shorts to buy back borrowed shares and close out their positions. Today, about 18.5% of BBBYQ’s float is held short.</p>\n\n<p>Momentum and Retail Investor&#39;s Appeal\nAccording to Simple Moving Average (SMA) analysis, Bed Bath &amp; Beyond shares’ trajectory evinces a short-term bullish and a long-term bearish trend.</p>\n\n<p>StockRover</p>\n\n<p>Relative Strength Index (RSI) analysis, meanwhile, shows shares of the home goods retailer are neither overbought nor oversold. A current RSI value near 50 suggests BBBYQ’s price momentum is only moderately positive.</p>\n\n<p>StockRover</p>\n\n<p>Turning to more anecdotal evidence, shares of Bed Bath &amp; Beyond remain quite popular among retail investors, many of whom follow the stock closely on social media forums.</p>\n\n<p>On the Stocktwits platform, for example, on the heels of its bankruptcy announcement in April, BBBYQ’s mentions reached over 8,000. And there’s still plenty of buzz surrounding the stock even two months after its bankruptcy announcement. Currently, there are an estimated 800 daily mentions for BBBYQ, which represents an increase of 185.6% over this year’s daily average.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/p630a9wdm3ab1.jpg\"/></div>"},
{"username": "No_Affect_5541", "url": "https://i.redd.it/3146i96vln4b1.jpg", "time": 1686168906.0, "subreddit": "r/ThePPShow", "title": "Breaking news", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3146i96vln4b1.jpg\"/></div>"},
{"username": "No_Affect_5541", "url": "https://i.redd.it/ddr9crhc3e4b1.jpg", "time": 1686053717.0, "subreddit": "r/ThePPShow", "title": "Calm before the wave", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>After the frenzy that was yesterday with fillings and &#39;news stories&#39; etc just want to wish the ones that are here calm and as we draw nearer to some conclusion with the twist and runs will be many i&#39;m sure. Some are here for their own reasons and end goals. </p>\n\n<p>To you all its been informative and truly an honour to see the effort some have place in trying to make sense of all that is going on, keep it up. Until we KNOW more. Not looking for up votes just wanted to put some kindness out there.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ddr9crhc3e4b1.jpg\"/></div>"},
{"username": "No_Affect_5541", "url": "https://i.redd.it/rqaes8clwr1b1.jpg", "time": 1684913397.0, "subreddit": "r/ThePPShow", "title": "Over the pond..I'm sure they can make it a green one.", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rqaes8clwr1b1.jpg\"/></div>"}]