[{"username": "No_Blueberry_7841", "url": "https://www.reddit.com/r/ThePPShow/comments/17m6edq/commitment_shares_where_are_they_now/", "time": 1698939832.0, "subreddit": "r/ThePPShow", "title": "Commitment Shares: Where Are They Now?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/8ayxPzVCtobQN5fEPPqZR-QS8GbDpXa6M6tvmjEhut4.jpg\"/></div>"},
{"username": "No_Blueberry_7841", "url": "https://www.reddit.com/r/ThePPShow/comments/16in3vr/questions_and_observations_surrounding_lazard_and/", "time": 1694709401.0, "subreddit": "r/ThePPShow", "title": "Questions And Observations Surrounding Lazard And APS Compensation Reports For June And July", "text": "<!-- SC_OFF --><div class=\"md\"><p>I noticed a few interesting things and have some questions over the Dream On Me IP auction on 6/29/23 and the cancellation of the going concern auction on 7/7/23.</p>\n\n<p>If this has already been discussed then please link me to the original thread and mods shut this one down but I couldn&#39;t find these specifics when searching.</p>\n\n<p>&#x200B;</p>\n\n<p>The following dockets surround AP Services and Lazard compensation reports for the months of June and July:</p>\n\n<p>&#x200B;</p>\n\n<p>Docket 2040 is AP Services compensation report for the month of June.  If you search the docket for &quot;P. Wu&quot; you will find her name referenced 36 times and most of these are surrounded by discussions with potential bidders, <strong>Sixth Street going concern plan</strong>, etc.   While all this was pre auction, there was still a lot of time spent discussing <strong>BABY standalone plans</strong> and <strong>BABY going concern plans</strong>.</p>\n\n<p>&#x200B;</p>\n\n<p>I then moved over to Docket 2155 (AP services compensation report for July) and Docket 2094 (Lazard compensation report for July) and saw some interesting discussions taking place after the IP auction and even after the Going Concern auction was cancelled.</p>\n\n<p>&#x200B;</p>\n\n<p>Docket 2155 (AP Services):</p>\n\n<p>7/4/23 - Lazard, DOM, and Patty Wu discussed BABY going concern models (pre going concern auction so they possibly just couldn&#39;t strike a deal)</p>\n\n<p>7/11/23 - Lazard, DOM, and Patty Wu discussed a &quot;<strong>go-forward corporate organization and strategy</strong>&quot; (this could be for DOM remaining private with no intention of going public)</p>\n\n<p>&#x200B;</p>\n\n<p>There is also discussion about &quot;50 and 75 door scenarios&quot; and also &quot;50 and 75 store recommendations&quot;.  <strong>Can anyone clarify what this might be referring to?</strong> (page 22 of docket 2155)</p>\n\n<p>&#x200B;</p>\n\n<p>Docket 2094 (Lazard):</p>\n\n<p>&quot;going concern&quot; is found 5 times in the docket.  There was a call on 7/6/23 with the Going Concern Buyers (it was only half an hour so this could have been the call where no bids were made on a going concern option which led to them cancelling the auction).</p>\n\n<p>It was mention again on 7/10/23 where 2 members of Lazard participated in a call titled &quot;Transition Call with Going Concern buyers&quot;.</p>\n\n<p><strong>If there was no Going Concern buyer and the 7/7/23 auction was cancelled then who is the transition call with and what are they transitioning?</strong></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "No_Blueberry_7841", "url": "https://www.reddit.com/r/ThePPShow/comments/16dgp2m/why_are_the_exculpation_provision_so_critical/", "time": 1694194220.0, "subreddit": "r/ThePPShow", "title": "Why Are The Exculpation Provision So Critical?", "text": "<!-- SC_OFF --><div class=\"md\"><p>When the original plan was released I remember reading about how important it is that the Exculpation provisions are approved.  It&#39;s also discussed again in Holly Etlin&#39;s Declaration for approving the plan (docket 2139).</p>\n\n<p>&#x200B;</p>\n\n<p>Page 16:</p>\n\n<p>&quot; 43. Based on my experience and discussions with counsel, it is my belief that the  exculpation provision described in Article X.E. of the Plan (the “Exculpation”) is appropriate  under applicable law because it was proposed in good faith, was formulated following extensive  good-faith, arm’s-length discussions with key constituents, and is appropriate limited in scope.  The Exculpated Parties played a critical role in negotiating, formulating, and implementing the  Disclosure Statement, the Plan, and related documents. <strong>I understand that the inclusion of the  Exculpation provision was a critical component of the negotiations over the terms of the Plan. In  short, I believe the Exculpation represents an integral piece of the overall settlement embodied in  the Plan.</strong> Accordingly, under the circumstances, I believe that it is appropriate for the Court to  approve the Exculpation provision.  &quot;</p>\n\n<p>&#x200B;</p>\n\n<p>I figured it was worth discussing what makes theses so critical however if this has already been discussed previously then mods please lock this thread.  I didn&#39;t see anything specific to exculpation provisions when using the search for this sub.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "No_Blueberry_7841", "url": "https://www.reddit.com/gallery/156imgp", "time": 1690028225.0, "subreddit": "r/ThePPShow", "title": "Some Screenshots From Docket 1438 Worth Reviewing", "text": "<!-- SC_OFF --><div class=\"md\"><p>It sounds like Lazard has been working on a going concern reorganization with BBBY since December of 2022.  There have been some bad actors that ultimately lead to filing BK but it sounds like Lazard has been working on said plan that could be effectuated in chapter 11.</p>\n\n<p>Also, below is a link to a bankruptcy article with the one and only Holly Etlin. She discusses the difficulty of the time constraints in these chapter 11 cases and there is verbiage in this docket that suggests this “plan” was filed to meet chapter 11 deadlines and that there is room for improvement for all stakeholders. </p>\n\n<p>Link to bankruptcy article:</p>\n\n<p><a href=\"https://www.cnbc.com/amp/2015/10/22/why-your-favorite-retailer-didnt-come-back-from-bankruptcy.html\">https://www.cnbc.com/amp/2015/10/22/why-your-favorite-retailer-didnt-come-back-from-bankruptcy.html</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/hXbajPdw4-IAZna8cy7m_2VjKhuWsEx6YEuV5k0mZis.jpg\"/></div>"}]