[{"username": "No_Interaction3703", "url": "https://www.reddit.com/r/ThePPShow/comments/1560etj/amc_ah_up_72/", "time": 1689974042, "subreddit": "r/ThePPShow", "title": "AMC AH Up 72%", "text": "Hope a similar thing happens to BBBYQ when we sleep, Once wake up Limit orders sold for $420.69 ", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "No_Interaction3703", "url": "https://www.reddit.com/r/ThePPShow/comments/1560etj/amc_ah_up_72/", "time": 1689974042.0, "subreddit": "r/ThePPShow", "title": "AMC AH Up 72%", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "No_Interaction3703", "url": "https://www.reddit.com/r/ThePPShow/comments/155z9si/bbb_is_rcs_first_hostile_take_over_with_the/", "time": 1689971460.0, "subreddit": "r/ThePPShow", "title": "BBB is RC's first Hostile Take over with the Guidance of CI", "text": "<!-- SC_OFF --><div class=\"md\"><p>The Plan Administrator shall report to and be overseen by a four-member oversight committee (the “Oversight Committee”). Each member of the Oversight Committee shall have a fiduciary obligation to the Wind Down Debtors and Holders of Allowed Claims. The Oversight Committee shall initially consist of four members to be appointed: (a) two by the Creditors’ Committee; (b) one by the FILO Agent (the “FILO Appointee”); and (c) one by the FILO Agent and Creditors’ Committee, which appointee shall be acceptable to the Debtors in their sole discretion (the “Fourth Member”); provided that, upon Payment in Full (as defined in the Final DIP Order) including payment of all accrued and unpaid Lender Fees, the FILO Appointee shall be replaced by a new member selected by the Creditors’ Committee. For the avoidance of doubt, the Fourth Member shall not be replaced. The Plan Administrator shall have the authority to release or settle any Claim or Cause of Action without the approval of the Oversight Committee where (i) the amount in controversy is equal to or less than $10 million without the approval of the Oversight Committee, or (ii) the amount in controversy is more than $10 million and the settlement amount is at least 70% of the amount in controversy. For any Claim or Cause of Action where the amount in controversy is greater than $10 million and the settlement amount is less than 70%, the Plan Administrator shall have the authority to release or settle such Claims or Causes of Action upon an affirmative vote of two members of the Oversight Committee; provided that decisions of the Plan Administrator related to the release or settlement of, or judgment in any D&amp;O Claim, including decisions related to any appeal thereof, shall be made by a unanimous vote of the Oversight Committee.</p>\n\n<p>&#x200B;</p>\n\n<p>RC would be the fourth member &quot;For the avoidance of doubt, the Fourth Member shall not be replaced&quot; who will be authorized to release &quot;the amount in controversy is equal to or less than $10 million without the approval of the Oversight Committee&quot;</p>\n\n<p>Other three members could be Larry+B Icohn+ &quot;no for  long&quot;</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "No_Interaction3703", "url": "https://www.reddit.com/r/ThePPShow/comments/147xaft/kingswood_capital_management_owner_of_world_market/", "time": 1686603001.0, "subreddit": "r/ThePPShow", "title": "Kingswood Capital Management owner of World Market", "text": "<!-- SC_OFF --><div class=\"md\"><p>company&#39;s decision to sell Cost Plus World Market to Kingswood Capital Management by February 2021,</p>\n\n<p>&#x200B;</p>\n\n<h3>Kingswood Capital Management General Information</h3>\n\n<p>Description</p>\n\n<p>Founded in 2013, Kingswood Capital is a private equity investment firm based in Los Angeles, California. The firm specializes in corporate divestitures, buyouts of family-and entrepreneur-owned businesses, operational turnarounds, bankruptcies and restructurings, and public-to-private investments. The firm prefers to invest in lower middle market companies operating in the business services, government services, healthcare services, consumer, energy, industrials, retail, technology, media, telecommunications, and value-added distribution sectors in the North-American region.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]