[{"username": "NoPants252", "url": "https://www.reddit.com/r/ThePPShow/comments/133aksw/so_i_dug_into_the_icahn_interview_a_little_more/", "time": 1682812682, "subreddit": "r/ThePPShow", "title": "So I dug into the Icahn interview a little more. Some of this is old news. Some are new observations. All of it is a wall of Text, but broken up with bullet points so hopefully you can stand it. And all of it is independently verifiable if you watch the vid.", "text": "All of this is done on mobile, so gimme a little bit of a break \n\nFacts: \n\n\n1. The screen grab they chose for Bird App thumbnail clearly shows the Clock at 1:47 (Even though it is an unflattering shot of Icahn)\n\n\n2. Clock is not clearly visible for the first several minutes of the interview.  \n\n\n3. At 6:28 Icahn shifts in his chair fully revealing the Clock. It is showing 1:46.\n\n\n4. At 6:53, there look to be several tiny edits while Icahn sort of stammers and draws words out.  Watch his shirt. You can see the wrinkles and his shoulders jump. Maybe it was a connection issue, maybe they were getting something just right.\n\n\n5. At 7:11 the frame zooms in. Edited post interview, not a camera zoom.\n\n\n6. At 7:12 the Clock changes to 1:47.\n\n\n7. At 7:20 there is a second zoom less significant than the first, but clearly happens.\n\n\n8. At 7:28 The already twice zoomed in image slightly distorts *exactly when* Icahn says \"8 Billion Dollars\"\n\n\n9 At 7:32 The image returns to original zoom level (no zoom)\n\n\n10. At 8:09 Icahn shifts his weight again and at 8:11 the Clock changes to 1:48 and his shoulder blocks part or all of the Clock for a while \n\n\n11. At 15:49 Clock is briefly visible showing 1:56 then remains partially blocked.\n\n\n12. At 19:18 Icahn slightly swivels his chair and reveals the Clock showing 1:59.\n\n\n13. At 19:20 the Clock changes to 2pm.\n\n\n14 At 32:26 Icahn's camera moves. \n\n\n15. At 33:17 While Andrew is speaking and they are all 3 displayed on the Split screen, Icahn pulls on his ear like you do in Charades to indicate \"sounds like\".  He does this at the same time as Andrew is saying '8 billion dollars\"\n\n\n\n16. At 36:52 Icahn will pick simething up from his desk with his left hand and then touch/scratch his face for a while.  This gives us a clear view of his wristwatch (which to me seems to be set at a very odd angle on his wrist for the wearer viewing the time, but at a perfect angle for the camera to see the watch face).  The watch seems to be exactly 2:15.   At the same time as the Clock is showing 2:18.  They look to be 3 minutes off \n\n\n17. At 43:43 there is another camera wiggle before Andrew speaks again.\nTalking about having confidence in an established business and not worrying about investing in building it.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]