[{"username": "NumbBumn", "url": "https://www.reddit.com/r/ThePPShow/comments/17ny64t/question_for_my_fellow_ibkr_holders/", "time": 1699139202.0, "subreddit": "r/ThePPShow", "title": "Question for my fellow IBKR Holders", "text": "<!-- SC_OFF --><div class=\"md\"><p>Anyone else has issue looking for a history transaction regarding BBBY/BBBYQ ? I&#39;m trying to find a history of when i bought my shares but i can only seem to find a history of when my cash settled. I&#39;m asking because in case of a share issuance they can just fuck me over and tell me i never bought any BBBY hence why i&#39;m not getting the new shares, and i won&#39;t be able to prove them wrong because i don&#39;t have a trace of any transactions whatsoever</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "NumbBumn", "url": "https://www.reddit.com/r/ThePPShow/comments/171jlmv/well_boys_after_seeing_that_they_didnt_at_first/", "time": 1696616194.0, "subreddit": "r/ThePPShow", "title": "Well boys, after seeing that they didn't at first glance, IBKR deleted my shares. Can't say it's been a pleasure, but can't say i won't remember it either.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Joined in August 2023, first it was the FTDs, then <a href=\"/u/BiggieSmallzzz\">u/BiggieSmallzzz</a> came in with the quality DD that gave us hope when the price kept plummeting, then the sneeze from $1 to 6$ in January a bit before RC&#39;s old $80 Jan calls expired, then the 100% sneeze on the 6th of february when Project Gemini tweeted congrats BBBY using emojis, to the stock split proposal, to the rumors of bankruptcy, to the bankruptcy itself, to the court livestream where one of the 6th street lawyers said that they have a plan moving forwards, to us learning we weren&#39;t a part of it...</p>\n\n<p>Had a lot of opportunities where i could sell for twice my investment and didn&#39;t need to torture my mind for months on ends wondering if i lost everything and if i&#39;m gonna make it, i could&#39;ve simply left with 3,000€... but i didn&#39;t sell. Should i have ? Seeing how everything is going ? Honestly yes. But i made a choice, and now here i am. I believed, and in the end, it didn&#39;t work out. At least for me. </p>\n\n<p>I hope for those that have their shares safe and secure in AST that y&#39;all are going to make it, and i mean it, i really hope all of this torturous path would have at least served some people. </p>\n\n<p>I&#39;m only 22, lost 4k, which is a lot for me, but defo not the same as the millions and thousands some lost. </p>\n\n<p>It&#39;s honestly hard to accept, that this year of uncertainty, fear, sadness for me, all of this, ended up being for nothing but a loss of money. But at the end of day, it&#39;s just money, i&#39;ll make it back hopefully. I didn&#39;t tell about this investment to anyone, no one knows i lost 4k, so i don&#39;t have anyone else to tell this to, hence why i&#39;m here (i would&#39;ve posted this on the BBBY main sub but looks like it&#39;s dogshit rn and this is the only place where we can talk without having a random tell us to sell and that the shares are cancelled and blablabla).</p>\n\n<p>But yeah, i&#39;m not here to tell you you made a shitty investment, or that you should sell or whatever. If you&#39;re complaining that you lost money because some guy on the internet told you to invest in a company, sorry to say bud but you&#39;re the only one to blame. </p>\n\n<p>I&#39;m simply here to say goodbye, because even if we don&#39;t know eachother, you boys have been apart of my daily life for a year now. And that&#39;s difficult to let go. The habits of checking the price, see the main BBBY sub with all of the people talking about the stock in a positive way where everyone would just shit on it... but i can&#39;t care about it anymore. I don&#39;t want to, but i can&#39;t. </p>\n\n<p>This shit&#39;s taken a toll on me pretty fucking hard, i aged 3 decades in a year because of all the stress and bullshit this stock has been through, but i really hope it&#39;ll turn good for y&#39;all.</p>\n\n<p>Anyways, have a nice day, and hopefully you&#39;ll made wife&#39;n&#39;life changing money. </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]