[{"username": "Ok-Vegetable4500", "url": "https://v.redd.it/8n3qewvlr1fb1", "time": 1690699559, "subreddit": "r/ThePPShow", "title": "Captain Ryan Cohen", "text": "☠️☠️", "preview": ""},
{"username": "Ok-Vegetable4500", "url": "https://www.reddit.com/r/ThePPShow/comments/14agljk/plan_for_malicious_responses_to_moass/", "time": 1686870853.0, "subreddit": "r/ThePPShow", "title": "Plan for malicious response(s) to Moass", "text": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s been an uptick in shills posting leading comments on the towel and Jimmy subs recently,</p>\n\n<p>(And of Onlyfans hoes following and spamming apes 😆)</p>\n\n<p>We don&#39;t know what injustices the dying system will attempt to dish out upon innocent apes if/when &quot;moass&quot; happens.</p>\n\n<p>Personally my plan is to buy and hold some stocks I like and not tell anyone how much I&#39;m worth or even tell folks &quot;I made 100k&quot; even if I made 20 mill (it&#39;s still a true statement)..</p>\n\n<p>I won&#39;t spend a penny on drugs, women, obscene luxury - it doesn&#39;t make anyone happy long-term and the brain builds up dopamine tolerance and then you spend more$$ and more$$$$ until you find yourself working at the dumpster behind Wendy&#39;s.</p>\n\n<p>I won&#39;t let any hoe, shill, cop, lawyer (or even friend or family - since you can be recorded and spied upon through devices) entrap me or manipulate me into saying or doing anything.</p>\n\n<p>But that&#39;s just my opinion. Do your own research and use your own brain.</p>\n\n<p>Not financial advice</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Ok-Vegetable4500", "url": "https://www.reddit.com/r/ThePPShow/comments/14a9re2/fed_reserve_strangely_changing_date_range_and/", "time": 1686854437.0, "subreddit": "r/ThePPShow", "title": "Fed Reserve strangely changing date, range and scope of it's annual bank \"stress test\".. 👀", "text": "<!-- SC_OFF --><div class=\"md\"><p>Source: <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/bcreg20230614a.htm\">https://www.federalreserve.gov/newsevents/pressreleases/bcreg20230614a.htm</a></p>\n\n<p>The Federal Reserve Board is going to announce the results of its annual stress tests for banks on Wednesday, June 28, at 4:30 p.m. EDT.</p>\n\n<p>These tests evaluate the resilience of 23 large banks by simulating a severe global recession that severely impacts real estate and corporate debt markets.</p>\n\n<p>The scenario they&#39;re using for the test involves the U.S. unemployment rate rising to 10% accompanied by severe market volatility, wide corporate bond spreads, and a crash in asset prices.</p>\n\n<p>This year, banks with significant trading operations will also be tested against a global market shock, which adds additional stress to their trading positions.</p>\n\n<p>For the first time, the stress test will include an exploratory market shock for the largest and most complex banks, the results of which will be released on a firm-specific basis.</p>\n\n<p>However, this exploratory shock won&#39;t contribute to this year&#39;s capital requirements it&#39;s meant to provide more information about the banks&#39; resilience and help the Board understand how to capture a wider array of risks in future stress tests--aka the portion of the test we know you are going to fail, so it does not count against your grade, but we need to know how bad you would have done...</p>\n\n<p>Considering the last of LIBOR priced swaps that were extended last year, need to be actually closed effective June 30th....I wonder why the FED is releasing results, and conducting test, right now.</p>\n\n<p>UNUSUAL - They usually conduct the test around October and release the results at the end of the year. Also I get real sketched out when they &quot;simulate&quot; scenarios these days. Looks like a possible playbook of an upcoming event.</p>\n\n<p>Edit: Related Content: Dodd-Frank Act Stress Tests 2023: <a href=\"https://www.federalreserve.gov/supervisionreg/dfa-stress-tests-2023.htm\">https://www.federalreserve.gov/supervisionreg/dfa-stress-tests-2023.htm</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Ok-Vegetable4500", "url": "https://i.redd.it/ksrfhwlgk66b1.jpg", "time": 1686834317, "subreddit": "r/ThePPShow", "title": "Given the last week (and year), we likely won't get the final confirmation until June 27", "text": "Replenish those liquids, BoBBY's", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ksrfhwlgk66b1.jpg\"/></div>"},
{"username": "Ok-Vegetable4500", "url": "https://i.redd.it/ornfuhy0k66b1.jpg", "time": 1686834170.0, "subreddit": "r/ThePPShow", "title": "Given the last week (and year), we likely won't get the final confirmation until June 27", "text": "<!-- SC_OFF --><div class=\"md\"><p>Replenish those liquids, BoBBY&#39;s</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ornfuhy0k66b1.jpg\"/></div>"},
{"username": "Ok-Vegetable4500", "url": "https://www.reddit.com/r/ThePPShow/comments/14a10nj/did_anyone_record_the_last_hearing/", "time": 1686831689, "subreddit": "r/ThePPShow", "title": "Did anyone record the last hearing?", "text": "I could only find 7 minutes of 30 seconds recordings on twitch, doesn't seem like anyone recorded it..\n\nWould love to watch, I fell asleep before it started (GMT..) and I hear it went great and the JPM lawyer was laughed at 😂", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]