[{"username": "OkBet9545", "url": "https://bedbathandbeyond.gcs-web.com/node/17361/html", "time": 1689197506, "subreddit": "r/ThePPShow", "title": "New 8K", "text": "On July 11, 2023 the Bankruptcy Court entered an order (the “Sale Order”) authorizing the Company Parties’ entry into an Asset Purchase Agreement (the “Purchase Agreement”), dated as of June 30, 2023, with Mark Srour-Serure, Dream On Me Industries, Inc., Dream 545 Weston Canal Road, LLC, a limited liability company organized under the laws of New Jersey (the “Purchaser”), and the other parties signatory thereto.\nThe Purchaser submitted a bid for the “BUYBUY BABY” business, subject to receipt of a higher or better bid for “BUYBUY BABY” as a going-concern. No qualified or viable going-concern bids were submitted ahead of the deadline. As a result, on July 7, 2023 the going-concern auction for “BUYBUY BABY” was cancelled and the Purchaser was declared the winning bidder.", "preview": ""},
{"username": "OkBet9545", "url": "https://www.reddit.com/r/ThePPShow/comments/14x0921/thanks/", "time": 1689102266, "subreddit": "r/ThePPShow", "title": "Thanks!", "text": "First off I’ve received about 80 or so messages/chat requests and every single one has been very supportive which was kind and completely unexpected. I’ve attempted to respond to the majority of them. Thank you for the love I’m overwhelmed. \n\nI’ve had many ask me to come back into the show but would only consider doing so once a significant announcement is made. Allow me to clarify what I mean by that. Teddy will need to file an S-1. To me, every other announcement is an amuse-bouche and though hype generating I want the entrée. Once that pops up on EDGAR maybe I’ll come on the show though I’m unsure of the purpose because the filing should be rather self explanatory. Within the S-1 look for any indicator as to what kind of shares (I’m hoping ERC-721), when will they be listed/tradable, where the listing will occur, how many are being distributed and to whom. I anticipate both GME and BBBY holders will receive shares in proportion to their respective market caps on a given date. Short institutions are cooked and because of the game of hot potato with toxic assets they’ve been playing, many will go under unless a significant bailout is provided.\n\nSome of you have indicated that SuperstoNk has plenty of peri/post moass guides. Feel free to use those instead. \n\n—\n\nIf I had to summarize my advice using one website I’d recommend the gold standard. Keep your life as simple as possible.\n\n[Chambers HNW/UHNW guide](https://chambers.com/legal-guide/high-net-worth-21)\n\nSpecifically focus on trust and estate law. Many of these firms have a private client division and they’ll help you create a trust and estate plan hopefully preventing intestacy (or the need for resulting/constructive trusts) and fortifying asset protection. They also provide many other services worth considering. \n\nTax planning can be done in conjunction with your private client firm and likely a 3rd party CPA firm they’ll guide you to. \n\nI’d rather be overinsured than under. HNW/UHNW insurance brokers are around. Find one and use them. I like Newfront.\n\nIf you want alt-citizenship or residency I like Henley & Partners. I’d avoid the Caribbean programs. Many other companies that offer these services are a scam. Tread carefully.\n\nYou can use a financial advisor, but I’d never recommend one. They’re some of the most unintelligent people I’ve met and a lot of what they offer is a grift. I prefer broad market mutual funds (I like VTSAX but choose whatever you want) and then taking pledged asset lines against that whenever I want some capital. This will likely be purchased through your private banks brokerage offering (I use one that’s domestic and another that’s outside US Banking jurisdiction). THE KEY is to never actually sell the mutual fund but be prepared to stomach some unrealized losses (we should be well trained at this point).\n\nOh also learn to stay secure. Pay off all bad debt immediately and be incredibly organized. You have to treat yourself like a corporation. Use a password manager as well as TOTP 2FA in as many places as possible. I keep a separate email for anything to do with finance/law/health and don’t give that out to the public. I even have a separate phone and number solely used for these services. iOS is more secure than Android. Google Privacy Guides though some of it I consider overkill. Get rid of all vices because wealth will potentiate them.\n\nI can only speak for men but always protect  women, children, and animals and treat people with respect. Be principled and honest. Do well, do good.\n\nI think that’s all I have!\n\nGodspeed 🚀\n\n-OKBET", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "OkBet9545", "url": "https://i.redd.it/e2e8ojxgzh7b1.jpg", "time": 1687408385, "subreddit": "r/ThePPShow", "title": "Backup bidders announced", "text": "https://restructuring.ra.kroll.com/bbby/ExternalCall-DownloadPDF?id1=MTUzMzM0NA==&id2=0&cid=0", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/e2e8ojxgzh7b1.jpg\"/></div>"},
{"username": "OkBet9545", "url": "https://i.redd.it/aloac2htmi5b1.jpg", "time": 1686544541, "subreddit": "r/ThePPShow", "title": "New dates", "text": "https://restructuring.ra.kroll.com/bbby/ExternalCall-DownloadPDF?id1=MTUyMjUzMA==&id2=0&cid=0", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/aloac2htmi5b1.jpg\"/></div>"}]