[{"username": "Opposite_Ladder_456", "url": "https://www.reddit.com/r/ThePPShow/comments/17xjgc3/i_wasnt_in_gme_but_im_here_now/", "time": 1700240077.0, "subreddit": "r/ThePPShow", "title": "I wasn't in GME, but I'm here now", "text": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t even know If I&#39;m considered a small whale at almost 11,000 DRS&#39;d shares. I know lots of you here have wayyyyyyy more than that. Whatever we end up getting per share from this, will help me out tremendously!</p>\n\n<p>Does anyone else walk out into the world and do your normal, daily, weekly, monthly , etc. activities and realize how different everything is feeling as of lately? Maybe it&#39;s the holiday season and weather changing OR maybe it&#39;s because I&#39;m finally seeing how sooo much is about to change.</p>\n\n<p>I grew up and still live in my hometown of Pensacola, FL. I&#39;m a real estate agent here who&#39;s had a job since 12 years old. Didn&#39;t have parents to teach me much and had to learn most of everything on my own. My grandparents raised me and taught me the most important thing over everything else; Good Morals and Good Intentions. All I&#39;ve ever wanted was enough money to help my grandparents fix up their house that&#39;s falling apart(they have no money), pay off my debt, help my siblings and friends and for my girlfriend and I to be able to wake up in the morning and not have to immediately stress and worry about bills and if we&#39;ll have enough work this month. I&#39;m not asking for sports cars or a bougie life. I will for sure elevate my life a little, but I&#39;d like to just wake up and KNOW everything will be ok. </p>\n\n<p>How is life like this? Why is life like this? Because of of the fucks at the top who think they can push us down and keep us here. All of this didn&#39;t have to happen, but they chose their path and I&#39;m happy to say we&#39;re waiting at the end for them to catch up and realize we&#39;re taking their money and doing something better with it.</p>\n\n<p>If we&#39;re right, and I really think we are, the world is about to change in a big way. I think lots of people will hurt from this. I think the economy will tank. Biden(idiot) just signed a bill extending spending to stop the government shutdown! Coincidence? Maybe, maybe not. </p>\n\n<p>Our World is greedy and run by people who profit off of death and robbing our wallets. I look forward to seeing our new world soon with all of you PP&#39;s. Happy 11/17. Tomorrow is soon! 🚀🚀🚀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Opposite_Ladder_456", "url": "https://i.redd.it/k84aaolwjmtb1.jpg", "time": 1697052342.0, "subreddit": "r/ThePPShow", "title": "Sent an email to Mellon", "text": "<!-- SC_OFF --><div class=\"md\"><p>Not sure if anyone has done this yet or shared. I was the one who posted last week about AST saying they had my shares still and we’re just waiting for corporate action.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/k84aaolwjmtb1.jpg\"/></div>"},
{"username": "Opposite_Ladder_456", "url": "https://www.reddit.com/r/ThePPShow/comments/171ckst/ast_call_just_now/", "time": 1696599556.0, "subreddit": "r/ThePPShow", "title": "AST Call Just Now", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve called AST each day for the past three days. Yesterday, a rep at AST told me my shares were &quot;Null and Void until the company(bbbyq) comes to an agreement with an acquiring company&quot; and that I wouldn&#39;t be able to access my AST online account until then.</p>\n\n<p>Just called AST five minutes ago and the rep I spoke with informed me my shares were still in my account, but I wouldn&#39;t have access to my online account until the &quot;corporate action is approved.&quot;</p>\n\n<p>I asked him what the corporate action was or if he could elaborate and he said they have received instructions, but none on next steps and couldn&#39;t elaborate more.</p>\n\n<p>Yesterdays call was &quot;Null and Void&quot; and todays call makes me think we might see something today. Just being hopeful!</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]