[{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/180bvpg/pathetic/", "time": 1700553428.0, "subreddit": "r/ThePPShow", "title": "Pathetic:", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/6wzmpmrrpn1c1.png?width=779&amp;format=png&amp;auto=webp&amp;s=cea0e857ded37051af0ef319cd2ceb85a6650df4\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/6wzmpmrrpn1c1.png?width=779&amp;format=png&amp;auto=webp&amp;s=cea0e857ded37051af0ef319cd2ceb85a6650df4\" alt=\"https://preview.redd.it/6wzmpmrrpn1c1.png?width=779&amp;format=png&amp;auto=webp&amp;s=cea0e857ded37051af0ef319cd2ceb85a6650df4\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/z523pr56qn1c1.png?width=797&amp;format=png&amp;auto=webp&amp;s=c525449671d8452a6d5efb7b6c5370b076d2d408\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/z523pr56qn1c1.png?width=797&amp;format=png&amp;auto=webp&amp;s=c525449671d8452a6d5efb7b6c5370b076d2d408\" alt=\"https://preview.redd.it/z523pr56qn1c1.png?width=797&amp;format=png&amp;auto=webp&amp;s=c525449671d8452a6d5efb7b6c5370b076d2d408\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/yrglysfeqn1c1.png?width=794&amp;format=png&amp;auto=webp&amp;s=e01777fe48137bf5ee0e2fc3834ba4a5b1673b80\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/yrglysfeqn1c1.png?width=794&amp;format=png&amp;auto=webp&amp;s=e01777fe48137bf5ee0e2fc3834ba4a5b1673b80\" alt=\"https://preview.redd.it/yrglysfeqn1c1.png?width=794&amp;format=png&amp;auto=webp&amp;s=e01777fe48137bf5ee0e2fc3834ba4a5b1673b80\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/AQ1OccIU4o6fo4tXLoJ-LYcO5VBBZLQwz9MyWMMTGM8.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/180bm1u/icork_vs_paddling_lets_debate/", "time": 1700552367.0, "subreddit": "r/ThePPShow", "title": "iCork Vs Paddling: Let's Debate", "text": "<!-- SC_OFF --><div class=\"md\"><p>OG Post: </p>\n\n<p><a href=\"https://preview.redd.it/pzdcnp92mn1c1.png?width=791&amp;format=png&amp;auto=webp&amp;s=76d01d8ecb7ffe9f16f6bd9d7af4863aa8151ed4\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/pzdcnp92mn1c1.png?width=791&amp;format=png&amp;auto=webp&amp;s=76d01d8ecb7ffe9f16f6bd9d7af4863aa8151ed4\" alt=\"https://preview.redd.it/pzdcnp92mn1c1.png?width=791&amp;format=png&amp;auto=webp&amp;s=76d01d8ecb7ffe9f16f6bd9d7af4863aa8151ed4\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/iyqsghrsmn1c1.png?width=794&amp;format=png&amp;auto=webp&amp;s=91b044e76099f706c5602f25c5c04d6d8b5d66f2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/iyqsghrsmn1c1.png?width=794&amp;format=png&amp;auto=webp&amp;s=91b044e76099f706c5602f25c5c04d6d8b5d66f2\" alt=\"https://preview.redd.it/iyqsghrsmn1c1.png?width=794&amp;format=png&amp;auto=webp&amp;s=91b044e76099f706c5602f25c5c04d6d8b5d66f2\"></a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/UoNcRuG7sMgAVYqT86XO9LPNeNykmOzLRUGkb8vM5uo.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/180ae81/fuck_bulls_and_fuck_bears_alike_lets_learn_how_to/", "time": 1700547523.0, "subreddit": "r/ThePPShow", "title": "Fuck Bulls and Fuck Bears Alike: Let's Learn How to Ride the Objectivity Bike - Part 1: Exclusivity", "text": "<!-- SC_OFF --><div class=\"md\"><p>My goal with this series is to force objective analysis. To be clear, I don&#39;t give a shit about anyone else except the x, xx, xxx, xxxx, and xx,xxx shareholders, unless shareholders above this level somehow propel that of the lower ranks into financial prowess by succeeding (and I know that&#39;s part of this play, hence the reason I&#39;m behind it). I&#39;m already irritated in general, so let&#39;s go.....</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://i.redd.it/xdioyvkv7n1c1.gif\">https://i.redd.it/xdioyvkv7n1c1.gif</a></p>\n\n<p>Jake, Ross, Region, Sal, PP, ABC, Michael, Famous, Edwin, FredDaph, StockD, Krill, Snake Plissken (you know), Kevin, PP, ABC, Michael, ByeByeShart (haha - term of endearment), 80HD, Lucio-4-Banger, No_Pie (Who probably knows the whole play as the omniscient being overwatching all of us). Before we begin, wanna know what I&#39;m smoking? </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://i.redd.it/dsmw783q8n1c1.gif\">https://i.redd.it/dsmw783q8n1c1.gif</a></p>\n\n<p>Yeah, I fuckin said it. Let&#39;s fight. </p>\n\n<p>Tonight&#39;s Writing is Inspired by the Following Playlist:</p>\n\n<ol>\n<li>Switchfoot: 4:12</li>\n<li>Thousand Foot Krutch: Absolute</li>\n<li>Red Hot Chili Peppers: Aeroplane</li>\n<li>The Goo Goo Dolls: Ain&#39;t That Unusual (probably played 5 times in a row, to be fair)</li>\n<li>Foo Fighter: All My Life (played on repeat, probably for an hour straight, because I was pissed off and it helped me focus). </li>\n<li>The Offspring: Americana</li>\n<li>Good Charlotte: The Anthem</li>\n<li>BuckCherry: Anything, Anything</li>\n<li>Arctic Monkeys: Arabella</li>\n<li>Jet: Are You Gonna Be My Girl</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/a9g5y27n7n1c1.png?width=2027&amp;format=png&amp;auto=webp&amp;s=a95bd8a30dc06c6f885dac9ff5f1287cba998151\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/a9g5y27n7n1c1.png?width=2027&amp;format=png&amp;auto=webp&amp;s=a95bd8a30dc06c6f885dac9ff5f1287cba998151\" alt=\"https://preview.redd.it/a9g5y27n7n1c1.png?width=2027&amp;format=png&amp;auto=webp&amp;s=a95bd8a30dc06c6f885dac9ff5f1287cba998151\"></a></p>\n\n<p><strong>Exclusivity</strong></p>\n\n<p>As a variable, the exclusivity period didn&#39;t receive much attention because the predominant theses up to this point are based on BBBY et al. being on the same side as retail investors since the commencement of Chapter 11 BK. As such, plans proposed by BBBY&#39;s legal teams were thought to have shareholders&#39; best interests in mind, since the drivers of the plan were those whose interests were written into the plan confirmation and voting process, i.e. the DIP and FILO parties.</p>\n\n<p>The DIP, FILO, roll-up lenders were deemed to make a full recovery. Consequently, these parties were deemed to accept the plan, thereby removing their need to vote just as shareholders of the company&#39;s common stock were deemed in advance to reject the plan and thereby not allowed to vote since the plan indicates shareholders will receive nothing. Alas, both claimant categories were not entitled to vote because their respective recoveries and corresponding vote records were treated as albeit certain, except: enter the waterfall recovery plan.</p>\n\n<p>DIP lenders <em>did</em> get to vote, via the waterfall recovery mechanism because authorizing the waterfall recovery method rendered them less than whole, unless I&#39;m recalling incorrectly or misinterpreting the Chapter 11 plan structure. Bondholders were initially deemed to reject the plan since their recovery was estimated to be zero. However, due to the waterfall recovery mechanism, bondholders were invited to vote because their 2.5% potential recovery from the waterfall recovery mechanism made them the fulcrum security holder.</p>\n\n<p>Well, bondholders voted to reject the plan (See Docket Item 2140), but since the DIP and FILO parties were not made completely whole by way of their acceptance of the waterfall recovery plan, <em>they were able to cast votes;</em> the results of which resulted in a net approval of the current Chapter 11 plan.</p>\n\n<p>So if Sixth Street is representing the private and/or activist investor team behind the pro-shareholder long-play, <strong>I am not able to explain how Sixth Street was able to help broker the original Chapter 11 plan while also laying in await to be a key party involved in the approval or execution of a post approved Chapter 11 plan</strong>, unless my understanding is completely off (most probable) or unless Sixth Street didn&#39;t help consummate the current Chapter 11 plan.</p>\n\n<p>Seriously, if you haven&#39;t read every page of the exhibits in Docket Item 2140 and claim to be in the know on this case, you need to press pause and go back through it. Look at the amounts vs numbers with respect to the percentage accepting vs rejecting the plan. Look at how the numbers and amounts voting to accept vs reject vary between each BBBY subsidiary. For instance, some BBBY subsidiaries include votes from Class 6 claimants to vote, whereas other do not. This reply isn&#39;t meant to be a polished DD post but, rather, my point is to press the point home that we don&#39;t know as much as we represent to know, and that&#39;s okay, but let&#39;s spend less time celebrating and more time working.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/sQe1fZWGZl6oh8-C7ym8wl1DHaQzq1GFABqshUdFZTU.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/17umyrw/b_riley_stock_down_50_in_relation_to_losses_on/", "time": 1699914687.0, "subreddit": "r/ThePPShow", "title": "B. Riley Stock Down ~50% in Relation to Losses on Franchise Group (ex-$FRG) Acquisition &amp; Securities Fraud Lawsuit: A Quick Look Back on the Legal Players Involved", "text": "<!-- SC_OFF --><div class=\"md\"><p>Shares of B. Riley Financial Inc. were trading at around $41 a share one week ago, whereas today the stock price closed at $22 per share. B. Riley served as the <a href=\"https://brileyfin.com/blog/b.riley-securities-serves-as-sole-bookrunner-for-bed-bath-beyonds-1.025bn-public-equity\">sole bookrunner</a> for BBBY&#39;s public offering of  Series A convertible preferred stock and warrants back in early February of this year, which yielded $225M initially plus an estimated $800M in future capital at the time. By the end of March, Gove had stated that, &quot;<em>We have raised $360 million of equity capital since the beginning of February, cured our default under our credit agreement, repaid material amounts of our ABL facility, completed our interest payment for our senior notes, all while jump-starting our turnaround plans</em>&quot; (<a href=\"https://www.abfjournal.com/dailynews/bed-bath-beyond-enters-committed-equity-facility-with-b-riley-principal-capital/\">Source</a>). </p>\n\n<p>B. Riley&#39;s losses this week are reportedly the result of unrealized investment losses and S&amp;P Global Ratings&#39; downgrading of B. Riley&#39;s key asset, Franchise Group. Per Oguh (2023) at <a href=\"https://www.reuters.com/business/finance/b-riley-shares-plummet-after-taking-losses-franchise-group-deal-2023-11-13/\">Reuters</a> today, &quot; </p>\n\n<p><em>S&amp;P Global Ratings downgraded Franchise Group&#39;s credit rating on Friday, dropping it further down in junk status to &#39;B-&#39; from &#39;B&#39; with a negative outlook, citing its weak performance. The rating agency also said it was monitoring legal developments relating to Franchise Group&#39;s Chief  Executive Brian Kahn, who led the August take-private deal [of FRG]. Bloomberg reported this month that Kahn is one of two co-conspirators named by co-founder of hedge fund Prophecy Asset Management John Hughes, who this month pleaded guilty to securities fraud.</em> </p>\n\n<p><em>Bryant Riley, B.Riley&#39;s eponymous CEO, said during an analyst earnings call last week that it had invested in Franchise Group based on the fundamentals of the business and that Kahn had no  &quot;direct experience with what has been alleged.&quot; B. Riley has also been targeted by a short seller. In February, Wolfpack Research accused the company of not cutting losses on &quot;failing&quot;  investments and continuing to extend capital to distressed clients.</em></p>\n\n<p>About three months ago, I made a <a href=\"https://www.reddit.com/r/BBBY/comments/15yncvu/disturbance_in_the_force/\">post</a> that got little commentary about B. Riley&#39;s acquisition of Franchise Group, the main reason being the degree of overlap among the financial players involved was odd to say the least. More specifically, the same B. Riley that served as the only bookrunner for BBBY&#39;s public offering of the Series A Stock and Warrants in February of this year, who is also the same B. Riley that&#39;s a member of the Options Clearing Corporation whose <a href=\"https://www.theocc.com/company-information/member-directory\">membership</a> is specific to its rights to participate in the OCC&#39;s <a href=\"https://www.theocc.com/Clearance-and-Settlement/Stock-Loan-Programs/Stock-Loan-FAQs\">Stock Loan Program</a>, acquired the Franchise Group just six months after it worked on BBBY&#39;s offering. There is more detail in my post about the overlap of legal teams used (Wachtell et al., Troutman et al., Willkie et al., Sullivan et al., and Jeffries LLC), but this is Franchise Group in a nutshell:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/89dqe1crv60c1.png?width=743&amp;format=png&amp;auto=webp&amp;s=f353ca58589b907cb4a24152b92cc0bb19474b68\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/89dqe1crv60c1.png?width=743&amp;format=png&amp;auto=webp&amp;s=f353ca58589b907cb4a24152b92cc0bb19474b68\" alt=\"https://preview.redd.it/89dqe1crv60c1.png?width=743&amp;format=png&amp;auto=webp&amp;s=f353ca58589b907cb4a24152b92cc0bb19474b68\"></a></p>\n\n<p>So we&#39;ve got two home furnishing companies and the entity that owns Sears under Franchise Group&#39;s umbrella, wherein the deal involving B. Riley&#39;s acquisition of FRG included five of the same legal teams that are involved in some way in BBBY&#39;s Chapter 11 Bankruptcy proceedings. Are we to think there is no connection between these events and the players involved? Curious what others think looking back on it now in light of more recent developments. </p>\n\n<p>Just a side note; B. Riley also used its B. Riley Principal 150 Merger Corporation to acquire FaZe Holdings Inc. (FAZE) , popular esports and entertainment company, in June of 2021. B. Riley took FaZe public in July of 2022. The stock hit a high of about $17 by early September, fell below a dollar by the end of January, and now trades at $0.20. Last month, FaZe was acquired by GameSquare and added to its eSports portfolio. I mention this transaction because it serves as an example of B. Riley either taking a company public or bookrunning a company&#39;s public offering, where after the company it supposedly believes in gets devalued into BK or acquired. </p>\n\n<p>If nothing else, and even if we&#39;re on track for a successful outcome now, I think it&#39;s important to understand any and all forces that are or were at work along the way. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Qp2GY7QnqB5CvrYAEqNFaM0Ltilbyftq-tSlCp4bwYg.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/17rdihv/did_anyone_with_shares_at_fidelity_ever_receive/", "time": 1699538284.0, "subreddit": "r/ThePPShow", "title": "Did Anyone with Shares at Fidelity Ever Receive the Non-Voting Status?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Page 14 of Docket Item 1438 indicates <em>there are approximately 445,000 holders of claims and interests that will require a solicitation package or non-voting status notice.</em> Kroll et al. and BBBY&#39;s legal team gave assurances that all banks, brokers, broker-dealers, and financial intermediaries received the instructions and material needed to supply non-voting statuses to beneficial holders due to their ineligibility to vote on the plan. </p>\n\n<p>I did not receive any information, alert, mail, or email from Fidelity about my non-voting status, so curious if anyone else at Fidelity did? Or, if you did receive notice of your non-voting status, what institution sent you the notice of non-voting status?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/17k3jh9/who_is_brandon_meadows_we_dont_know_for_sure_yet/", "time": 1698699546.0, "subreddit": "r/ThePPShow", "title": "Who is Brandon Meadows? We Don't Know for Sure Yet", "text": "<!-- SC_OFF --><div class=\"md\"><p>I love to have my tits jacked as much as the next fella, but felt obligated to make a post about tempering our expectations. I just responded to a comment from <a href=\"/u/Real_Eyezz\">u/Real_Eyezz</a>, who accurately pointed out that we don&#39;t know for sure which Brandon Meadows and which Addison Holdings go together, if any. </p>\n\n<p>In my post last week, I <em>speculated</em> the Brandon Meadows I found on LinkedIn could be the $10B claimant Brandon Meadows. It was also speculation as to whether the Brandon Meadows I found on LinkedIn works at the Addison Holdings LLC located at <a href=\"https://addisonholdings.com\">addisonholdings.com</a>. LinkedIn Brandon Meadows appears to work in Montgomery, AL. There is an Addison Holdings, LLC in Alabama, but it sure doesn&#39;t look like much according to <a href=\"https://www.google.com/maps/place/Addison+Holdings,+LLC/@33.530195,-86.7828958,17z/data=!4m14!1m7!3m6!1s0x88891baabc965247:0x6fdd2cf67aaec86d!2sAddison+Holdings,+LLC!8m2!3d33.5303873!4d-86.7828585!16s%2Fg%2F11f3m8cf73!3m5!1s0x88891baabc965247:0x6fdd2cf67aaec86d!8m2!3d33.5303873!4d-86.7828585!16s%2Fg%2F11f3m8cf73?entry=ttu\">Google Maps</a>, not to mention it appears to be shut down. Then again, there was Alameda Bank, so who knows - lol.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8uofrhrpiexb1.png?width=320&amp;format=png&amp;auto=webp&amp;s=9774cc8e1124fa0391fe85d501436cb5b4400818\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/8uofrhrpiexb1.png?width=320&amp;format=png&amp;auto=webp&amp;s=9774cc8e1124fa0391fe85d501436cb5b4400818\" alt=\"https://preview.redd.it/8uofrhrpiexb1.png?width=320&amp;format=png&amp;auto=webp&amp;s=9774cc8e1124fa0391fe85d501436cb5b4400818\"></a></p>\n\n<p>The fact that the Brandon Meadows I referenced from LinkedIn <em>appears</em> to reside in Birmingham combined with there being a record of Addison Holdings, LLC existing in Birmingham, does make it seem probable on the surface those two are in reference to each other. As of yet, I can&#39;t find a link between the Brandon Meadows I referenced on LinkedIn and the Addison Holdings, LLC in Park City, UT (the one with the <a href=\"https://addisonholdings.com/\">website</a>), so any linkage between them is not yet substantiated. Brandon Meadows&#39; background and experience on LinkedIn <em>seems</em> to align well with Addison Holdings LLC in Park City, but I can&#39;t prove anything and, even if I could, I can&#39;t prove its the $10B B.A.M.</p>\n\n<p>Addison Holdings out of Park City appears to be a branch of Addison Holdings LLC in California per <a href=\"https://opencorporates.com/companies?jurisdiction_code=&amp;q=addison+holdings+llc&amp;type=companies&amp;types_of_data_held=Branch+Relationship&amp;user=true&amp;utf8=%E2%9C%93\">OpenCorporates</a>. There are multiple subsidiaries in it, four Addison Holdings LLCs in different states, but it&#39;s weird because the named state, jurisdiction state, and state of registration are all different in some cases. For example, Addison Holdings-Florida LLC shows it under the jurisdiction of OH and registered to the Addison Holdings LLC in UT, so no relationship to FL other than what&#39;s stated in the name.</p>\n\n<p>There is also one <em>Dream Addison Holdings LLC</em> (TX jurisdiction but registered in NY)) which originated in January 2023. But still no confirmatory linkage yet between the Brandon Meadows I referenced on LinkedIn, the Addison Holdings LLCs in Park City, and the Brandon Adam Meadows on the $10B claim. Regardless, the $10B claim is both provocative and bullish to me because it suggests a massive fish has entered the waters, with both inventory and capital. I can&#39;t explain it or what&#39;s going on, but it&#39;s what I think. In the meantime, I want to keep things honest and felt it was important to reiterate any connections between $10B Brandon, LinkedIn Brandon, and <a href=\"https://AddisonHoldings.com\">AddisonHoldings.com</a> remains to be proven. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/mAt3CNrehHdCxWckI01hrWSXqMGe3ElQsLG2P8oHjpA.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/17h44b2/new_piece_of_information_2m_spent_on_relocating/", "time": 1698347685.0, "subreddit": "r/ThePPShow", "title": "New Piece of Information: $2M Spent on Relocating 63 Employees in the 3 Months Leading Up to BK and as of the Most Recent MOR, 65 FT Employees Remain", "text": "<!-- SC_OFF --><div class=\"md\"><p>I found this information by accident while I was digging for something else, then couldn&#39;t find it again for like three hours, because the number employees relocated was strangely written-out as &quot;sixty-three&quot; instead &quot;63&quot;. I&#39;m not saying this is <em>something</em> but it&#39;s odd because the standard is to write numbers numerically when equal to or greater than 10 and spell them out when less than 10. In all fairness, court filings aren&#39;t academic essays or business reports, but just saying. Anyway:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7pxrnf5pglwb1.png?width=551&amp;format=png&amp;auto=webp&amp;s=fceea5d68b81264a5b0faead8c7e16ca7166b219\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/7pxrnf5pglwb1.png?width=551&amp;format=png&amp;auto=webp&amp;s=fceea5d68b81264a5b0faead8c7e16ca7166b219\" alt=\"This is from Page 13 of Docket Item 11 but it&#39;s also in Docket Item 10.\"></a></p>\n\n<p>In my experience, relocation packages are typically reserved for employees in senior management positions who companies see long-term future value in. Moreover, $2M divided by 63 employees breaks down to about $32k per employee. I received a relocation package of $5,000 in 2006 for moving out of state as part of a promotion with a company that was absolutely crushing it and on the Fortune 1000 list at the time. My director-level position only managed 5 managers, 40 employees, and three locations, plus you have to factor in inflation. </p>\n\n<p>Nonetheless, $32k on average for 63 employees strikes me as being sizeable, especially when the company was in dire financial straits and barreling toward Chapter 11 bankruptcy. As such, it made me wonder if these moves were made to get key people in specific locations. In Docket Item 10, there is mention of a Wages Motion, wherein the relocation expenses are explained in greater detail, but I can&#39;t find it anywhere. Anyway, after seeing 63 employees received what appeared to be noteworthy relocation packages, I recalled that only 65 employees remained employed full-time:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gdu4vfqgjlwb1.png?width=645&amp;format=png&amp;auto=webp&amp;s=8a8759e1898c07f3020fce8cd376c86b2f9344d5\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/gdu4vfqgjlwb1.png?width=645&amp;format=png&amp;auto=webp&amp;s=8a8759e1898c07f3020fce8cd376c86b2f9344d5\" alt=\"https://preview.redd.it/gdu4vfqgjlwb1.png?width=645&amp;format=png&amp;auto=webp&amp;s=8a8759e1898c07f3020fce8cd376c86b2f9344d5\"></a></p>\n\n<p>So it got me wondering what the likelihood of the 65 encompassing some or all of these 63 employees.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/AFJc2NAP9yOArWqurSGHeJEv0kGLUixQ2SNXv4CxL-o.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/17cjaop/docket_2520_exhibit_e_notice_of_nonvoting_status/", "time": 1697830051.0, "subreddit": "r/ThePPShow", "title": "Docket 2520 - Exhibit E: Notice of Non-Voting Status Served on Three Equity Holders &amp; A Partner of Berger Singerman, Florida's Business Law Firm", "text": "<!-- SC_OFF --><div class=\"md\"><p>In Docket Item 2520 is Exhibit E: Supplemental Impaired Service List. The list contains four names, at least three of which are equity holders with DRS&#39;d shares, per Docket Item 219. Curious why Kroll would serve the Notice of Non-Voting Status to these parties specifically?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ieuzj3puievb1.png?width=486&amp;format=png&amp;auto=webp&amp;s=03cac942c25fcb64f24a9e756b66de9809fc5c98\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ieuzj3puievb1.png?width=486&amp;format=png&amp;auto=webp&amp;s=03cac942c25fcb64f24a9e756b66de9809fc5c98\" alt=\"https://preview.redd.it/ieuzj3puievb1.png?width=486&amp;format=png&amp;auto=webp&amp;s=03cac942c25fcb64f24a9e756b66de9809fc5c98\"></a></p>\n\n<p><a href=\"https://www.oak-tree-advisors.com/\">Oak Tree Advisors</a> operates a consulting business out of Port St. Lucie in Florida, focusing on a wide range of business growth services. The business is run by Bob Coradini, who also holds shares personally per Docket Item 219. Collectively, Coradini and his family appears to hold or held at one point close to 15,000 direct registered shares. </p>\n\n<p><a href=\"https://www.bergersingerman.com/team/samuel-j-capuano\">Capuano</a> doesn&#39;t appear to be an equity holder but did show up in Docket 2135 on Exhibit M: Impaired Service List, which was served on August 7th. Capuano is a partner at <a href=\"https://www.bergersingerman.com/\">Berger Singerman</a>, Florida&#39;s Business Law Firm. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/719baexzlevb1.png?width=829&amp;format=png&amp;auto=webp&amp;s=ffe5fa14f4326749eb258133b7027e9c58be0f40\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/719baexzlevb1.png?width=829&amp;format=png&amp;auto=webp&amp;s=ffe5fa14f4326749eb258133b7027e9c58be0f40\" alt=\"https://preview.redd.it/719baexzlevb1.png?width=829&amp;format=png&amp;auto=webp&amp;s=ffe5fa14f4326749eb258133b7027e9c58be0f40\"></a></p>\n\n<p>More specifically, Capuano works on Berger Singerman&#39;s business reorganization team, including matters involving commercial insolvency and litigation in bankruptcy cases, assignment for the benefit of creditors cases, receiverships, post-judgment proceedings, and out-of-court workouts. Neither Capuano nor Berger Singerman show up in any claims search results or other filings. </p>\n\n<p>To be clear, the name Berger Singerman doesn&#39;t show up anywhere in the filings, only the name Samuel John Capuano. Nonetheless, given his late arrival to the bankruptcy proceedings and specific legal specializations, it makes me wonder if Berger Singerman could be involved somehow in the post-bankruptcy restructuring. It could be absolutely nothing, but figured it was worth sharing and seeing if these names surface again in future filings. </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/o_01pOnH0HIAWetFLKHkl0ZBvIUcIZzKEN4E-3MsgVE.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/17bp97r/ratio_of_rbbby_posts_and_comments_in_past_24/", "time": 1697738323.0, "subreddit": "r/ThePPShow", "title": "Ratio of r/BBBY Posts and Comments in Past 24 Hours: Share Count Tracker Participant vs Non-Share Count Tracker Participant by Username", "text": "<!-- SC_OFF --><div class=\"md\"><p>I love The PP Show but, like many people, this play all started for me on the <a href=\"/r/BBBY\">r/BBBY</a> sub. It is all too obvious at this point how much the sub has changed for the worse, however, I was curious how many posts and comments were from users who participated in the share count tracker initiative at some point. Granted, not all participants in the share count tracker initiative were verified, but it still seemed like a reasonable shill filter, just for some perspective. </p>\n\n<p>I only looked at the past 24 hours of posts and comments on the BBBY sub, so admittedly not a strong sample size, anecdotal at best. Nonetheless, I found it interesting that out of the 35 posts in the past 24 hours starting from about an hour ago, that 26 were posts from people who never participated in the share count tracker. Interestingly, quite a few of these were posting screenshots of their liquidated positions and/or comments with customer service reps at their brokers. I was thinking some people are more inclined to weigh-in in the presence of a negative stimulus than a positive one, so maybe that&#39;s part of it. Nonetheless, only 9 out of 35 posts were from sub members who participated in the share count tracker. </p>\n\n<p>The comments were even more of a shit show. Out of 134 comments, 115 were from people who didn&#39;t participate in the share count tracker. Not all comments were negative but, for the most part, I would say they were either negative, lacked substance, or only contained a stupid little catch phrase, i.e., RC will save us, shorts are fukt, etc. It sucks the OG BBBY sub is a dump now. I hope the PP Team adopts the point of view that an ounce of prevention is worth a pound of cure given that we&#39;re seeing a huge uptick in pointless posts. Just wanted to share this little findings because it confirmed it for me that low-quality posts and comments really can rot a sub fast. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/17b2wdb/could_this_be_a_honeypot_play/", "time": 1697667071.0, "subreddit": "r/ThePPShow", "title": "Could This Be a Honeypot Play", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just a couple of hours ago, <a href=\"/u/Jolly-Ad8243\">u/Jolly-Ad8243</a> made a <a href=\"https://www.reddit.com/r/ThePPShow/comments/17b0aht/might_be_on_to_something_here/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">post</a> theorizing Cede &amp; Co could be behind the share cancellation process in an attempt to determine how many shares, real, naked, or synthetic, are in circulation. While I doubt Cede &amp; Co would do this because it could implicate them and/or expose cracks in the current system they rule over, the post led me think of another idea. Although I made a comment about it already, I wanted to get some more spotlight on it and ask what members of the sub think, as to whether what we&#39;re seeing could be a honeypot play.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/dfxt0kgz91vb1.png?width=361&amp;format=png&amp;auto=webp&amp;s=b0d8d2cc4d4fe0564033f010c6d27b675e983f6e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/dfxt0kgz91vb1.png?width=361&amp;format=png&amp;auto=webp&amp;s=b0d8d2cc4d4fe0564033f010c6d27b675e983f6e\" alt=\"https://www.merriam-webster.com/dictionary/honeypot\"></a></p>\n\n<p><a href=\"https://preview.redd.it/czjiokf3a1vb1.png?width=696&amp;format=png&amp;auto=webp&amp;s=add115902ce05f9612c77d513eb1bb964211e247\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/czjiokf3a1vb1.png?width=696&amp;format=png&amp;auto=webp&amp;s=add115902ce05f9612c77d513eb1bb964211e247\" alt=\"https://usa.kaspersky.com/resource-center/threats/what-is-a-honeypot\"></a></p>\n\n<p>&#x200B;</p>\n\n<p>Via the share cancellation process, some form of accounting entry must be triggered to clear BBBY/BBBYQ/0HMI etc. preferred shares, common shares, common stock warrants, and secured note positions from shareholders&#39; accounts. Could this event be unique in that it will create a record exposing the extent of naked short-selling, rehypothecation, FTDs, and other forms of fuckery among banks, brokers, dealers, market-makers, clearing agencies, introducing brokers, etc., sort of like mapping the chain of custody from the bottom-up?</p>\n\n<p>I mean if JPM was willing to sell a billionaire like Ryan Cohen millions of IOUs instead of buying real shares until they were forced to when he sold, then who knows what kind of shit they&#39;ve pulled on us retail mongrels. Again, perhaps THAT&#39;s the data we need to measure the totality of it. If some entity, be it DK-Butterfly or some other acquirer were to offer shareholders $0.01 per share or one new share for every 100 BBBY shares held, all that information of record regarding the cancellations would need to come out to facilitate such a transaction. </p>\n\n<p>The most logical counterpoint to this being a possibility is that how could it be the first time this is happening given the long history of manipulative market practices and cellar-boxed stocks? I don&#39;t know, but I still wanted to throw it out there because maybe there isn&#39;t any other way for anyone outside &quot;the club&quot; to see this kind of information without taking it on the financial chin. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/49DpXBz4r4oRDEUi1iwvQH5UHfsYOESGPREKhIyj5HA.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/17ab7i3/check_it_out_more_weird_numbers_first_time_ive/", "time": 1697583128.0, "subreddit": "r/ThePPShow", "title": "Check it Out - More Weird Numbers!: First Time I've Seen a Public Site Showing 861,376,836 Shares (0HMI)", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/WgKjSo8DnIvpnA4uHlEgFQxlQRdaYKrDTXD6ZnFG5oU.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/gallery/16vnfv7", "time": 1696021783.0, "subreddit": "r/ThePPShow", "title": "A Foretold Prophecy or Just Another Cohencidence?", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/gnLik2XjcCUcb88HlUSwrfQyVBNGrKOfm5IvsJHBqGQ.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/16pd4ht/still_in_like_flynn/", "time": 1695396155.0, "subreddit": "r/ThePPShow", "title": "Still in Like Flynn", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just wanted to make a quick post to let everyone know why the share counts stopped abruptly and never resumed. About four weeks ago, I flew out of state to help my mom move and get her old house on the market. She&#39;s a tough old bird at 69 but obviously needs help and I didn&#39;t want her paying ridiculous amounts of money for packers, movers, and repairmen when I could get out there and help. </p>\n\n<p>Got home about two weeks ago but, since my own lease was up and our landlord jacked-up our rent by almost 40%, we needed to get a new place STAT. We were able to find a new place and are nearly finished moving in. However, after returning home, we got some pretty bad news that my girlfriend of 12 years has HER2+ breast cancer that may have spread to her lymph nodes and liver. She&#39;&#39;s only 39 years-old and is incredible healthy and fit - doesn&#39;t make any sense to me at all and I&#39;m still in shock. </p>\n\n<p>The last two weeks have been jam-packed with MRIs, PET scans, CT scans, biopsies, etc. She starts chemotherapy next week - suppose to last about 4-5 months. Next comes radiation, then bilateral surgery, followed by antibody treatments, and ongoing tests to achieve remission. We find out before chemo if it&#39;s hit her liver, which would put her at Stage IV and reduce her chances considerably. </p>\n\n<p>I miss the share counts and ongoing engagement with the PP Show and BBBY sub, and was glad to hear from so many people asking why the share counts stopped and if I jumped ship. Still here and holding strong. Life is a trip - hug and kiss your significant others, kids, and parents. Please keep Mrs. ShitCrick in your thoughts and love to all.  </p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/166cndi/correspondence_update_no_reversion_as_of_yet_sent/", "time": 1693492028.0, "subreddit": "r/ThePPShow", "title": "Correspondence Update: No Reversion As of Yet - Sent Third Request for Information", "text": "<!-- SC_OFF --><div class=\"md\"><p>Annoyed I made a couple of mistakes in this email and used certain words too frequently but, with time winding down, it will have to do. Previous email correspondence <a href=\"https://www.reddit.com/r/BBBY/comments/15zv8fi/correspondence_update_received_a_reply_from_r/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">here</a>. </p>\n\n<p><a href=\"https://preview.redd.it/ofm3tv86hglb1.png?width=803&amp;format=png&amp;auto=webp&amp;s=022fa4e04afcbd567fb9c624c45f3372ef590f09\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ofm3tv86hglb1.png?width=803&amp;format=png&amp;auto=webp&amp;s=022fa4e04afcbd567fb9c624c45f3372ef590f09\" alt=\"https://preview.redd.it/ofm3tv86hglb1.png?width=803&amp;format=png&amp;auto=webp&amp;s=022fa4e04afcbd567fb9c624c45f3372ef590f09\"></a></p>\n\n<p><a href=\"https://preview.redd.it/2c31sdg5hglb1.png?width=796&amp;format=png&amp;auto=webp&amp;s=3e6f3d06ad4d5d87189704e9900409e16c4ccb8f\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/2c31sdg5hglb1.png?width=796&amp;format=png&amp;auto=webp&amp;s=3e6f3d06ad4d5d87189704e9900409e16c4ccb8f\" alt=\"https://preview.redd.it/2c31sdg5hglb1.png?width=796&amp;format=png&amp;auto=webp&amp;s=3e6f3d06ad4d5d87189704e9900409e16c4ccb8f\"></a></p>\n\n<p>Also, thank you very much to everyone who&#39;s posted updated share counts and shared screenshots to verify their positions. I have at least 20-30 DMs, emails, and comments regarding position verifications and plan to have a new share count update out no later than tomorrow evening. I apologize for not having them out as often but other responsibilities have been relentless lately. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/dkckiAdJA_js1KGi4WcmrfOyHLKstcy534LSk7ouiPU.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/161f6po/share_count_update_103950202_shares_1924/", "time": 1693007125.0, "subreddit": "r/ThePPShow", "title": "Share Count Update: 103,950,202 Shares | 1,924 Shareholders | 46,583 Options Contracts | 108,608,502 Total Potential Shares | 46,479,052 Shares Verified", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/849xwysreckb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=493db01034c49afd30201782111ba1c1f491ff57\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/849xwysreckb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=493db01034c49afd30201782111ba1c1f491ff57\" alt=\"https://preview.redd.it/849xwysreckb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=493db01034c49afd30201782111ba1c1f491ff57\"></a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/pl6q3ekseckb1.png?width=876&amp;format=png&amp;auto=webp&amp;s=4254db6428b8dd9f69af9427bef4b50b73a671a6\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/pl6q3ekseckb1.png?width=876&amp;format=png&amp;auto=webp&amp;s=4254db6428b8dd9f69af9427bef4b50b73a671a6\" alt=\"https://preview.redd.it/pl6q3ekseckb1.png?width=876&amp;format=png&amp;auto=webp&amp;s=4254db6428b8dd9f69af9427bef4b50b73a671a6\"></a></p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Shareholder Level</th>\n<th align=\"left\">Shareholder Count</th>\n<th align=\"left\">Shares Held</th>\n<th align=\"left\">Shares Verified</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">x,xxx,xxx</td>\n<td align=\"left\">18</td>\n<td align=\"left\">30,208,814</td>\n<td align=\"left\">26,942,807</td>\n</tr>\n<tr>\n<td align=\"left\">xxx,xxx</td>\n<td align=\"left\">192</td>\n<td align=\"left\">41,358,480</td>\n<td align=\"left\">16,824,216</td>\n</tr>\n<tr>\n<td align=\"left\">xx,xxx</td>\n<td align=\"left\">955</td>\n<td align=\"left\">29,565,171</td>\n<td align=\"left\">2,662,122</td>\n</tr>\n<tr>\n<td align=\"left\">x,xxx</td>\n<td align=\"left\">640</td>\n<td align=\"left\">2,768,012</td>\n<td align=\"left\">49,382</td>\n</tr>\n<tr>\n<td align=\"left\">xxx</td>\n<td align=\"left\">99</td>\n<td align=\"left\">49,288</td>\n<td align=\"left\">525</td>\n</tr>\n<tr>\n<td align=\"left\">xx</td>\n<td align=\"left\">10</td>\n<td align=\"left\">433</td>\n<td align=\"left\">0</td>\n</tr>\n<tr>\n<td align=\"left\">x</td>\n<td align=\"left\">1</td>\n<td align=\"left\">4</td>\n<td align=\"left\">0</td>\n</tr>\n<tr>\n<td align=\"left\">Options Only</td>\n<td align=\"left\">9</td>\n<td align=\"left\">0</td>\n<td align=\"left\">8,652 (Verified Options Contracts)</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">1,924</td>\n<td align=\"left\">103,950,202</td>\n<td align=\"left\">46,479,052</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p><strong>NEW: Verified Shares Column</strong></p>\n\n<p>Moving forward, I&#39;ll include a column tracking the percentage of reported shares verified per shareholder level. There are three ways reported shares qualify as reported:</p>\n\n<ul>\n<li>Initial or subsequent position reports via posts with screenshots verifying the position. </li>\n<li>Initial or subsequent position reports via comments with screenshots verifying the position.</li>\n<li>Direct messages or emails sent to me via chat with screenshots verifying the position. </li>\n</ul>\n\n<p>Note that some individuals participating in the share count updates maintain positions across multiple positions, some as many as eight. I am flagging positions as verified if someone provides proof substantiating at least half their position size. Why? Because there is a trade-off - make positions verifications too much of a pain in the ass and participating will suffer, whereas setting the verification bar too low will all doubt to creep in regarding the integrity of the share counts. The thought process is that, if someone is willing to go through the trouble of verifying the majority of their position <em>and</em> their post and comment history isn&#39;t suspect, there is little reason to doubt the unverified portion of their position is made-up. </p>\n\n<p>It is also very important that everyone knows the ~58M shares that haven&#39;t been verified yet are not unverified because of any holders&#39; unwillingness to verify but, rather, I simply haven&#39;t reached out to request verification. Moreover, and this is on me, there are a lot of people (hundreds) who did post screenshots verifying their positions early on but I simply was not set up to delineate verified and DRS&#39;d shares at the time. My apologies for that; shoulda, woulda, coulda. Moving forward and as a call to action, this is an open invite for all shareholders with positions at or below the xxx,xxx level to direct message me with verifications of their positions if willing. </p>\n\n<p>I only have two x,xxx,xxx shareholders I haven&#39;t verified yet, both of which probably verified at some point and I either missed it or they subsequently deleted it before I began distinguishing verified vs unverified shares. I&#39;m in the process of reaching out to these two individuals directly for verification. Since nearly half of the xxx,xxx shareholders are verified, please reach out with a direct message via chat to confirm you&#39;re verified if you&#39;re unsure whether you are or include in the message a screenshot to verify. </p>\n\n<p>Last thing, please understand that I&#39;m respectfully asking people to verify, not telling anyone what to do. Your shares are your business, period. However, I also want to strive for as much trustworthiness and accuracy as possible across the share count updates, hence the request. Thank you to all who verify proactively and to those willing to verify moving forward. </p>\n\n<p>As always, whether you&#39;re already on the share tracker and want to update your count or report a new position, please reply to this post with the total number of shares you hold. This tracker started on May 4th. If you weighed-in with your share count at some point before this date, your shares are not included. Anyone who wants to participate but do so privately, or if your comments aren&#39;t going through because you don&#39;t have enough karma, you can message me directly anytime via chat in Reddit.</p>\n\n<p>Additionally, between share count updates, you can share an update to your position any time by responding to any post or comment from me, no matter what the context or how old the post. And all types of updates are encouraged, including position decreases, to help keep the counts as accurate as possible.</p>\n\n<p>In case there are shareholders among us who want to participate but do so without any connection to Reddit, you can also email me at [<a href=\"mailto:paddlingupshitcreek@gmail.com\">paddlingupshitcreek@gmail.com</a>](mailto:<a href=\"mailto:paddlingupshitcreek@gmail.com\">paddlingupshitcreek@gmail.com</a>).</p>\n\n<p>P.S. I am flying out of town to help my mom move for the next two weeks, then return home to move my own fam. Fucking landlord increased our rent by 53% when our lease expired month before last, so we&#39;re on the hunt for a new place. As such, I may be slow to respond, so please don&#39;t interpret that as me ignoring anyone&#39;s efforts to participate or verify; just slammed is all. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/088z2ltgzyPe25fgC_GvEd2jqKU34-1Z_NSy7pEXEGc.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://i.redd.it/fn31k02ic6kb1.jpg", "time": 1692933508.0, "subreddit": "r/ThePPShow", "title": "Rachel's Probably Putting the Finishing Touches on that Email Right Now...Lol", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/fn31k02ic6kb1.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/15zv7nm/correspondence_update_received_a_reply_from_r/", "time": 1692863690, "subreddit": "r/ThePPShow", "title": "Correspondence Update: Received a Reply from R. Golden @ K&amp;E Regarding My Request for the CURRENT Number of Shareholders and Shares of Common Stock Outstanding to Be Made Public", "text": "&#x200B;\n\n**I sent the following email to Rachel Golden at Kirkland and Ellis on August 9th:**\n\n&#x200B;\n\nhttps://preview.redd.it/o5jtm5oyozjb1.png?width=633&format=png&auto=webp&s=f3da8e82ef17a57dfdf12a06f4706bc044caae61\n\n**I waited two weeks and sent a follow up email today (August 23), to Rachel Golden, and copied several additional parties:**\n\n&#x200B;\n\nhttps://preview.redd.it/43bd67rpqzjb1.png?width=1002&format=png&auto=webp&s=a7a5004acd8750c7ff8374114bafb663e0a10a8e\n\n**I received a response from Rachel Golden within a couple of hours acknowledging receipt and, what appears to be, her looping-in the appropriate parties.**\n\n&#x200B;\n\nhttps://preview.redd.it/h1a6yzh7szjb1.png?width=1102&format=png&auto=webp&s=56d2a8ab17dd95cb214c3664f3ab71a3f2e1ddb5\n\nI will follow-up as soon as I receive an update, regardless of whether or not it is helpful or meaningful. In the initial version of this post, I wrote for another 3 hours regarding how this inquiry is important, what the implications are, and why the information matters at this stage in the Chap 11 BK proceedings. However, instead of creating a gigantic post and in hopes of receiving a response from R. Golden sooner rather than later, I opt to hold off for 1-2 days in case we receive some new information.  \n\n&#x200B;\n\nCheers!", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/mBlF2YTCWzfQXI5o1KeLbalUHxvr-FVSjPABNIVzp6g.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/15yncvu/disturbance_in_the_force/", "time": 1692749338.0, "subreddit": "r/ThePPShow", "title": "Disturbance in the Force", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/15yadpj/quick_reminder_to_anyone_interested_in_doing_bbby/", "time": 1692720948.0, "subreddit": "r/ThePPShow", "title": "Quick Reminder to Anyone Interested in Doing BBBY BK Research: All Docket Items are Downloaded and Available Via the G-Drive Shared Folder Linked in this Post", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/15xxyby/one_hundred_million_shares_100011435_shares_1838/", "time": 1692688220.0, "subreddit": "r/ThePPShow", "title": "ONE HUNDRED MILLION SHARES: 100,011,435 Shares | 1,838 Shareholders | 41,684 Options Contracts | 104,179,835 Total Potential Shares. ONE HUNDRED MILLION FUCKING SHARES", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://i.redd.it/s0dx447s2mjb1.gif\">https://i.redd.it/s0dx447s2mjb1.gif</a></p>\n\n<p>100% of X,XXX,XXX shareholders are verified. 40% of xxx,xxx shareholders are verified. The remaining 60% of xxx,xxx are working with me to verify. Many of these individuals verified proactively in the first place, but I didn&#39;t take the necessary steps to track verification after starting the tracker, so now I have to inconvenience these folks to verify again - AND THAT&#39;S ON ME. </p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Shareholder Level</th>\n<th align=\"left\">Shareholder Count</th>\n<th align=\"left\">Shares Held</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">x,xxx,xxx</td>\n<td align=\"left\">16</td>\n<td align=\"left\">29,948,814</td>\n</tr>\n<tr>\n<td align=\"left\">xxx,xxx</td>\n<td align=\"left\">183</td>\n<td align=\"left\">39,375,198</td>\n</tr>\n<tr>\n<td align=\"left\">xx,xxx</td>\n<td align=\"left\">907</td>\n<td align=\"left\">28,009,102</td>\n</tr>\n<tr>\n<td align=\"left\">x,xxx</td>\n<td align=\"left\">618</td>\n<td align=\"left\">2,629,801</td>\n</tr>\n<tr>\n<td align=\"left\">xxx</td>\n<td align=\"left\">96</td>\n<td align=\"left\">48,083</td>\n</tr>\n<tr>\n<td align=\"left\">xx</td>\n<td align=\"left\">10</td>\n<td align=\"left\">433</td>\n</tr>\n<tr>\n<td align=\"left\">x</td>\n<td align=\"left\">1</td>\n<td align=\"left\">4</td>\n</tr>\n<tr>\n<td align=\"left\">Options Only</td>\n<td align=\"left\">7</td>\n<td align=\"left\">0</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">1,838</td>\n<td align=\"left\">100,011,435</td>\n</tr>\n</tbody></table>\n\n<p><strong>The single most important power of individuals assembled</strong> <strong><em>against</em></strong> <strong>a common enemy is the degree to which they&#39;re able to harness their collective frustrations in a meaningful way toward an appropriate</strong> <strong><em>target</em></strong><strong>.</strong></p>\n\n<p><strong>The single most important power of individuals united</strong> <strong><em>for</em></strong> <strong>a common ally is the degree to which they&#39;re able to channel their collective interests in a meaningful way toward an appropriate</strong> <strong><em>outlet</em></strong><strong>.</strong> </p>\n\n<p>On behalf of all $BBBY/$BBBYQ shareholders worldwide, as well as those of you who can&#39;t hold shares but share our sentiment, respect to all who hold for better outcomes for themselves, their families, their communities, and their countries:</p>\n\n<p>Afghan, Albanian, Algerian, American (United States), Andorran, Angolan, Antiguan, Argentine, Armenian, Australian, Austrian, Azerbaijani, Bahamian, Bahraini, Bangladeshi, Barbadian, Belarusian, Belgian, Belizean, Beninese, Bhutanese, Bolivian, Bosnian, Botswanan, Brazilian, British, Bruneian, Bulgarian, Burkinabé (Burkina Faso), Burundian, Cambodian, Cameroonian, Canadian, Cape Verdean, Central African, Chadian, Chilean, Chinese, Colombian, Comorian, Congolese (Democratic Republic of the Congo), Congolese (Republic of the Congo), Costa Rican, Croatian, Cuban, Cypriot, Czech, Danish, Djiboutian, Dominican (Dominica), Dominican (Dominican Republic), Dutch, East Timorese, Ecuadorian, Egyptian, Emirati (United Arab Emirates), Equatorial Guinean, Eritrean, Estonian, Eswatini (Swazi), Ethiopian, Fijian, Filipino, Finnish, French, Gabonese, Gambian, Georgian, German, Ghanaian, Greek, Grenadian, Guatemalan, Guinean, Guinea-Bissauan, Guyanese, Haitian, Honduran, Hungarian, Icelandic, Indian, Indonesian, Iranian, Iraqi, Irish, Israeli, Italian, Ivorian (Côte d&#39;Ivoire), Jamaican, Japanese, Jordanian, Kazakh, Kenyan, Kittitian or Nevisian (Saint Kitts and Nevis), Kuwaiti, Kyrgyz, Laotian, Latvian, Lebanese, Lesotho, Liberian, Libyan, Liechtenstein, Lithuanian, Luxembourgish, Macedonian, Malagasy (Madagascar), Malawian, Malaysian, Maldivian, Malian, Maltese, Marshallese, Mauritanian, Mauritian, Mexican, Micronesian, Moldovan, Monegasque (Monaco), Mongolian, Montenegrin, Moroccan, Mozambican, Myanmar (Burmese), Namibian, Nauruan, Nepali, New Zealander, Nicaraguan, Nigerian, Nigerien, North Korean, Norwegian, Omani, Pakistani, Palauan, Palestinian, Panamanian, Papua New Guinean, Paraguayan, Peruvian, Polish, Portuguese, Qatari, Romanian, Russian, Rwandan, Saint Lucian, Samoan, San Marinese (San Marino), Sao Tomean, Saudi Arabian, Senegalese, Serbian, Seychellois, Sierra Leonean, Singaporean, Slovak, Slovenian, Solomon Islander, Somali, South African, South Korean, South Sudanese, Spanish, Sri Lankan, Sudanese, Surinamese, Swedish, Swiss, Syrian, Taiwanese, Tajik, Tanzanian, Thai, Togolese, Tongan, Trinidadian or Tobagonian, Tunisian, Turkish, Turkmen, Tuvaluan, Ugandan, Ukrainian, Uruguayan, Uzbek, Vanuatuan, Venezuelan, Vietnamese, Vincentian (Saint Vincent and the Grenadines), Yemeni, Zambian, Zimbabwean. </p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/wepKUEt1eOOfIWtuQg50u7Rcpa1gdfy_4tEPjXmbfbI.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/15uo5nz/dailyish_share_count_update_95526150_shares_1891/", "time": 1692373652.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 95,526,150 Shares | 1,891 Shareholders | 41,701 Options Contracts | 99,696,250 Total Potential Shares", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://i.redd.it/82f45wg03wib1.gif\">https://i.redd.it/82f45wg03wib1.gif</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9gbk1z713wib1.png?width=940&amp;format=png&amp;auto=webp&amp;s=2b21bad8d7a7e4b5a03874dffab13ebd45ec7d26\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/9gbk1z713wib1.png?width=940&amp;format=png&amp;auto=webp&amp;s=2b21bad8d7a7e4b5a03874dffab13ebd45ec7d26\" alt=\"https://preview.redd.it/9gbk1z713wib1.png?width=940&amp;format=png&amp;auto=webp&amp;s=2b21bad8d7a7e4b5a03874dffab13ebd45ec7d26\"></a></p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Shareholder Level</th>\n<th align=\"left\">Shareholder Count</th>\n<th align=\"left\">Shares Held</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">x,xxx,xxx</td>\n<td align=\"left\">14</td>\n<td align=\"left\">27,322,825</td>\n</tr>\n<tr>\n<td align=\"left\">xxx,xxx</td>\n<td align=\"left\">176</td>\n<td align=\"left\">38,505,061</td>\n</tr>\n<tr>\n<td align=\"left\">xx,xxx</td>\n<td align=\"left\">883</td>\n<td align=\"left\">27,098,249</td>\n</tr>\n<tr>\n<td align=\"left\">x,xxx</td>\n<td align=\"left\">600</td>\n<td align=\"left\">2,552,778</td>\n</tr>\n<tr>\n<td align=\"left\">xxx</td>\n<td align=\"left\">93</td>\n<td align=\"left\">46,800</td>\n</tr>\n<tr>\n<td align=\"left\">xx</td>\n<td align=\"left\">10</td>\n<td align=\"left\">433</td>\n</tr>\n<tr>\n<td align=\"left\">x</td>\n<td align=\"left\">1</td>\n<td align=\"left\">4</td>\n</tr>\n<tr>\n<td align=\"left\">Options Only</td>\n<td align=\"left\">7</td>\n<td align=\"left\">0</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>As always, whether you&#39;re already on the share tracker and want to update your count or report a new position, please reply to this post with the total number of shares you hold. This tracker started on May 4th. If you weighed-in with your share count at some point before this date, your shares are not included. Anyone who wants to participate but do so privately, or if your comments aren&#39;t going through because you don&#39;t have enough karma, you can message me directly anytime via chat in Reddit.</p>\n\n<p>Additionally, between share count updates, you can share an update to your position any time by responding to any post or comment from me, no matter what the context or how old the post. And all types of updates are encouraged, including position decreases, to help keep the counts as accurate as possible.</p>\n\n<p>In case there are shareholders among us who want to participate but do so without any connection to Reddit, you can also email me at [<a href=\"mailto:paddlingupshitcreek@gmail.com\">paddlingupshitcreek@gmail.com</a>](mailto:<a href=\"mailto:paddlingupshitcreek@gmail.com\">paddlingupshitcreek@gmail.com</a>).</p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/2luFu9PT055lxXLiZ_r1FixO9Z3HmQ9OFDXusRLximM.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/15tszue/weve_got_movement_docket_1904/", "time": 1692293136.0, "subreddit": "r/ThePPShow", "title": "We've Got Movement: Docket 1904", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/15rcjvp/nol_pron_sharing_access_to_the_best_of_the_best/", "time": 1692062093.0, "subreddit": "r/ThePPShow", "title": "NOL Pron: Sharing Access to the Best of the Best of My NOL Discussions with A.I. &amp; A Shared Folder with 22 PDFs on Chapter 11 BK, M&amp;A, NOL, and Distressed Takeover Strategies", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/15lxdoh/updated_share_count_data_and_compelling_analysis/", "time": 1691538474.0, "subreddit": "r/ThePPShow", "title": "Updated Share Count Data and Compelling Analysis Regarding the Likelihood the Float is Locked or Oversold", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/15efyvh/dailyish_share_count_update_86555833_shares_1651/", "time": 1690809529.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 86,555,833 Shares | 1,651 Shareholders | 41,791 Options Contracts | 90,734,933 Total Potential Shares", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/15d75xn/trying_to_dig_but_short_on_time_brandon_meadows/", "time": 1690703643.0, "subreddit": "r/ThePPShow", "title": "Trying to Dig but Short On Time: Brandon Meadows, Jason Coggins, &amp; Sixth Street", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/159sv6b/highlighted_version_of_wachtell_et_als_2022_white/", "time": 1690338265.0, "subreddit": "r/ThePPShow", "title": "Highlighted Version of Wachtell et al.'s (2022) White Paper on Distressed Investing, Mergers, &amp; Acquisitions: An Overview of the Legal Landscape for Acquirers and Investors", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "https://v.redd.it/vltdevckc5db1", "time": 1689870594.0, "subreddit": "r/ThePPShow", "title": "All This Waiting Really Grinds My Gears", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/-DpOqFSeNo4Dpvc4TuRJbFJ_q32w95ZWqbmPMfzcpp8.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/1548ggf/dailyish_share_count_update_84022167_shares_1615/", "time": 1689805167.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 84,022,167 Shares | 1,615 Shareholders | 37,744 Options Contracts | 87,796,567 Total Potential Shares", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/150t8b7/dailyish_share_count_update_81385593_shares_1583/", "time": 1689523849.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 81,385,593 Shares | 1,583 Shareholders | 37,707 Options Contracts | 85,156,293 Total Potential Shares", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/150uwh3/og_fucking_diamond_hands_3200_shares_and_a_claim/", "time": 1689476560.0, "subreddit": "r/ThePPShow", "title": "OG Fucking Diamond Hands: 3,200 Shares and a Claim for Almost 100k", "text": "<!-- SC_OFF --><div class=\"md\"><p>We gotta get this guy on the show! These are screenshots from an investor who filed a claim for nearly $100,000 for unrealized losses on his BBBY shares. I hear all the time from humble apes who only hold a couple thousand shares in regard to the share count updates. To all those apes, this OG BBBY investor&#39;s cost basis per share is in the mid-$30s, across approximately 3,200 shares. </p>\n\n<p><a href=\"https://preview.redd.it/ydrq3sylq8cb1.png?width=686&amp;format=png&amp;auto=webp&amp;s=bb8ea5b0dae86d2a023a9339cd54c66047d58581\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ydrq3sylq8cb1.png?width=686&amp;format=png&amp;auto=webp&amp;s=bb8ea5b0dae86d2a023a9339cd54c66047d58581\" alt=\"https://preview.redd.it/ydrq3sylq8cb1.png?width=686&amp;format=png&amp;auto=webp&amp;s=bb8ea5b0dae86d2a023a9339cd54c66047d58581\"></a></p>\n\n<p><a href=\"https://preview.redd.it/lpcxnqhtq8cb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=9cd2d5c8cd489262112fdb75b0ee5110eca0fcd1\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/lpcxnqhtq8cb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=9cd2d5c8cd489262112fdb75b0ee5110eca0fcd1\" alt=\"https://preview.redd.it/lpcxnqhtq8cb1.png?width=640&amp;format=png&amp;auto=webp&amp;s=9cd2d5c8cd489262112fdb75b0ee5110eca0fcd1\"></a></p>\n\n<p><a href=\"https://preview.redd.it/9e41mdbkr8cb1.png?width=477&amp;format=png&amp;auto=webp&amp;s=33396cbeb0a1e9a08752adec1862e50df3af4bd0\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/9e41mdbkr8cb1.png?width=477&amp;format=png&amp;auto=webp&amp;s=33396cbeb0a1e9a08752adec1862e50df3af4bd0\" alt=\"https://preview.redd.it/9e41mdbkr8cb1.png?width=477&amp;format=png&amp;auto=webp&amp;s=33396cbeb0a1e9a08752adec1862e50df3af4bd0\"></a></p>\n\n<p>When BBBY exits Chap 11 with a feasible plan, makes good on that plan, and this thing squeezes, apes holding 3,200 shares for $0.30 each will make 100k if the share price hits $31.25. Now I know there are hundreds of million more shares in circulation today than there were back then, but the compression factor of the float being oversold, over-shorted, and rehypothecated will turn BBBY into a Deepwater Horizon event. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://i.redd.it/iuasir95t8cb1.gif\">https://i.redd.it/iuasir95t8cb1.gif</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ABhu-6JBqeNkhyIRgHi0ep30e5LgJau1cjL8Db87tzo.jpg\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/14wx0xx/dailyish_share_count_update_78323170_shares_1555/", "time": 1689095078.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 78,323,170 Shares | 1,555 Shareholders | 37,707 Options Contracts | 82,093,870 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/14v2hoz/dailyish_share_count_update_71856529_shares_1487/", "time": 1688919281.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 71,856,529 Shares | 1,487 Shareholders | 37,742 Options Contracts | 75,630,729 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/14rhhzl/dailyish_share_count_update_69663675_shares_1452/", "time": 1688578385.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 69,663,675 Shares | 1,452 Shareholders | 37,600 Options Contracts | 73,423,675 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/14lr4nd/dailyish_share_count_update_65539116_shares_1357/", "time": 1688001614.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 65,539,116 Shares | 1,357 Shareholders | 37,369 Options Contracts | 69,276,016 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/14jtif3/bbby_master_folder_of_kroll_docket_items_quick/", "time": 1687814122.0, "subreddit": "r/ThePPShow", "title": "BBBY Master Folder of Kroll Docket Items, Quick Links Files, and BBBY Historical Data", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/14h1ddx/dailyish_share_count_update_63503527_shares_1329/", "time": 1687533806.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 63,503,527 Shares | 1,329 Shareholders | 37,034 Options Contracts | 67,206,927 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/14ei3y5/dailyish_share_count_update_60016978_shares_1305/", "time": 1687288105.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 60,016,978 Shares | 1,305 Shareholders | 3,042 Options Contracts | 63,821,178 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/149uvks/dailyish_share_count_update_57465608_shares_1271/", "time": 1686812044.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 57,465,608 Shares | 1,271 Shareholders | 36,000 Options Contracts | 61,065,608 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/147n77z/dailyish_share_count_update_54550559_shares_1227/", "time": 1686573935.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 54,550,559 Shares | 1,227 Shareholders | 35,475 Options Contracts | 58,319,159 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/145co8f/dailyish_share_count_update_50848230_shares_1166/", "time": 1686341063.0, "subreddit": "r/ThePPShow", "title": "Dailyish Share Count Update: 50,848,230 Shares | 1,166 Shareholders | 34,907 Options Contracts | 54,338,930 Total Potential Shares | 110,000 2024 Bonds | 100,000 2034 Bonds | 100,000 2044 Bonds", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "https://i.redd.it/mr9w92qbo94b1.png", "time": 1686000514.0, "subreddit": "r/ThePPShow", "title": "Potential Investors Be Like: Do I Have to Take Them Both or Can I Just Buy the One on the Right?", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/mr9w92qbo94b1.png\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://i.redd.it/2asqxkolfrya1.png", "time": 1683618223.0, "subreddit": "r/ThePPShow", "title": "This is a Test from the PaddlingUpShitCreek Emergency Broadcast System to Better Gauge Which BBBY Subs Can Tolerate Dark Humor - Annoyed I Got Boo'd Out of BBBY Earlier Today For This Gem", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2asqxkolfrya1.png\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "/r/BBBY/comments/1382u3f/daily_share_count_update_16611609_shares_597/", "time": 1683241696.0, "subreddit": "r/ThePPShow", "title": "Daily Share Count Update: 16,611,609 Shares | 597 Shareholders | 17,255 Options Contracts | 18,337,109 Total Potential Shares | 10,000 Bonds (2024)", "text": null, "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/1369co4/need_input_for_updated_share_count_heading_into/", "time": 1683085142.0, "subreddit": "r/ThePPShow", "title": "Need Input for Updated Share Count Heading Into OTC", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><em>Processing img o4hhzuk3wkxa1...</em></p>\n\n<p><a href=\"https://www.reddit.com/r/BBBY/comments/13665zv/whos_still_in_the_fight_and_if_youre_comfortable/\">https://www.reddit.com/r/BBBY/comments/13665zv/whos_still_in_the_fight_and_if_youre_comfortable/</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PaddlingUpShitCreek", "url": "https://www.reddit.com/r/ThePPShow/comments/12wyv0m/havent_been_on_the_show_but_sometimes_feel_like_i/", "time": 1682301467.0, "subreddit": "r/ThePPShow", "title": "Haven't Been on the Show, But Sometimes Feel Like I Belong There....", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7ea9cekcoqva1.png?width=781&amp;format=png&amp;auto=webp&amp;s=952ce837cdacd2397086aece86b8585802db2c6d\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/7ea9cekcoqva1.png?width=781&amp;format=png&amp;auto=webp&amp;s=952ce837cdacd2397086aece86b8585802db2c6d\" alt=\"https://preview.redd.it/7ea9cekcoqva1.png?width=781&amp;format=png&amp;auto=webp&amp;s=952ce837cdacd2397086aece86b8585802db2c6d\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Paddling Whale 🐋 ", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/yNJ0XAYz8svDwczjpFwD09YESNNtwd-IlX5R7WSMOZ8.jpg\"/></div>"}]