[{"username": "pdubs716", "url": "https://i.redd.it/ijtq82cvek0c1.jpg", "time": 1700077374.0, "subreddit": "r/ThePPShow", "title": "Pitching shills?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ijtq82cvek0c1.jpg\"/></div>"},
{"username": "pdubs716", "url": "https://i.redd.it/zl89l7hp5yyb1.jpg", "time": 1699372089.0, "subreddit": "r/ThePPShow", "title": "AH today?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/zl89l7hp5yyb1.jpg\"/></div>"},
{"username": "pdubs716", "url": "https://www.reddit.com/r/ThePPShow/comments/16q3y2t/new_tokenized_shares/", "time": 1695474025.0, "subreddit": "r/ThePPShow", "title": "New tokenized shares", "text": "<!-- SC_OFF --><div class=\"md\"><p>Been with GME since the sneeze and jumped into BBBY when RC bought in.  I also dable in crypto and rode LRC from .8-&gt;3.8-&gt;.1 (yeah fun times) as many hoped we&#39;d see tokenized dividends destroy naked shorts.\nIf that was considered we know that beautiful man and team would do their research and speak with those that went through the OSTKO issuance.  It was actually very surprising when I heard their involvement with the bk and IPO.  Was it their way of buying in?\nOne of the concerns discussed in the SSsub was distributing and providing access to the dividends to all rightful stockholders.\nThe GS wallet came (based on LRC) and is now leaving but the team at LRC have been improving it with regular updates making it cheaper and faster.\nWhy couldn&#39;t the updated plan include tokenized shares, NFTs or any blockchain based reward for holding a real share?  It&#39;s not a requirement for the bk exit plan and optional for anyone wanting to claim their piece.  Is there be a better way to start a true tokenized share market without the baddies crying?\nSeems like nothing to lose, unless your Mayoman and the condommint crew.\nOf course this assumes our White Knight is RC and an agreeable investment group.\nWhat fun that would be for me!</p>\n\n<p>NFA because you probably can&#39;t buy or sell anyways.</p>\n\n<p>Btw bacon grease covered tinfoil tastes the best.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "pdubs716", "url": "https://i.redd.it/k9jdcxlbq9ob1.jpg", "time": 1694717868.0, "subreddit": "r/ThePPShow", "title": "Hello sexy", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/k9jdcxlbq9ob1.jpg\"/></div>"}]