[{"username": "PersuitOfHappinesss", "url": "https://www.reddit.com/r/ThePPShow/comments/17p6nxt/jat_ceo_resignation_and_marcus_lemonis/", "time": 1699288258.0, "subreddit": "r/ThePPShow", "title": "JAT, CEO Resignation and Marcus Lemonis", "text": "<!-- SC_OFF --><div class=\"md\"><p>Good morning fellow investors, as a long time lurker I wanted to contribute something to this subreddit which has given us a lot of good DD, as well as has helped me become a more informed investor. As always do your own dd this isn’t financial advise. </p>\n\n<p>Okay so we know a couple days ago (on November 2) JAT wrote a public letter to then Overstock recommending the removal of then CEO Jonathan E. Johnson. JAT being a hedge fun which has a 9.6% stake in Overstock. JAT wrote:</p>\n\n<p>“The current CEO needs to be removed immediately […] He has performed poorly (as demonstrated by the company’s financials relative to its peer group), he has communicated poorly with investors and the sell-side community and he has recently taken actions that give the appearance that his own interests are being prioritized.”</p>\n\n<p>JAT didn’t stop there, and also recommended for a certain board member by the name of Marcus Lemonis to become CEO. Lemonis had joined the Overstock board just last month:</p>\n\n<p>JAT wrote:</p>\n\n<p>“Marcus Lemonis is clearly the most qualified person available to manage the business,”</p>\n\n<p>All good and dandy, so far. </p>\n\n<p>Yet today we get news of Johnathan E Johnson resigning as CEO, as per JAT’s recommendation? AND Marcus Lemonis popping up on Pulte’s X thread asking Pulte for permission to come up to his NYC meetup celebration. </p>\n\n<p>Curious no? 🤔🤔🤔 🦋 🧸</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]