[{"username": "Pete_The_Pilot", "url": "https://www.reddit.com/r/ThePPShow/comments/13na1rl/its_a_meme_stock_anything_can_happen/", "time": 1684619054.0, "subreddit": "r/ThePPShow", "title": "It's a \"MEME STOCK\" , anything can happen.", "text": "<!-- SC_OFF --><div class=\"md\"><p>This post will broadly address the &quot;MEME STOCKS&quot; as a phenomenon in the market. We touched on this on last night&#39;s show in the discussion with Travis, and I think it&#39;s an important topic.</p>\n\n<p>I have spoken about this at length on the show, and now I&#39;m writing this post in order to discuss events surrounding the &quot;meme stocks&quot; with special regard to the Big Three while mentioning other heavily shorted and potentially illegally manipulated tickers.</p>\n\n<p>I am posting this here because <a href=\"https://www.reddit.com/u/ppseeds/\">u/ppseeds</a> has created a space to address the issue frankly with investors who are generally apprised of the situation. The moderators of various subs related to these stocks often remove posts and comments related to others - which is frustrating, because they often trade in lockstep, and their CEOs and investors ostensibly share the same goal of pushing these criminal shorts out of their respective stocks.</p>\n\n<p>I recently talked about this with Gunjan Banerji, a reporter from the Wall Street Journal. In my discussion with Ms. Banerji, I spoke about what has transpired with the meme stocks since the blatant market manipulation and illegal naked shorting activity that took place during COVID, starting in March of 2020, and which came to light during the GME frenzy in January 2021. In my judgement, fallout from this activity continues to affect the market.</p>\n\n<p>There is a long list of affected tickers, and the commonalities that I have identified are: small floats, similar chart patterns, high short interest, high borrow rate, retail investor interest, heavy social media traffic, controversy/lawsuits, high dark pool volumes , significant off exchange trading, significant options activity, and high volatility. These tickers include:</p>\n\n<p>$GME $BBBY $AMC $APE</p>\n\n<p>$BB $KOSS $HYMC $GNS $MMAT/MMTLP etc.</p>\n\n<p>Obviously each case is unique, because each company is unique, and many different strategies have been employed at different times by these companies to weather the storm and stay alive in the face of pandemic and malicious activity by financiers.</p>\n\n<p>$GME has undeniably steered the best path through this crisis. It is backed by the most sophisticated investors and an army of unified household investors and the DRS movement. Their meteoric initial run and later dividend split, followed by a return to profitability on the balance sheet, has cemented the value of this stock in the eyes of investors.</p>\n\n<p>$AMC has charted its course in a different manner and has struggled to return to profitability in the wake of the pandemic, suffering net losses that have continued into the current quarter. Shareholders voted against dilution of the stock and this resulted in the creation of $APE. I have written at length about the $AMC saga and the <a href=\"https://www.reddit.com/user/Pete_The_Pilot/comments/12os1i7/the_apeamc_conversion_play/\">current state of the play</a>.</p>\n\n<p>$BBBY, after much controversy, <em>appears</em> to have succumbed to the market forces at play and now faces chapter 11 bankruptcy proceedings and restructuring or liquidation. But significant questions remain. What of activist investor Ryan Cohen&#39;s interest in the stock, letter to board, and purchase and subsequent sale of a large stake? What about CFO Gustavo Arnal&#39;s mysterious suicide? The questionable financing deal with Hudson Bay Capital? Why did CEO Sue Gove give an interview assuring investors of a turnaround weeks before the company filed for bankruptcy? Why is Bill Pulte, $GME whale investor, CNBC contributor, and Ryan Cohen Twitter orbiter now posting in <a href=\"https://www.reddit.com/r/BBBY/\">r/BBBY</a> and <a href=\"https://www.reddit.com/r/ThePPShow/\">r/ThePPShow</a>? How many shares of $BBBY were issued? (~740m). Is the stock oversold and does the potential for a Short Squeeze still exist?</p>\n\n<p>A stalwart corps of household investors wants answers to these questions, and has faced significant dilution as the company continued to issue shares to raise capital and stay afloat over the last several months; attempting to cut costs and slow their cash burn in order to allow a return to profitability.  The market for the stock did not allow enough of a runway for the board to execute that strategy.Now, the company&#39;s assets are up for auction, with Stalking Horse bids due at the end of the month. Within the coming weeks and months, we may learn the answers to these questions and perhaps others will be raised.</p>\n\n<p>It&#39;s a MEME STOCK, anything can happen</p>\n\n<p><strong>0 CommentsShareSavePromote</strong></p>\n</div><!-- SC_ON -->", "flair": {"text": "🤦‍♂️ IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Pete_The_Pilot", "url": "https://www.reddit.com/r/ThePPShow/comments/13gqhf6/iep_buybacks_and_dividend_declaration_carls_plan/", "time": 1684006266.0, "subreddit": "r/ThePPShow", "title": "IEP Buybacks and Dividend declaration - Carl's plan to squeeze out his shorts.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Pete_The_Pilot", "url": "https://www.reddit.com/r/ThePPShow/comments/13d3ksl/total_shares_outstanding_are_780m_proof_sources/", "time": 1683660932.0, "subreddit": "r/ThePPShow", "title": "Total Shares Outstanding are 780m+. Proof &amp; Sources inside.", "text": "<!-- SC_OFF --><div class=\"md\"><p>One last time for the slow people in the back.  <a href=\"/u/excitedbox\">u/excitedbox</a> and <a href=\"/u/edwinbarnes\">u/edwinbarnes</a> listen up and stop spreading garbage DD and misinformation.</p>\n\n<p><a href=\"https://www.investopedia.com/terms/o/outstandingshares.asp\">FROM INVESTOPEDIA</a> (I&#39;m starting with the basics because you guys don&#39;t even know what TSO even means).</p>\n\n<p>&quot;Shares outstanding refer to a company&#39;s stock currently held by all its shareholders, including share blocks held by institutional investors and restricted shares owned by the company’s officers and insiders.&quot;</p>\n\n<p>If you&#39;re too dumb or lazy to read the article, here&#39;s a TL;DR.</p>\n\n<p>TSO means total shares SOLD/ISSUED BY THE COMPANY TO THE MARKET; the Company has been paid for all shares considered outstanding.  </p>\n\n<p>It&#39;s that simple.  Stop trying to make it complicated.  </p>\n\n<p>The number is 781m+.  Period, fact, not up for discussion.  Here&#39;s proof.  If you disagree with this number, you are taking the stance that the company has lied or been mistaken in the court documents and SEC filings that it has submitted.</p>\n\n<p>SOURCES</p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5Nzg4MA==&amp;id2=-1\">5/5 Equity holders list showing 781,375,697 shares and 1,234,693 warrants outstanding</a> </p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NDAxOQ==&amp;id2=-1\">4/23 bankruptcy filing showing  739,056,836 shares outstanding </a> (p.11)</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/sec-filings/sec-filing/s-1/0001193125-23-097982\">4/11 S-1 showing 558m outstanding</a> (p.5)</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/sec-filings/sec-filing/def-14a/0001140361-23-016774\">4/5 DEFINITIVE 14-A showing  428,098,624 shares outstanding</a> as of 3/27, the the date of record for the vote that ended up not happening (p.2)</p>\n\n<p>WHY THIS IS IMPORTANT:</p>\n\n<p>TSO x SHARE PRICE = MARKET CAPITALIZATION</p>\n\n<p>$0.20/share x780,000,000 = $156m in market cap at this time.</p>\n\n<p>The objective of the chapter 11 proceedings is to determine NET ASSET VALUE of the company for the purpose of auctioning off those assets.  </p>\n\n<p>Thus, the market cap of BBBYQ during this time of scrutiny ought to reflect the company&#39;s assets minus its liabilities, because in bankruptcy proceedings debt holders get paid before equity holders.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Pete_The_Pilot", "url": "https://www.reddit.com/r/ThePPShow/comments/12nl44s/bbby_lawsuits_update/", "time": 1681597693.0, "subreddit": "r/ThePPShow", "title": "BBBY lawsuits update", "text": "<!-- SC_OFF --><div class=\"md\"><p>As I&#39;ve discussed before, there are two suits concerning RC ventures and BBBY.  These are:</p>\n\n<p>SI v. BED BATH &amp; BEYOND CORPORATION et al 1:22-cv-02541 in District Of Columbia District Court under Judge Trevor N Mcfadden</p>\n\n<p>and</p>\n\n<p>IN RE BED BATH &amp; BEYOND INC. SECTION 16(b) LITIGATION 1:22-cv-09327 in New York Southern District Court under Judge Paul G Gardephe</p>\n\n<p>Both dockets were updated this week.  </p>\n\n<p>On Wednesday April 12, 2023 SI v. BBBY et al saw a Memorandum in opposition to RC Ventures and BBBY&#39;s motion to dismiss the Second Amended Complaint for Violations of the Federal Securities Laws filed by BRATYA SPRL (one of the plaintiffs)</p>\n\n<p>on Monday 4/10, In RE BBBY 16(b) saw a MEMORANDUM OF LAW in by the plaintiff in Opposition to RC ventures and BBBY&#39;s MOTION to Dismiss.</p>\n\n<p>to suimmarize, We got plaintiffs opposition papers to RC and BBBY motions to dismiss in both suits this week so it’s progress.</p>\n\n<p>I believe that it is now with the judge(s) to decide how to rule on the motions.  I do not know how the suits interact or whether they are consolidated in any way but I suspect they are.</p>\n\n<p><a href=\"/u/ppseeds\">u/ppseeds</a> asked me to post an update and this is my understanding of the matters at hand.  I am not a lawyer.  if anyone is, please weigh in on what the next steps in the progression of the case may be.</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Pete_The_Pilot", "url": "https://www.reddit.com/r/ThePPShow/comments/11uz9dy/summary_and_discussion_of_yesterdays_press/", "time": 1330698502, "subreddit": "r/ThePPShow", "title": "summary and discussion of yesterday's press release and 14A filing", "text": "Summary and discussion of recent $BBBY press release and filing\n\n**FROM THE RESS RELEASE**\n\n“Bed Bath & Beyond Inc. (Nasdaq: BBBY) (the \"Company\") announced today that it plans to hold a special meeting of shareholders to seek approval to amend the Company's Amended and Restated Certificate of Incorporation (the \"Certificate of Incorporation\") to effect, at the discretion of the Board of Directors (the \"Board\"), a reverse stock split of the Company's common stock, par value $0.01 per share (the \"Common Stock\"), at a ratio in the range of 1-for-5 to 1-for-10, with such ratio to be determined at the discretion of the Board.  Holders of record of the Common Stock as of the close of business on March 27, 2023 will be entitled to notice of and to vote at the special meeting. The time, location, and other details regarding the special meeting, will be communicated to shareholders at a later date via proxy materials that have been filed with, and are subject to review by, the Securities and Exchange Commission (the \"SEC\").”\n\n**SUMMARY**\n\n* Reverse split at a ratio in the range of 1-for-5 to 1-for-10\n\n* To be voted on a date TBA\n\n* Date of record for voting rights is MARCH 27\n\n\n**FROM THE  PRE 14A PROXY STATEMENT FILED 3/17**\n\n“Effect on Authorized but Unissued Shares of Common Stock. Currently, we are authorized in our Amended and Restated Certificate of Incorporation to issue up to a total of 900,000,000 shares of Common Stock. The total number of authorized shares of Common Stock will not change as a result of the Reverse Stock Split. As of March 15, 2023, we had 335,404,588 shares of Common Stock outstanding and 46,957,040 shares of Common Stock held in treasury.”\n\n**SUMMARY OF QUOTE**\n\n* **335,404,588 shares of common stock outstanding, up from 117m of common stock previously.** (dilution of ~3 to 1)\n\n* **46,957,040 common shares in BBBY treasury**\n\n* **The company is authorized to issue up to 900,000,000 shares at this time.**\n\n**FROM THE 14A FILING REGARDING THE OFFERING's PREFS AND WARRANTS**\n\n* Effect of reverse split on Series A Convertible Preferred Stock: “subject to pro rata adjustments.”\n\n* Effect of reverse split on Preferred Stock Warrants, and Common Stock Warrants: “If the Reverse Stock Split is effected, proportionate adjustments are generally required to be made to the per share exercise price and the number of shares issuable upon the exercise of Common Stock Warrants into shares of Common Stock.”\n*\n\n**This means the prefs will be adjusted in proportion with common stock.**\n\n**FROM THE 14A FILING ON THE TRADING MARKET FOR $BBBY**\n\n“The Reverse Stock Split may decrease the trading market for Common Stock. Because the Reverse Stock Split will reduce the number of shares of Common Stock available in the public market, the trading market for Common Stock may be harmed, particularly if the stock price does not increase as a result of the Reverse Stock Split.”\n\n**this means a reverse split MAY reduce liquidity**\n\n** 14A FILING RESERVATION OF RIGHT TO ABANDON THE REVERSE SPLIT PROPOSAL**\n\n\"The Board reserves the right to abandon the Reverse Split Proposal without further action by our shareholders at any time before the Effective Time, even if shareholders approve such amendment at the Special Meeting. By voting in favor of the Reverse Split Proposal, shareholders are also expressly authorizing the Board to determine not to proceed with, and abandon, the Reverse Split Proposal if it should so decide.\"\n\n**this means the board can abandon the reverse split at any time at their discretion, even after the vote**\n\n**14A FILING CUSIP**\n\n“After the Effective Time, the post-Reverse Stock Split shares of Common Stock would have a new CUSIP number, which is a number used to identify our equity securities.”\n\n**This means that after the reverse split, there will be new cusip # for the stock**\n\n**MY RESEARCH QUESTIONS**\n\nWhich investors/institutions/funds HOLD the 335,404,588 LONG SHARES OF COMMON STOCK, and therefore the voting power?\n\nWhich investors/institutions/funds are short the 80,000,000+ FINRA reported SHORT SHARES?\n\nWhich investors/institutions/funds OWN the TENS OR HUNDREDS OF MILLION FAILS TO DELIVER?\n\nDoes a CUSIP change, for certain, require shorts to prove a borrow?\n\nWhat happens to a NAKED SHORT in the event of a reverse split?\n\nWhat happens to a FAIL TO DELIVER in the event of a reverse split?\n\n**MY CURRENT THESIS**\n\nThe Finra reported short interest is 82,580,000 shares.  The next short interest FINRA publication date is 3/24.  The settlement date for that reporting period was 3/15 and the due date was 3/17.  I believe that the short position on the stock will continue to increase.\n\nand \n\nThe stock REMAINS on the REGULATION SHO THRESHOLD SECURITIES LIST despite significant dilution having taken place.\n\ntherefore\n\nBenefical long Investors/Institutions/funds hold all the long shares.\n\nInstitutions and funds that are SHORT or own FAILS TO DELIVER numbering in the 10s IF NOT 100s OF MILLIONS are UNABLE TO COVER THEIR POSITIONS, because these NAKED SHORTS are NOT COVERED BY LOCATES.  \n\nThese positions are facing a reverse split which would decrease the number of shares outstanding by a divisor of between 5 and 10, at the discretion of the board of directors.  This action will EXPOSE NAKED SHORTS and the STOCK WILL SQUEEZE.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Pete_The_Pilot", "url": "https://www.reddit.com/r/ThePPShow/comments/11u5rs3/reverse_split_and_major_dilution_confirmed/", "time": 1330698502, "subreddit": "r/ThePPShow", "title": "Reverse split and major dilution confirmed", "text": "From the today's press release and the PRE 14A preliminary proxy statement providing notification matters to be brought to a vote.\n\nThere will be a vote on a 1 for 5 or 1 for 10 reverse split on a date to be announced. Holders of record of the Common Stock as of the close of business on March 27, 2023 will be entitled to notice of and to vote at the special meeting. The time, location, and other details regarding the special meeting, will be communicated to shareholders at a later date via proxy materials that have been filed with, and are subject to review by, the Securities and Exchange Commission (the \"SEC\").\n\nON DILUTION\nfrom the PRE 14A\n\n\"As of March 15, 2023, we had 335,404,588 shares of Common Stock outstanding and 46,957,040 shares of Common Stock held in treasury.\"", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Pete_The_Pilot", "url": "https://www.reddit.com/r/ThePPShow/comments/11saaq1/institutional_shorts_on_bbby_may_be_in_trouble/", "time": 1330698502, "subreddit": "r/ThePPShow", "title": "Institutional shorts on BBBY may be in trouble", "text": "Hey folks, Pete_The_Pilot here with a little bit of juicy DD for you in the midst of all this doom and gloom we are experiencing in the BBBY community and in the market at large.  I think that this banking crisis is getting serious. So, i took another look at the institutional short positions on BBBY over at FINTEL to see how those guys are doing during this turbulent period, and this is what I found:\n\n[https://fintel.io/sosh/us/bbby](https://fintel.io/sosh/us/bbby)\n\nMany of the funds on this list are private, like Citadel advisors(4.7mm puts), Lombard Odier Asset Management(4.9mm puts), and simplex trading (2.9mm puts).  Thus we can't really tell how the banking crisis is affecting these firms.  However, the public funds that are short on BBBY are indeed hurting.\n\nBelow are the 5 biggest short positions by publicly traded companies against BBBY:\n\nFund | Ticker| Type | Position| stock price change (1 month)\n---|---|----|----|----\nNomura Holdings | $NMRA | Put| 4,972,500| -10.24%\nBarclays Plc | $BCS | Put| 2,851,700| -19.74%\nUBS Group AG| $UBS | Put| 673,300 | -14.59%\nBank Of America Corp | $BAC | Put| 434,400 | -19.25%\nJefferies Financial Group | $JEF | Put | 420,600| -19.86%\n\nAs you can see, these funds have been very negatively affected.  As such, we could see liquidity issues and margin call situations that arise from this black swan event.  Thus, we could see voluntary closures of these positions for liquidity or forced ones due to margin requirements.\n\nWith all this presented, i would like to stress that while I don't believe that events regarding BBBY and meme stocks have caused this crisis, I do think they could certainly take advantage of it.\n\nTL;DR Hedgies are fukt", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]