[{"username": "PissfestMcgee", "url": "https://www.reddit.com/r/ThePPShow/comments/171moq1/order_of_token_distribution_we_no_longer_need_a/", "time": 1696623750.0, "subreddit": "r/ThePPShow", "title": "Order of Token Distribution - We no longer need a transfer agent for a blockchain exchange that has been in beta testing for 2 years - These are not shares anymore, we should start thinking in terms of NFT Tokens offered by a private company", "text": "<!-- SC_OFF --><div class=\"md\"><p>Once again definitely NOT financial advice. I&#39;ve been in this play since January 2021. Always and forever a smooth-brain. I have learned way too much about things I never thought I would be able to grasp. I&#39;ve been watching the PPshow for months and listening to spaces when I can. Getting so many nuggets of information but it never clicked. One night, all these nuggets connected to form a LATTICE of understanding. Once that lattice is formed, missing pieces can be much more easily interpolated. Any questions I ask to break this lattice just can&#39;t. I invite all the critique please, this is all a hypothesis for now but we should see this come to fruition within the next couple weeks.  It&#39;s all a lot simpler once we stop thinking in terms of &quot;shares and stock exchange market mechanics,&quot; and start thinking more in terms of NFT marketplace mechanics. Literally that simple. How much did the NFT marketplace have to deal with SEC, DTCC, OCC, or FINRA? None, it was just a fun layer 2 self contained blockchain exchange for NFTs. This will be the same thing. Just a company that also has a layer 2 self contained blockchain exchange. The last thing to get all these these pesky acronyms out of the way: token distribution. In this post I will hypothesize how this will occur. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/52n116ggwmsb1.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=d05e19b806be3a0139592a5e91fa1f86a1cfa691\">Transfer Agent Account data. Most shares are own by Cede and Co, the rest to registered holders through DRS or private ownership, outside of the DTCC. </a></p>\n\n<p>The job of a transfer agent is to keep accurate accounts of all shares and their owners. For most publicly held companies, the vast majority of shares will be held at Cede and Co to be used by the DTCC to disperse to brokers. Think of the DTCC as a central hub and each broker/holding institution as spokes off that hub:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jifo9om3ymsb1.png?width=587&amp;format=png&amp;auto=webp&amp;s=88dec8994711ed1830505217a2bc658235c3800d\">DTCC is responsible for share distribution to Broker Dealers (Banks), and subsequently to Brokers (Fidelity) for beneficial ownership in retail accounts (You)</a></p>\n\n<p>Image source: [Link to &quot;The Dark Side of the Looking Glass Presentation&quot; by none other than former OVERSTOCK CEO Dr. Patrick Byrne.](<a href=\"https://youtu.be/nLnw2_q5iMk?si=6F7GF-EyfwaZUYfz\">https://youtu.be/nLnw2_q5iMk?si=6F7GF-EyfwaZUYfz</a>) and I added Cede and Co. This is a must watch by the way, really aids in understanding the corruption of the complicated markets. Digressing again. </p>\n\n<p>Cede and Co is the company designated to actually “hold the shares” for DTCC to arrange ownership. Aside from Cede and Co data, with total sum of shares held by them, and also the data of every holder who is direct registered through DRS or other means of personal ownership outside of DTCC. This includes identification information and account numbers of course. All just data at the transfer agent. And because it’s all data for <em>share counts</em> is the reason why a transfer agent is no longer needed.</p>\n\n<p>There’s already an exchange built. It was beta tested for 2 years in the GameStop NFT marketplace. Same exact concept that’s had the bugs worked out for an official release. But GameStop is already partnered with IMX to handle the gaming marketplace needs. So what was the purpose of the Loopring layer 2 exchange? To beta test a token exchange for the purpose of private ownership of corporate tokens. NFTs are just numbered unique tokens on blockchain. These will be our “shares” but I hate using that word because all these people are diving TOO DEEP into details because everyone is still seeing this through securities law standpoint. Stop that. How much securities law did the NFT marketplace have to go through? None. Teddy is a holding company, so they can hold our USD as well as any other blockchain currency people wish to convert the USD into, in this case Ethereum. The Holding Company part is so important.  </p>\n\n<p>Let’s get this part out there. Ryan Cohen bought BuyBuyBaby. You know it, I know it, everyone knows it (big thanks to Jake2B and others helping me along there). He will rebrand the name to Teddy. He DID cancel the shares. They ARE going to zero. But it’s not a bad thing because he is taking the company private and issuing tokens to all shareholders.  How? We don’t have a transfer agent like we all know. Doesn’t matter. They have all data needed from the transfer agent, froze shares in every account by turning off trading, and created the correct number of tokens to satisfy the TSO. They are minted in the Teddy wallet. Idgaf how many, 400k? 800k? Doesn’t matter, whatever ledger number was obtained from AST. So tokens are minted in the Teddy main wallet (think GameStop creator on the marketplace releasing their own NFT, but way simpler even). Based on the transfer agent DATA, Teddy will create wallets for each account registered with the transfer agent, which is typically a majority with Cede and Co for DTCC distribution, but there are private owners and of course the DRS accounts. For us, DRS&#39;d shares can access wallets with AST account number, or SSN, or whatever you used to ID yourself with AST. Log in, boom correct number of tokens in you wallet which was already created based on AST data. </p>\n\n<p>Another large wallet for Cede and Co. One wallet. It will be up to the DTCC and each broker dealer and Broker to create accounts with wallets. Then the DTCC has to distribute the correct number of tokens to each broker/dealer, which should then be issued to each account holder in each broker. At this point, wallets will have to be created manually, only transfer agent accounts are created by Teddy. Brokers will be responsible for either creating accounts (wallets) for users to log in with ease, or giving instruction to each retail account to create their own wallet, then it is the responsibility of the broker to send the correct number of tokens to each wallet. &quot;How&quot; is on them but they are legally responsible to deliver the correct number of tokens to each account. Here’s where it gets FUN! </p>\n\n<p>Wait...What do you mean there’s not enough tokens to go around? Teddy minted the correct number of Tokens, this was reviewed to death by some top Law firms in the country during the bankruptcy case. Teddy is 150% sure the correct number of tokens were minted and visible on blockchain. Cede and Co received the correct amount. But for some reason, very few brokers are able to get enough from the DTCC to give to all of their accounts. This is where some of us may need to make some noise. This is where it will without a doubt break down the source(s) of the crime, naked shorting, FTDs, synthetics, married DOOMPS, doesn&#39;t matter. Blockchain will expose it. And they can be held legally liable to deliver the tokens to every account holder, but of course a lot will just not care and hope their retail owners just forget about it or don&#39;t bring it up. We have to. They will try to settle for cash, don&#39;t. You want tokens. Everyone will want tokens when they see the astronomical prices the tokens are hitting. Those DRS&#39;d, had 10,000 shares at AST? Boom 10,000 tokens. Brokers have to buy them form the token exchange, from us mostly, and some others. People will see the prices of these things averaging higher and higher. And FOMO will cause everyone to demand their tokens. Because as we saw on the NFT marketplace, it is free and a true representation of supply and demand. If you want to put one share for 500,000 ETH, Go ahead! Might have trouble finding a buyer at that price if there are others at 5 ETH, but that doesn&#39;t matter. It is your freedom to set whatever price you want. And their responsibility to buy these tokens from the open market and deliver to their retail account owners. We know BBBYQ was held predominantly by retail, decentralized. The squeeze will happen on blockchain, as there is no regulation and it is a self contained exchange and marketplace. All for a private company who decided to mint some NFTs (aka tokens) and allow people to purchase the tokens. Nothing more. The simplicity is PROFOUND. And since Teddy is a holding company, anyone can create an account (again, wallet), and wire fiat funds into this account. The fiat can be converted to cryptocurrency to be used on the exchange at the wallet owner discretion. Just like the NFT marketplace, except it will also allow fiat like USD to be held. </p>\n\n<p>Once this is launched, users can create accounts and wallets independently from brokers as well. If your broker is giving you trouble, there is nothing stopping you from making a wallet and buying some tokens for yourself on the open market. I am no legal expert, but the top law firms used during the bankruptcy proceedings are. I am certain they were being utilized to ensure no laws are broken while the DTCC is liquidated to keep repurchasing tokens from the open marketplace to deliver to all accounts. </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/dFhLY5i7VumONPZ5pJOFm_63xz4cWMpJtxfy4zNkVHk.jpg\"/></div>"},
{"username": "PissfestMcgee", "url": "https://i.redd.it/l276mqjggukb1.jpg", "time": 1693225405.0, "subreddit": "r/ThePPShow", "title": "I mean I’m sure his legal team can’t tell him every detail", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/l276mqjggukb1.jpg\"/></div>"},
{"username": "PissfestMcgee", "url": "https://www.reddit.com/r/ThePPShow/comments/15m1qqs/just_had_a_thought_ppseeds_is_the_new_dfv/", "time": 1691546664, "subreddit": "r/ThePPShow", "title": "Just had a thought - PPSeeds is the new DFV", "text": "Watching the show now, and had a daydream of PPSeeds being the next DFV\n\nBut he does it different. DFV aka Roaring Kitty was solo. He had to stand up to a LOT of heat, mostly alone. He did his research, what he found blew him away and he had to share, he tried his best to get the word out as much as possible. But he was a one man show.\n\nPP does it different. He seems very smart and astute, but I think the best quality he has to offer is how he puts things together. He creates. He turns a conversation into a show, now we have something to watch. I’ve been wanting something like this for a while, PP did it.\n\n In that way, he attracts some of the brightest minds, sleuthing through files and dockets and hints from everywhere. I mean there are people coming on the show, some regulars, that learned as they went but very sharp people. But others, like Pulte and OKBet, have much different and valuable perspectives, and are all supportive of the play. He’s doing it much different than DFV, but he’s doing the same thing: getting the word out. DFV was showing over-shorted company that could squeeze. PpSeeds is showing and over-shorted company undergoing the biggest beer trap in history. In his own way. Thanks PP, and Michael, and ABC, and Travis, Plur, all them  regulars. You guys are doing an amazing job.\n\nEdit: oh shit OKBet just came on!", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PissfestMcgee", "url": "https://www.reddit.com/r/ThePPShow/comments/15m1pb7/watching_the_show_now_and_had_a_daydream_of/", "time": 1691546556, "subreddit": "r/ThePPShow", "title": "Watching the show now, and had a daydream of PPSeeds being the next DFV", "text": "But he does it different. DFV aka Roaring Kitty was solo. He had to stand up to a LOT of heat, mostly alone. He did his research, what he found blew him away and he had to share, he tried his best to get the word out as much as possible. But he was a one man show.\n\nPP does it different. He seems very smart and astute, but I think the best quality he has to offer is how he puts things together. He creates. He turns a conversation into a show, now we have something to watch. I’ve been wanting something like this for a while, PP did it.\n\n In that way, he attracts some of the brightest minds, sleuthing through files and dockets and hints from everywhere. I mean there are people coming on the show, some regulars, that learned as they went but very sharp people. But others, like Pulte and OKBet, have much different and valuable perspectives, and are all supportive of the play. He’s doing it much different than DFV, but he’s doing the same thing: getting the word out. DFV was showing over-shorted company that could squeeze. PpSeeds is showing and over-shorted company undergoing the biggest beer trap in history. In his own way. Thanks PP, and Michael, and ABC, and Travis, Plur, all them  regulars. You guys are doing an amazing job.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]