[{"username": "pittsburghsteel7", "url": "https://www.reddit.com/r/ThePPShow/comments/16b3kxa/new_uploads_on_bbby/", "time": 1693955561.0, "subreddit": "r/ThePPShow", "title": "New Uploads on bbby?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m on my way out to a meeting, but in looking for a filing from pre-ch 11, I found some additional items in the BBBY SEC filings on their website.</p>\n\n<p>The items are named UPLOAD or CORRESP.  Are these items released due to an expired NDA?  I saw one contained staff notes on the reverse split.  Please consider checking out, I know I will tonight.</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/financial-information/sec-filings\">https://bedbathandbeyond.gcs-web.com/financial-information/sec-filings</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "pittsburghsteel7", "url": "https://www.reddit.com/gallery/15fh6kk", "time": 1690906852.0, "subreddit": "r/ThePPShow", "title": "BBBY Waldorf MD - Aug 1", "text": "<!-- SC_OFF --><div class=\"md\"><p>Stores is closed, but shelving still up.  Cash registers are still there.  Surprising that the lights are still on too.</p>\n\n<p>Last referenced in docket 878, no named acquirer from what I could find.</p>\n\n<p>Let the discussion begin!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Asr6bJitQ8ivu3LDPMB6-9O_52cpEsp-MqGm-0eF44w.jpg\"/></div>"},
{"username": "pittsburghsteel7", "url": "https://i.redd.it/61ky0oajequa1.jpg", "time": 1681844281.0, "subreddit": "r/ThePPShow", "title": "PP - Watch out for competition", "text": "<!-- SC_OFF --><div class=\"md\"><p>Latest press release, I believe it’s a sign</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/news-releases/news-release-details/shop-bed-bath-beyondr-and-buybuy-babyr-mothers-day-planning-and\">https://bedbathandbeyond.gcs-web.com/news-releases/news-release-details/shop-bed-bath-beyondr-and-buybuy-babyr-mothers-day-planning-and</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/61ky0oajequa1.jpg\"/></div>"},
{"username": "pittsburghsteel7", "url": "https://www.reddit.com/r/ThePPShow/comments/12p7cjb/thoughts_on_columbia_dude/", "time": 1681718324.0, "subreddit": "r/ThePPShow", "title": "Thoughts on Columbia Dude", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I didn’t get to watch most of the stream on Thursday, but just got to it last night.  That segment sounded way more genuine to me than I’m sure it did most people.  See, I actually took my retirement portfolio and put it in the equivalent of  government treasuries during the time I started taking a overly large exposure in BBBY (shares only).  I felt the risk of BBBY was huge but the reward was bigger.  If I lost it all, I could justify taking a loan from retirement to float myself in the event of major expenses until I was able to re-save; that’s how big I thought this play could be.</p>\n\n<p>I’m not here to justify my position on the greater economy, cause I’m not handing out financial advice and cause most of you wouldn’t give two cents about my macroeconomic views (We’re here to discuss BBBY).</p>\n\n<p>Imagine you were some wealthy ‘dude’ who went to an Ivy League school and was actually trying to invest in BBBY, how would you justify exposure to this play to your social group?  How many of us have told friends and family about this just to be dismissed gently or worse?</p>\n\n<p>But why hasn’t he read the dang SEC filings?  He even said they were backward looking.  When I first took a small position, the company was at the dreaded January media-induced bankruptcy. From there, I started reading filings and increasing my position as the company kept finding more ways to get funding.  Even funding via dilutive effect would allow the debt to start being reduced meaning bankruptcy was unlikely.  The consignment agreement was the biggest tell for me as that is effectively free life support.  And there’s no such thing as a free lunch.</p>\n\n<p>Yea, he is likely a financial reporter, and claims to usually only invest in safe crap.  But what if he was actually being genuine?  Have early long investors for once caught the wave before the ‘smart’ money?  Just my two cents.</p>\n\n<p>And don’t mind the fact I’m writing this at 3am, being in this play is one of the most risky things I’ve done.  It’s not exactly doing wonders for my health, but I still believe the reward will make up for it (whether it’s an invaluable lesson on investing in garbage or a pool of gold coins I can swim in).</p>\n\n<p>P.S.  Thanks PP for bringing the contrarian views on. It’s just annoying that there are so many trolls to sift through to get to logical bears (or non-bulls).</p>\n\n<p>Edit: changed autocorrect from ‘not’ to ‘most’ in 2nd sentence.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "pittsburghsteel7", "url": "https://www.reddit.com/r/ThePPShow/comments/129hm4l/photo_of_rc_and_ichan/", "time": 1680432525.0, "subreddit": "r/ThePPShow", "title": "Photo of RC and Ichan", "text": "<!-- SC_OFF --><div class=\"md\"><p>Was listening to Saturday’s show where the suggestion came up that it would be foolish to take this picture before a big move so let’s thought experiment.  </p>\n\n<p>What if the mentorship is the other way around?  Ichan wanted something from RC.  You’d invite someone over to your place if you wanted something from them.  What expertise would RC have that Ichan wouldn’t?</p>\n\n<p>Ichan didn’t understand the loyalty of ‘meme’ investors.  He wanted to know if it was replicable.  That if Ichan wanted to take a big name retail company and turn it into a way to ‘fix the markets’, how could he build a similar psychological following among retail/household to hold even as the price crashes into the ground.</p>\n\n<p>In exchange, RC knows that a hypothetical plan would involve a steep dive in stock price.  If he ever saw such a move in the market, it might be possible to think, “I wonder if that’s my buddy Icahn’s play?.  Maybe I’ll get in on that.”</p>\n\n<p>Didn’t we just see this recent offering with restrictive language against past and future shorts.  It’s almost perfect opportunity for someone big to get invested who might realize what’s going on.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]