[{"username": "Pnutdad", "url": "https://i.redd.it/chemddg0vevb1.jpg", "time": 1697830918.0, "subreddit": "r/ThePPShow", "title": "Schwab rep claims SEC pulled BBBYQ shares from my account", "text": "<!-- SC_OFF --><div class=\"md\"><p>This was received two hours ago.  I immediately fired back a few questions about how/why would SEC do this when I’ve held another BK stock for years that remains in account, do they have other examples of SEC taking such action, etc.  but no further reply yet.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/chemddg0vevb1.jpg\"/></div>"},
{"username": "Pnutdad", "url": "https://www.reddit.com/gallery/14kud6s", "time": 1687911657.0, "subreddit": "r/ThePPShow", "title": "BBBY in Lincoln Park/Chicago. SHELVES FULL w tons of new inventory. Is BBBY already being completely transformed into GMErica with hundreds of new products never before seen at BBBY???", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve shopped regularly at BBBY for 15 years.  My regular one closed a couple years ago, but the one I left just now shows zero signs of closing (every single shelf is full - far different than my last visit in April).  Not a single ‘going out of business’ or ‘liquidation’ sign.  About 15 cars in parking lot (decent total in city where most people walk/bike).</p>\n\n<p>I was utterly shocked by the inventory levels of not just typical towels and bedsheets and kitchen stuff, but of toys, air hockey tables, even socks/hosiery that I never recall seeing at BBBY in all the years I’ve shopped.  Brand names I’d never seen either.</p>\n\n<p>When I asked employee if store was closing, she said she heard end of July but doesn’t know (it’s clearly not June 30!).  About inventory, she said the liquidator is bringing items from not only closed BBBY stores but from many others….my own tinfoil based on stuff I saw there:  Party City?  Sears?  Newell Brands?  Other recent Ch. 11 retailers using same liquidator?</p>\n\n<p>Granted, there were 40-70% off signs all over (nearly all 40%), but this might not be much of a discount based on what these (distressed?) non-BBBY goods may have been purchased for by liquidator…</p>\n\n<p>I think ABC is correct in the way things are going down with multiple companies joining the team w RC, Icahn, Byrne, perhaps Pulte and eventually many others who will indeed go toe to toe w Amazon.  Evidence of this seems to be piling up at the Chicago store…</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/5uh0KdeoDDK7m4N3j5OZn9wAE5X4vEWuqMD_z2MiGdk.jpg\"/></div>"},
{"username": "Pnutdad", "url": "https://i.redd.it/2gvrpa1c2e7b1.jpg", "time": 1687360920.0, "subreddit": "r/ThePPShow", "title": "Bought more today to round out my final battle position. LFG!! 🚀🚀🚀🚀🚀🚀🚀🚀💎💎💎🙏🙏", "text": "<!-- SC_OFF --><div class=\"md\"><p>Won’t be able to catch up to <a href=\"/u/sundevilrogue\">u/sundevilrogue</a> in share count but am a grateful 2nd fiddle equally committed to help all 🦍with my 💎🙏 forged past 2 years.  Our time is near!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2gvrpa1c2e7b1.jpg\"/></div>"}]