[{"username": "PotentialMotion", "url": "https://www.gamestop.com/digital-store", "time": 1699650287.0, "subreddit": "r/ThePPShow", "title": "GameStop is working: New Digital Store", "text": "<!-- SC_OFF --><div class=\"md\"><p>They aren&#39;t sitting still.  Someone we all know is working hard.</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://www.gamestop.com/on/demandware.static/Sites-gamestop-us-Site/-/default/v1700900098387/images/logo-gs-mono.jpg\"/></div>"},
{"username": "PotentialMotion", "url": "https://i.redd.it/duo1cugn5gpb1.jpg", "time": 1695231515.0, "subreddit": "r/ThePPShow", "title": "Any updates on the giant new DOM warehouse?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Its been a hot minute since we had our sleuths check this place out.  I&#39;m super curious whether there has been any updates or changes there.  I believe they said they were hiring in the fall.</p>\n\n<p>With the &#39;almost ready&#39; Baby post today, I am curious to see some updates.  </p>\n\n<p>Anyone up for a visit?  </p>\n\n<p>Thank you!</p>\n\n<p><a href=\"/u/Odd_Presentation2131\">u/Odd_Presentation2131</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/duo1cugn5gpb1.jpg\"/></div>"},
{"username": "PotentialMotion", "url": "https://i.redd.it/ldp2f9z3pnob1.jpg", "time": 1694886959.0, "subreddit": "r/ThePPShow", "title": "The message is: Book your shares (you're searching too hard and missing the big picture)", "text": "<!-- SC_OFF --><div class=\"md\"><p>Do YOU have a collection of books?</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ldp2f9z3pnob1.jpg\"/></div>"},
{"username": "PotentialMotion", "url": "https://www.reddit.com/r/ThePPShow/comments/16kbimj/why_drs/", "time": 1694881262.0, "subreddit": "r/ThePPShow", "title": "Why DRS?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an old old ape.  I&#39;ve seen some stuff.</p>\n\n<p>Some tax restrictions keep me from being entirely DRSed, because of those limitations I needed to understand the whole thing pretty well.  Maybe this will help someone.</p>\n\n<ol>\n<li>DRS in book form removes a &#39;reasonable&#39; locate for short traders.  Since it is in YOUR OWN NAME, and not street name, or under the jurisdiction of a broker, shorties can make a reasonable claim that there are shares to borrow against.  This is where DRS got important.  It gradually removes shares from the float so that there are none to borrow. If enough people do this, it could force a short squeeze.</li>\n</ol>\n\n<p>As an extra note on this, when the shares are direct registered, but held in PLAN, they are still under the control of a broker because it keeps them closer to the market for the purposes of buying and selling.  So they can still be used as locates.  BOOK is important.</p>\n\n<ol>\n<li>When the world ends, it could very well be that many financial institutions go belly up.  After all if there are 200T in derivatives floating around, who could stay afloat?  The ultimate reason Robinhood turned off the buy button was to survive.  They didn&#39;t have the margins necessary to survive otherwise.  Yes there were nasties pulling the strings, but they were going to go under overnight.  DRS removes the shares from brokers, and legally puts them in YOUR name.  No one can take them from you.  Any other form, you are only a beneficial owner.  There is uncertainty about what happens if the institution goes under.</li>\n</ol>\n\n<p>So for BBBY, will we lock the float?  No.  #1 doesn&#39;t apply.  It does to GME, but obviously it hasn&#39;t resulted in a short squeeze yet.</p>\n\n<p>But #2 does apply for both.  Or in any scenario where the world has a major turn.  </p>\n\n<p>I just DRSed my BBBYQ.  Don&#39;t see any reason not to.  Afterall it&#39;s going to be gone if we&#39;re wrong anyway.  And if we&#39;re right, they can buy my TEDDY shares from my cold dead hands, cus I&#39;ll be borrowing against them for the rest of my life.</p>\n\n<p>Not financial advice.  You do you.  God speed young apes.</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PotentialMotion", "url": "https://i.redd.it/9jbq3xi3fkob1.jpg", "time": 1694847271.0, "subreddit": "r/ThePPShow", "title": "Grandpa taught me it's worth the wait", "text": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s going to be so satisfying.</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9jbq3xi3fkob1.jpg\"/></div>"},
{"username": "PotentialMotion", "url": "https://www.reddit.com/r/ThePPShow/comments/16iqs38/post_moass_my_plans_to_give_back/", "time": 1694718063.0, "subreddit": "r/ThePPShow", "title": "Post MOASS: My plans to give back", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hi all. I really hope this is all over soon. Though I will miss this amazing crew of misfits and contrarians.  </p>\n\n<p>Because I expect most of us will go dark, I wanted to share my side-side-side gig that represents one of the ways I hope to give back in the future.</p>\n\n<p>Please excuse my going off topic just this one time. I do appreciate your support, and I honestly believe that this will be worth a read for any human person.  </p>\n\n<p>So please put on your contrarian, research-driven, analytical, skeptical hat — then suspend disbelief — and give this a few minutes of real attention. This is a different flavour of DD, but a DD none the less.  What I am going to claim is a fundamental shift in thinking, just like everything else that led us here. And as such, I am finding that it will probably require a huge amount of capital (MOASS) to actually get this message to a wide enough audience that will actually affect change.  In the meantime, if I can help a couple individuals, that is still reward enough.  In the meantime, I hope it helps you.</p>\n\n<p>//</p>\n\n<p>I have found significant scientific research that shows that a flavonoid called Luteolin inhibits the metabolism of Fructose.</p>\n\n<p><em>&quot;we have observed that luteolin is a potent fructokinase inhibitor in vitro (IC50: 11.2 μM) and in human proximal tubular cells that express fructokinase&quot;</em></p>\n\n<p><em>&quot;we observed that luteolin induced a significant elevation in urinary fructose levels&quot;</em></p>\n\n<p><em>Andres-Hernando, A., Li, N., Cicerchi, C. et al. Protective role of fructokinase blockade in the pathogenesis of acute kidney injury in mice. Nat Commun 8, 14181 (2017). <a href=\"https://doi.org/10.1038/ncomms14181\">https://doi.org/10.1038/ncomms14181</a></em></p>\n\n<p>This means that the bad sugar, instead of causing cellular suppression (more on this later), is just expelled in urine. If you’re reading that you can eat sugar without bad effects, that is reductive, but not far off. Unfortunately this is why most people stop here, because they figure this is a snake oil thing. Keep reading.</p>\n\n<p><strong>Evidence 1: Fructose affects our cells uniquely</strong></p>\n\n<p>Upon entering cells, Fructose behaves very differently from other sugars. It consumes ATP (energy), then generates uric acid, which causes oxidative stress. This stress suppresses mitochondrial function, and its energy output. This means that the body can’t use energy from food, while suppressing existing cellular energy as well. The body sees this as an emergency state, thinking we are starving — so unregulated appetite.  </p>\n\n<p>This creates a feedback loop that suppresses energy usage (promoting storage), and keeping cellular energy low (promoting appetite). So we just keep going back for more.</p>\n\n<p><strong>Evidence 2: Fructose in Nature</strong></p>\n\n<p>In nature, Fructose only appears for brief periods when fruit is sweet. I believe this is the reason for the survival of most species. It allows animals to bulk up quickly before a period of scarcity. Not just scarcity of food, but also of water (when converted to glycogen, 1g of carbohydrates stores 3g of water). Fat and glycogen are our battery packs, enabling us to survive. And Fructose is the recharger.</p>\n\n<p><strong>Evidence 3: Non-dietary Fructose explains the complexity of weight gain</strong></p>\n\n<p>Most people say this is too reductionist. What about carbs, salt, alcohol, lack of exercise, etc etc etc. Those are good questions. The same scientific research found that Fructose can be synthesized in our tissues, so cutting sugar sources isn’t enough. Carbs, salt, alcohol, all stimulate fructose production. What if rather than all being different sources of weight gain, it was all the same thing. When alcoholics stop drinking, what do they crave? Sugar. </p>\n\n<p><strong>Evidence 4: The timing of Sugar Availability</strong></p>\n\n<p>Humans didn’t have this problem before. Fat and gout was the blessing of the Ken Griffins of times past. If you look at history, obesity and diabetes started increasing gradually around the mid-1800s, progressively getting worse ever since. What happened then? Sugar became cheaply and widely available after the world fair in London in 1851. Suddenly international trade made sugar and sweet fruit available around the world. In years since, we invented new ways to supersize this — high fructose corn syrup, sodas, and putting it in every processed food we could find.</p>\n\n<p><strong>Evidence 5: What if we can’t metabolize Fructose?</strong></p>\n\n<p>To me, the above makes a good case that our metabolic problems stem from our daily availability of Fructose. Animals don’t have any problems regulating weight (until we keep them as pets). Something we are doing is different. So scientists started inhibiting Fructose metabolism to see what happens. And you can guess what did. Every illness related to sugar started to ease.  </p>\n\n<p>I am suggesting that Fructose is the real source of metabolic syndrome. This likely is affecting most of our families in one horrible way or another. The worst, I think, is Alzheimer’s Disease. There is new evidence that shows that: 1) Fructose is also synthesized in the brain. 2) The areas it targets create a behavioural pattern that supports the search for food. 3) The areas it targets match PERFECTLY those targeted in Alzheimer’s. 4) They tested this on mice. They developed full Alzheimers after 18 weeks on Fructose. 5) They tried inhibiting Fructose metabolism, and the symptoms started reversing.</p>\n\n<p><strong>Evidence 6: Personal Experience</strong></p>\n\n<p>My family used the above knowledge to try countering the effects of fructose with the same natural ingredients these scientists used, particularly Luteolin as mentioned earlier. The results are freaking crazy. Within a few days, cravings started to disappear. Alcohol cravings started to disappear. Energy levels skyrocketed. Brain clarity improved. My diabetic father in law regained normal insulin levels (his doctor just took him off Ozempic). Our friend saw improvements in hormonal imbalance. The amazing part to me is that everyone is seeing different effects, because Fructose is affecting them on a cellular level, taking advantage of different weak spots. So correcting it is showing equally diverse improvements.</p>\n\n<p>Please note if you want to try this yourself, that Luteolin is very water soluble, so not only do you want a high potency, but you need a liposomal encapsulation to protect it through your digestive tract.</p>\n\n<p>I want the world to know about this!!!! But no one will suspend believe long enough to try!!!!  </p>\n\n<p><strong>Back to MOASS.</strong></p>\n\n<p>My hope is that post-MOASS, tendies will enable getting this research to a wider audience. People need to know. I truly believe that Fructose exposure is the reason for 80% of modern illness. Even cancer often develops when cells start using glycolysis for energy instead of energy produced by mitochondria. So fructose’s influence, suppressing mitochondrial energy, could be one of the biggest reasons for cancer development. The connections are endless because we broke how our cells work.  </p>\n\n<p>Anyway, I hope that this was educational for you. Please visit my website <a href=\"http://fructosecontrol.com/\">fructosecontrol.com</a> for way more information on this. Everything I have stated above is backed with citations on my website.  It is chock full of references to scientific papers.  But if you have questions, I am completely at your service.  </p>\n\n<p>If something compels you to share this with your loved ones, I would be very humbled at the opportunity to be able to help even one person with this. Apparently you might come off as crazy, but we already do. LOL. Every life is precious. If something here can help one person, it is worth everything.</p>\n\n<p>Thank you friends. May the force be with you. Always.</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PotentialMotion", "url": "https://v.redd.it/nsukxqlunnnb1", "time": 1694498692.0, "subreddit": "r/ThePPShow", "title": "Everything reminds me of her...", "text": null, "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/bzNzOGU1Z3Vubm5iMZvVSC7nrCcE4B4-TCgkx3eGdJn_YQeFs_6816xFX9S2.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=ae0f8578523f58dbaca1b656a8015456b2c54879\"/></div>"},
{"username": "PotentialMotion", "url": "https://www.reddit.com/r/ThePPShow/comments/16flewj/i_just_want_to_say_this_loud_and_clear_once_this/", "time": 1694405198.0, "subreddit": "r/ThePPShow", "title": "I just want to say this loud and clear. Once this plan is approved, nothing can stop it. I'm jacked! Jacked to the tits!", "text": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t care whether I need to wait a day or 90.  It&#39;s done.</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PotentialMotion", "url": "https://www.reddit.com/r/ThePPShow/comments/15u7wf0/whao_there_may_be_very_bullish_reasons_why_rc_is/", "time": 1692326497.0, "subreddit": "r/ThePPShow", "title": "Whao. There may be very bullish reasons why RC is on a list of bypassed recipients", "text": "<!-- SC_OFF --><div class=\"md\"><p>I asked ChatGPT to hypothesize why RC would be on a list of bypassed recipients.  I included the rumor of his eventually being involved in a acquisition by reverse merger.  It&#39;s hypothesis was pure hopium:</p>\n\n<p>Hypothesizing based on available information, I can offer a speculative scenario that might explain the inclusion of Ryan Cohen&#39;s name on a list of bypassed recipients in the context of a potential reverse merger:</p>\n\n<ol>\n<li><p><strong>Strategic Positioning:</strong> Ryan Cohen might be positioning himself strategically within the bankruptcy process. Being listed as a bypassed recipient could indicate that he has intentionally chosen not to assert certain claims or rights at this stage of the bankruptcy. This could be a part of a larger strategy related to the potential reverse merger.</p></li>\n<li><p><strong>Negotiations and Agreements:</strong> As a significant stakeholder or potential acquirer, Ryan Cohen could be engaged in negotiations with the bankrupt company. This could involve discussions about the terms of a potential reverse merger or acquisition. As part of these negotiations, Cohen might have agreed to temporarily bypass certain claims or rights in exchange for other benefits or assurances.</p></li>\n<li><p><strong>Confidentiality and Timing:</strong> In many business transactions, including potential mergers, confidentiality is crucial. Being listed as a bypassed recipient might be a way to keep negotiations and plans under wraps while the bankruptcy proceedings unfold. It could also serve to manage public perceptions and avoid unnecessary speculation until a formal announcement is made.</p></li>\n<li><p><strong>Legal and Financial Considerations:</strong> Bypassing claims or rights could have legal or financial implications in the context of a potential reverse merger. This could involve issues related to taxation, valuation, or the structure of the transaction. The decision to bypass claims might be a tactical move to ensure that the merger process is executed in the most advantageous manner.</p></li>\n<li><p><strong>Smooth Transition:</strong> If a reverse merger is indeed in the works, Cohen&#39;s involvement as a bypassed recipient could be aimed at facilitating a smoother transition of ownership and operations. It might be part of an overall plan to ensure a seamless integration of the companies involved.</p></li>\n</ol>\n\n<p>EDIT:</p>\n\n<p>I pushed it hard for a bearish thesis too to try to get a balanced read.  They were summarized this way:</p>\n\n<p><em>The bearish thinking in this context could revolve around the speculation that Ryan Cohen may no longer have a strong financial interest in a positive outcome for the company. His inclusion as a bypassed recipient could suggest that his investment in the company might not be yielding the expected returns or that his financial interests have shifted. This type of interpretation aligns with a bearish perspective where investors or stakeholders may perceive his involvement as a potential indicator of less favorable prospects for the company, regardless of any reverse merger rumors.</em></p>\n\n<p>The original responses outlining bearish concepts all painted RC in a light of a sourpuss that didn&#39;t want to play anymore, so he denied the communication.  </p>\n\n<p>In my personal opinion, the bearish thesis sounds a lot more far fetched and than the bull thesis.  I would appreciate someone smarter than me checking the validity of its statements.  ChatGPT is simply a tool (double meaning implied).</p>\n\n<p>Edit 2: Looks like I struck a nerve. I got my first suicide watch DM. Such a weird shill tactic. But WOW is it validating!!!</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PotentialMotion", "url": "https://i.redd.it/npg35gxjdjib1.jpg", "time": 1692219556.0, "subreddit": "r/ThePPShow", "title": "This needs more eyes. Well done monke!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Actively shipping?\nTeddy bear?\nHiring in 2 months? 👀</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/npg35gxjdjib1.jpg\"/></div>"},
{"username": "PotentialMotion", "url": "https://www.reddit.com/r/ThePPShow/comments/15ck40g/a_critical_analysis_of_the_commentary/", "time": 1690609287.0, "subreddit": "r/ThePPShow", "title": "A critical analysis of the commentary", "text": "<!-- SC_OFF --><div class=\"md\"><p>I hope this word salad helps you stay off the FUD for the weekend:</p>\n\n<p>This forum is a lively discussion, largely of court documents. It&#39;s wonderful and critical. There is a necessity for objective critical thinking.  It is the only way anything good happens. Lively intelligent dialog has resulted in this beautiful anomoly of our age, which I believe will soon rock the world.</p>\n\n<p>Unfortunately as we&#39;ve seen all too much as the discussion has migrated from Sub to Sub, it can descend into ugliness.  Sometimes the happens because the discourse has been hijacked and poisoned, other times simply because we&#39;re all human with easily bruised egos.  But I believe that you don&#39;t need to look too deep to see through the mire.  </p>\n\n<p>Let me explain.</p>\n\n<p>NEGATIVE COMMENTS</p>\n\n<p>When I see any negative comment in the subs: I briefly ask myself, why is this person here and engaging?<br/>\nAre they interested in critical progressive discourse? Are they generously trying to save my sorry ass from making a terrible mistake? \nIf not, they are likely some brand of troll. Perhaps they are simply sore from being way in the red.  Or perhaps they are straight evil, just here to sow seeds of doubt. </p>\n\n<p>I don&#39;t pretend their tactics don&#39;t work.  On a day where the doubt runs strong, am I as likely to buy?  If I&#39;m honest, no.  It is days when new DD gives me renewed confidence, I search the couch for a few more bucks.  </p>\n\n<p>But asking those questions keeps me steady so I can separate the true critical progressive discourse from the mire.  We’re stuck with it.  We need to learn to work through it unitedly.</p>\n\n<p>SHF TACTICS</p>\n\n<p>Beyond just comments, SHFs are working hard to exert control in any way possible.  In the case of BBBY, we have seen opposition throw any delay or derailment possible at the bankruptcy plans.  Personally, I believe DRS/Book is one of the few weapons we possess as shareholders, but I’ll shelf that discussion for now.</p>\n\n<p>Enough about shills.  I want to talk about the positives.</p>\n\n<p>POSITIVE DISCOURSE</p>\n\n<p>Positive discourse is not just cheerleading.  It requires critical analysis.  This means lively, objective discussion.  Sometimes we are wrong, but by checking and rechecking each other, we have made great strides.  The Heat Lamp Theory a few months back seems a perfect example of this.  It was tested and examined again and again in the face of abuse and censorship.  And now the SEC itself(!) outright confirmed that Plan is not DRS.  Well done people.  That was a hard fought battle.  Entire Subs were banned in the fallout.  I am proud to stand in the same room with you.  Your work revealed a critical factor in the battle against naked shorting.</p>\n\n<p>Finally, I want to talk about the Insiders</p>\n\n<p>INSIDERS</p>\n\n<p>I am sure they are here among us lurking.  (Hi Dad!!!!!)  But do they speak up?  Of course not.  And this is important.</p>\n\n<p>If the thesis is true, it stands that there would be a very careful control on what they can actually disclose.  Not only would it be tightly controlled by iron clad NDAs and be ridiculously illegal, but showing your hand too soon would be devastating to the success of an elaborate plan. </p>\n\n<p>As such, I believe that while there might be hints and conjecture, until the cat is out of the bag, any more would be sh*tting the bed. While none could legally cross that line, I also doubt any want to be responsible for that. Enthusiasm and optimism spills out from anyone RC is closely connected to. This guy has strong, smart allies.  </p>\n\n<p>So for those that have privileged information: RC, lawyers, probably even Overstock… Blockbuster?? Who knows who is involved?  But if they are, what CAN they say, whilst gagged?  For the answer, look to the captain.</p>\n\n<p>RC is notorious for keeping his cards close.  But is he totally silent?  No.  We hang off his Twitter for juicy subtext.  He knows this, and at some point decided that this is how he will communicate with us.  Details Matter.  But he will NEVER come out and say something that isn’t ready to be publicly disclosed.  Nor do I want him to.  He barely says anything anyway, he lets his actions speak. </p>\n\n<p>RC is one of the few CEO/Chairman/SupremeLeaders keenly aware that he works FOR the shareholders.  He takes no salary, has invested piles of his own money, works his pants off, and moves when the time is right.  He is all about customer delight.  He knows that includes his boss: you.  So do I want him to just come out and say it?  Well yeah…  But also NO!  I trust him, and don’t know all the details.  I trust that when the time is right to move, he will decisively.  </p>\n\n<p>So in the case of BBBY, of Teddy, and any hairbrained idea of how this might all fit together: if there is a big move happening, they&#39;ll know ON THE MOON when they want us to.  Until then, we&#39;ll still be scouring for hints and hypothesizing.  </p>\n\n<p>TL;DRS/BOOK</p>\n\n<p>Shills will be obvious because they don&#39;t have your best interests at heart. They aren&#39;t trying to help you, they want you to doubt and/or leave.  Or at least not click buy today.  Just ignore them.  This is NOT the same as the necessary critical progressive dialogue essential to advancement.  We NEED that.</p>\n\n<p>Don’t expect insiders to reveal anything.  Nor should you want them to.  They don&#39;t want to screw the plan.  We&#39;ll know when they want us to.</p>\n\n<p>Until then, what can insiders do?</p>\n\n<p>Tease.  Like RC.</p>\n\n<p>Flash a teddy bear or a horse here and there.  Show a side eye.  A cryptic tweet.  Reinforce (under oath) that they have a plan beneficial to all stakeholders...  ALWAYS staying within the bounds of the law.</p>\n\n<p>We&#39;re seeing all of this.  Freaking teddy bears everywhere.  It might feel like tinfoil, but its pretty damn hard to speak clearly while gagged!  Notice how the source is always those that might be &#39;familiar&#39; with the situation.  They aren’t trolling us maliciously.  But they ARE teasing us, knowing we are paying close attention.  </p>\n\n<p>They are sending a subtle message within allowance that says, “Keep going. You might be on to something.”</p>\n\n<p>Happy weekend fam.</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PotentialMotion", "url": "https://www.reddit.com/r/ThePPShow/comments/15c7lwz/dear_shills_why_would_i_leave_the_movie_3_minutes/", "time": 1690574554.0, "subreddit": "r/ThePPShow", "title": "Dear Shills: Why would I leave the movie 3 minutes before it ends?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Shhhhhh.  This is the best part.</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PotentialMotion", "url": "https://www.reddit.com/r/ThePPShow/comments/159hq9u/why_i_buy/", "time": 1690312001.0, "subreddit": "r/ThePPShow", "title": "Why I buy", "text": "<!-- SC_OFF --><div class=\"md\"><p>I believe that this is the play to end all plays.  And that eventually the game will stop and holding GME, BBYQ, and probably others in the basket will turn into a black hole because you wonderful Apes will not let go once it runs.  I believe there is no possible measure of &quot;Days to Cover&quot;, because we&#39;re going to HODL and not let go.  After all, when it runs, it will be because the fundamentals are shown to be abso-freaking-lutely real.  Whatever our cost basis, we bought at the very bottom.  So why ever sell and pay taxes?</p>\n\n<p>That said, I am wary of becoming wealthy.  I know that money does not buy happiness.  I fully expect it to screw with my life and my relationships, and I fear that because they are my most precious assets.  As noble as we all feel going into this, wealth will corrupt some of us.  Maybe even me.  We can&#39;t change human nature, only fight it.  I am determined to fight hard.  But for now, I am happy, and scared to mess with that. I don&#39;t have a lot, but I am content with what I have, and I am happy in my relationships. I don&#39;t expect wealth to improve this, in fact, I expect it to more likely harm it.  Or at least change it, because any major changes in circumstances always require some serious adjustment.</p>\n\n<p>But I am still human. I am a minimalist, but I still want nice things. Who doesn&#39;t? What attracts me most though is the freedom. I have many working years ahead, and I have a mind for hair-brained ideas that could turn into businesses (a number that I have tried and always failed, it drives my partner nuts), and I know that idle hands are likely to turn me selfish and corrupt.  I intend to keep working, but because I want to and it is fulfilling. But even more than that, I crave time with the ones I love; with my young daughter and my love.  And spending time helping people that need help.  I spent years doing volunteer work before my daughter was born and I was forced to earn a more responsible income.  I know from experience: <strong>Giving makes you happy.</strong></p>\n\n<p>I am keenly aware that when this play runs, it will not be the cause of suffering, but great suffering will most certainly happen in parallel.  Greed, corruption and unchecked power have resulted in a house of cards that will come crashing down when our play pulls the floor out from them.  Margin call after margin call will bring untold collapse, and the super rich won&#39;t be the ones hurt most — it will be everyone else that loses their livelihood when the institutions they rely on fall. The super rich are using us peons as a shield. So as much as I crave justice, the fallout terrifies me. I know many lives will be lost, and many more will suffer. This is why I won&#39;t &quot;f*cking dance&quot;.</p>\n\n<p>I hope this doesn&#39;t sound sanctimonious. I am no one and want to remain that way. I just want to be on the side of good because my conscience demands it.  Honestly this play puts me too close to the center of the drama for my tastes. I would rather not be so closely connected to something that is so likely to rock the world. It makes me nervous. We are the heroes that will take down the supervillain. But the collateral damage from the great battle is nothing to scoff at for the average citizen. Many will be angry at the hero for their role.</p>\n\n<p><strong>This brings me to why I buy.</strong>  It isn&#39;t for the wealth: I fear that.  It isn&#39;t to become happy: I know that happiness is not dependant on circumstances, and already am happy. It isn&#39;t for the freedom from work: work is good for me. It isn&#39;t for the justice: it is so important, but I don&#39;t believe holding a few villains accountable will rid the world of villainy.</p>\n\n<p><strong>It is for the freedom to strengthen my relationships. And for the ability to help others.</strong>  Because they will sure need need it, and someone needs to be left standing to help when this all falls apart.</p>\n\n<p>When the world changes in a few weeks, I promise to try my best to be kind and work hard to help others. I know you will do the same. </p>\n\n<p>The world will need heroes even more so THEN than it does now.</p>\n\n<p>&#x200B;</p>\n\n<p>Thank you for reading.</p>\n\n<p><strong>Be excellent to each other.</strong></p>\n\n<p>Party on dudes!</p>\n</div><!-- SC_ON -->", "flair": {"text": "PPs legion", "text_color": "dark", "back_color": null}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]