[{"username": "Pottle13", "url": "https://www.reddit.com/r/ThePPShow/comments/11vt2sw/some_perspective_of_the_bobby_madness/", "time": 1253385318, "subreddit": "r/ThePPShow", "title": "Some Perspective of the Bobby Madness", "text": "Can’t post on r/bbby so thought it would write something here.\n\nAfter investing in Jimmy, I didn’t think anything could be crazier, yet here we are. This Bobby rollercoaster has been nuts. I became interested after the RC buy-in and bought in right before the August run-up (which was insane in itself, running to 30, RC selling, price crashes).  \n\nBut look at the last few months:\n* REG Sho every day this year\n* A metric ton of FTDs\n* Short interest explosion (price pummeled accordingly)\n* Dark pool increase \n* Buyer saving the company through a unique purchase of convertible shares. \n* Bond payments\n\nThe list goes on but what a start to the year. \n\nNow, who knows what’s going with HBC or if Icahn/Cohen still involved. Complete speculation at this point. \n\nBut just take a second to focus on Bobby’s New Releases this week:\n\n3/14 Amends Equity Offering Agreement. Another $100m coming in. More preferred shares sold. Reset stock fail price to $1. \n\n3/15 Sleep Awareness Month recognition. I mean WTF. With all that’s going on, they suddenly care to recognize sleep awareness month. They sure as hell didn’t last year or the year before. Maybe Sue is just a sleep nazi. Who knows\n\n3/17 Special Shareholder meeting announcement of reverse stock split. 6 trading days for right to vote. Date of actual meeting up in the air. Even the meeting itself up in the air. Very non-committal about the meeting and can be cancelled for any reason. \n\nSchedule 14A: All eyes on change of share count. \n\nDilution fears stoke to an all time high. \n\nWho knows what happens next week, but it was a wild one this week. Speculation is fun/dangerous, but don’t forget to take a look at the hard facts without the need for someone’s opinion. \n\nMain Fuel for the speculation machine:\n- HBC is revealed to behind the equity offering. \n- Outstanding share change\n- Reverse Split vote\n- Special shareholder meeting\n- Brett Icahn leaving the Newell Board. \n- Gemini protocol: random emoji tweet (seeming to congratulate Bobby)\n- RC standstill ending\n- Jimmy Earnings \n\nWho knows what is really going on behind the scenes or who is involved (or still involved). But I still find this interesting: 3/25/22 Bobby announces an agreement RC ventures:\n\n“Mr. Cohen concluded: \"The resolution announced today represents a positive outcome for all of Bed Bath's shareholders. By refreshing the Board with shareholder-designated individuals who possess capital markets acumen and transaction experience, the Company is well-positioned to review alternatives for buybuy BABY. I appreciate that management and the Board were willing to promptly embrace our ideas and look forward to supporting them in the year ahead.\" \n\nAs a result of the agreement between RC Ventures and Bed Bath & Beyond, RC Ventures has agreed to abide by certain customary standstill provisions and will support the Board's full slate of directors at the 2022 Annual Meeting. The complete cooperation agreement will be filed with the U.S. Securities and Exchange Commission as an exhibit to a Current Report on Form 8-K.”", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]