[{"username": "PrayToChrist777", "url": "https://i.redd.it/l60uonr03w0c1.png", "time": 1700218699.0, "subreddit": "r/ThePPShow", "title": "Sal says TODAY 17/11 is actually TOMORROW!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/l60uonr03w0c1.png\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/17s1qtq/you_will_bow_down_to_ucopy_you_will_simp_for_tea/", "time": 1699614600.0, "subreddit": "r/ThePPShow", "title": "You WILL bow down to U-copy. You WILL simp for tea leaf charts. You WILL get paid on Nov 15th.", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is a formal request for everyone to give U-copy a conditional &quot;im sorry!&quot;. </p>\n\n<p>If you type + in this thread, you agree to the following:</p>\n\n<p>If (i.e. WHEN) this shit hits Nov 15th, I HEREBY FORMALLY LET U-COPY KNOW IM SAD FOR BEING A DOUBTER AND A HATER. HIS TRIANGLES HEALED MY HEART AND HIS LINES OPENED MY EYES.</p>\n\n<p>That is all.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://i.redd.it/zhg061p2rezb1.jpg", "time": 1699573023.0, "subreddit": "r/ThePPShow", "title": "Me listening to the Jake vs Sparkle debate", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/zhg061p2rezb1.jpg\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/175efxl/doesnt_this_confirm_that_next_week_is_indeed_the/", "time": 1697032083.0, "subreddit": "r/ThePPShow", "title": "Doesnt this confirm that next week is indeed the week? Options expiry pushforward DD by Jake.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ok, so i encourage everyone to listen to the latest PPshow at 1h-1h 5 min. During these five minutes, <a href=\"/u/jake2b\">u/jake2b</a> gives us extremely juicy bits. My question in this thread for you guys, is what you think, and if this does not actually confirm that next week is indeed the week. Listen to the clip first, its only 5 min.</p>\n\n<p>It starts from this link: <a href=\"https://youtu.be/-Ca_qFU-5nk?t=3639\">https://youtu.be/-Ca_qFU-5nk?t=3639</a></p>\n\n<p>To recap:</p>\n\n<ol>\n<li><p>There is an options expiry pushforward to Oct 20.</p></li>\n<li><p>Some document from OCC confirms that options expiry pushforwards are only moved to standard date (3rd friday on month) in this circumstance, if a cash for share compensation is provided/made known (?) at the latest, on the tuesday of that week. Again, listen to the segment and tell me if im wrong. If this has not occured, then the options expiry will not be pushed forward.</p></li>\n<li><p>As Options expiry is indeed pushed forward, as Jake concludes, then it implies that they expect that there is indeed a compensation to be made known at the latest on tuesday 17th Oct.</p></li>\n<li><p>Quasi-related: possibility of SEC objection has deadline on 14th October, being 14 days after the 29 sept cancelling of BBBY. So theoretically, news on item 1-3 (above) can be made known from this friday at the earliest.</p></li>\n</ol>\n\n<hr/>\n\n<p>My questions here is: do i get this (roughly) right? Because if so, this is almost like a guarantee that next week is indeed the week.</p>\n\n<p>My question is; if all this is right, why is not this been on hot in like fifteen thousand threads? I learned about it sloppily listening to PPshow while grinding wow classic rogue shit - isnt this news ALOT bigger than that? Or am i getting something wrong?</p>\n\n<p><a href=\"/u/jake2b\">u/jake2b</a>, doesnt your points on these issues above actually confirm next week as the week? Are there any reasons for doubt?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/16svj2k/holly_etlin_bbby_is_a_5b_dollar_company_i/", "time": 1695752330.0, "subreddit": "r/ThePPShow", "title": "Holly Etlin: \"BBBY is a 5b dollar company\". I literally cannot see how BBBY estate can lose this play.", "text": "<!-- SC_OFF --><div class=\"md\"><p>When Holly said this, what did she refer to? Mostly the crown jewel, BBB, or? She said this (cant remember exact quote, but it had this meaning) on tape, and she is very respected in her field, so it cannot just have been taken out of the ass.</p>\n\n<p>It makes me think. If BBBY is 5b dollar company (perhaps this includes nols, dont know), with 1.5b in debt - some of which may be in the form of bonds held by a fren, meaning debt could be in practice substantially lower - how the fuck could BBBY loose this, mathematically?</p>\n\n<p>Either Holly was wrong in her appraisal - but its consistent with a certain other high profile dude, valuing the crown jewel in &quot;billions&quot;. But i dont think she is the kind of person who wants to be caught on tape, saying things that turn out to be blatantly false. Or she is right. If so, where is this value heading? </p>\n\n<p>This holdup is dramatic, sure. But we will see, some time or other, where the value of this play is heading. In Hollys appraisal, the bare value of BBBYQ estate is 3x higher than its debt (1.5b debt vs 5b value). Again, this possibly excludes the nols, making it a ratio of 1:4 (debt:assets). </p>\n\n<p>Add to that; last time a basket stock rose significantly in value due to shorts fuk, another basket stock cleared its debt entirely and aquired a $1b cash warchest. This situation is exponentially worse by any metric.</p>\n\n<p>I am serious - can anyone tell me how the fuck BBBYQ estate can lose? You think some of the countrys best and most well payed laywers have done their paperwork and math 24/7 for over 6 months, for all of it just to rinse away in sand?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/16bdhmd/is_sept_12th_a_hard_deadline_inb4_dick_jokes/", "time": 1693984697.0, "subreddit": "r/ThePPShow", "title": "Is sept 12th a hard deadline? Inb4 dick jokes.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Before answering &quot;noone knows&quot;, read.</p>\n\n<p>I wonder; would it be possible for BBBYQ estate not to give amendment to the ch11-exitplan before or on sept 12th, but for shareholders to still have a chance? Just how final is sept 12th?</p>\n\n<p>Inb4 noone knows, a way of answering this question could be like  this: &quot;I dont know, but i recall  DD writer XYZ saying something like this...&quot; or &quot;I dont know, and i do not recall any DD writer opening for the possibility of happenings post sept 12th&quot;.</p>\n\n<p>If nothing happens before or on sept 12th, is there any reasons for hope for shareholders? Im sorry if this already has been answered, i just want to see if this question has been brought up in the community and if there is any wisdom here, or if it is literally reduced to just fucking around and finding out.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/16aymty/feeling_excited_what_are_you_gonna_do_postmoass/", "time": 1693944575.0, "subreddit": "r/ThePPShow", "title": "Feeling excited! What are you gonna do post-moass?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yo bros whadup?</p>\n\n<p>Just stopping by to say hi, and to share some thoughts. Im fucking excited for this! Ill tell you why: one faithful night in feb 2021, i got intense feeling that i should go all into GME. This was when it was really volatile. I knew nothing about it, was just a guess - i told myself i was gonna hold one day, and close before market close. Got in at like $120 (as i remember), it went up to $140. I thought: &quot;this was fun!&quot;.</p>\n\n<p>That was now two years since, i did not sell, but started to read, and the very intense research brought be into BBBY. I know its been a crazy two years for all of us. There have been good days, exciting times, but also alot of stress and hard times. </p>\n\n<p>Here is why im excited: within one week, its very likely that we have a verdict. Next tuesday is 12th sept. As i am perfectly regarded, im not in the position to say that &quot;if we have nothing on or before 12th sept, its over&quot; - as I dont know. But i will say this: <strong><em>we are on a timeline that, regardless of the exact details, is coming to an end very shortly</em></strong>. Its hard to take in, i guess, for all of us. For better or worse, this chapter that for many of us started in early 2021, is very soon completed and we will know, what all these speculation, vagueposting, cues, tinfoil - we will know what it actually amounts to.</p>\n\n<p>I still trust RC, i trust the board, i trust Sue. I do not, for one second, think that these are people that are willing to smile on camera (remember Sues last interview, days before BC?), while knowing that houndreds of thousands of average joes are going to facetank financial ruin. RC knows 100%, about quite well founded speculations on his engagement in BBBY, and if he were not in he would 100% have signalled that very explicitly. But he hasnt, to the contrary he shows up again and again.</p>\n\n<p>I have put literally 100% of my assets, and then alot extra (full degen, for better or worse), on the line for this. If this fails, I will face the destiny of my parents, and their parents, and their parents, etc - I will wagecuck until the day i die, allowing nothing more and nothing less than a middleclass life to my family. It would be hard for us initially, but we would make it. I would be sad, but i could live with it. </p>\n\n<p>But if there is a plan, if the tinfoil holds, the speculations are true, if two years of DD is roughly right. You know what? I have put everything on the line, but i would not move one inch above middleclass regardless. But these years, i have tasted what its like to be financially challenged, poor tbh. I had to ask my parents for help (despite being a working man, having two jobs) a couple of times, fucking embarrassing. But im extremely grateful for what these years have taught me. If moass would have happened in 2021, i would have been a dick with a lambo.</p>\n\n<p>Post-moass i just want to help people. In India, there are children who are literally slaves, sold for $3k per person. I have spoken to single mothers who are getting squeezed out, cause of inflation, from their apartments. </p>\n\n<p>Post-moass, I would help some parishes getting churches. And i want to start a fund or similar to help poor families, to get them jobs and perhaps housing. If you wanna go lambo, do it and enjoy it, this is not me shaming apes or anything like that. Im gonna get some things for myself. But i am personally very grateful for what i have learned during these two years - the entire economy is a sham, a farce, and a great injustice, and i dont want to live for cash or material wealth anymore, i want to live to help others. Im also thrilled about the next chapter beginning, for better or worse, real soon.</p>\n\n<p>If you read my blog, thanks and God bless. If you have dreams for what youre gonna do post-moass, do tell :)</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://i.redd.it/ih67plmpg7mb1.jpg", "time": 1693818745.0, "subreddit": "r/ThePPShow", "title": "Dragonforce DD", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ih67plmpg7mb1.jpg\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/15g5ust/bbby_estate_the_play/", "time": 1690974087, "subreddit": "r/ThePPShow", "title": "BBBY Estate - the play.", "text": "In this post, I will show my outline of how to make sense of the BBBY Estate play, in a way that keeps everyones interests intact. I will be as brief as possible. What i want in return, is answers - is this theoretically possible? Im not saying THIS WILL HAPPEN! - im asking if this is a possible way of squaring everyones interests here, that keeps squeeze play intact.\n\n\nOk, so look at this:\n\nFrom the First Day Declaration we know that the secured debt and bonds were: (millions)\n\nABL: $80.3\nFILO: $547.1\nFinance Leases: $61.5\nLoC: $102.6\nTotal secured: $791.5\n\n2024 Notes: $215.4\n2034 Notes: $209.7\n2044 Notes: $604.8\nTotal Notes: $1029.9\n\nTotal secured + Notes: $1821.4\n\n\nYesterday, they said closing sales netted an amount that is sufficient for doing away with secured debt, roughly $800m give or take. Left is a billion of secured notes, and thats it.\n\n\nGo on, under the following assumption: assume that the majority of noteholders will convert the notes into equity/other compensation related to the coming company, e.g. TEDDY. Then there is zero secured debt+notes left to pay.\n\n\nMeaning that left on the table are the NOLs, $1.6b free money. ASSUMING that bondholders are okay with compensation in form of ownership of new company (this likely was the plan all along, and the way e.g. Icahn has aquired companies before), and they intend to run new company to make use of NOLS. Theoretically, the entire NOL space can be used to bring BBBYQ shareholders into the game of e.g. TEDDY, for up towards $1.6b, and the equation still holds net positive. Note, im not saying this will happen - im saying this is a way to make sense of playing BBBY estate right now in a way that keeps everyones presumed interests intact. Whoever is bondholder, gets proportionate share of new company, that will to BBBY´s job in entirely slimmed and trimmed fashion, you bring shareholders with you, and you have 100% exposure to entire squeeze play scenario. Ch11 killed off the dead meat, that was it.\n\n\nIf one would want a onestop destination, pertaining to e.g. baby shit, this is a \"simple\" way to do it. Or am i misunderstanding something?", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/BBBY/comments/14pf93x/bed_bath_beyond_and_buybuy_baby_stores_remain/", "time": 1688381074.0, "subreddit": "r/ThePPShow", "title": "\"Bed bath &amp; beyond and buybuy BABY stores remain open to serve you\". Wat mean?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/dmrxuihi4618MSgiX0SixtNfytGe98N7-ATYbSCcHo4.jpg\"/></div>"},
{"username": "PrayToChrist777", "url": "https://i.redd.it/5mhjo2ca119b1.gif", "time": 1688074994.0, "subreddit": "r/ThePPShow", "title": "I dont think RC forgets. We will see his cards in less than 10 days.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/5mhjo2ca119b1.gif\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/14lwd0p/is_there_new_timeschedule_for_bbb_splitsale/", "time": 1688017065.0, "subreddit": "r/ThePPShow", "title": "Is there new timeschedule for BBB split-sale?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yo bros. Extreme cheers for what happened yesterday, madass respect to Holly and the others - i am vey thankful. Now, is there a new timeframe for what happens with BBB sale? I gather Overstock makes announcement 8.30 AM but that is for the BBBY-ip shit, right?</p>\n\n<p>Also ps, fun story. I was praying the rosary ysterday during the trial for the intention of saving BBBY. When i get back, Glenn is talking his usual blahblah. He said that BBBY is more or less fucked, and that all that remains is a &quot;hail mary&quot;. Two hours later he is rekt. Just saying :D</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/14ffcig/expectations/", "time": 1687371868, "subreddit": "r/ThePPShow", "title": "Expectations", "text": "If the accepted BBBY offer is not the biggest disappointment so far this year, we are making progress.\n\n\nFurther, the big fish here is BBB sale.\n\n\nI fully expect this to be, as per usual, total and utter garbage, such that all DD will seem like fairy tales. We will then have to wait for BBB sale. Copium will be had. Then the disappointment will be repeated. Realistically, so far BBBY has been laser-precise in delivering the most heart-crushing news at worst possible times, every time. \n\n\nEither this is to maximize upside potential in M&A. Or, we have been played from beginning to end. \n\n\nIf we see even a little green today, i will party hard. The conclusion of this shit episode of my life is very near. Hoping for sunshine, always, but expecting pure diarrhea and worse. Thanks.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/14ffcig/expectations/", "time": 1687371868.0, "subreddit": "r/ThePPShow", "title": "Expectations", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/148fniy/are_people_retarded_overstock_big_is_huge/", "time": 1686663377.0, "subreddit": "r/ThePPShow", "title": "Are people retarded? Overstock big is huge.", "text": "<!-- SC_OFF --><div class=\"md\"><p>All know that BBB is the crown jewel. Difficulty would be selling BBBY related shit, and/or getting a price for BBB that is &gt; outstanding debt.</p>\n\n<p>In comes OS. Massive balls. GME talked about NFT divvied for two years, but OS DID NFT divvie 2020. </p>\n\n<p>So they solve biggest problem; majority of debt gone, with BBB left. BBB valued at &quot;billions&quot; by RC in the letter. </p>\n\n<p>There are bidders interested in BBB, maybe even as ongoing concern. If you take Ryan&#39;s &quot;billions&quot; and divide by outstanding shares (117m/428m), that gives an idea of WORST case price per share. Ok so that&#39;s worst case. </p>\n\n<p>As for best case:</p>\n\n<p>There has been ONE squeeze by NFT divvie in this galaxy, and it&#39;s by OS. Now they are coming for BBBY. With even a worstcase, no squeeze scenario, that is still livable. </p>\n\n<p>Shape up folks. This is not about $21m, how can one be that stupid?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/145rgjl/can_i_get_tldr_for_golden_retriever/", "time": 1686374763.0, "subreddit": "r/ThePPShow", "title": "Can I get TLDR for Golden Retriever?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Guys, sorry but I&#39;m retarded and don&#39;t get these big words. Can someone explain very simply what has happened last 12 hours? I don&#39;t get shit but it seems like something has happened.</p>\n\n<p>EDIT:</p>\n\n<p>I am reffering primarily to this:\n&quot;Docket 676. Lazard Freres just got court approval for their engagement letter with BBBY to carry out a financial transaction, and it got approval two days before the stalking horse deadline&quot;</p>\n\n<p>Why are people so hyped about this? Lazard Freres &quot;may&quot; carry out a financial transaction. What would be the end of this transaction, is it one dollar to buy an icecream, or wtf is it? Why are people so hyped?</p>\n\n<p><strong><em>Am i getting this right:</em></strong> Lazard Freres will get $15m onetime, and $200k per month, until they have completed the process of selling BBBY. There is a confidentiality agreement. Does it mean that there is a deal between debtors and creditors, and only that Lazard Freres will execute the practicalities of it, <strong><em>or</em></strong> does it mean that in the eventuality that there is a deal to be carried out, Lazard Freres will execute it? What is everyone so hyped about? Sorry this is a genuine question, no troll, i am literally this stupid.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/13j3pld/if_something_is_up_whats_the_timeframe_can/", "time": 1684239834.0, "subreddit": "r/ThePPShow", "title": "If something is up, whats the timeframe? Can, theoretically, a buy be confirmed and announced today?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "PrayToChrist777", "url": "https://i.redd.it/9v8eyzzaezza1.jpg", "time": 1684150432.0, "subreddit": "r/ThePPShow", "title": "Changed date for court? 31 May instead of tomorrow? Can someone look at this, found on interwebs.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9v8eyzzaezza1.jpg\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/13fgg82/is_pultes_reddit_acc_confirmed_real_pulte/", "time": 1683885163.0, "subreddit": "r/ThePPShow", "title": "Is Pultes Reddit acc confirmed real pulte?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/135slwf/what_happens_when_bbbyq_is_awarded_tpubgmer_at/", "time": 1683044399.0, "subreddit": "r/ThePPShow", "title": "What happens when BBBYQ is awarded TPUB/GMER at 100:1 ratio, and there is not enough TPUB/GMER to award?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/133m941/can_delisting_be_cancelled/", "time": 1682852522.0, "subreddit": "r/ThePPShow", "title": "Can delisting be cancelled?", "text": "<!-- SC_OFF --><div class=\"md\"><p>As topic, can the delisting for May 3rd be cancelled and called off? I know the delisting is caused by ch11, but if BBBY said on sun, mon or tues that it has a buyer or w/e and is no longer in ch11, can that mean that delisting is called off?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/131rl38/is_the_cause_of_delisting_only_being_under_1_does/", "time": 1682688080, "subreddit": "r/ThePPShow", "title": "Is the cause of delisting ONLY being under $1? Does that mean, if BBBY gets over $1 in coming days, delisting is called off?", "text": "As topic, honest question:\n\nIs the cause of delisting ONLY being under $1? Does that mean, if BBBY gets over $1 in coming days, delisting is called off? Does this happen automatically, and does it suffice for BBBY to be over $1 per share for one second, or one hour, or one day, or does it have to be over $1 at May 3rd, or how does this shit work?\n\nThankful for any answer.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrayToChrist777", "url": "https://www.reddit.com/r/ThePPShow/comments/130hunp/reasons_to_buy_bbby_before_delisting/", "time": 1682593003.0, "subreddit": "r/ThePPShow", "title": "Reasons to buy BBBY before delisting?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello, sorry if this question is stupid, but it is nevertheless sincere.</p>\n\n<p>I wonder what reasons there would be,if any, for e.g. Newell or others, to acquire BBBY prior to the delisting? Would there be any benefits to scooping it up now, or announcing deal now, rather than after delisting?</p>\n\n<p>Icahn seems like the kind of guy who probably likes to cause ruckus, and probably hate short gang as much as we do, but he does not appear to me like a santa claus. If it is more beneficial for him to proceed when this shit is on pink sheets, why wouldnt he? Now, would it be more beneficial for him?</p>\n\n<p>Thankful for any answer.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]