[{"username": "PreciseLot", "url": "https://www.reddit.com/r/ThePPShow/comments/176ix1z/if_the_prophecy_is_true_why_would_anyone_sell/", "time": 1697148276.0, "subreddit": "r/ThePPShow", "title": "If the prophecy is true, why would anyone sell?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I know all of us in here have different situations and are at different stages of our lives. Some younger ones haven’t seen 6 or 7 figures in a bank account and some older ones have that amount sitting in debt. I’m not here to to give any financial or investment advice but if papa Cohen or Icahn are involved why the fuck would you sell these shares.</p>\n\n<p>I’ve thought about that situation a million times, the stock squeezes to 3-5 figures and I’ve got a multimillion dollar position in a stock. Now what?</p>\n\n<p>Do I sell? Then…. Buy a nice house and invest the money… into what? S&amp;P500?</p>\n\n<p>Why would I do that when I’ve got a perfectly good company right here that’s completely against corruption and looks after its shareholders. The investment is done. RC is all about long term investment &amp; growth, nothing about him says he’s planning an overnight success and he’s made that clear. Because of this I’m 100% sure that whoever is holding this stock is not going to get fucked over.</p>\n\n<p>If he’s involved and this pops we’ll all see crazy numbers in our investment accounts but it’s not a casino, you don’t just cash out and that’s you done. You’ll need some sort of asset to generate income &amp; grow your funds over the years, that’s either going to be a property portfolio, stock portfolio or a business.</p>\n\n<p>Business and property are good but when you’re in them you’re still just looking for somewhere to park your money and generate true passive income, once you cash out, that could be you unable to get back in at that price point. That genuinely scares me.</p>\n\n<p>For all I know we could all be fucked already and left for dead. But if the short destroyers are involved, I ain’t fucking selling shit.</p>\n\n<p>Also PP and the boys are doing a great job. Really good energy in this sub.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]