[{"username": "PrestigiousComedian4", "url": "https://www.reddit.com/r/ThePPShow/comments/17wg15b/fairtale_dialogue_between_pp_and_a_shill/", "time": 1700115710.0, "subreddit": "r/ThePPShow", "title": "Fairtale Dialogue between PP and a Shill", "text": "<!-- SC_OFF --><div class=\"md\"><p>This fictional dialogue is meant purely for entertainment and humor, with an unexpected twist at the end. I also received help from GPT in creating this.  I don&#39;t cook the books like fucking shorts do.  Hope you all enjoy it and that it&#39;s not a FTD. </p>\n\n<p><strong>Part 1: Skeptical Investments and Hidden Agendas</strong></p>\n\n<p><strong>Shill</strong>: Trust me, investing in BBBYQ was like throwing your money into a black hole.</p>\n\n<p><strong>PP</strong>: Oh please, you just don’t want the stock to make a come-back because you&#39;ve got your own dirty little game going. </p>\n\n<p><strong>Shill</strong>: You think you know everything, don&#39;t you?  That stock is dead in the water. I&#39;ve done my research.  It’s worthless!! It went to 0. Let me repeat myself.  IT’S WORTHLESS.</p>\n\n<p><strong>Part 2: The Accusations and the Comeback</strong></p>\n\n<p><strong>PP</strong>: (smirks) Aren’t you the one with the “big naked secret”?  Betting against a comeback is a rookie&#39;s move.  You sure you got this all figured out?</p>\n\n<p><strong>Shill</strong>: Keep smirking. Only a fool would hold onto hope for that train wreck of a company. I bet you people believe the world is flat too!</p>\n\n<p><strong>PP</strong>: How many times have we talked about this already!!  Let me be clear with you. It’s only Daniel who thinks that around here. NO ONE ELSE.   <em>Thank youuuuu.</em></p>\n\n<p><strong>PP</strong> (after catching his breath): Let&#39;s get back on topic now.  Perhaps, just, just maybe…I figured something out. Or maybe everyone knows something about you.  Do you remember the exceedingly high volume of shares traded before the shares were “recalled”. Where did they all come from? Not naked shorting, riiiiight?! (winks) </p>\n\n<p><strong>Shill</strong>: (dismissively) I have nothing to hide!  You just threw good money after bad.  It&#39;s sad, really.  Your shares are worthless!! THE SHARES ARE WORTH NADA, NOTHING!</p>\n\n<p><strong>Part 3: Market Shock and Schadenfreude</strong></p>\n\n<p><strong>(Suddenly, the news anchor on TV announces that the stock is back on the NYSE and has begun to squeeze.)</strong></p>\n\n<p><strong>TV Anchor</strong>: Breaking news!  There&#39;s an unexpected twist in the stock market as BBBYQ makes a comeback by relaunching its shares under the new ticker symbol BUTTFQ on the NYSE, and the stock price is soaring!</p>\n\n<p><strong>PP</strong>: (pointing at the screen, grinning) Look at that!  What was that you were saying about dead in the water earlier?</p>\n\n<p><strong>Shill</strong>: (face paler than mayo, fuming) This can&#39;t be happening.  There must be some mistake - some temporary glitch.</p>\n\n<p><strong>PP</strong>: (mockingly) Aww, look at you. Do you need a tissue? I promise it’s not <em>synthetic</em>.</p>\n\n<p><strong>Shill</strong>: This isn&#39;t over and I don’t need your fucking tissue! There&#39;s no way they can pull off a recovery like this!</p>\n\n<p>PP: (shaking his head, chuckling) For someone so confident, you sure didn&#39;t see this coming, did you?</p>\n\n<p><strong>Part 4: The Twist of Fate</strong></p>\n\n<p><strong>(At that moment, the FBI bursts into the bar.</strong>  <strong>The shill staring in disbelief, the agent approaching)</strong></p>\n\n<p><strong>FBI Agent:</strong> Are you uhh, the Shill in Shambles?</p>\n\n<p><strong>Shill</strong>: (stammering, completely caught off guard) What, what’s this about? </p>\n\n<p><strong>FBI Agent</strong>: (Flashing badge) You&#39;re under arrest. Allegations of domestic assault with a... bedpost, was it? Your wife&#39;s boyfriend gave us quite the statement.</p>\n\n<p><strong>PP</strong>: (laughing) Well, isn’t this a plot twist?  I didn’t know this was a part of your “hands on” asset management strategy.  I thought they’d get you for all of your alleged naked shorting.</p>\n\n<p><strong>SHILL</strong>: (Stands up in disbelief, his distress replaced by fear)* No, no, no!  You’ve got it all wrong!  This is a setup!  I’m going to call the SEC right now!!!</p>\n\n<p><strong>FBI AGENT</strong>: They’re uh a little busy right now at the computer.</p>\n\n<p><strong>PP</strong>: Well there you have it! Fuck around and find out!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "PrestigiousComedian4", "url": "https://www.reddit.com/r/ThePPShow/comments/14xrp2d/only_horse_in_the_race_a_guide_to_cancelled/", "time": 1689175671.0, "subreddit": "r/ThePPShow", "title": "Only Horse in the Race: A Guide to Cancelled Auctions", "text": "<!-- SC_OFF --><div class=\"md\"><p>There was a comment by <a href=\"/u/cookiesandwich\">u/cookiesandwich</a> that gave me a lot of hopium 5 days ago.  Here it is as well as the direct link to the comment:<br/>\n<a href=\"https://www.reddit.com/r/BBBY/comments/14t5ae2/comment/jr0nzhs/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/BBBY/comments/14t5ae2/comment/jr0nzhs/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n\n<p>&quot;Guys, the auction process is a backup to the bidding. Bidding order states if no successful bids then it goes to auction. They could ONLY have cancelled the auction if there was a successful bid. This is Ch. 11 BKY, not the wild fucking west where you just don&#39;t follow Ch 11 plan orders.</p>\n\n<p>WAGMI&quot;</p>\n\n<p>I believe him and still do.  I double checked his work and stumbled upon this article here from a legitimate source:</p>\n\n<p><a href=\"https://www.wardandsmith.com/articles/the-section-363-sale-process-buying-assets-from-a-bankrupt-company\">https://www.wardandsmith.com/articles/the-section-363-sale-process-buying-assets-from-a-bankrupt-company</a>  </p>\n\n<p>In the <strong>Sale Process</strong> section contained within the <strong>4th paragraph</strong>, you will see the following:</p>\n\n<p>&quot;Once the court approval is obtained, notice has been provided, and bidding closes, the auction is held.  The debtor selects the highest and best bid at the auction.  <strong>If there are no bidders for the assets other than the stalking horse bidder, the auction is cancelled and the stalking horse bidder is the successful bidder.&quot;</strong>  </p>\n\n<p>I know this is redundant but sometimes regards need reassurance.  BULLISH</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]