[{"username": "Pumpkin_Chance", "url": "https://www.reddit.com/gallery/16oo3yo", "time": 1695322762.0, "subreddit": "r/ThePPShow", "title": "Information of Freetrade ISA Holders UK", "text": "<!-- SC_OFF --><div class=\"md\"><p>Following a failed attempt to move my Freetrade ISA shares to IBRK that I initiated on Wednesday, Freetrade came back to me today (after I chased them up) to say there wouldn&#39;t be enough time to move the shares over before Monday, and have still not responded to why our deadline doesn&#39;t meet further out deadlines set by Drivewealth (the custodian of our shares).</p>\n\n<p>After personally trying everything I could this week to see if we (the holders) had a way out of Freetrade, it would appear (unless something changes tomorrow) that we&#39;re being locked in for position liquidation on/the end of September 25th.</p>\n\n<p>I&#39;m applying pressure from all angles with them currently and I will try to provide updates were I can if anything changes but I just wanted to point something out.</p>\n\n<p>We received a notification on the 3rd of May to say our shares could be moved to a GIA account following the OTC/delisting, but...</p>\n\n<p>After contacting them today, following the message they sent out to GIA holders (which stated they could hold upto the 13th of October) it is not a possibility to move shares from an ISA to a GIA account - i find this a little strange...</p>\n\n<p>I&#39;ve logged a formal complaint with them but I doubt that will change anything.</p>\n\n<p>See pictures for reference to what I&#39;m talking about, I will try to provide an update should anything change at my end that anybody else isn&#39;t anyway of.</p>\n\n<p>Moving forward I plan to remove all GME shares from them and transfer to IBRK, followed by a cancellation of my membership (this is my personal choice)</p>\n\n<p>Feel free to apply pressure to them on your own behalf (if thats how you feel) based on the issue surrounding ISA/GIA accounts as I&#39;m sure this would help all of our cases.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/5ZZ7RTE2NFMcPoQGaH_x52NI4fQknHjLY9Sf48DBiVU.jpg\"/></div>"},
{"username": "Pumpkin_Chance", "url": "https://www.reddit.com/r/ThePPShow/comments/16k5hvx/where_to_buy_in_uk_stuck_in_freetrade/", "time": 1694864739.0, "subreddit": "r/ThePPShow", "title": "Where to buy in UK!? (Stuck in freetrade)", "text": "<!-- SC_OFF --><div class=\"md\"><p>Does anybody have a way of buying and securing shares from UK while we&#39;re in the expert market? Im trapped in freetrade with 8k shares. Cant transfer, cant drs and cant buy anywhere to my knowledge. Freetrade will liquidate my position at market open on Monday the 25th of September!</p>\n\n<p>-70% at the minute, hoping for a miracle next week.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]