[{"username": "Puzzleheaded_Log5241", "url": "https://i.redd.it/hmzyn6wckwzb1.jpg", "time": 1699788651.0, "subreddit": "r/ThePPShow", "title": "GME on German Market...new stock?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Maybe something...maybe nothing.  Says GME New class A common stock.  No news released...this ready to drop soon?  Someone smarter than me needs to look at this</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/hmzyn6wckwzb1.jpg\"/></div>"},
{"username": "Puzzleheaded_Log5241", "url": "https://www.reddit.com/r/ThePPShow/comments/17pc3gc/bear_trap/", "time": 1699302272.0, "subreddit": "r/ThePPShow", "title": "Bear trap?", "text": "<!-- SC_OFF --><div class=\"md\"><p>One thing I learned throughout this play is they are continually reloading this bear trap.  I&#39;m now 100 percent convinced Overstock is part of it.  Wast Furlong news released on earnings day?  Now Overstock CEO stepping down today.  We know this market is driven by algorithms.  So release &quot;bad&quot; news and BYON is being shorted down on a day when it should be rising with its move to NYSE.  Someone smarter than me may can figure it out..They are purposefully resetting the bear trap in my opinion.  Seems super bullish to me!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Puzzleheaded_Log5241", "url": "https://www.reddit.com/r/ThePPShow/comments/16mchf4/non_voting_shares/", "time": 1695083812.0, "subreddit": "r/ThePPShow", "title": "Non voting shares?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just talking out loud here.  Wrinkles, is it possible that the initial share conversion ftom loyal BBBYQ shares to &quot;non voting&quot; shares are initially issued to original owners of the new company &quot;Teddy&quot;.  Technically non voting shares could have other values.....ie the ability to receive dividend distribution. Any new shares issued after will be common shares.  Ryan Cohen loves Coke.  Coke pays dividends.  Berkshire Hathaway owns ALOT of coke shares BUT Berkshire does not pay dividends.  Is this the only shot that loyal shareholders will be given dividend stock. If you sell it, it&#39;s gone forever and converts to common shares?  Tbe FOMO and investing crowd will be buying Common shares.  Basically Teddy takes care of loyal shareholders of BBYQ and their newly reissued shares are non voting shares because they receive dividend. Which could kinda be like profit sharing.  Imagine getting a piece of the NFT market, GME, (fill in any other company that Teddy acquires) almost like profit sharing!  Just a tin foil thought.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Puzzleheaded_Log5241", "url": "https://www.reddit.com/r/ThePPShow/comments/15afhwu/pulte_and_announcement/", "time": 1690400326.0, "subreddit": "r/ThePPShow", "title": "Pulte and announcement", "text": "<!-- SC_OFF --><div class=\"md\"><p>Pulte would never go on PP show before because of his involvement in BBBY.  Well he is coming on at 8 PM,,,he specifically asked for that time.  What time does after hours end...oh yeah 8 pm.  Prediction announcement made before 8 PM...Maybe 5? Is that why Protocal Gemini tweeted that?  Buckle up and see yall on other side,!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Puzzleheaded_Log5241", "url": "https://bedbathandbeyond.gcs-web.com/node/16941/html#toc", "time": 1689329986.0, "subreddit": "r/ThePPShow", "title": "How can TSO be shrinking?", "text": "<!-- SC_OFF --><div class=\"md\"><p>If preferred stocks and warrants from February offering by Riley aren&#39;t getting exercised... They have to hold 200% reserve shares for unexercised Preferred Stock and 100% for warrants.  This is how the TSO shrinks</p>\n</div><!-- SC_ON -->", "preview": ""},
{"username": "Puzzleheaded_Log5241", "url": "https://uspto.report/TM/97185420", "time": 1688185579.0, "subreddit": "r/ThePPShow", "title": "Dumb boomer solves reason for delay on auction", "text": "<!-- SC_OFF --><div class=\"md\"><p>Ok....50 year old crayon eating boomer here but I think I figured out two things.  What the &quot;work or leave&quot; tweet is about and why delay.  Remember when all the Teddy trademarks and parents were submitted.  Well after looking them over the earliest submittals from 12-22-2021 HAVE NOT been approved.  In fact Teddy Holdings LLC submitted for an extension on January 18th 2023.  The extension is good for 6 months which means it expires July 18th.  I believe they can do 5 six month extensions....someone dropped the ball and did not complete the Intent to use!  Auction postponed until all trademarks and patents are completed.  Looks like the patent attorney dropped the ball.  I think baby has already been acquired and they wont launch until all trademarks and patents are completed!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://uspto.report/TM/97185420/mark.png\"/></div>"},
{"username": "Puzzleheaded_Log5241", "url": "https://www.reddit.com/gallery/14m89p5", "time": 1688053246.0, "subreddit": "r/ThePPShow", "title": "Ok folks searched Ryan cohen on baby website", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Puzzleheaded_Log5241", "url": "https://www.reddit.com/gallery/14m89p5", "time": 1688053246, "subreddit": "r/ThePPShow", "title": "Ok folks searched Ryan cohen on baby website", "text": "Bored and decided to search Ryan Cohen on buybuybaby website...Look at this shit.  Someone explains why this pops up?", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/bN4CseRSPXObkVkzyLf27M8sOb0_EnXvP6Aq_wS9pGE.jpg\"/></div>"}]