[{"username": "pwning_shills", "url": "https://www.reddit.com/r/ThePPShow/comments/17xm22f/we_have_been_given_reason_to_believe_the_work_is/", "time": 1700247033.0, "subreddit": "r/ThePPShow", "title": "We Have Been Given Reason to Believe the Work is Done.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I think we are at the precipice of a big reveal and it&#39;s either a one or a zero. We are either getting equity or we are not. </p>\n\n<p>I listened to <a href=\"https://www.reddit.com/user/RealPulte/\">u/RealPulte</a> on the Spaces call last night and in mixed company he definitely publicly distanced himself from us and I know you all heard it. I understand that he was put on the spot publicly and said what was necessary at the time but the fact remains.</p>\n\n<p>Many of you were watching as <a href=\"https://www.reddit.com/user/RealPulte/\">u/RealPulte</a> live streamed the PPShow from his office and proceeded to EAT FUCKING ICE CREAM with everyone? We all know what that is supposed to mean including Pulte. The deal is done! This was instigated by Pulte himself, nobody even knew what he was doing until he showed up on camera with a spoon and carton of ice cream. Then he flew all the fellas around in his private jet? Something is off.</p>\n\n<p><a href=\"https://preview.redd.it/2o4ln5cxby0c1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=669e39eabfc740334a54305b23d02fb2d9c33524\">Pulte Eating Ice Cream On the PP Show!</a></p>\n\n<p>Think what you want but in my opinion to encourage this gesture only later to say he doesn&#39;t have any info whatsoever? Like PP says, I&#39;M NOT BUYING IT! Pulte knows what that gesture meant just like the rest of us. If we end up getting skunked after all that has transpired he will have a creditability problem no matter what in the end.</p>\n\n<p>And in my opinion we have reached that end. </p>\n\n<p><a href=\"https://preview.redd.it/fg4bl92acy0c1.jpg?width=2409&amp;format=pjpg&amp;auto=webp&amp;s=b931574010171846f947a5f362a6383a53d48277\">Celebrating a job Well Done.</a></p>\n\n<p>BABY stores are open both online and brick &amp; mortar. The lawyers have all submitted their final invoices to the court for approval and they have been approved. The Teddy books point to Thanksgiving being made great again which is next week. It&#39;s either happening or it isn&#39;t and we will know by Thursday morning which one it is.</p>\n\n<p><a href=\"https://preview.redd.it/czfhfqdicy0c1.jpg?width=1893&amp;format=pjpg&amp;auto=webp&amp;s=9d524f3c64909f5f38ab647993f3fbd6d93465ad\">Teddy Buying Thanksgiving Dinner With All His Tendies.</a></p>\n\n<p>Unless new information comes to light soon our fate will be decided over the next six days and there is no getting around that reality. If we are left to think the tinfoil hype is real, or put our belief in the mountains of DD presented over the past year an half then we have arrived at that moment.    </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/jZykr9K5v2_hZCe-t8q9HIPQthMrD2Fm_Ps-alWT4uQ.jpg\"/></div>"},
{"username": "pwning_shills", "url": "https://www.reddit.com/r/ThePPShow/comments/17qpll8/what_is_the_10b_for_with_bbby_debt_now_sitting_at/", "time": 1699461410.0, "subreddit": "r/ThePPShow", "title": "What Is the $10B for? With BBBY debt now sitting at about $1B, Why Was There a Cash Injection Of $10B? Or Was it Just a \"Glitch\" or \"Mistake\"", "text": "<!-- SC_OFF --><div class=\"md\"><p>Remember this photo?</p>\n\n<p><a href=\"https://preview.redd.it/nnkf7wjvh5zb1.png?width=1396&amp;format=png&amp;auto=webp&amp;s=42a5fe31216482bfc34ea29761e0cd67ef6a8178\">BBBY is Now the \\&quot;Parent\\&quot; Company of BEYOND</a></p>\n\n<p>What is a parent company?  A parent company is <strong>one which has a controlling or majority interest in another company, which gives it the right to control the subsidiary&#39;s operations</strong>.  </p>\n\n<p>What this means &quot;we&quot; (BBBY) have already acquired Overstock (BEYOND) and that $10B in cash went towards the purchase of Overstock (BEYOND).</p>\n\n<p><a href=\"https://preview.redd.it/lvzt9f3ii5zb1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=03ebd14c216e7c0c70b33af8f0f02d9398c313b6\">BBBY Used the $10B to Purchase BEYOND</a></p>\n\n<p>I surmise the deal has to go down this way in order to preserve the NOLS. This is a huge transaction in its own right. We also have the BABY spin off to look forward to as well. What do you guys think? </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/FfW-RZdsBLUAIk-q_Tmo_BTiiI-s46cSt5hIb36Lt3c.jpg\"/></div>"},
{"username": "pwning_shills", "url": "https://www.reddit.com/r/ThePPShow/comments/176fe16/this_is_screenshot_of_an_email_sent_to_a_td/", "time": 1697139333.0, "subreddit": "r/ThePPShow", "title": "This is Screenshot of an Email sent to a TD Ameritrade Account Holder. I think Charles Schwab and TD Ameritrade Let the Genie Out of the Bottle Early.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Which has left the rest of the brokers in a mad scramble to put the Genie back in! It was the day after this that the OCC sent their memo. </p>\n\n<p>Most of these types of messages are automated and systemic. Did this one get through before they could change it due to the Schwab/TD merger? If you recall Schwab was also the broker who leaked the $25 rumor. All the emails about this </p>\n\n<p>If you have ever worked for a large company going through a merger you know it&#39;s a clusterfuck while they are trying to integrate systems etc.. I could see them easily miscommunicating or forgetting to kill this email before it went out as a result of their internal systems not being fully integrated. </p>\n\n<p>Wonder what <a href=\"/u/Region-Formal\">u/Region-Formal</a> thoughts are but would love to hear from anyone else as well. Also what does <strong>$FZC</strong> mean in this context? I have been sitting on this for a while but think it may be good to discuss now. </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "pwning_shills", "url": "https://www.reddit.com/r/ThePPShow/comments/16ojg6n/is_doug_cifu_of_virtu_capital_the_real_mastermind/", "time": 1695311542.0, "subreddit": "r/ThePPShow", "title": "Is Doug Cifu of Virtu Capital the Real \"Mastermind\" Behind the Meltdown Subs?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/aST8T-bz1BX_F0zK_9olrbcPIos1JSV2bBBN6jobH7U.jpg\"/></div>"},
{"username": "pwning_shills", "url": "https://www.reddit.com/r/ThePPShow/comments/16irwk2/is_jp_morgan_the_real_reason_for_all_this_fuckery/", "time": 1694720816.0, "subreddit": "r/ThePPShow", "title": "Is JP Morgan The Real Reason For All This Fuckery?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "pwning_shills", "url": "https://www.reddit.com/r/ThePPShow/comments/15loe2c/has_bad_actors_on_the_board_made_drsing_look/", "time": 1691515323.0, "subreddit": "r/ThePPShow", "title": "Has Bad Actors On the Board Made DRS'ing Look Sketchy By Design? Quoting u/Ultrabarrel on DRS: \"It is likely that if your shares aren’t drsed you can end up in a situation like our German friends.\" Based off of the amount of shilling going on pertaining to this topic maybe it's time to reconsider?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just some context -- Last December, I took a small position in MMTLP, now worthless and sitting in my brokerage account with a new dummy cusip#. This happened because the transfer agent already had accounted for all the recorded total shares outstanding and would not take anymore shares. As far as they were concerned, the books were balanced.</p>\n\n<p>This meant that any shares left were all synthetic, naked shares whether they were being held in Cede &amp; Co. or any one of the many brokers that sold the dividend. Something similar happened with the Dole deal as well.</p>\n\n<p>I understand that the trepidation with AST. When one considers the costs associated with DRS and the fact we can only sell via market order does not do much to instill confidence in the decision. Not to mention the fact the AST site has been under maintenance since April! Not receiving any real feedback that closes the communication loop between us and the transfer agent really makes it difficult to have confidence in the tactic. Could all of this passive resistance be by design?</p>\n\n<p>After reading <a href=\"/u/Ultrabarrel\">u/Ultrabarrel</a> thoughts on what just transpired in Europe and taking into consideration the historic behavior of our opponent I now think DRS may be the only real way to protect our investment.</p>\n\n<p>What if there are folks on the board that are indeed bad actors as many have suggested? Maybe they have worked to purposely create a perception that DRS with AST is sketchy by design? Maybe all of this clunkiness was manufactured in order to deter us from doing it? </p>\n\n<p>Why would they do that? Because they don&#39;t want us to do it! As a matter of fact as I am writing this I feel more and more this is the case which has compelled to DRS 85% of my shares. Our opponent(s) are going to play dirty, I can feel it in my plums.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "pwning_shills", "url": "https://www.reddit.com/r/ThePPShow/comments/15ko8pb/new_docket_1848_engagement_letter_between/", "time": 1691422816.0, "subreddit": "r/ThePPShow", "title": "New Docket #1848 - Engagement Letter Between Deloitte Tax LLP and BBB RE: \"tax matters arising in connection with Clients debt restructuring\". Look at the scope of the work on pages 87-88 (see image) with specific terms i.e. bankruptcy emergence transaction and use of net operating losses (NOLS)!", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>Bullish!</strong></p>\n\n<p><a href=\"https://preview.redd.it/pc0p04a70qgb1.png?width=1240&amp;format=png&amp;auto=webp&amp;s=4c949c4445ef8666b2ad639ead97355be3143ffa\">https://preview.redd.it/pc0p04a70qgb1.png?width=1240&amp;format=png&amp;auto=webp&amp;s=4c949c4445ef8666b2ad639ead97355be3143ffa</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/xi6Gl0sSJvA_3zLIJje8KyTCKBG98V8I1VdVT0j-CbA.jpg\"/></div>"}]