[{"username": "Qweiopakslzm", "url": "https://www.reddit.com/r/ThePPShow/comments/17rk25y/in_regards_to_the_wealthsimple_sellsellbuy/", "time": 1699555886.0, "subreddit": "r/ThePPShow", "title": "In regards to the WealthSimple SELL/SELL/BUY transactions:", "text": "<!-- SC_OFF --><div class=\"md\"><p>Tried to get as much information as I could... If there&#39;s anything interesting in the follow up from the corporate actions team, I&#39;ll be sure to add. Here you go:</p>\n\n<blockquote>\n<p>AGENT (*****): Hi there! I&#39;m ***** from the Wealthsimple team. Thanks for reaching out!  </p>\n\n<p>How can I help you today?   </p>\n\n<p>USER: Hey *****   </p>\n\n<p>USER: I just had a question about my October statement   </p>\n\n<p>AGENT (*****): I&#39;m happy to take look. To verify your identity I&#39;ve just sent a security code to your phone via text message. Can you please confirm that code for me?   </p>\n\n<p>USER: Sure thing - *****   </p>\n\n<p>AGENT (*****): Thank you for confirming, *****.   </p>\n\n<p>USER: It&#39;s in regards to BBBYQ - I understand that they&#39;re still going through their ch.11 restructuring bankruptcy, and that WS received notice from the transfer agent that the shares are worthless, null, void, etc...   </p>\n\n<p>USER: The last I checked, the shares were recalled back to the DTCC   </p>\n\n<p>AGENT (*****): Yes, BBBYQ shares were withdrawn and deleted by the depository. We have not received any information after the event yet.   </p>\n\n<p>USER: But in my October statement, I can see two different SELL transactions, and one BUY transaction for the full amount of 5,000 shares   </p>\n\n<p>AGENT (*****): We are still waiting for guidance from the issuer.   </p>\n\n<p>USER: I didn&#39;t authorize any selling of shares - why is that showing?   </p>\n\n<p>AGENT (*****): Please give me a moment to review your statement and I can confirm   </p>\n\n<p>USER: Thanks :)   </p>\n\n<p>AGENT (*****): Hi ***** thank you for your patience.   </p>\n\n<p>AGENT (*****): Sorry for the delay   </p>\n\n<p>AGENT (*****): I think it will take more time for me to find a complete answer for you. Would it be alright if I follow up with you via email following this chat?   </p>\n\n<p>USER: No problem!   </p>\n\n<p>USER: I&#39;d rather stay on the line if at possible - it&#39;s easier that way as I&#39;ll probably have follow-up questions   </p>\n\n<p>USER: I&#39;m happy to wait   </p>\n\n<p>AGENT (*****): I have asked my corporate actions team for further clarity. They usually respond before end of day.   </p>\n\n<p>USER: Okay... The main concern is that, when the shares were &quot;deleted&quot; from my account, I was told that there would still be a record of them attached to my name. I&#39;m worried that with this SELL transaction, that may no longer be the case   </p>\n\n<p>AGENT (*****): Even though it&#39;s denoted as a sell, we do have a record of this corporate action   </p>\n\n<p>AGENT (*****): It&#39;s recorded within the system that this was due to a mandatory corporate action.   </p>\n\n<p>USER: 2nd, why are there two SELL transactions and one BUY transaction? If it was a simple deletion of shares, shouldn&#39;t there only have been one SELL transaction? Makes me concerned that the 5,000 shares that were in my account weren&#39;t actually there and that they had to be &quot;bought&quot; first before going back to the DTCC   </p>\n\n<p>USER: &quot;Even though it&#39;s denoted as a sell, we do have a record of this corporate action&quot; Okay, that&#39;s good to know, thanks   </p>\n\n<p>USER: Lastly, what are the STKDIS transactions?   </p>\n\n<p>AGENT (*****): I&#39;m pretty sure that this is appearance of multiple sells and buys is just how these transactions were processed. I have reached out to my corporate actions team for more information.   </p>\n\n<p>USER: Thanks for your time, and I look forward to responses from the corp action team!   </p>\n\n<p>AGENT (*****): STDKIS transactions are activities connected to corporate actions   </p>\n\n<p>USER: What does it stand for?   </p>\n\n<p>AGENT (*****): It&#39;s how corporate actions transactions are recorded internally.   </p>\n\n<p>AGENT (*****): Well, the abbreviation stands for Stock Distribution but it&#39;s just an entry type. Not in the literal sense.   </p>\n\n<p>USER: Okay   </p>\n\n<p>USER: When your corp actions team replies, could I also request that they forward along any available notices from both the company and the transfer agent? For my own records/information   </p>\n\n<p>AGENT (*****): It&#39;s just an internal identifier entry, like &quot;DIV&quot; for dividends and &quot;NRT&quot; for Non Resident Tax.   </p>\n\n<p>AGENT (*****): Sure, I can send along the connected press releases   </p>\n\n<p>USER: That would be great - I like to be kept informed, especially with something as surprising as shares suddenly going poof and disappearing with absolutely zero communication to me   </p>\n\n<p>AGENT (*****): I understand how it&#39;s concerning. The shares were deleted by depository and this was a mandatory action.   </p>\n\n<p>USER: Oh yes, I understand that it was a mandatory action, but some effort in communication would have been nice   </p>\n\n<p>AGENT (*****): Thanks for understanding. Please let me know if there&#39;s anything else meanwhile and I&#39;ll be happy to help   </p>\n\n<p>USER: Only other question, is are you expecting any other communications/actions from the company/transfer agent?   </p>\n\n<p>AGENT (*****): We&#39;re definitely waiting for more information. Right now, we have received no further communication after the corporate action.   </p>\n\n<p>USER: Okay - so at this point it isn&#39;t a fully complete story? Do you have any idea of when to expect some more news?   </p>\n\n<p>AGENT (*****): We have no timeline yet. Court proceedings are still underway. The decision on this security is completely in the hands of the issuer. Our hands are tied in this matter.   </p>\n\n<p>USER: Totally understand   </p>\n\n<p>USER: Thanks, I appreciate your information today and I look forward to hearing more from your corp actions team! </p>\n</blockquote>\n\n<p>Only thing I found interesting was &quot;We&#39;re definitely waiting for more information&quot; and that they acknowledged that court proceedings are still underway.</p>\n\n<p>Do with this what you will!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Qweiopakslzm", "url": "https://www.reddit.com/r/ThePPShow/comments/17enlfp/another_chat_transcript_from_wealthsimple_now/", "time": 1698076136.0, "subreddit": "r/ThePPShow", "title": "Another chat transcript from WealthSimple now that they have deleted shares as well", "text": "<!-- SC_OFF --><div class=\"md\"><p>AGENT (George): Hey there! Thanks for contacting Wealthsimple, you&#39;ve reached George. How may I help you today?   </p>\n\n<p>USER: Hey George - interesting, I wonder if you&#39;re the same George I talked to on Friday? In regards to my BBBYQ shares/options   </p>\n\n<p>AGENT (George): I might be! Did you have a question about your BBBYQ shares/options?   </p>\n\n<p>USER: I did, yeah. I had 5,000 shares and a few call contracts in my account on Friday. I understand the the options obviously expired worthless, but my shares seem to have disappeared as well   </p>\n\n<p>AGENT (George): I can look into that for you. I&#39;ll just need some information to access your account. Can you provide your full name and the email address associated with your Wealthsimple profile?   </p>\n\n<p>USER: Yep it&#39;s ******, ******  </p>\n\n<p>USER: Cheers   AGENT (George): Thanks, *****! To verify your identity I&#39;ve sent a security code to the email address associated with your profile. It should arrive shortly! Once received can you please confirm the code with me?   </p>\n\n<p>USER: Sure thing: *****</p>\n\n<p>AGENT (George): Thank you! Please give me a moment to review your account. I will be back in about 2-3 minutes with an update  </p>\n\n<p>AGENT (George): I appreciate your patience here Matthew. Since the securities have been deemed worthless after Bed Bath &amp; Beyond Inc. declared bankruptcy, they have been deemed null, void, and worthless with no future payments. Since the depositories have written off and taken back these securities, we ultimately had to remove them as well.  </p>\n\n<p>AGENT (George): You can learn more about the details of these through the SEC website here <a href=\"https://www.sec.gov/cgi-bin/browse-edgar?action=getcompany&amp;CIK=0000886158&amp;owner=include&amp;count=40&amp;hidefilings=0\">https://www.sec.gov/cgi-bin/browse-edgar?action=getcompany&amp;CIK=0000886158&amp;owner=include&amp;count=40&amp;hidefilings=0</a>   </p>\n\n<p>USER: Hmm... This has never happened to me before, and I&#39;ve held shares of bankrupt companies at $0 for years. Who are the depositories in this case that have &quot;written off&quot; the shares?  </p>\n\n<p>USER: As far as I was aware (and I&#39;ve been following quite closely), this is a ch.11 restructuring bankruptcy, and not a ch.7 liquidation   </p>\n\n<p>AGENT (George): I&#39;m not quite sure but it should be on the documents in the website I just provided you.  </p>\n\n<p>AGENT (George): From the company&#39;s transfer agent &quot; Participants are advised that positions will be deleted upon confirmation of terms from the transfer agent.&quot;   </p>\n\n<p>USER: The agent I talked to on Friday said (direct quote): &quot;I&#39;ve never heard of a company or exchange asking brokerage to remove shares from a client&#39;s account. &quot;  </p>\n\n<p>USER: Is ComputerShare the transfer agent?   </p>\n\n<p>AGENT (George): Yes Computershare is the transfer agent.   </p>\n\n<p>USER: So this comes as quite a shock to me, that my shares were deleted with absolutely no warning or notification to me, the shareholder   </p>\n\n<p>AGENT (George): Oh, that&#39;s strange. I see that they have been delisted on Septemeber 29th 2023 and have declared bankruptcy on September 14th, 2023.   </p>\n\n<p>USER: Yes that&#39;s correct  USER: A chapter 11 bankruptcy that is still going through court hearings  </p>\n\n<p>USER: Can you tell me, what it ComputerShare themselves that sent the request to remove shares?  </p>\n\n<p>USER: I understand that they were declared worthless, but that doesn&#39;t mean that they can just be deleted at will - they&#39;re still my shares even if they are deemed worthless. Like I said, I&#39;ve held $0.00 shares before with no issue   </p>\n\n<p>AGENT (George): I don&#39;t have more details than this to provide I&#39;m afraid. Computershare is the transfer agent of Bed, Bath, and Beyond Inc. so it sounds like they would have worked together to remove the shares. You can find more information on the details of the filings on the website I provided you or contact the company themselves on <a href=\"https://www.bedbathandbeyond.com/contact-us\">https://www.bedbathandbeyond.com/contact-us</a>   </p>\n\n<p>USER: Okay... I&#39;d just like to know who it was that sent WS the request to delete shares   </p>\n\n<p>AGENT (George): The transfer agent, Computershare.   </p>\n\n<p>USER: Okay, thank you for confirming that   </p>\n\n<p>AGENT (George): No worries! Was there anything else I could help you with today?   </p>\n\n<p>USER: I guess that&#39;s it, thank you  </p>\n\n<p>&#x200B;</p>\n\n<p>Not a whole lot new here, but WS did confirm that it was ComputerShare themselves that sent out the notice to remove shares. One interesting phrase was &quot;Since the depositories have written off and taken back these securities, we ultimately had to remove them as well.&quot;</p>\n\n<p>Share recall, anyone???</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Qweiopakslzm", "url": "https://www.reddit.com/r/ThePPShow/comments/17cis3i/another_update_from_wealthsimple_canada_they_have/", "time": 1697828639.0, "subreddit": "r/ThePPShow", "title": "Another update from WealthSimple Canada - they have not received any instruction to delete/remove shares", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yeah yeah, it&#39;s a &quot;trust me bro&quot;, but I just got off the help chat with WS support and they confirmed that they have NOT received any instruction from the company/exchange/transfer agent to remove shares. Here you go:  </p>\n\n<p>AGENT (George): Hey there! Thanks for contacting Wealthsimple, you&#39;ve reached George. How may I help you today?   </p>\n\n<p>USER: Hi George  </p>\n\n<p>USER: Just have a couple questions about my BBBYQ shares and options contracts   </p>\n\n<p>AGENT (George): Yes of course.   </p>\n\n<p>USER: I have been seeing lots of news about brokers removing BBBYQ shares from accounts, but mine are still showing - is there a reason for this? Everything I&#39;ve heard says that they should be deleted by now  </p>\n\n<p>USER: I&#39;m wondering if WS has received any notices from the company and/or exchange about removing the shares   </p>\n\n<p>AGENT (George): BBBYQ is currently undergoing bankruptcy. Once this has been finalized and we have more news, we will be able to take further action.  </p>\n\n<p>AGENT (George): We cannot comment on other brokers I&#39;m afraid.   </p>\n\n<p>USER: Totally understand that you can&#39;t comment on other brokers, and yes I&#39;ve been following the bankruptcy hearings closely... Can you confirm that WS has not received any corporate actions to remove/delete shares?  </p>\n\n<p>USER: From the company, exchange, or transfer agent?   </p>\n\n<p>AGENT (George): I can confirm that we have not received any notice to remove BBBYQ shares from our client&#39;s accounts.   </p>\n\n<p>USER: Thanks for that. Very interesting.   </p>\n\n<p>USER: As for options - since the stock isn&#39;t trading I&#39;m guessing all of my options will just disappear by the end of the day, correct?  </p>\n\n<p>USER: They&#39;re all OTM calls    </p>\n\n<p>AGENT (George): If they are call options then they will all expire worthless by the end of the day.   </p>\n\n<p>USER: Okay  USER: Has there been any news about cash and/or share equity being distributed for the cancelled BBBYQ shares?    </p>\n\n<p>AGENT (George): The latest official news is that they are undergoing bankruptcy. We cannot comment on any other rumours for now I&#39;m afraid.  </p>\n\n<p>AGENT (George): Since they have been delisted from all exchanges, you may either hold on to those shares or write them off.   </p>\n\n<p>USER: Okay. If WS does get notice to &quot;delete&quot; the shares, will I be notified before that happens?    </p>\n\n<p>AGENT (George): I&#39;m not quite sure if we can be asked to remove the shares from your account, however, the shares are now worthless and if there will be any distributions, then we will of course, do the necessary.   </p>\n\n<p>USER: Thanks, good to know.  </p>\n\n<p>USER: One last thing: I know you can&#39;t comment on other brokerages, but if there WAS a notice from the company/exhange/transfer agent to remove shares, all brokerages should theoretically receive that at the same time, correct? Like there&#39;s no reason that other brokerages would receive notice and WS would be delayed for some reason?   </p>\n\n<p>AGENT (George): I honestly don&#39;t know. I&#39;ve never heard of a company or exchange asking brokerage to remove shares from a client&#39;s account.  </p>\n\n<p>AGENT (George): I don&#39;t see how it would serve the exchange or company and purpose since the shares are worthless.   </p>\n\n<p>USER: Agreed - plenty of bankrupt companies that people still hold $0.00 shares of  </p>\n\n<p>USER: Is there any other reason that you can think of for shares to be extinguished like that? Would it be necessary if there was a distribution of shares in a new company so that there wouldn&#39;t be &quot;duplicate&quot; shares of new/old?   </p>\n\n<p>AGENT (George): There wouldn&#39;t be a distribution of shares since they have been delisted and the company is undergoing bankruptcy. If there was a cash distribution then we would have to wait for more information from the company.   </p>\n\n<p>USER: Right, I was more thinking a distribution of shares of a new entity, not of BBBYQ   </p>\n\n<p>AGENT (George): I don&#39;t think that would happen since they are undergoing bankruptcy and not a merger or takeover.   </p>\n\n<p>USER: Right, it&#39;s a ch.11 restructuring bankruptcy though, not ch.7. Has there been notice from the company that there is 0 possibility of a merger/acquisition?   </p>\n\n<p>AGENT (George): I&#39;m not quite sure. I&#39;m not following on the details of BBBYQ but the latest official communication is that they are undergoing Chapter 11. as you mentioned and they have been delisted from all exchanges.   </p>\n\n<p>USER: It&#39;s all very confusing and unclear... I just can&#39;t understand why some brokerages are deleting shares and some aren&#39;t. Some are marking them at $0.00, but here I am looking at 5,000 shares at $0.08 in my account  </p>\n\n<p>USER: I understand I can&#39;t sell them because they&#39;ve been delisted, but I don&#39;t understand why they still have value if they&#39;ve been declared worthless. At least according to other brokers   </p>\n\n<p>AGENT (George): Yes, $0.08 was the last traded price of the stock before it was delisted. Some brokerages can show a value of $0.00 since it is securities are not being traded since they have been delisted and so are officially worthless.  </p>\n\n<p>AGENT (George): You can choose to write-off the securities if you want by submitting a form... I&#39;m not sure what policies do other brokerages have but ultimately, the end result is the same.   </p>\n\n<p>USER: I&#39;m going to hang tight still :)   </p>\n\n<p>AGENT (George): No problem! Was there anything else I could help you with today?   </p>\n\n<p>USER: That&#39;s everything - thanks for the help   </p>\n\n<p>AGENT (George): My pleasure! Thank you for reaching out and have a great rest of your day and weekend ahead!   </p>\n\n<p>USER: Are you okay if I share this on social media to help answer any questions other folks might have about the situation?   </p>\n\n<p>AGENT (George): That&#39;s up to you :)   </p>\n\n<p>USER: Cheers! Have a great weekend  </p>\n\n<p>&#x200B;</p>\n\n<p>Do with that what you will... But if a notice to delete shares was sent out by the company/exchange/transfer agent, it would have gone to ALL brokerages at the same time.</p>\n\n<p>Why are shares being deleted? Why can&#39;t people hold shares of a bankrupt company at $0.00? Who told brokers to delete these shares?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Qweiopakslzm", "url": "https://www.reddit.com/r/ThePPShow/comments/17b0aea/for_what_its_worth_i_still_have_all_of_my_shares/", "time": 1697660351.0, "subreddit": "r/ThePPShow", "title": "For what it's worth, I still have all of my shares (at $0.08) and calls in WealthSimple (Canada). It was $0.00 for a few days but it's back to $0.08 as of yesterday", "text": "<!-- SC_OFF --><div class=\"md\"><p>Do with this what you will!</p>\n\n<p><a href=\"https://preview.redd.it/oq0z21uqr0vb1.png?width=818&amp;format=png&amp;auto=webp&amp;s=e77d8de382a3605769e13c1cab8d4e93cbeb97ea\">https://preview.redd.it/oq0z21uqr0vb1.png?width=818&amp;format=png&amp;auto=webp&amp;s=e77d8de382a3605769e13c1cab8d4e93cbeb97ea</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/0pTM4IC4nsFZG-5C-zWlO5qWblWVtACSOnKklJWwmMU.jpg\"/></div>"},
{"username": "Qweiopakslzm", "url": "https://www.reddit.com/r/ThePPShow/comments/171f42u/for_what_its_worth_wealthsimple_has_not_received/", "time": 1696605677.0, "subreddit": "r/ThePPShow", "title": "For what it's worth, WealthSimple has NOT received any orders from the exchange to delete shares, ONLY to halt trading. Transcript below:", "text": "<!-- SC_OFF --><div class=\"md\"><p>AGENT (Mitch Kalins): Hello! I hope you are doing well! My name is Mitch and I am a Registered Investment Agent specialized in options trading. How can I help you today?   </p>\n\n<p>USER: Hey, good morning Mitch  </p>\n\n<p>USER: I hold stock and call options in BBBYQ - with the deletion of the ticker, what is going to happen to my shares (and options)?   </p>\n\n<p>AGENT (Mitch Kalins):  Hey Matthew, thanks for reaching out. BBBYQ is currently halted from trading and is no longer tradeable. We are awaiting the next actions from the exchange currently.   </p>\n\n<p>USER: Okay - I have seen some other brokerages that have zeroed out the value and/or changed option expiry dates to Oct 20, 2023. Is there any reason why WS hasn&#39;t made any actions yet?  </p>\n\n<p>USER: I still see 0.08/share and all my long call expiry dates   </p>\n\n<p>AGENT (Mitch Kalins): Our decision is to halt the security from trading until we have more information. If you would like more information about Bed, Bath &amp; Beyond&#39;s bankruptcy proceeding, you may click here. If you have any questions, please feel free to let us know. <a href=\"https://restructuring.ra.kroll.com/bbby/\">https://restructuring.ra.kroll.com/bbby/</a>  Additionally, if you currently hold BBBYQ Options contracts, please review the OCC website for the most recent memo (Search by Keyword - type BBBYQ).   </p>\n\n<p>USER: Oh yes I&#39;ve been keeping up on the Ch.11 proceedings :) So it sounds to me like you have received any official instructions from the company or the exchange?  </p>\n\n<p>USER: Regarding the restructuring   </p>\n\n<p>AGENT (Mitch Kalins): Yea, we only have the information from the exchange regarding BBBYQ right now. It&#39;s likely we will have to wait until the bankruptcy proceedings are complete until we will have direction for shareholders   </p>\n\n<p>USER: Awesome - I&#39;ve done the same through all of this as well. Sit tight and wait for something official. Very strange that other brokerages have already taken actions...   </p>\n\n<p>AGENT (Mitch Kalins): Yea, I can&#39;t really speak to why other brokers have done it differently, but the direction from the exchange is to halt trading.   </p>\n\n<p>USER: Halt and nothing else, got it.   </p>\n\n<p>USER: I just checked on my WS app and it looks like the call options have actually been updated to Oct 20, 2023 and have a $0 value   </p>\n\n<p>AGENT (Mitch Kalins): Oh, interesting. I guess that is the direction from the OCC for options contracts then   </p>\n\n<p>USER: (sidenote, in both the web and mobile app, it would be great if the option contract expiry date was listed right in the summary with the strike price)  </p>\n\n<p>USER: Okay, thanks very much for your clarity today! I will continue to sit tight   AGENT (Mitch Kalins): Thanks for the feedback! I&#39;ll share that with my team   </p>\n\n<p>USER: Are you okay if I share this conversation on Reddit for my fellow Canadian apes?   </p>\n\n<p>AGENT (Mitch Kalins): If you want as well. I can share a typeform that will go straight to the development team as well. Would you be interested in that?   </p>\n\n<p>USER: Sure that would be great   </p>\n\n<p>AGENT (Mitch Kalins): Perfect! Here you go:<a href=\"https://start.wealthsimple.com/to/yGeWOXfF\">https://start.wealthsimple.com/to/yGeWOXfF</a>  </p>\n\n<p>AGENT (Mitch Kalins): And maybe share the official communication my team has provided with your fellow Canadian Apes 😅  </p>\n\n<p>AGENT (Mitch Kalins): I can share that with you over email if that works :)   </p>\n\n<p>USER: That would be great! Much appreciated  </p>\n\n<p>USER: Thanks for your help, and have a great Thanksgiving weekend!   </p>\n\n<p>AGENT (Mitch Kalins): Great! Thanks so much for being a valued customer and for contacting Wealthsimple Support. Have a wonderful Thanksgiving weekend as well, Matthew!  </p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Qweiopakslzm", "url": "https://i.redd.it/sapqplguvr8b1.png", "time": 1687964108.0, "subreddit": "r/ThePPShow", "title": "In case anyone wants to join the Zoom meeting of today's hearing. Running right now.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/sapqplguvr8b1.png\"/></div>"}]