[{"username": "rayryhm", "url": "https://www.reddit.com/r/ThePPShow/comments/17k0o7u/teddy_making_thanksgiving_great_again_i_like/", "time": 1698692089.0, "subreddit": "r/ThePPShow", "title": "Teddy making thanksgiving great again! I like billions and calculators", "text": "<!-- SC_OFF --><div class=\"md\"><p>At the beginning it was said that Bobby had around $4b-$5b of debt.\nAll the claims we have seen so far has been within this range.\nThen some debt were cleared to the tune of $3b or so.\nThen came NOL.\nThen came the talk of a merger! Then came a huge dildo of $10b appearing on the creditor side.\nThere’s no way Bobby will have that much debt and we won’t know about it.\nThere’s no way someone will owe you 10b dollars and you will wait like for ever to make appearance.\nHell if someone owes me $100 dollars and they are bankrupt I will be the first in court.\nUndertaker rose from the dead, this is the sign! Lube up and wait for the Boom 💥 \n$3000.69 dollar a share is not a meme.\nBig thanks to all the big DD writers. All of my close friends that I told to buy Bobby told me it’s over, I told them it’s not, some looked me like I’m crazy.\nI told them, I know what you’re thinking but I’m just regarded and the gain porn is coming!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "rayryhm", "url": "https://www.reddit.com/r/ThePPShow/comments/17bsszn/bring_out_your_calculator_its_time/", "time": 1697747435.0, "subreddit": "r/ThePPShow", "title": "Bring out your calculator, it’s time", "text": "<!-- SC_OFF --><div class=\"md\"><p>Boy and girls, most of us held into zero and that’s why we are still here! We did till the ticker was deleted because we believe in this play. \nI don’t care what any shill writes, all I know is if my shares are worth nothing they won’t be writing! Unwavering erection ! \nRemember your shares belong to you, you paid for it and they don’t belong to Bobby, if they are being removed without your consent their must be a replacement plan or some other plan!\nHere is my daily task, I login to Reddit like 10 times a day, then I see numbers like $18 a share, $25, then $460.69 then $1000 and/or $25 plus equity, all I do is bring out my calculator and estimate my future money then adjust my plan in my head based on the figure I get. I’m guessing I’m not alone! My wife now knows Bbbyq and sometimes I let are read crazy comments from you regards, because I just burst into laughter all of a sudden and she wonders why.\nStay Zen, fuck around and find out, buy your wife’s bf a green dildo and get some ear plugs for The Boom 💥</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "rayryhm", "url": "https://i.redd.it/8dxhhj09n1hb1.jpg", "time": 1691569046.0, "subreddit": "r/ThePPShow", "title": "Im Ape that lives in Germany, trade republic sent this.", "text": "<!-- SC_OFF --><div class=\"md\"><p>They said „Delisting“ \nHow can you delist a stock that’s still trading on the home exchange ? Stock still trades in the US but can’t trade in Germany anymore.</p>\n\n<p>I always knew all the FTDs are hidden in Europe! \n(SHF meetings go like this : If you don’t want FTD‘s to blow up on your face just kill all the shares we sold to Europe and make sure nobody can ever sell incase it squeezes, if they can’t sell you don’t have to pay them billions) </p>\n\n<p>They probably don’t have the real shares and are hoping lots of people will forfeit their position. I am looking for a broker outside Europe where I can transfer my shares, someone said share transfer to ibkr does not work anymore.\nIf anyone knows how I could do this easily, kindly let me know.</p>\n\n<p>I need a broker to move my stocks to ASAP, this will encourage a lot of people in Germany to also do the same, hence the brokers here will be forced to go to market and buy real shares to transfer to our new chosen broker.\nIf this fails then shorts/crooked brokers win buy selling us non-tradeable  shares and part with our money.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/8dxhhj09n1hb1.jpg\"/></div>"},
{"username": "rayryhm", "url": "https://i.redd.it/ieo05np2fyfb1.jpg", "time": 1691094129.0, "subreddit": "r/ThePPShow", "title": "If you have never read any Docket/filings, I beg you to read just this one on the kroll website. Never had a boner reading a 34page PDF until today !", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ieo05np2fyfb1.jpg\"/></div>"},
{"username": "rayryhm", "url": "https://www.reddit.com/gallery/15hehfq", "time": 1691093307, "subreddit": "r/ThePPShow", "title": "Look at the names of the warriors that filed this document, APEs with slinging dicks went all out and wrote the unwritten!", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/azkmFPNhmPHjXJ4A72NXTPWoiF_MgF58JJC0q6lGibU.jpg\"/></div>"},
{"username": "rayryhm", "url": "https://www.reddit.com/gallery/15hehfq", "time": 1691093307.0, "subreddit": "r/ThePPShow", "title": "Look at the names of the warriors that filed this document, APEs with slinging dicks went all out and wrote the unwritten!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "rayryhm", "url": "https://www.reddit.com/r/ThePPShow/comments/15gh64v/just_when_i_thought_i_was_done_buying/", "time": 1691001995, "subreddit": "r/ThePPShow", "title": "Just when I thought I was done buying", "text": "The lower it goes, the more easier for us to buy up the float like 10th time !\n\nNow I need to buy more, kindly keep dropping the price till it blows up on your faces. Pheeeew", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "rayryhm", "url": "https://www.reddit.com/r/ThePPShow/comments/15gh64v/just_when_i_thought_i_was_done_buying/", "time": 1691001995.0, "subreddit": "r/ThePPShow", "title": "Just when I thought I was done buying", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"}]