[{"username": "ReflexesOfSteel", "url": "https://i.redd.it/63h7q845fypb1.jpg", "time": 1695452630.0, "subreddit": "r/ThePPShow", "title": "Kiwis and sharesies.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I have reached out to sharesies the other day about them selling our shares out from under us and got a reply today.\nThey should be able to transfer out to another broker but I don&#39;t know which ones and it&#39;ll cost $50usd.\nMight need to ask whatever other platforms you are using if they can accept a transfer in.\nIf we are to be canceled on the 30th or we are rescued beforehand it may not matter but personally I think k it would be wise to have a plan b in case anything is delayed.\nLet us all know below if you find a platform that will accept a transfer in and maybe approximate timeliness for such transfers.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/63h7q845fypb1.jpg\"/></div>"},
{"username": "ReflexesOfSteel", "url": "https://www.reddit.com/r/ThePPShow/comments/15desmk/super_tinfoil_from_the_smoothest_of_brains/", "time": 1690700197.0, "subreddit": "r/ThePPShow", "title": "Super tinfoil from the smoothest of brains.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just watched my first PP on YouTube today as I was interested in what Pulte had to say. I liked both the stream and how Pulte came across, seems Ike a good dude. A couple of moment in the show did strike me as he knows something but is keping it to himself, either by NDA or not wanting to ruin someone else&#39;s party.\nRandomly a thought popped into my head near the end of the stream, only the young - a reference to baby? I&#39;m not usually a tinfoil kinda guy, but hey the mind sees what it wants.\nThe big guys twittering only the young do all seem to have a disdain for the shorts too, so maybe they are all involved.\n&quot;There will be a story to tell here, it&#39;s just not mine to tell&quot;.\nAlso, the fulla in the schmick blue suit bottom left with the book at about 30min looked like he was casting fucking spells, haha, then later drinking his huge bottle of urine. \nPersonally, I think this whole BBBY saga, which I haven&#39;t been in all that long, circa 6months and about $5k, is either a trap for retail or the biggest trap for short ever seen.\nFerraris or foodstamps.\nLambos or Ramen.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]