[{"username": "Regulatetherich", "url": "https://www.tzero.com/article/2021/03/a-cure-for-wall-streets-problems", "time": 1700554856.0, "subreddit": "r/ThePPShow", "title": "Proof “the entire system is fraudulent, I mean flawed”", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"/blog/2021/wall-street-2.0.jpg\"/></div>"},
{"username": "Regulatetherich", "url": "https://www.reddit.com/r/ThePPShow/comments/17uvt53/entire_sys_ponzi/", "time": 1699941716.0, "subreddit": "r/ThePPShow", "title": "Entire Sys. = ponzi", "text": "<!-- SC_OFF --><div class=\"md\"><p>“Bonafide liquidity called market making” means its 100% synthetic. Until this “tool” is not for profit or decentralized, someone is getting screwed. Good news everybody, it’s just numbers on a screen so your rights have not been violated; including the 14th amendment…. Will it take a national March, this behavior has been happening since tulips! Any ideas other than resist.bot or “report them regard!”? This is going to affect any new shares unless it’s unfuckable like unfungible and 100% publicly owned/operated. \n<a href=\"https://x.com/pir8teangel/status/1724227086590660751?s=46&amp;t=haEqglR27odTCsA2t2uxjg\">https://x.com/pir8teangel/status/1724227086590660751?s=46&amp;t=haEqglR27odTCsA2t2uxjg</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Regulatetherich", "url": "https://www.reddit.com/r/ThePPShow/comments/17tk9zi/pp_for_pres/", "time": 1699795855.0, "subreddit": "r/ThePPShow", "title": "PP for Pres", "text": "<!-- SC_OFF --><div class=\"md\"><p>And you Ppshow contributors as vices. Imagine a decentralized platform to allow anyone with a cell phone to voice their choice towards changing the world. All verification is built in. No one can just lie or make up the books, deaths, or taxes. One world built for ALL not just the people who can afford the best lawyer or are good at covering up crimes like 2008! They have built a national emergency response fully tested recently on over 400 million phones recently. Information can be distributed to all with the majority able to comment and ensure it meets quality checks. Quality checks that provide equality and makes 2008 impossible without ALL voices in majority making it possible. The world will not become better with our current limitations that have allowed billions to die poor while a few hold all the gold. The people telling you that you don’t deserve a vacation, or a gun are the ones sitting on a nuclear bomb switch. Did they ask you if our group savings(taxes) should be spent on killing other people(war) instead of building community infrastructure that is fully self sustaining for food, entertainment, socializing, and overall BETTERMENT of the planet and its EIGHT FUCKING BILLION YOUS. We are all on the same side when it comes to “do you want to live in a society that cares about you?” Or “Do you want to let Enron decide for you? For starters let’s get a president on the docket that does believe in humans over Epstein island slavery and destroy “Citizens United vs FEC” type suppression. A question for all, how did the voting class become the peasants with no power or money or actual liberty and life? THEY WILL NEVER TAKE OUR FREEDOM!!! But if we don’t act now, freedom will go on vacation until we bring it back to the bedrock of this great planet! Let’s Go PP’s. </p>\n\n<p>This would mean zero crimes in the stock market and the voting system and taxes which should impact this community and eventually the world.</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Regulatetherich", "url": "https://www.reddit.com/r/ThePPShow/comments/17s5x1b/treasuries_being_spoofed/", "time": 1699628767.0, "subreddit": "r/ThePPShow", "title": "Treasuries being spoofed", "text": "<!-- SC_OFF --><div class=\"md\"><p>Where the fuck is my money?!\nI have a legitimate question where the fuck is my money that the SEC got from suing entities that have robbed the markets through naked, shorting, spoofing, counterfeiting and nefarious other acts that they do in the markets like this treasuries case just today. So they sue for billions and billions of dollars each and every year but did you get a check from them because I didn’t which means they settled for us but we didn’t get paid. Is it our time to sue them for the same thing since the I’ll gotten gains came from someone who didn’t get reparations?!?!?? Fuck you pay me SEC</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Regulatetherich", "url": "https://www.thestreet.com/crypto/innovation/new-integration-brings-gamestop-to-a-50-billion-market", "time": 1699368426.0, "subreddit": "r/ThePPShow", "title": "Now Wall Street will know about GME? Lol", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": ""},
{"username": "Regulatetherich", "url": "https://i.redd.it/6bn35v08glvb1.png", "time": 1697910707.0, "subreddit": "r/ThePPShow", "title": "Reddit is the Time Machine?", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/6bn35v08glvb1.png\"/></div>"}]