[{"username": "RenoNex", "url": "https://i.redd.it/lspjyw9i8rtb1.jpg", "time": 1697109044.0, "subreddit": "r/ThePPShow", "title": "Hargreaves Lansdown update", "text": "<!-- SC_OFF --><div class=\"md\"><p>After HL’s removal of shares from their platform recently, I reached out to ask them some more information on the matter. Namely; should there be any changes within the bankruptcy procedure that restores shares/compensates shareholders, do my shares still exist in my name and will I get my shares back.</p>\n\n<p>Their answer; yes. Our shares are still in our name, they’ve not been sold, and if anything positive happens, we get them back.</p>\n\n<p>Hopefully this provides a bit of relief to those that were worried about this!</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/lspjyw9i8rtb1.jpg\"/></div>"},
{"username": "RenoNex", "url": "https://i.redd.it/x0aur1mti8mb1.jpg", "time": 1693831544.0, "subreddit": "r/ThePPShow", "title": "Minor update on HL", "text": "<!-- SC_OFF --><div class=\"md\"><p>After seeing HL responding to another user last week about the counterparty, I contacted them myself for clarity.</p>\n\n<p>They’ve said the same comments as before, that the counterparty has suddenly stopped providing them with services.</p>\n\n<p>They’ve mentioned about transferring away, however, my shares are within either an ISA or a SIPP, and other providers won’t accept them that way - they have to be sold and re-purchased.</p>\n\n<p>So, I’ve responded to HL to ask if they can still facilitate that or not. I’ve also asked if they’re in talks with/plan to find another counterparty to provide the same service as before.</p>\n\n<p>I’ll update when I get a response!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/x0aur1mti8mb1.jpg\"/></div>"}]