[{"username": "reverseterryreverse", "url": "https://i.redd.it/4oe5rha79ktb1.jpg", "time": 1697024529.0, "subreddit": "r/ThePPShow", "title": "Posted in Stonk, pure black tar. Whoever is using Sears and other zombie stocks as collateral dug their own grave when they showed the world that these tickers can still rip. Butterfly engineered this same scenario IMO, only this time the hedgies are on the receiving end of the big green dildos.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/4oe5rha79ktb1.jpg\"/></div>"},
{"username": "reverseterryreverse", "url": "https://www.reddit.com/r/ThePPShow/comments/16qbs2l/does_anyone_else_feel_like_their_algorithm_is/", "time": 1695494164.0, "subreddit": "r/ThePPShow", "title": "Does anyone else feel like their algorithm is being manipulated?", "text": "<!-- SC_OFF --><div class=\"md\"><p>If you thought you saw this last night it’s cause you did. Mod wanted me to hold off so Pulte could get max coverage. Disclaimer: I am a rational and sane human being and I understand that not everything in my life somehow ties back to this stock. I feel like a nut saying this, but for the last 2-3 weeks my home feed has been less and less hot posts from this sub but a huge influx of other stock related subs. Not the degen ones like wasabi but stuff like FIRE and Bogleheads. Subs that basically preach smart, long term investing for the goal of retiring in your early 50s. The reason I ask is because now I’m getting recommended posts about meme stocks and how it’s so sad that there’s people like us and how we don’t realize we’re in a cult. It’s freaking me out seeing what looks like a concerted effort to affect my decision making. Just wanted to know if anyone can relate to this.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "reverseterryreverse", "url": "https://www.reddit.com/r/ThePPShow/comments/16ppf12/does_anyone_else_feel_like_their_algorithm_is/", "time": 1695426796.0, "subreddit": "r/ThePPShow", "title": "Does anyone else feel like their algorithm is being manipulated?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: I am a rational and sane human being and I understand that not everything in my life somehow ties back to this stock. I feel like a nut saying this, but for the last 2-3 weeks my home feed has been less and less hot posts from this sub but a huge influx of other stock related subs. Not the degen ones  like wasabi but stuff like FIRE and Bogleheads. Subs that basically preach smart, long term investing for the goal of retiring in your early 50s. The reason I ask is because now I’m getting recommended posts about meme stocks and how it’s so sad that there’s people like us and how we don’t realize we’re in a cult. It’s freaking me out seeing what looks like a concerted effort to affect my decision making. Just wanted to know if anyone can relate to this.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "reverseterryreverse", "url": "https://www.reddit.com/r/ThePPShow/comments/14x9p5k/tomorrow_ah_we_see_rc_make_the_same_play_with_his/", "time": 1689124654.0, "subreddit": "r/ThePPShow", "title": "Tomorrow AH We see RC make the same play with his 🍎🍎🍎, Then Thursday, Pulte with his 🏡🏡", "text": "<!-- SC_OFF --><div class=\"md\"><p>Then Friday….. Boom. A vision has come over me after rubbing one in the shower, thus the prophecy hath foretold🔮🔮🔮🔮🔮</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "reverseterryreverse", "url": "https://i.redd.it/3llvj131a94b1.jpg", "time": 1685995431.0, "subreddit": "r/ThePPShow", "title": "Taylor Swift is going to revolutionize concerts and ticketing through GME NFT.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Was listening to Bill Simmons podcast yesterday about Taylor Swift. I think she’s still underrated in a way to a lot of people like me who really don’t listen to her music at all. She’s statistically as big now as Michael Jackson was back in the day, arguably more so. I think the subtleties of Pulte possibly referring to her with the incessant only the young tweets, along with GMEs obvious expansion into NFTs, along with the most obvious use case for NFTs being ticket sales or virtual concerts gives at least a silhouette of tinfoil that she’s going to change the game doing ticketing through GME somehow. Don’t forget, she broke all redundancies of the ticket infrastructure in America when she announced tour. Sounds like a monopolistic industry ripe for disruption.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3llvj131a94b1.jpg\"/></div>"}]