[{"username": "RoccoBalbutski", "url": "https://www.reddit.com/r/ThePPShow/comments/12sd1o5/sue_where_are_you/", "time": 1681944202.0, "subreddit": "r/ThePPShow", "title": "Sue, WHERE ARE YOU??", "text": "<!-- SC_OFF --><div class=\"md\"><p>If you are not filing BK this weekend.  Why not release a statement immediately stating that and that alone.  Fight back for christ sake.  This is why people are not going to vote for the RS because we feel like you don&#39;t have our back.  Say something...</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "RoccoBalbutski", "url": "https://www.reddit.com/r/ThePPShow/comments/12qy2xh/question_about_rs/", "time": 1681840257.0, "subreddit": "r/ThePPShow", "title": "Question about RS", "text": "<!-- SC_OFF --><div class=\"md\"><p>At first I was on board with RS.  BBBY said, RS or BK make your choice.  We need the billion or we are fucked.  They basically put a gun to my head as an investor.</p>\n\n<p>Then I said fuck that they haven&#39;t given me any news at all on why I should actually do it, so I changed to no.  Reason being is because they are just going to dilute me even more making what I have(20K shares) even more worthless.  I haven&#39;t seen any info on what they will change and make the company more valuable after RS.  How are they changing course and turning things around.  We could be back in this position months or a year from now with what I currently have being worth much less.</p>\n\n<p>That said, I am open to changing back to yes, but I want more info.  I want to know the plan.  OR How about I still vote NO and put the gun to BBBY.  SELL Buy Buy Baby to RC for 1.5 Billion OR you go BK.  If you sell it to him which he wants to obviously buy it, then you have your money and the shareholders will get value in return.</p>\n\n<p>Why is that not an option and RS is the ONLY option... Any insight is much appreciated.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "RoccoBalbutski", "url": "https://www.reddit.com/r/ThePPShow/comments/12k327l/i_have_changed_my_vote_to_no/", "time": 1681340784.0, "subreddit": "r/ThePPShow", "title": "I have changed my vote to NO!", "text": "<!-- SC_OFF --><div class=\"md\"><p>14,000 shares and $20k invested into BBBY.  Look through my comments and history.  I am not a shill, I am not spreading FUD.  I AM PISSED OFF.  </p>\n\n<p>RC, who has a proven track record if definitely speaking of BBBY.  We always think he is.  He seems to have offered his help and the board who we have &quot;trusted&quot; to make the right calls have time and again fucked up.  I&#39;m sick of it.  RC is an activist investor with a following and KNOWS how to turn a company around.  You don&#39;t want his advice?  You don&#39;t want his help for FREE?  FUCK YOU.  Go BANKRUPT AND TAKE MY REMAINING $5K.  I could give two fucks about the money.  But to know you will be out of a job soon and have to explain to your next employer that you had a hand in the BK and numerous chances to get out of it.  Good Luck.  I VOTE NO UNTIL SOMEONE RELEASES NEWS YOU HAVE PUT YOUR EGOS AND PRIDE TO THE SIDE AND ASKED FOR HIS HELP.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "RoccoBalbutski", "url": "https://www.reddit.com/r/ThePPShow/comments/12cgf0b/just_listen/", "time": 1680692344.0, "subreddit": "r/ThePPShow", "title": "Just listen…", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.instagram.com/reel/CqNr4y4OMM-/?igshid=YmMyMTA2M2Y=\">https://www.instagram.com/reel/CqNr4y4OMM-/?igshid=YmMyMTA2M2Y=</a></p>\n\n<p>From a different interview but it basically foreshadows what BBBY is going through currently. This is exactly what he looks for.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]