[{"username": "s2a4ib", "url": "https://www.reddit.com/r/ThePPShow/comments/17ytub6/unwavering_fucking_conviction/", "time": 1700387820.0, "subreddit": "r/ThePPShow", "title": "Unwavering Fucking Conviction!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello Fellow PP Followers! How ya Fucking doing!? (sorry PP stole your amazing intro!)</p>\n\n<p>Good? Good! Fuck ya! You should be because soon I am about to fuck up the entire world! Tons of Cucks are going to be watching me fuck the financial system and fucking harder then any of them dreamed they could!</p>\n\n<p>To start im not a finacial expert! Im not a we, I am an individual who is not an expert in almost anything but i have some tid bits of info that i want to share!</p>\n\n<p>First off we are on the final stretch of this race! We have endured so much these last couple of years and about to enjoy the fruit of our labor! Congradu-fucking-lations! I did it people!</p>\n\n<p>My second point is a word of caution! We are entering territory that is by nature undiscovered! we may find the best of humanity leading us against the worst that humanity has to show! The final bosses of this whole ordeal! We have endured their psychological attacks, and understand the nature of shills but that gives them the ultimate attack against us! Friendly voices whom we trust! Now im not a shill saying that pp or any of the great dd writers are against us! Im talking about hackers that have stolen usernames.</p>\n\n<p>I want to be clear on this point! I want the PP show to be bigger than Pornhub! I want to google PP and the first thing i see is the PP show, and then Pornhub (come on im human! just like y&#39;all!). What i am talking about is attacks by hackers pretending to be people of our great community. It may only take one click to put yourself in a position of vulnerability.</p>\n\n<p>There are many people on the internet that are paid to be against us. They dont care about market changes, they dont care about who is right/wrong, they only care about money their paid (not any that is earned by holding through unwavering conviction). So lets go over some basic ways they can access your systems. </p>\n\n<ol>\n<li>Dont open links that come from random people/Posts/emails on the internet. Im serious, after MOASS starts dont open shit from random links. Im super serious like super dupper serious! did you know the difference between a and  α? One would say that they are the same by a quick glance! In reality they are not in the slightest! a is the keyboard lower case A and α is Alt - 224. Do you know what is the same between both characters? They both can be used in hyperlinks! it turns <a href=\"https://facebook.com\">facebook.com</a> into fαcebook.com . One is a social site that you can talk with peers, the other is a scammers sight that can take your info (before i posted i checked, that the example used wont take you to a sight that will scam you. I know some retard will click on the link). If you get an email from any questionably or trusted source, rather than just blindly clicking the shortcut link to change password. Instead take the long way! Go that URL bar (you know the bar on the top of your browser) and type the website you need to go to. This is the safest way to browse the internet, remember there are more against you then with you! From a security position, no one on this sub should be posting links at this point! It should be stated that a new docket has been dropped, and you the responsible retard goes to the krolls website and find that docket!</li>\n<li>Social engineer! It powerful! like really powerful. It could be a call from your local bank, whom you have an account with. They start off saying that someone has attempted to hack your account and in order to proceed they require your Social Security number, or a pin texted to your phone or email. This is the most common way people get hacked, like people are dumb, like realllllllllly dumb! If you get a call from your bank or any institute whom you are associated with that requires some sort of verification that you are who you say you are. Respond with &quot;I do not answer questions given to me by numbers i do not recognize. What company are you associated with and what phone number can i call you back on?&quot; They will either hang up, or give you a company and phone number. &quot;Thank you and have a great day.&quot; Hang up! I said fucking hang up! like hit that red button and ignore everything they are saying! Did you hear me? Hang the fuck up and go call the number on the institutions/companies website! If it matchs what was given, cool you may have adverted being socaially hacked, if it doesnt match, awesome you seriously avoided getting fucked! Once you have called the number on the website and have gone throught he 20 minutes of automated messages, say that you have recieved a phone call stating X (tell them what the phone call said) and proceed. Any legit call would have put a note in your account and you can figure it out then. watch this video if you dont believe me in how powerful social engineering can be. <a href=\"https://www.youtube.com/watch?v=opRMrEfAIiI\">https://www.youtube.com/watch?v=opRMrEfAIiI</a></li>\n<li>Hope you didnt click on that link! if i was hackerman i could have stolen everything from you! I gentle computer user who dont need more than my shares so ill preserve your info this time! </li>\n<li>Expired password! You know the old password you were given in middle school that is so random that it words for most things. Well did you know that hackers constantly attack many different weak websites specifically for these kinds of passwords, that there is banks of data on the web of passwords people use and can be sold to the lowest bidder? They figure that if you use X password on runescape ten years ago, then you may use X password with your bank! It never hurts to use a password manager like lastpass, or onepass (no advertising here, just stating the usefulness of these kinds of programs). They can generate a password that is hundreds of characters long. For record, a computer in 2023 can hack an 8 character password that uses only number almost instantly and five minutes if you use numbers, upper and lower case letters, and special characters. I personally have over 18 digit password that houses my stocks. According to netsec.news it takes 28 trillion years to guess a password of 18 characters comprised of upper/lower case letter, numbers and special characters. </li>\n<li>Physical vs digital. I mentions above the usefulness of a password manager. They can be powerful tools to keep track of basic passwords, but that is all they are tools. Remember a hammer in your hands is a useful tool, but that hammer doesnt owe it allegiance to you or the hammer could be stolen. The safest way to secure your info is to keep it physical and not digital. You have a crypto wallet, Awesome! Sweet! how are you storing your security key? Do you have a word document with your 16 word code? Is that word document sitting on your desktop? Just dont! please just dont store that on your computer. Password keepers are powerful and can house that kind of info but they can be cracked. Lastpass was hacked in 2022 and exposed tons of master passwords. The best way to store a password of that level is to write it down somewhere safe and keep it as analog as possible. There are reason the nuclear missiles are still controlled by analog systems.</li>\n</ol>\n\n<p>Now another note of fact, im not a hacker, i cant think like hackers, and i dont behave like hackers so i cant tell you how they will attack you in attempts to get your info. All i can say is that im going to be vigilent to any phone call i get, to any email i recieve, and will scrutinize it as best as i can in order to protect myself and the wealth I will have. I will take the long way to a website, and i will change passwords. If i get a call from my bank and they require me to provide info to verify myself, im going to hang up and call back on their websites phone number. I have powerful passwords that will take many lifetimes to crack, if its easy to remember it may be too easy of a password. And that i have a physical copy of my most important passwords, sometimes i forget is it a or α!</p>\n\n<p>Please for the sake of me, and for the sake of your PP (or vajaaj, or whatever your got!). Be careful! the internet may be the greatest thing ever created period! It is also the greatest place for those with dubious intentions (except for travis&#39;s strip club! ;) ). If you take anything from this long winded, half drunk, half stoned post is that we are about to experience our final attack and no one can tell you how that is going to happen. It is up to you as an individual to protect yourself both online and offline. I cant help with offline matters but I hope, no i pray that this post will get everyone to think about online security on another level. We have once chance, one moment and it would be an absolute shame to be left behind due to a hacked accout.</p>\n\n<p>Love you all, Love you PP, Love you Houston Wade, and love all the great DD writers and fighters of this community. If this is read by any of you big wigs of our community heavily recommend the need for vigilance for their own digital security in the days coming. </p>\n\n<p>The FTC have resources that do outline some ways hackers get access to your accounts (<a href=\"https://www.ftc.gov/business-guidance/small-businesses/cybersecurity/phishing\">https://www.ftc.gov/business-guidance/small-businesses/cybersecurity/phishing</a>)</p>\n\n<p>&#x200B;</p>\n\n<p>P.S. Hope you didnt click on that link ;) Did you pass?</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "s2a4ib", "url": "https://i.redd.it/5k4ydptg6jvb1.png", "time": 1697883199.0, "subreddit": "r/ThePPShow", "title": "Calls forced expire", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just checked fidelity and my call options have been forced closed. Didn&#39;t see any post and thought it needed to be know, it happened. Now I was under the impression of two things with options and a worthless company</p>\n\n<p>1: they expire when they expire with a worthless stock, not forced close. If memory serves me correctly, ape has stated they had worthless companies options just expire on their expire date and worthless company just sits in account like eating a bad stone. </p>\n\n<p>2: with this unusual maneuver that isn&#39;t an industry practice I was under the impression by reading ape dd or shit post (hard to tell sometimes) they were only closing 2023 options, not 2024&#39;s? Did they close the entire options chain? Haven&#39;t seen anything that makes the jump improbable. Would Ape check for ape?</p>\n\n<p>Another beautiful thing now missing in this screen shot that I took on my honeymoon, was the lack of evidence of the activity saying bbby stock being declared worthless by the company. It was there on Wednesday!</p>\n\n<p>I had to have a nice long talk with a fidelity rep wednesday for almost an hour. Wife was not too happy. At the end I got the juicy good from my rep that in my account exists a massive 8xxxxxxxxxxxx sized shares and it&#39;s recorded in their books.</p>\n\n<p>Got most tickets hand scrolled in my name in some ledger of sorts, honestly don&#39;t know who holds my keys at this point. When I get home I&#39;m hoping for a pile of mail with some golden ticket of something.</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/5k4ydptg6jvb1.png\"/></div>"}]