[{"username": "salamanderc0mmander", "url": "https://www.reddit.com/r/ThePPShow/comments/1803ne2/jake_appreciation_post_this_guys_fucks/", "time": 1700526067.0, "subreddit": "r/ThePPShow", "title": "Jake appreciation post. This guys fucks", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve had the impression Jake can word his thoughts so eloquently and gets the point across in as few words as possible. The charles gasparino thread confirmed that for me. Looking at his twitter replies now and reading through how he has been handeling trolls without negative emotion just makes me love the guy more. His ability to still be kind at the face of anger would make some of the best stoics proud. Love you jake and the work youre doing. I would have never thought so many people would give a shit what you are invested in (the royal you), this serves as confirmation I think we are in the right place. Fuck em</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "salamanderc0mmander", "url": "https://www.reddit.com/r/ThePPShow/comments/17ukclz/wow_that_twitter_shit_storm_being_spun_by_an_old/", "time": 1699908176.0, "subreddit": "r/ThePPShow", "title": "Wow that twitter shit storm being spun by an old fat man (doug cifu) and some really old fart (charles gasparino) tells me all I need to know", "text": "<!-- SC_OFF --><div class=\"md\"><p>They are fucked. SO fucked. Holy shit. If Doug is really so smart and wealthy and was even half a wise man he would know better than to roll around in the mud with the masses. In general stooping down to &#39;our&#39; level is foolish and inadvisable for someone that wanted to be respected. He just showed that he is emotionally weak. Now lets zoom out a little.</p>\n\n<p>&nbsp;\nStock gets naked shorted to absolute shit. The only people that have the &#39;privilege&#39; to naked sell stock are market makers. What does Doug run? A mother fucking market making company. Now that the stock is &#39;gone&#39; you would think he could silently celebrate since regarded people giving him money in exchange for a FTD is what his business runs on. WRONG the poor bastard is online trying to tell people how the investors in that naked sold short company are wrong and foolish. I have never heard mcdonalds calling Don Gorske a fool because he eats multiple big macs a day. </p>\n\n<p>&nbsp;</p>\n\n<p>Now some old fart who literally works for a news network is going online and posting some very &#39;imbecile and unprofessional&#39; comments.(Shout out for how eloquently jake can take a shit down someones throat). They are trying to get ahead of this thing. They do not need the fomo although its already too late for them. The &quot;News&quot; and the Criminal are trying to tell you that there was nothing wrong, look away. Nothing to see here. That rug smells like shit, its 10 feet high, and I&#39;m not sure how much more can get swept underneath it. The fat man will sing, he will have to get used to taking his wife on vacation to the atlantic city beach. He will get fatter from the stress. And if we are lucky he&#39;ll have 2 square meals a day of grool. And I know everyone wants to dance, hell I do too but dont. This poor bastard has a life time of ass fuckings coming his way after we fuck him first. Dont drop the soap doug, holy shit.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "salamanderc0mmander", "url": "https://www.reddit.com/r/ThePPShow/comments/17uesj3/hey_if_anyone_has_experience_making_hype_videos/", "time": 1699893893.0, "subreddit": "r/ThePPShow", "title": "Hey if anyone has experience making hype videos like back in the day when gme was taking off, I have been finding a bunch of great tracks that I think would be great for the videos!", "text": "<!-- SC_OFF --><div class=\"md\"><p>please hit me up I have some really great hype songs involving rockets and more!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "salamanderc0mmander", "url": "https://www.youtube.com/watch?v=AkDCrAxTLH8", "time": 1698877485.0, "subreddit": "r/ThePPShow", "title": "I used to love the hype videos that people made for our beloved stocks. It has been a while since I've seen a hype video get posted so heres one of my favorite hype songs! Really amps me up for Tomorrow!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/AkDCrAxTLH8/maxresdefault.jpg\"/></div>"},
{"username": "salamanderc0mmander", "url": "https://www.reddit.com/r/ThePPShow/comments/15mvwv6/is_that_august_15th_hearing_happening_i_dont_see/", "time": 1691625257.0, "subreddit": "r/ThePPShow", "title": "Is that august 15th hearing happening? I dont see anything on krolls site or the nj court site", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "salamanderc0mmander", "url": "https://www.youtube.com/watch?v=GdxuWq1-5qk", "time": 1691092949, "subreddit": "r/ThePPShow", "title": "To the Regards that filed the newest docket. One of us! One of us!", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/GdxuWq1-5qk/maxresdefault.jpg\"/></div>"},
{"username": "salamanderc0mmander", "url": "https://www.youtube.com/watch?v=GdxuWq1-5qk", "time": 1691092949.0, "subreddit": "r/ThePPShow", "title": "To the Regards that filed the newest docket. One of us! One of us!", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/GdxuWq1-5qk/maxresdefault.jpg\"/></div>"}]