[{"username": "saltyblueberry25", "url": "https://www.reddit.com/r/ThePPShow/comments/15qdn4d/confidentiality_in_ch_11/", "time": 1691968918.0, "subreddit": "r/ThePPShow", "title": "Confidentiality in Ch. 11", "text": "<!-- SC_OFF --><div class=\"md\"><p>This was my response to <a href=\"/u/real_eyezz\">u/real_eyezz</a> when he shared a link in a comment that he credited <a href=\"/u/allforbbby\">u/allforbbby</a> for finding which talks a lot about confidentiality in Ch. 11. </p>\n\n<p><a href=\"https://www.jonesday.com/-/media/files/publications/2005/12/confidentiality-in-chapter-11-22-iemory-bankr-dev/files/erensneff/fileattachment/erensneff.pdf\">https://www.jonesday.com/-/media/files/publications/2005/12/confidentiality-in-chapter-11-22-iemory-bankr-dev/files/erensneff/fileattachment/erensneff.pdf</a></p>\n\n<p>They go over several reasons why confidentiality agreements and ndas can be upheld to protect the company even in ch. 11 where others argue that everything should be out in the open.</p>\n\n<p>NDAs including a buyout could be hiding info from the public even if they shared the info with the judge and the biggest creditor but wanted to hide the info from the smaller creditors.</p>\n\n<p>I also found this juicy nugget about licensing agreements:</p>\n\n<p>Pdf page 17, document page 64:</p>\n\n<p>The phrase &quot;commercial information&quot; has been interpreted somewhat diversely by the courts. For instance, the Ninth Circuit Bankruptcy Appellate Panel has defined commercial information as information that would bestow *an unfair advantage to competitors by providing them information as to the commercial operations of the debtor.&quot;</p>\n\n<p>In general, however, courts have applied § 107(b)(1) in situations where &quot;open inspection may be used as a vehicle for improper purposes.&quot; Thus, pursuant to $ 107(6)(1), courts have maintained the confidentiality of, among other things, a licensing agreement where disclosure would cause &quot;an unfair advantage to competitors by providing them information as to the commercial operation of the debtor.</p>\n\n<p>Further, in determining whether an\nagreement can be filed under seal, a court often will review whether the parties to the contract believed that the agreement was confidential.</p>\n\n<p>If the protection pursuant to § 107(b)(1) is requested by a party in interest, courts differ on the standard to be applied for overcoming the presumption of the public&#39;s right of access under § 107(a). According to some courts, if the information contained in the document falls within the scope of any of the specified categories in the statute, the court must apply the protections.</p>\n\n<p>.</p>\n\n<p>TLDR/Emphasis on this part:  🚀🚀🚀</p>\n\n<p>“courts have maintained the confidentiality of, among other things, a licensing agreement where disclosure would cause &quot;an unfair advantage to competitors by providing them information as to the commercial operation of the debtor.”</p>\n\n<p>Imagine if we already have a licensing agreement like getting royalties with Overstock and DOM and that’s why the IP was sold for so little…</p>\n\n<p>Even if not, just the fact that NDAs are often upheld to protect companies in ch. 11 from their competitors finding out too much is very useful to know.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "saltyblueberry25", "url": "https://i.redd.it/feqzvypmcqfb1.jpg", "time": 1690996452.0, "subreddit": "r/ThePPShow", "title": "Gonna repost this juicy section here for visibility", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just read this section of the Plan</p>\n\n<p>Once this plan gets approved where we would get nothing under a complete liquidation, the effective date is the date the distributions would go out to the top tier creditors.</p>\n\n<p>This has always been labeled a dual path liquidation and attempt at a sale of the company.</p>\n\n<p>It says here under liquidation transaction that on the effective date, the debtors will take actions as necessary to effectuate the liquidation transaction, including but not limited to execution and delivery of any appropriate agreements or other documents of merger, consolidation, etc.</p>\n\n<p>Perhaps the offer to buy the company was contingent on a full release from all claims so that Teddy could start fresh. It looks like we won’t know until the Effective Date, which might not be til Sep 12.</p>\n\n<p>I have a feeling we’ll get more clues before then, but I’m ready to be patient another two months if we have to. I’ll be holding the bulk of my shares for life anyway, so what’s another couple months in the big picture.</p>\n\n<p>I’m feeling really good about this.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/feqzvypmcqfb1.jpg\"/></div>"},
{"username": "saltyblueberry25", "url": "https://www.reddit.com/r/ThePPShow/comments/15fu4mn/my_thoughts_as_condensed_as_possible_to_reply_to/", "time": 1690937211.0, "subreddit": "r/ThePPShow", "title": "My thoughts, as condensed as possible to reply to a shill", "text": "<!-- SC_OFF --><div class=\"md\"><p>Letter to board. Cooperation agreement. The day after he sold bbby said they were pleased to have come to a constructive agreement with rc ventures that will be beneficial to all stakeholders.</p>\n\n<p>Ryan cohen listed on pitchbook as attempting an LBO in January. Then he tweets Ryan cohen buys all the stocks. Ryan cohen also listed in court docs as interested party and as a creditor. Other tweets about executives getting paid leaving shareholders holding the bag.</p>\n\n<p>Most of the PPshow seemed kinda so-so at first (I prefer to read it all myself) until Ross Brown, senior vice president of Oracle comes on and says he thinks the Teddy thesis is probably true. Then Bill Pulte comes on and says we’re all leaders (not regards) and that he would bet Ryan cohen is still involved. Then he mentions how he’s invested in X, and in somebody, a great founder who we would all know, but he can’t tell us yet because of an NDA. Then when he’s asked pointed questions he intentionally does the 👀 look in real life basically implying that we’re on the right path but he can’t say anything.</p>\n\n<p>I believe. That’s it. I know there isn’t any concrete evidence and how could there be? It’s all airtight ndas and probably won’t get disclosed until the Plan is approved and it just so happens if you search Liquidation Transaction in the disclosure statement that dropped last night, it mentions that it could involve a merger and that those documents would become available and effective, if applicable, on the effective date.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "saltyblueberry25", "url": "https://www.reddit.com/r/ThePPShow/comments/15fltr5/surprised_no_one_posted_the_court_link_yet_its_on/", "time": 1690917235, "subreddit": "r/ThePPShow", "title": "Surprised no one posted the court link yet. It’s on right now. Here’s the link", "text": "Here’s the link to the court zoom meeting:\n\nhttps://njb-uscourts.zoomgov.com/j/1602225205", "flair": {"text": "Stream announcement ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "saltyblueberry25", "url": "https://i.redd.it/n8uuupujx0fb1.jpg", "time": 1690688707, "subreddit": "r/ThePPShow", "title": "Supermoon coming closest to earth on August first", "text": "Holy shit Batman", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/n8uuupujx0fb1.jpg\"/></div>"},
{"username": "saltyblueberry25", "url": "https://www.reddit.com/r/ThePPShow/comments/15bomhb/ive_got_some_black_tar_tin_foil_for_you/", "time": 1690523044, "subreddit": "r/ThePPShow", "title": "I’ve got some black tar tin foil for you", "text": "From the sound of some of Pulte’s answers yesterday, I think Elon may be involved. Pulte mentioned that he was up to big things, that he was invested in twitter/x also, and when he answered the only the young question, he said it’s part Ryan cohen and part… trailed off and talked about how we’re probably at an inflection point in financial markets and how he thinks Ryan cohen is the real deal, then suddenly starts talking about Elon musk and X.\n\nMy take is that only the young is these two guys, meme-lords who are very outspoken about hating short sellers, are both involved. They’re young enough billionaires that they’re not entrenched in the same bs as the old system. They’re fighting against it for fairer markets.\n\nI know a lot of people have mixed opinions about Elon, but honestly I think it’s coming from the same place of hate against RC. They know he’s building something huge and they’re trying to tear him/them down.\n\nIf RC wants to build an Amazon competitor and destroy shorts at the same time, why not team up with fellow short-hating billionaire? Oh this guy just happened to recently buy Twitter and then randomly rename it X? It sounds like a placeholder. \n\nWhat if this teddy conglomerate of zombie stocks and bbbyq also merges with X?\n\nWhat if Teddy not only became a competitor to Amazon, but also to Facebook, and to banks?\n\nI’d say a little less likely than Teddy just swooping baby but just imagine, this could be even bigger than we think. \n\nLet’s fucking go.", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "saltyblueberry25", "url": "https://www.reddit.com/gallery/13a46t4", "time": 1683411885.0, "subreddit": "r/ThePPShow", "title": "5 comments by Pulte on a post in Beyond Uranus about his own tweet", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is this real life?!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/5W_Sk2-iL_7uotY7i1QlT4XDPQ4IICQh8kUmz4LM-oI.jpg\"/></div>"}]