[{"username": "Schultzeee", "url": "https://www.reddit.com/r/ThePPShow/comments/12c2kr7/the_forgotten_8k_from_81822/", "time": 1680655138.0, "subreddit": "r/ThePPShow", "title": "The Forgotten 8-K From 8/18/22", "text": "<!-- SC_OFF --><div class=\"md\"><p>What&#39;s up with all the negativity lately?? There&#39;s plenty to be bullish about!! Thank god we had Carter come on last night and breathe some new life into all of us, especially ABC! </p>\n\n<p>The most bullish thing for me right now is that I think the RC connection is still 100% viable. Yeah LC bought some GME shares recently, clearly indicating that GME isn&#39;t involved in this play. It wasn&#39;t a huge buy so it&#39;s just RC/LC communicating to us through the SEC filings that GME isn&#39;t involved directly. However, it doesn&#39;t rule out a play by RC Ventures and later involvement with GME!  </p>\n\n<p>For some context I&#39;m a January 2021 DRS&#39;d GME ape who took on the BBBY side quest in May of last year. Ryan Cohen was basically the sole reason for my initial investment into Bobby. I believe his letter to the board should be the guiding light, the north star, the whatever you want to call it, for all of us. If you&#39;ve invested a dime into this play without reading the letter you&#39;re doing yourself a MAJOR disservice inmypersonalopinion (say it fast like Mr. Business lol). </p>\n\n<p><a href=\"https://s.wsj.net/public/resources/documents/bbbletter030622.pdf\">bbbletter030622.pdf (wsj.net)</a>   </p>\n\n<p>I can already hear the shills. &quot;Buuuuuut RC sold out of his position in August!&quot; </p>\n\n<p>Yes, but what seems to have been forgotten around here is the company&#39;s filing shortly after RC&#39;s updated 13D. By shortly after I mean the same exact day 8/18/22.   </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ysi1uls0iyra1.jpg?width=1334&amp;format=pjpg&amp;auto=webp&amp;s=d5bd748f1e3dfcba4748c1962848ebb378f44de0\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ysi1uls0iyra1.jpg?width=1334&amp;format=pjpg&amp;auto=webp&amp;s=d5bd748f1e3dfcba4748c1962848ebb378f44de0\" alt=\"https://www.sec.gov/Archives/edgar/data/886158/000138713122008865/bbby-8k_081722.htm\"></a></p>\n\n<p>Now why would the company specifically release this 8K on the exact same day as RC&#39;s filing? It&#39;s telling us not to worry. Trust the process. RC is somehow still involved. I just don&#39;t see a reality where RC sells because of bad blood between him and the board and then the company releases this filing the same day his filing drops.   </p>\n\n<p>Then in the company&#39;s prospectus later that month dated 8/31/22 on page s-9 they remind us to not trust anything other than what is filed by them with the SEC. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qsz8a71ekyra1.jpg?width=1334&amp;format=pjpg&amp;auto=webp&amp;s=cac283e9d9603576230b2340c37cddc3742457cf\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/qsz8a71ekyra1.jpg?width=1334&amp;format=pjpg&amp;auto=webp&amp;s=cac283e9d9603576230b2340c37cddc3742457cf\" alt=\"  424B5 (sec.gov) \"></a></p>\n\n<p>Kudos to the people around here that have been diving deep into the filings and making them easily digestible for everyone. By following along and scrutinizing every filing I believe we as a community have been able to make sense of what&#39;s potentially going on, even with incomplete information.<br/>\nWith everything that has transpired recently there is NO way the company is going under by 4/26. I&#39;m down about 90%, still buying, and as bullish as ever.  </p>\n\n<p>As RC said himself, every detail matters.  </p>\n\n<p>TLDR: Please just read RC&#39;s letter to the board if you haven&#39;t already lol.</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/ddeTrJrjuflhfAGWogn_eILjMtjWFKEatfcLgAZaeJo.jpg\"/></div>"}]