[{"username": "scooterbike1968", "url": "https://www.reddit.com/r/ThePPShow/comments/17yif7z/anybody_care_to_address_the_doxxing_accusations/", "time": 1700348006.0, "subreddit": "r/ThePPShow", "title": "Anybody care to address the doxxing accusations?", "text": "<!-- SC_OFF --><div class=\"md\"><p>It’s on SS. Prominent mod/ contributor “going dark” because PP and Sal doxxing. </p>\n\n<p>The redditor is established and I’m not so sure how high the shill reader is with him. He made a post about it. Seemed very genuine. I am sure Shill Team Six can pull “genuine” off when they are called in, in times of shambles. </p>\n\n<p>That said, what he claims was done is fucked up. I find it hard to believe but he tells a good tale. Certainly one that silence will not rebuke. </p>\n\n<p>Please respond. The accusations are completely contrary to the spirit of this community, and while I could see “over-zealous” Bobbys doing stupid shit in times of excitement and debate, but the leaders of this community need to be held to the highest standard to keep it united. </p>\n\n<p>That higher standard, of course, includes not doxxing.  But it also requires transparent and direct response when accused of such misconduct. </p>\n\n<p>The accusations seemed pretty low on substance when he got to the “proof” but it’s for you guys to drill down on why it’s bullshit. </p>\n\n<p>Because if what BAT is saying is true, that’s not ok. Set the record straight please.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "scooterbike1968", "url": "https://www.reddit.com/r/ThePPShow/comments/17nvm62/old_people_cant_run/", "time": 1699132276.0, "subreddit": "r/ThePPShow", "title": "Old People Can’t Run", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "scooterbike1968", "url": "https://www.reddit.com/r/ThePPShow/comments/17lm04r/could_rc_be_invested_in_twitter_with_elon/", "time": 1698872072.0, "subreddit": "r/ThePPShow", "title": "Could RC be invested in Twitter with Elon?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been looking back over tweets and thinking about some as more long term Easter eggs. </p>\n\n<p>On March 22, 2022, RC tweeted “I put my money where my mouth is.”</p>\n\n<p>Well, where’s RC’s mouth? His mouth is on Twitter - pretty much his only voice. </p>\n\n<p>Did he put his money in Twitter? Elon disclosed his initial 9% stake on April 5, 2022. </p>\n\n<p>Then he got on the Board. Then he said, “Fuck you; I’m just gonna buy Twitter entirely.” He wanted Twitter bad. Not for it’s current use specifically, but for the potential of the platform. </p>\n\n<p>Maybe the persona he has had since buying Twitter, along with frequently odd behavior, is an act? Why’d he buy Twitter??? “Just Elon being Elon.”</p>\n\n<p>Recent connections between Elon, Pulte, Taylor Swift….possibly. Ice cream. It seems to big to be real but if the tweet fits…..</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "scooterbike1968", "url": "https://www.reddit.com/r/ThePPShow/comments/16hu5yq/yesterdays_hearing/", "time": 1694628400.0, "subreddit": "r/ThePPShow", "title": "Yesterday’s hearing", "text": "<!-- SC_OFF --><div class=\"md\"><p>The thing about yesterday’s hearing that stuck out to me was the game everyone seemed to be playing when referring to “Class 9” with no one acknowledging a passionate, heavily-invested, household investor base was Class 9. Nor all of the fucked up shit leading to BBBY bankruptcy. Naked shorting. The CFO. Crime. Ryan Cohen’s involvement; the fact that the Zoom feed is packed. The judge was basically, “Read the fine print” losers. </p>\n\n<p>And only the US Trustee and SEC attorney looking out (sort of) for retail. The SEC guy bumbled through and neither actually made the right argument.  They pulled punches. You can’t foreclose people from exercising a right like the plan does. It’s a substantive due process violation. </p>\n\n<p>So we were the center of attention at the same time everyone was pretending we don’t exist. </p>\n\n<p>Yet, we do. If we are getting wiped out, how is the stock (at the moment) green. Isn’t it worth zero?</p>\n\n<p>So when I think back to yesterday, and the wierd things, like the SEC lawyer going as an aside “…I don’t know who’d want to bring a claim…I’m just sayin.” Paraphrased but that was sarcasm. Of course he knew. We are the elephant in the room. Or Voldemort to them perhaps - or some of them. </p>\n\n<p>I’m hoping the half assed legal argument and judge’s poor reasoning were to just to advance this to the next stage but … I guess it seemed like Stage 1, yesterday, really was a stage and an act was being put on. </p>\n\n<p>We’re red again but this price (any price) makes no sense if yesterday was bad. Because if yesterday’s hearing was not good for BBBYQ holders, it was “game fucking over” bad. </p>\n\n<p>We’re green again….and I did not hear any bell. </p>\n\n<p>🚀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "scooterbike1968", "url": "https://www.reddit.com/r/ThePPShow/comments/14h47l0/are_physical_assets_and_corporate_entity_up_next/", "time": 1687540698.0, "subreddit": "r/ThePPShow", "title": "Are physical assets and corporate entity up next?", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "scooterbike1968", "url": "https://www.reddit.com/r/ThePPShow/comments/14h47l0/are_physical_assets_and_corporate_entity_up_next/", "time": 1687540698, "subreddit": "r/ThePPShow", "title": "Are physical assets and corporate entity up next?", "text": "The current bidding is for intellectual property of Bobby and Baby. Those brands have value and can be used to immediately have a large online presence. The physical assets remain, along with Bobby and subsidiary baby, as corporate entities. RC does not want the brand names so they are breaking it off to get good money for it. He’s got Teddy signs to put up and execute his vision for this “new” company which also happens to have short sellers by the balls.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]