[{"username": "scorchedhalo", "url": "https://www.reddit.com/r/ThePPShow/comments/17rok0v/jake2b_and_platinum_sparkles_spaces_text/", "time": 1699567956.0, "subreddit": "r/ThePPShow", "title": "jake2b and Platinum Sparkles Spaces Text Transcript", "text": "<!-- SC_OFF --><div class=\"md\"><p>There were a few requests for a written transcript.  Here is one I made from the mp3.  There is a 40000 character limit in Reddit Posts so I had to share a Google Doc link. Instead.</p>\n\n<p><a href=\"https://drive.google.com/file/d/1PEqlB0pMP6lEqNJ_euvfjASbxOxfred7/view?usp=drive_link\">Jake and Platinum Sparkles Spaces</a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "scorchedhalo", "url": "https://www.reddit.com/r/ThePPShow/comments/16pp7jw/i_do_it_for_the_nolz_redux/", "time": 1695426248.0, "subreddit": "r/ThePPShow", "title": "I Do It For The Nolz (Redux)", "text": "<!-- SC_OFF --><div class=\"md\"><p>(TLDR available at the end of this post)</p>\n\n<p>Three months ago I posted on the BBBY sub my best effort to summarize the NOL strategy and how it could apply to an acquisition of BBBY. You can find that post here if you want to refresh yourself on NOLs.</p>\n\n<p><a href=\"https://www.reddit.com/r/BBBY/comments/14ndd5j/i_do_it_for_the_nolz_net_operating_losses/\">https://www.reddit.com/r/BBBY/comments/14ndd5j/i_do_it_for_the_nolz_net_operating_losses/</a></p>\n\n<p>Since then, there has been a lot of debate and FUD presented about how the outstanding bond debt would wipe out all of these NOLs, leaving no tax attributes for the acquiring entity. The issue I have with those making this claim, is that they have zero insight into the specific tax situation of BBBY. They present their opinion as fact, and cite vague sections of the tax code as proof, without further explanation. Unsatisfied, I continued looking up information regarding the subject.</p>\n\n<p>Some of you may have seen this video on YouTube. It was uploaded on October 22, 2022. If you have not, I suggest you watch it. It’s a bit dry and may be difficult to follow by those of us that are not tax experts. But after a few views, things started to make more sense to me.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/crhzu4vr6wpb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=f329bea00fa4942d8c33c3d92752e92f7ce247cb\"> </a></p>\n\n<p>Tax Consideration for Chapter 11 Bankruptcy Proceeding Video</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=BEHzTRxNm4k\">https://www.youtube.com/watch?v=BEHzTRxNm4k</a></p>\n\n<p>I will be showing screen grabs from the relevant slides and excerpts from the transcript of their Zoom presentation.</p>\n\n<p>In this video, a panel of experts explains specific strategies that would preserve NOLs and other tax attributes in a Ch. 11 bankruptcy. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/iceqqyn47wpb1.png?width=1281&amp;format=png&amp;auto=webp&amp;s=58595aeccec8197c6bcaa6285246e499a6670fc2\">https://preview.redd.it/iceqqyn47wpb1.png?width=1281&amp;format=png&amp;auto=webp&amp;s=58595aeccec8197c6bcaa6285246e499a6670fc2</a></p>\n\n<p>Check out both of the names of the Tax Consulting Firm and the names of the panelists. They are the same as those found in Document #1683 of the BBBY bankruptcy docket filed in June 2023.</p>\n\n<p>&quot; Monthly Fee Statement. For the Month of June 2023. Objection Date is August 14, 2023. Filed by Bradford J. Sandler on behalf of Alvarez &amp; Marsal North America, LLC&quot;</p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjQ1MzA3OQ==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjQ1MzA3OQ==&amp;id2=-1</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/13lg0x2f7wpb1.png?width=805&amp;format=png&amp;auto=webp&amp;s=7fb25eaad2e5f4c0bde4b9cf275801116b9391a3\">https://preview.redd.it/13lg0x2f7wpb1.png?width=805&amp;format=png&amp;auto=webp&amp;s=7fb25eaad2e5f4c0bde4b9cf275801116b9391a3</a></p>\n\n<p>Doc 1683 contains the billing information for services provided to the Committee of Creditors by Alvarez &amp; Marsal. The highlighted sections show the time spent discussing 382 (l)(5) plans.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jznrm27j7wpb1.png?width=1284&amp;format=png&amp;auto=webp&amp;s=9de8e312b258847f9d58b37f8fe68bd9c8bba35d\">https://preview.redd.it/jznrm27j7wpb1.png?width=1284&amp;format=png&amp;auto=webp&amp;s=9de8e312b258847f9d58b37f8fe68bd9c8bba35d</a></p>\n\n<p>Christopher Howe spends about 10 minutes explaining the ins and outs of the 382 (l)(5) plan. I’ll let his words do the heavy lifting here. From the Youtube auto generated transcript. Edited by me for clarity sake.</p>\n\n<p>8:18 - <em>At the beginning of the case when we talk with corporate executives or the internal tax department who may not have much experience with a chapter 11, folks often thinks upfront that there will not be any immediate federal cash tax impact which is likely the case. So oftentimes the federal tax aspects are put on the back burner at the forefront.</em> <strong><em>What we like to do is try to make sure that there&#39;s that there&#39;s not any hidden value there that&#39;s being lost. right. So from a natural perspective a lot of times you think of generally your net operating losses</em></strong><strong><em>.</em></strong> <em>So if a company is doing a restructuring, and again we&#39;re focusing here on in court restructuring, they generally have been bleeding some some cash and likely have large net operating losses. But at a high level oftentimes corporate executives or the non-tax advisors may say…</em> </p>\n\n<p><em>“okay well there&#39;s 10 million or 100 million or a billion dollars of NOLs but i&#39;m going to have COD (cancellation of debt income) of 10 million 100 million a billion dollars and won&#39;t my attributes be reduced regardless? and/or The cod does not necessarily cause an immediate cash tax exposure. We have attribute reduction where any of that COD would just reduce those NOLs or any other credits?”.</em>  </p>\n\n<p><em>And that&#39;s a fair point, but often times it&#39;s a modeling exercise to look at how attribute reduction works how the COD works. When you&#39;re in a large consolidated group, there&#39;s some pretty complex rules of reducing the NOLs, what entities they sit in, how you reduce attributes and where stock basis is within within the organization. Also often times what folks don&#39;t realize is that you know you look at your tax return and you say okay well there&#39;s x amount of NOLs but there&#39;s but there&#39;s also an attribute which is a NUBIL. And that&#39;s a “net unrealized built-in loss”. And what that is is per for the the definition of the term, it&#39;s unrealized. So if the fair market value of your assets are less than the tax basis, had you sold those assets, it would create a loss. Well those losses haven&#39;t been realized yet and are not part of your NOL balance. But if you have a change of control, those built-in deductions are actually limited at the same as the NOLs would be.</em> <strong><em>And so we&#39;ve worked on several cases where even though there&#39;s a small amount of NOLs or those NOLs maybe may be reduced with attribute reduction or an offset of otherwise of COD, there may be hundreds of millions or billions of dollars of value and net unrealized built-in losses in the tax basis balance sheet. And again this is a this is hidden value that that that may go untapped and if not structured properly could result in severe limitations.</em></strong></p>\n\n<p>11:20 <em>- for those who want to get get a deeper knowledge in section 382, at the highest level the the best way to think about it is that when you have a change of control from a tax perspective, there&#39;s limitations on these tax attributes. Again your NOLs, your credits, your built-in deductions. That limitation is based on what the equity value of the company is. So again, if you&#39;re going into a bankruptcy and you&#39;re about to file for a chapter 11… your limitation on these attributes would be fairly limited.</em> <strong><em>Now what happens is you take the equity value of the company, and let&#39;s say that a company before they go into bankruptcy was 100 million dollars, and you look at what the long-term tax exempt rate is, which may be two percent, you would only be able to use your attributes at two percent a year. And so in my example, that&#39;d be two million dollars a year, going forward where you have hundreds of millions again or billions of dollars of attributes. So it&#39;s a pretty severe limitation. And again that&#39;s assuming that there&#39;s any equity value at all. And in a chapter 11, you&#39;re likely insolvent so it&#39;s important not to have a change in control during dependency of the case of the chapter 11 case.</em></strong></p>\n\n<p>12:57 - <strong><em>and what i think the main takeaway should be for the non-tax folks, is that there&#39;s two exceptions when you go into a chapter 11 regarding 382. And that is what we refer to here as a section 382.l5 and l6 bankruptcy exceptions</em></strong><strong><em>.</em></strong> <em>…The section 382.l5 election, which is in the middle of the page, I refer to it as the “</em><strong><em>home run election</em></strong><strong><em>”.</em></strong> <em>That, basically, is allowing creditors who are going to take ownership of the company,</em> <strong><em>to not have any limitation on their tax attributes</em></strong><em>. Now there&#39;s various technical nuances that may prevent a section 382.l5 plan from being able to be executed. And because you&#39;re treating the creditors as if they were historically equity owners, any interest expense that&#39;s part of your tax attributes will be reduced.</em> <strong><em>But if you do a modeling exercise and you look at the true value here, we&#39;ve worked on several cases where creditors have come in, they&#39;re going to the end result is they will have the majority equity ownership upon emergence and upon making this election they will not have any limitation. That two percent is not applicable and they will have the full use of any remaining net operating losses credits or built in deductions.</em></strong></p>\n\n<p><strong>TLDR:</strong></p>\n\n<p>In October of 2022, Alvarez &amp; Marsal hosted a Zoom webinar where they discussed how to preserve Tax Attributes (NOLs) during Ch. 11 bankruptcy proceedings. Eight months later, in June of 2023, this same company files a billing invoice with the bankruptcy court for services related to tax attribute plans for BBBY. With specific line items referring to the tax code section 328 (l)(5), which Christopher Howes refers to as the “Home Run election” in the Zoom webinar from October 2022.</p>\n\n<p>They aren’t just telling the viewer how to preserve the NOLs. They are telling us that they are preserving the NOLs. Billions of dollars worth of NOLs. That is something worth acquiring.  I trust the professionals over the Reddit Tax experts any day.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/BKT40MuHKGTwjQpWTXt3-wpzDsO5-UtctYbR7n3HIf4.jpg\"/></div>"}]