[{"username": "scott_sleepy", "url": "https://www.reddit.com/r/ThePPShow/comments/16kepqe/hype_vid_assistance_crowdsourcing_people_who_got/", "time": 1694889627.0, "subreddit": "r/ThePPShow", "title": "Hype Vid Assistance - Crowdsourcing People who Got Rekt", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey you dildo wielding pps,</p>\n\n<p>To make good on my laziness a while back, I&#39;m making a hype vid. I&#39;m enjoying what I&#39;m putting together, and hope others will soon enjoy as well :)</p>\n\n<p>I&#39;ve been building a list of the following:</p>\n\n<ul>\n<li>People / entities that got Fukt during bankruptcy: JP morgan, Jake Freeman, Jr Unsecured Creditors, Opposing councils (what are the opposing council names?), </li>\n<li>Important bullish events: JP Morgan loan paid off day 1,  14 day stay waived, successor entity, twitter post handshake, 8k, NOLs,</li>\n<li>Important docs that were bullish: 2179, 2172, 2139, RC as debtor &amp; Creditor, DIP financing info, </li>\n</ul>\n\n<p>Looking to the community for additional names, docs, and events.</p>\n\n<p>What am I missing? What would be important to include?</p>\n\n<p>I have room for TONS of call outs in the vid. I want to make it robust. Any info is <em>greatly</em> appreciated!!</p>\n\n<p>&#x200B;</p>\n\n<p>Scotty</p>\n\n<p>&#x200B;</p>\n\n<p>@ mods I have no idea what flair to choose</p>\n</div><!-- SC_ON -->", "flair": {"text": "🎬 The Pie Cut - Highlights Reel ", "text_color": "dark", "back_color": "#00a6a5"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "scott_sleepy", "url": "https://www.reddit.com/r/ThePPShow/comments/1653srh/chewy_app_preview_stalking_horse/", "time": 1693366814.0, "subreddit": "r/ThePPShow", "title": "Chewy App Preview - Stalking Horse", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey all,</p>\n\n<p>The original post below about the Chewy app and the preview showing GameStonk and Teddy hints.</p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/164yyzg/teddy_shown_in_autoship_preview_for_chewy_app/\">Teddy shown in auto-ship preview for Chewy app : ThePPShow (reddit.com)</a> </p>\n\n<p>Also, horse picture shown during the pet picture scroll:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tye91mzm46lb1.png?width=1170&amp;format=png&amp;auto=webp&amp;s=f5bb96ce3926fc8975b4de7c56b9f293d1b21d15\">\\&quot;Horse Deals\\&quot; is the text</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/HRzC4Pe0xo7UFMFAeIE5vGeB6U-zibfQT1dP0w1nGG0.jpg\"/></div>"},
{"username": "scott_sleepy", "url": "https://www.reddit.com/r/ThePPShow/comments/1630ft6/question_emerging_with_shares_intact_or_new/", "time": 1693166732, "subreddit": "r/ThePPShow", "title": "Question: Emerging with Shares Intact - Or New Shares in Merger", "text": "Hey you banana shoving regards,\n\nI've been following the posts here, and the awesome DD everyone has done.\n\nQuestion: What are the tangible things that are happening in bankruptcy and/or with bondhodlers or financing behind the scenes that indicates shareholders will come out whole getting shares in a reverse merger, or tangible things *not* happening that have typically wiped out shareholders in previous historical bankruptcies?\n\nI'm in this play (30k shares), but being a smooth brain, have not been picking up these details quite as much.\n\nI'm not looking for qualitative indicators such as \"RC hates shorts, Overstock hates shorts, Teddy book, etc.\" BTW I read the Teddy book and yeah it slaps apes in the face with what is going to happen. Looking purely for the quantitative details about what is happening in bankruptcy that indicate we are on path to sharehodlers coming out whole.", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "scott_sleepy", "url": "https://www.reddit.com/r/ThePPShow/comments/13qvg0f/remember_how_important_drs_is/", "time": 1684957208.0, "subreddit": "r/ThePPShow", "title": "Remember How Important DRS Is", "text": "<!-- SC_OFF --><div class=\"md\"><p>Fellow Apes,</p>\n\n<p>This sub is on the learning curve for many, many things. I am a long-time member of the GameStonk saga. Here in Bobby, there are a handful that have done stellar, amazing DD. We all know who you are, and I want to commend you. Without your deep-dive efforts to provide clarity and research as to the possible happenings with Bobby and Baby, we would not be here today. Your work has influenced tens of thousands, and world events and that have yet to occur. It&#39;s quite incredible when you take a step back.</p>\n\n<p>One thing I wanted to remind this sub about is how important DRS is. The more shares that are DRS&#39;d, the bigger the squeeze. Removing shares from the float creates more volatility and upward pressure on the stock. If shares are not DRS&#39;d, SHFs and market makers are free to continue naked shorting, and have a <em>much</em> easier time manipulating the share price in their favor, regardless of buy pressure.</p>\n\n<p>There can, and will, be catalysts that put shorts in a corner and force them to close. Their continued attacks here (shills), on Icahn (IEP and Hindenburg), and smear campaigns against Pulte are continued evidence that we are on the right path and that shorts are under threat.</p>\n\n<p>I can&#39;t understate how important DRS is. Without it, we are on our heels, no matter how many apes worldwide are buying this stock in a frenzy.</p>\n\n<p>My AST account is currently in the mail. When I log in, I&#39;m going to check if there is any Plan vs. Book bs, similar to Computershare. I will update here.</p>\n\n<p>Remember, NO DINGLEBERRIES. Pure DRS is the only way. Look up &quot;Heat Lamp Theory&quot; on google, it&#39;s in another minor GameStonk sub that has this DD. TBD if this is an issue with AST.</p>\n\n<p>DRS also ensures that if you are keeping your shares for the Baby acquisition into the new entity (351 code per the latest RC tweet), there will be no issue, because you do not have synthetics. Remember, your broker owns your (potentially synthetic) shares. If the latest Speculation DD is correct that the new Bobby issued shares via HBC and others were bought up by major players, they own &gt;80% of outstanding shares, leaving roughly 100 million to apes. Given how cheap the stock is, if this is the case, I am CONFIDENT that apes here already own more than the float. DRS is the only way to lock it, otherwise we own synthetics and MMs and SHFs are business as usual.</p>\n\n<p>I have no idea if this will be an issue, but if it is found that more than the float is owned, brokers because they own the shares (not you), can simply delete them from your account. I believe this happened with Dole in the past. (Wrinkles please confirm). I have NO IDEA if this will be an issue. It&#39;s your call what you do. Not trying to spread fear or fud. Something to ponder as you make your game plan.</p>\n\n<p>Best of luck everyone!</p>\n\n<p>Food stamps or Ferraris.</p>\n\n<p>Or shares in the new entity.</p>\n\n<p>Not financial advice.</p>\n\n<p>Our suspicions will soon be revealed.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "scott_sleepy", "url": "https://www.reddit.com/r/ThePPShow/comments/135xop2/negative_bidask_for_bbby/", "time": 1683055664.0, "subreddit": "r/ThePPShow", "title": "Negative Bid/Ask for BBBY", "text": "<!-- SC_OFF --><div class=\"md\"><p>I do NOT take credit for this post. Originally in the Jimmy subreddit and am re-posting here because I haven&#39;t yet seen it.</p>\n\n<p>FINRA is displaying positive bid/ask for BBBY and true market data behind the scenes showing negative Bid/Ask.</p>\n\n<p>If you&#39;re interested, check out the Bid/Ask for GME in another post there as well.</p>\n\n<p><a href=\"https://twitter.com/MrDavidNIO/status/1653432061947002881?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1653432061947002881%7Ctwgr%5Ec240f9f7426b9a199806185cce3db240e991c51e%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.redditmedia.com%2Fmediaembed%2F135w75x%3Fresponsive%3Dtrueis_nightmode%3Dfalse\">DavidNIO on Twitter: &quot;BREAKING NEWS ⚠️ Time &amp;amp; Sale reveals self regulated body #FINRA is committing security fraud with #BBBY stock. Looks like system is getting exposed. Negative figures getting reported for BID &amp;amp; ASK while NBBO is 0.0788/0.0790. Tell me the market is crashing in front of our eyes. https://t.co/DwGPOcV6qE&quot; / Twitter</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>@ mods please change the flair if needed. There 3 or 4 I felt could have fit.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: I reached out to the twitter OP, and both times he/she did not answer as to where this data was from. So we can&#39;t verify its validity, and it&#39;s questionable that they are the only person to have found this (presumably in a Bloomberg terminal). </p>\n\n<p>As of now, I think the video is fake.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]