[{"username": "Scott_Donald", "url": "https://www.reddit.com/r/ThePPShow/comments/17rk22v/jake2bs_evisceration_of_plattyice/", "time": 1699555879.0, "subreddit": "r/ThePPShow", "title": "Jake2b's Evisceration of PlattyIce", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/u/jake2b\">u/jake2b</a> did an excellent job representing our community with respect and grace. Plat showed her hand on that space call. She very clearly displayed how she doesn&#39;t have an understanding of this play and her position is based on the most limited amount of information. The number of times Jake had to correct her on her misinformation was astounding. At every turn when Plat thought she had a strong point Jake was able to refute her baseless claims with concrete information directly from dockets or hearings. </p>\n\n<p>Big thanks to Jake for being such a good human and so kind to everyone! Thank you Jake!!! </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Scott_Donald", "url": "https://www.reddit.com/r/ThePPShow/comments/17h54ns/2900_s_valley_pkwy_in_reference_to_jakes_dd_from/", "time": 1698350304.0, "subreddit": "r/ThePPShow", "title": "2900 S. Valley PKWY - In Reference to Jake's DD From Last Night's Show", "text": "<!-- SC_OFF --><div class=\"md\"><p>After listening to <a href=\"/u/Jake2b\">u/Jake2b</a> last night on the PP show - 10/25/2023, I was compelled to get eyes on the building he was referencing. I work about ten minutes from 2900 S Valley PKWY so I went there during my lunch break. The parking lot was mostly empty. I have to admit, when I was driving over there I got a little engorged thinking there was a chance I would see RC in the flesh. Unfortunately, RC was nowhere to be seen. </p>\n\n<p><a href=\"https://reddit.com/link/17h54ns/video/x06ofcqbilwb1/player\">Entrance to the building </a></p>\n\n<p>This building is in a commercial area surrounded by other fulfillment centers. I couldn&#39;t help but notice the proximity to GameStop Headquarters. I have season tickets for the Rangers and drive past 2900 S Valley and the GameStop corporate office every time I go to a game (GOOOO RANGERS!!!!!). One thing I want to point out, DFW is large and these two locations being so close to each other is very convenient if it is just a coincidence. When you are driving down the highway that passes these two locations it only takes about ten minutes to get from one to the other. Both are very very close to DFW airport which is why this area is packed with fulfillment centers. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://reddit.com/link/17h54ns/video/9hcfgh2dllwb1/player\">Empty parking lot at 2900 S Valley PKWY</a></p>\n\n<p>I was expecting to see some activity but this place was a ghost town. Hundreds of thousands of square feet of warehouse space going unused. Or is it? I was not familiar with what Flexport did I looked them up and did a surface-level amount of digging. For those of you like me who didn&#39;t know what Flexport did, they are a supply chain management platform. It appears that retailers use Flexport to manage the fulfillment side of their business. Now let&#39;s put that in the context of what we think is going on behind closed doors. If RC were to be building a conglomerate of companies all under a single umbrella, Flexport would be an ideal company to contract for fulfillment. All of the different brand&#39;s products are stored in the same warehouse, picked, packed, and shipped by a single team. Why would Flexport pay $500,000 for the lease if they aren&#39;t going to use it, and why aren&#39;t they using the space now?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Scott_Donald", "url": "https://www.reddit.com/gallery/17g8bn7", "time": 1698250101.0, "subreddit": "r/ThePPShow", "title": "Buy Buy Baby - Plano", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was headed out to a job site for work and passed a Buy Buy Baby store. Looks very vacant, but the sign is still up. There was a building permit posted for cleaning out the building. The building is located in Plano, TX. </p>\n\n<p>What I found interesting is that the property was removed from LoopNet which is a website for buying and selling commercial real estate. Also, most of my local Bed Bath and Beyond stores all took down their signage and have “For Lease” or “For Sale” signs posted. This property did not have any signs posted for a real estate agent. </p>\n\n<p>I’m not sure what the plan is for this property but I find it odd that it has been sitting vacant since June and no one is trying to sell it. If it was already sold or leased I have a hard time believing the new tenant would let it sit for this long. What do you guys think?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/FG9f8w4CCJyqrKfVXvA0tXHVUa6eBWR627f6xLRXRlI.jpg\"/></div>"},
{"username": "Scott_Donald", "url": "https://i.redd.it/h315kxacou8b1.jpg", "time": 1687997880.0, "subreddit": "r/ThePPShow", "title": "Glenn…. 🤡", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/h315kxacou8b1.jpg\"/></div>"}]