[{"username": "sheezeBreeze", "url": "https://www.reddit.com/r/ThePPShow/comments/15xoaex/ast_first_time_registration_something_you_need_to/", "time": 1692661326.0, "subreddit": "r/ThePPShow", "title": "AST - First Time Registration. Something you NEED to know.", "text": "<!-- SC_OFF --><div class=\"md\"><p>yooo guys, regarding DRS: DON&#39;T BE ME!!!</p>\n\n<p>just wanted to put this out there, so maybe you won&#39;t fuck up to the extent in which I did.</p>\n\n<p>I went to create my account since the portal is now up and functional. simple enough huh?</p>\n\n<p>I input all of the requested information (name, address, etc) <em>exactly as it appears on the statement received by AST that confirms my 13k shares directly registered with them.</em></p>\n\n<p>1st attempt, locked account due to &quot; Authentication failed. Registration for this account has been locked. Please call Shareholder Services from Monday-Friday between 8:00am to 8:00pm EST at 888-999-0032 or 718-921-8124&quot;</p>\n\n<p>Called and spoke with a rep to get it unlocked for the first time.</p>\n\n<p>I go back into the portal, input my information and again, double checking the info I input is exact. annnd it <strong>fucking fails authentication</strong> for a <em>2nd time.</em> No clue why, and no explanation provided by the rep.</p>\n\n<p>Called the number listed above <em>again.</em> Spoke with another rep. Guess what? if you get your account locked out twice? </p>\n\n<p><strong>YOU LOSE THE ABILITY FOR ONLINE ACCESS. YOU CAN&#39;T FUCKING MAKE AN ONLINE ACCOUNT.</strong> </p>\n\n<p><strong>YES, YOU CAN STILL CALL VIA PHONE WHEN/IF YOU WANT TO SELL BUT, SERIOUSLY?</strong> </p>\n\n<p>this is not FUD. I will post my AST statement if need be, so put down the pitch forks. This is merely a heads up to do it right the <strong>FIRST</strong> time. (although i was more than certain i did it correctly the first time, and damn sure i did the second time) </p>\n\n<p>the last rep i spoke with said he would &quot;escalate&quot; it to a supervisor, that would get back with me within 72 hours. I will post an update once i hear back, if i hear back.</p>\n\n<p>in it for the long haul &lt;3</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "sheezeBreeze", "url": "https://i.redd.it/9h04a6aknm4b1.jpg", "time": 1686157373.0, "subreddit": "r/ThePPShow", "title": "741 IOUs - 13k DRS’d forced hodl style. since AST is wildin these days. about to fuck around and find out &lt;3", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9h04a6aknm4b1.jpg\"/></div>"}]