[{"username": "Significant-Bowler23", "url": "https://www.reddit.com/gallery/15i9wwj", "time": 1691178658, "subreddit": "r/ThePPShow", "title": "Old news, new shills. Anything can happen but RC sold out in August ‘22.", "text": "Not sure why this is going back around but RC sold.  Here are documents From his court case, bbby dockets, his form 4, and then his amendment to his 13d showing he sold his entire position 8/16 & 8/17.  What he did after that we don’t know if he stayed under 5% it wouldn’t be reported.  Anything is still possible. Do your research and spreading bad information around makes the community lose faith in all the DD.  There was SHF fuckery on this company, and investors are hoping for accountability.  I’m not liking the new grifters showing up and muddying the waters.", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/S31lECSsx0LmZm5LleJGNdpWplahoPAzCwTdzAaBC4o.jpg\"/></div>"},
{"username": "Significant-Bowler23", "url": "https://www.reddit.com/gallery/15i9wwj", "time": 1691178658.0, "subreddit": "r/ThePPShow", "title": "Old news, new shills. Anything can happen but RC sold out in August ‘22.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Significant-Bowler23", "url": "/r/FWFBThinkTank/comments/149hqxl/bbbys_10k/", "time": 1686776968.0, "subreddit": "r/ThePPShow", "title": "BBBY's 10-K from Bearz", "text": null, "preview": ""},
{"username": "Significant-Bowler23", "url": "https://i.redd.it/2uvsl2hk9uya1.jpg", "time": 1683634431.0, "subreddit": "r/ThePPShow", "title": "Pete is not a shill. This is just the next forum slide. Haven’t you learned to buckle up already! Zen fellow bobbys!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Is it really that crazy to think that the final equity list released on Friday is the actual TSO?  I mean I love the tinfoil and am bullish for other reasons but the math and theories on this don’t seem true.</p>\n\n<p>The 428 million voting shares is the number from the 3/27 record date and was used because the proxy wasn’t cancelled at the time of the filing.  The footnote stated in the same filings the TSO was over 739 million or something.</p>\n\n<p>The S-1 cancellation did not cancel any shares.  The S-1 was inactive and was not in play yet.  The $300m ATM w/ B reily was part of the S-3 that didn’t expire until 4/26.  The share price at the time of the offering was not high enough to raise the full $300 million with the available shares authorized.  So with that known we are lucky we didn’t end up at 900 million TSO.  They had to show the courts they did everything possible before declaring Ch 11.  They were selling shares up until 4/21 to raise as much as possible. The settlement of the shares was not complete by the hearing date and this explains why the number went from the 739 million from day 1 filings to the 782million number of the final equity list that was released this past Friday.</p>\n\n<p>It seems this has been a forum slide across the board and feel it was planned as a let down when confirmed to create more paperhands.  Just look at the Roach Saga and how he built it up just to crush it down and take some with him.  </p>\n\n<p>The naked shorts do not display at the shares issued level but underneath in the internalization with brokers and MM’s.  THEY DO EXIST.  These numbers will never be shown in court, and is what they want to act like don’t exist.</p>\n\n<p>There are a lot of shares out there and it’s very possible there is a whale or a pod holding out there that is going to hold the board and others accountable.  Buckle Up because this is going to get interesting.  Watch out for the sinkholes!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/2uvsl2hk9uya1.jpg\"/></div>"}]