[{"username": "Silvontoff", "url": "https://www.reddit.com/r/ThePPShow/comments/15ltclc/i_keep_reading_we_will_know_soon_whether_its/", "time": 1691526428.0, "subreddit": "r/ThePPShow", "title": "I keep reading \"We will know soon whether it's lambos or foodstamps\"", "text": "<!-- SC_OFF --><div class=\"md\"><p>...and I am here making my post to tell you, that the court dates, and deadlines DO NOT MATTER for you to win here. Yes, you heard that right. I&#39;m long the stock. I believe the debtors have a plan to restructure in such a way that equity holders are GUARANTEED a victory. However, even if they don&#39;t, you still can win... so long you hold.</p>\n\n<p>The real problem here is that with naked short selling, obligations get postponed as long as possible. Shares get sold to you at whatever price wall street wants, and you are left to wait potentially years for whatever swap those positions are tucked away in to finally expire, and shares be repurchased - and most of the time retail either gives up or faces economic hardships. Many of you have been through GME, and BBBY in august, so everyone here reading this today is very aware that wall street isn&#39;t invincible, those obligations eventually do come due.</p>\n\n<p>Everyone here has likely already experienced the share price dropping at the end of a court hearing at least one time, and everyone here BUYS those shares. <strong>WHO IS SELLING THEM TO YOU?</strong></p>\n\n<p>I will close this up with a simple theoretical question that I&#39;ve never heard anyone ask before, and I think it will help you realize just how much power retail has...</p>\n\n<p>Even if equity holders receive nothing in bankruptcy, <strong>what is to stop any one person from buying a majority of the stock themselves when this is all over,</strong> so long it happens before the ticker is moved to OTC expert market? If wall street wants to short the stock to less than a penny, it opens up the possibility of a single individual or firm buying up the entire float for almost nothing. It would take a single individual $7.3M in cash to buy 730,000,000 shares at one cent. Eyes on the prize, people. <strong>The swaps DO NOT disappear, and wall street is banking on YOU to lose interest when the ch11 case is over and done with.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://i.redd.it/w57qqtt44ygb1.gif\">...and remember they owe you money.</a></p>\n\n<p>Edit: WOW, I didn&#39;t expect to receive so many different shill account comments in the first half hour after sharing this. Wall street is SCARED of people staying interested even in the worst case.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍉 Watermelon Lover 🍉 ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Vr2rgrRsgwMKUpTGvPBFzL4nK-IAFfCw4usW-54cSns.jpg\"/></div>"},
{"username": "Silvontoff", "url": "https://www.reddit.com/r/ThePPShow/comments/15i7c55/did_we_ever_see_docket_1716/", "time": 1691172624.0, "subreddit": "r/ThePPShow", "title": "did we ever see Docket 1716?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Docket 1716 is titled,</p>\n\n<p>&#x200B;</p>\n\n<p>&quot;                                                   Order (1)(A)Conditionally Approving Disclosure Statement, (B)  Approving the solicitation and Notice Procedures with respect to  Confirmation of the Plan, (C) Approving the Forms of Ballots and Notices  in connection with therewith, (D) Scheduling a Combined Disclosure  Statement approval and Plan Confirmation Hearing and certain dates and  deadlines with respect thereto, and (E) Granting related Relief, and  (ii) (A) Extending the Debtors&#39; Exclusive Period to file a Chapter 11  Plan and solicit acceptances thereof pursuant to section 1121 of the  Bankruptcy Code and (B) Granting Related Relief  Related [+].  Service of notice of the entry of this order pursuant to Rule 9022 was  made on the appropriate parties. See BNC Certificate of Notice. Signed  on 8/2/2023. Confirmation hearing to be held on 9/12/2023 at 02:30 PM at VFP - Courtroom 3B, Newark. Last day to Object to Confirmation 9/5/2023. (jf)                    &quot;</p>\n\n<p><a href=\"https://preview.redd.it/l2xwi059w4gb1.png?width=1903&amp;format=png&amp;auto=webp&amp;s=5ae0e214b739da217a9824134f2d079cbdf2d31c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/l2xwi059w4gb1.png?width=1903&amp;format=png&amp;auto=webp&amp;s=5ae0e214b739da217a9824134f2d079cbdf2d31c\" alt=\"1716\"></a></p>\n\n<p>This is what I see on pacer, the docket has not been viewable though on Kroll. Just checking in on you guys with this one. Let me know if you have some information. Thanks!</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍉 Watermelon Lover 🍉 ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/gICgXlvhRgcYhrfT61daW31uQ_cC4OAyEFcUImEZpu8.jpg\"/></div>"},
{"username": "Silvontoff", "url": "https://www.reddit.com/r/ThePPShow/comments/15dbmoa/you_are_the_greatest_asset_to_teddy/", "time": 1690689659.0, "subreddit": "r/ThePPShow", "title": "YOU are the greatest asset to Teddy.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Over the course of the last several decades, we have watched markets magically lose the power of price discovery. Distressed companies can no longer perform a secondary offering except in the rare circumstance of a squeeze, or a swap expiration leading to a required purchase of shares. Gone are the days of a secondary offering being met with caution but open arms. Machines read the text right off the filings, and front run with (naked) short sales before an offering can even hit the market. It&#39;s this reason though, that retail is destined to win. Teddy, an ecommerce giant, NOLs, and all that stuff really sounds wonderful. But NOLs alone wouldn&#39;t be the reason Ryan, or Icahn or anyone else would save this ticker. YOU are the reason this company is worth saving. The value that can be created from retail holding this ticker exceeds that of EVERYTHING we theorize is happening behind the scenes. Your belief that an activist can take advantage of this opportunity, is precisely what will enable an activist to win. How many hundreds of millions of shares have retail purchased at 30 cents or less? Who is selling you those shares? We know 4.5% holders are locked in. Ask yourself who has millions of shares to sell us... All it takes is one docket. One activist, publicly taking control of this ship. Every share I buy, I increase the value of this opportunity for an activist... and that goes for every single one of us. Next time someone asks you what BBBYQ still has that is of value, don&#39;t forget to include yourself. Those short obligations will come full circle. YOU give BBBYQ value.</p>\n\n<p>Long live the highly regarded 💜</p>\n</div><!-- SC_ON -->", "flair": {"text": "🍉 Watermelon Lover 🍉 ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Silvontoff", "url": "https://www.reddit.com/r/ThePPShow/comments/14wv3k9/bbby_squeeze_correlation_with_xrt_retail_etf/", "time": 1689090794.0, "subreddit": "r/ThePPShow", "title": "BBBY squeeze correlation with XRT retail ETF", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ylde29qpxcbb1.png?width=729&amp;format=png&amp;auto=webp&amp;s=694ed1eb52ca45337c3ec41303c8c6b5f52b90a9\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ylde29qpxcbb1.png?width=729&amp;format=png&amp;auto=webp&amp;s=694ed1eb52ca45337c3ec41303c8c6b5f52b90a9\" alt=\"chart is XRT retail ETF, labeled to show the parity to BBBY&#39;s movements.\"></a></p>\n\n<p>It&#39;s that time of year where we squeeeeeeeeeeeeeeeeeeze boys. Nothing like a good squeeze in July to keep the blood flowing am I right? </p>\n</div><!-- SC_ON -->", "flair": {"text": "🍉 Watermelon Lover 🍉 ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/5vFrc_vqdwwtbTgjMkJJCW1sHk7NfNKcEQNN7m8jd-Q.jpg\"/></div>"}]