[{"username": "SilverDapplePony", "url": "https://i.redd.it/4hwwjt3s3byb1.jpg", "time": 1699092982.0, "subreddit": "r/ThePPShow", "title": "Project Crystal", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m not a DD writer, just a lady in Florida. This is a local article about a 1 million square foot warehouse in Jacksonville called “Project Crystal” (based out of Coral Gables!) that the author believes to be Sam’s Club. I do not. </p>\n\n<p><a href=\"https://www.jaxdailyrecord.com/news/2023/nov/03/market-reports-show-sams-club-as-1-million-square-foot-warehouse-tenant/\">https://www.jaxdailyrecord.com/news/2023/nov/03/market-reports-show-sams-club-as-1-million-square-foot-warehouse-tenant/</a></p>\n\n<p>By Karen Brune Mathis  | 12:00 a.m. November 3, 2023\nThe 1 million-square-foot Imeson Park South Building E at 1511 Zoo Parkway sold in September for $95 million.\nThe 1 million-square-foot Imeson Park South Building E at 1511 Zoo Parkway sold in September for $95 million.\nCOLUMNISTS</p>\n\n<p>MATHIS REPORT\nShare<br/>\nWhile Project Crystal hasn’t been confirmed by the tenant or landlord, the probability it is Sam’s Club appears to be well known.</p>\n\n<p>In third-quarter market reports, several commercial real estate firms list Sam’s Club as notable lease transactions during the period.</p>\n\n<p>The information is that Sam’s Club leased a 1,003,200 square-foot-building at 1511 Zoo Parkway, Building E, also known as Building 300.</p>\n\n<p>The lease was signed in July.</p>\n\n<p>NAI Hallmark, CBRE and Cushman &amp; Wakefield identify it. </p>\n\n<p>Colliers and JLL listed the lease as a notable transaction but not the tenant name.</p>\n\n<p>Sam’s Club has been widely believed to be the code-named Project Crystal for the 1 million-square-foot warehouse being completed in Imeson Park South in North Jacksonville. </p>\n\n<p>The city issued a permit in September 2022 for the speculative 1 million-square-foot building.</p>\n\n<p>VanTrust Executive Vice President Marc Munago has not identified the potential tenant.</p>\n\n<p>The building has been identified as the location for Project Crystal, which matches the description of Sam’s Club, the wholesale membership club division of global merchandiser Walmart Inc.</p>\n\n<p>City Council enacted Ordinance 2023-332-A on June 13, 2023, approving a five-year $1.5 million Recapture Enhanced Value Grant for Project Crystal based on 50% of the increase in real and tangible property taxes for the project. </p>\n\n<p>According to a city memo, summary and fact sheet, the project wants to open a distribution facility in the building under construction at 1400 Zoo Parkway, which is the 1 million-square-foot warehouse at Imeson Park South.</p>\n\n<p>The building is on almost 63 acres.</p>\n\n<p>VanTrust Real Estate LLC already has sold the building to a Coral Gables group for $95 million.</p>\n\n<p>Through JI IPS Building E LLC, Van Trust sold the structure at 1511 Zoo Parkway on Sept. 15 to AK Imeson LLC, whose registered agent is Interamerican Corporate Services LLC, led by lawyer Rene Murai.</p>\n\n<p>The deed was recorded Sept. 20 with the Duval County Clerk of Courts.</p>\n\n<p>Colliers Senior Vice President Guy Preston and Executive Vice President Ryan Vaught represented the buyer in the deal. There was no broker on the seller’s side.</p>\n\n<p>VanTrust Real Estate said the Imeson Park South master plan totals 3 million square feet of industrial space.</p>\n\n<p>The 214-acre Imeson Park South property is south of VanTrust’s 146-acre Imeson Park, which totals about 2.5 million square feet and includes a 1 million-square-foot Amazon fulfillment center.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/4hwwjt3s3byb1.jpg\"/></div>"}]