[{"username": "SixStringSuperfly", "url": "https://i.redd.it/qsldlwwel7ub1.jpg", "time": 1697307093.0, "subreddit": "r/ThePPShow", "title": "Some Supplemental Tinfoil to my Data Center Post: Cyxtera Recently Hired M3 Partners", "text": "<!-- SC_OFF --><div class=\"md\"><p>A mid-size data center company called Cyxtera Technologies recently filed for Chapter 11 bankruptcy.  They have every intention of restructuring and are looking for either a buyer or a capital infusion.</p>\n\n<p><a href=\"https://www.cyxterarestructuring.com/\">https://www.cyxterarestructuring.com/</a></p>\n\n<p>One of Cyxtera&#39;s main investors is BC Partners, who also owns 80% of Chewy.</p>\n\n<p>Cyxtera also recently hired M3 Partners, same as Bobby/BUTTFQ and Sears, Toys R Us, etc 🤯</p>\n\n<p>Cyxtera has a global data center footprint with 60+ data centers in prime locations.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/qsldlwwel7ub1.jpg\"/></div>"},
{"username": "SixStringSuperfly", "url": "https://www.reddit.com/gallery/177q3ts", "time": 1697291718.0, "subreddit": "r/ThePPShow", "title": "DK Butterfly *still* has a Tier III 47,500 sq ft 1.0 MW Data Center at 2436 Penny Rd in Claremont, NC", "text": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to follow up on my post from 3 months ago.  <a href=\"https://reddit.com/r/BBBY/s/RMSch0Zijn\">https://reddit.com/r/BBBY/s/RMSch0Zijn</a></p>\n\n<p>To my knowledge, DK Butterfly is still in possession of a Tier III data center in a prime location know as the &quot;North Carolina Data Center Corridor&quot;.</p>\n\n<p>Here&#39;s an article saying the data center is one of Bobby&#39;s most valuable assets:\n<a href=\"https://www.networkworld.com/article/3697155/now-on-sale-at-bed-bath-beyond-one-slightly-used-data-center.html\">https://www.networkworld.com/article/3697155/now-on-sale-at-bed-bath-beyond-one-slightly-used-data-center.html</a></p>\n\n<p>My smooth-brain estimate is between $50-200 million.  The current capacity can also be expanded.</p>\n\n<p>Data centers are huge value right now.  Companies like Google, Apple, Meta, Disney, and Microsoft also have a data center presence in North Carolina.</p>\n\n<p>Amazon and Microsoft continue to invest billions of dollars in their global data center footprint.</p>\n\n<p>Sears just sold their headquarters in Hoffman Estates to a company that builds data centers.</p>\n\n<p>Defense contractors, governments, tech companies, artificial intelligence, cryptocurrencies are all heavily dependent on utilizing data centers.</p>\n\n<p>While Buy Buy Baby may be the crown jewel, the data center is the hidden gem.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/0-b-bs__azqHRs3V6QhilvteCx3-Kt7ONr4XzTyH_eU.jpg\"/></div>"},
{"username": "SixStringSuperfly", "url": "https://www.reddit.com/r/ThePPShow/comments/175f7qm/sears_canada_still_exists/", "time": 1697034181.0, "subreddit": "r/ThePPShow", "title": "Sears Canada Still Exists! 🧰🍁🚀", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been a bit obsessed with SRSCQ since I bought some shares 84 years ago.  My research into Sears Canada has run parallel with my research into Sears Holdings with Shagspeare/SearsForever. </p>\n\n<p>Sears will never die!  💎 🧰 ♾</p>\n\n<p>Sears Canada was spun-off from Sears Holdings a few years ago to become a separate company, with Sears Holdings keeping around 10% of Sears Canada.  (Sears Holdings also spun-off Lands&#39; End and Seritage Growth Properties.)</p>\n\n<p>Sears Canada went through Canadian bankruptcy (CCAA) and still exists as a bare-bones company with a handful of assets.  Sears Canada still has two offices in Toronto (82 Peter Street and an office in the Eaton Centre mall), Sears Floor Covering Centres, and a handful of subsidiaries under the name Initium.</p>\n\n<p>Initium was a project started before bankruptcy to turnaround the company and explore some new business ideas.  One idea was a discount store, similar to Marshalls or TJmaxx, called The Cut.  The subsidiary also still exists, but I&#39;m not aware of any current operations or storefronts.</p>\n\n<p>While Sears Canada went through CCAA, most of its retail footprint was taken over by Nordstrom and... Buy Buy Baby.</p>\n\n<p>Canadians seem to have a fondness for Sears Canada.  Sears Canada also owns the Eaton&#39;s brand, a former Canadian retailer with some very cool history.  Lady Eaton was a classy lady.  She opened The Carlu event venue, aka &quot;Eaton&#39;s Seventh Floor&quot; in Toronto and Eaton&#39; Ninth Floor in Montreal,  which is due to reopen in 2024!  </p>\n\n<p><a href=\"https://cultmtl.com/2023/03/the-eaton-centre-ninth-floor-restaurant-in-montreal-will-reopen-show-venue-included/\">https://cultmtl.com/2023/03/the-eaton-centre-ninth-floor-restaurant-in-montreal-will-reopen-show-venue-included/</a></p>\n\n<p>Sears Canada also seems to have a presence on TikTok, where they beef with Wal-Mart, talk of their &quot;Flop Era&quot;, and hint at a partnership with Zellars (another Canadian brand making a comeback).<br/>\n<a href=\"https://www.tiktok.com/@sears_canada\">https://www.tiktok.com/@sears_canada</a></p>\n\n<p>Yes, Sears Canada has been cellar boxed.  I purchased shares at .0065/share.  SRSCQ still has short interest and continues to have random ass trades at random intervals.  Two shares were traded for .33/share a few days ago.  108 shares were traded at 1.99 yesterday, and so far, it looks like one share has traded today at 1.99.</p>\n\n<p>Anyway, not a very organized post, but I thought I&#39;d drop some knowledge/tin foil.   Sears is quite the rabbit hole, and nothing makes sense. Happy to discuss further in the comments.  </p>\n\n<p>Also, beware the Sears shills.  They are out there for sure.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "SixStringSuperfly", "url": "https://youtu.be/zliasEkWx0M?si=VoLVxO32sSaevhtP", "time": 1696188791.0, "subreddit": "r/ThePPShow", "title": "Dildo Enthusiastics Don't Sleep On This Song 🔥🔥", "text": "<!-- SC_OFF --><div class=\"md\"><p>Banger 🚀🚀🚀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/zliasEkWx0M/maxresdefault.jpg\"/></div>"},
{"username": "SixStringSuperfly", "url": "https://www.coindesk.com/policy/2023/08/25/ftx-blockfis-customer-data-compromised-in-kroll-hack/", "time": 1692972524.0, "subreddit": "r/ThePPShow", "title": "Looks like Kroll got hacked 🔥😬🔥", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yikes!</p>\n</div><!-- SC_ON -->", "preview": ""},
{"username": "SixStringSuperfly", "url": "/r/DeepFuckingValue/comments/15elm5e/a_deeper_look_into_the_undisputed_luld_halt_king/", "time": 1690843954.0, "subreddit": "r/ThePPShow", "title": "A Deeper Look into the Undisputed LULD Halt King, $KOSS", "text": null, "preview": ""},
{"username": "SixStringSuperfly", "url": "https://i.redd.it/d3csphcuhbdb1.jpg", "time": 1689944903, "subreddit": "r/ThePPShow", "title": "Just a lil reminder from Sears world", "text": "Shills love to emphasize the word \"canceled\".  Canceled essentially means shareholders no longer have voting rights.  Stay zen and hold for distributions🧡 💎💰🧸", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/d3csphcuhbdb1.jpg\"/></div>"}]