[{"username": "sleepy-shark", "url": "https://www.reddit.com/r/ThePPShow/comments/17zkgrm/anyone_want_to_force_this_bod_out_after_moass/", "time": 1700471443.0, "subreddit": "r/ThePPShow", "title": "Anyone want to force this BOD out after MOASS?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Seriously, these CEOs and the board shouldn&#39;t be collecting anything if their employees can&#39;t be paid a living wage...and the rats have established their own country within the company&#39;s warehouse. 🤢🐀🤢🐀🤢🐀🤢</p>\n\n<p><a href=\"https://youtu.be/p4QGOHahiVM\">https://youtu.be/p4QGOHahiVM</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "sleepy-shark", "url": "https://www.reddit.com/r/ThePPShow/comments/16r18xs/most_are_far_too_dumb_and_arrogant/", "time": 1695571210.0, "subreddit": "r/ThePPShow", "title": "Most are far too dumb and arrogant ...", "text": "<!-- SC_OFF --><div class=\"md\"><p>It doesn&#39;t matter if they do lose, there is no &quot;sinking in&quot; for them. In the 90&#39;s one man triggered the collapse of England&#39;s oldest bank, Barings. He was not sorry (and probably still isn&#39;t). The fear he felt was fleeting. The banking and finance sector tends to attract Cluster B personalities. If you don&#39;t want to watch a few minutes for context and just cut to what I mean fast forward to 19:34. Don&#39;t get hung up on making them feel fear or sorry, they don&#39;t experience those kind of things (or anything really) like a normal person. I think what I&#39;m trying to say is don&#39;t drink poison in order to hurt someone because it only hurts you in the end. Look to the future and what you&#39;re going to do to better your life and society&#39;s. The ultimate form of revenge for people like this is to live well, literally. Why? Because they don&#39;t experience real happiness or love like a normal person. It makes them irate and uncomfortable, because they can only mimic these things rather than experience them. They are broken people and statistically unlikely to ever be whole, because the majority of them don&#39;t respond to treatment or flat out refuse it.</p>\n\n<p><a href=\"https://youtu.be/avMbu6cc4Eo?si=Fg-6w4UncmCTut47\">How A 28 Year Old Man Destroyed England&#39;s Oldest Bank</a>\nTime Stamps:\n7:26\n9:43\n11:03 \n19:34</p>\n\n<p><a href=\"https://psychcentral.com/disorders/narcissistic-personality-disorder/when-a-narcissist-sees-you-happy#tips-for-dealing-with-a-narcissist\">What to Do When a Narcissist Sees You Happy</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "sleepy-shark", "url": "https://www.reddit.com/r/ThePPShow/comments/16psoer/to_everyone_who_wonders_why_they_wont_go_away/", "time": 1695436183.0, "subreddit": "r/ThePPShow", "title": "To everyone who wonders why they won't go away...", "text": "<!-- SC_OFF --><div class=\"md\"><p>Some of these shills have co-opted therapy speak and are weaponizing it on top of just sinking to some really slimy coercion tactics. They&#39;re doing it to paint anyone who doesn&#39;t follow them as an unintelligent and misguided overly trusting fool. It comes off as incredibly fake (and pretty annoying) to us, it&#39;s like an <a href=\"https://en.m.wikipedia.org/wiki/Uncanny_valley\">uncanny valley</a> of emotions, but to someone who is an outsider it may make sense, because they&#39;re not as invested in this. Manipulative people with <a href=\"https://www.medicalnewstoday.com/articles/320508#:%7E:text=Cluster%20B%3A%20A%20person%20with,histrionic%2C%20and%20narcissistic%20personality%20disorders.\">Cluster B personality disorders</a> and toxic people do stuff like this. They also engage in things like <a href=\"https://www.healthline.com/health/emotional-blackmail#examples\">emotional blackmail</a> to control those around. </p>\n\n<p>They don&#39;t respect boundaries, most of us have told them point blank to leave, but they refuse and keep coming back with criticism wrapped in a thin veneer of concern. We&#39;ve given our stances and they completely ignore the argument. In place of something to counteract our points they resort to using ridicule, <a href=\"https://www.floridawomenslawgroup.com/the-narcissists-word-salad/#:%7E:text=The%20narcissist%20uses%20a%20word,you%20or%20say%20something%20mean.\">word salad</a>, or they completely ignore what was said. If they actually cared and respected us they would leave us alone and move on to something else. So why are they coming back again and again? Because they want us to let go of something valuable to save their skins. We are fully aware of the risks and we have whole heatedly chosen to not only accept these risks but to trust our due diligence and instincts.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "sleepy-shark", "url": "https://www.reddit.com/r/ThePPShow/comments/165mowx/is_anyone_else_surprised/", "time": 1693420322.0, "subreddit": "r/ThePPShow", "title": "Is anyone else surprised...", "text": "<!-- SC_OFF --><div class=\"md\"><p>...that they haven&#39;t tried a real fake out yet? I was expecting them to be smarter with their tricks by running up BBBYQ to like .99 while running a a few articles that the stock had &quot;peaked.&quot; Just before dropping it back to something stupid low like .09 and claiming we were dumb and doomed. 😂 But no, it&#39;s &quot;gEt ouT Of tHis bAd StocK beCaUse It&#39;s sO baD yOu FOOLS.&quot; What they&#39;ve doing is like dumb Disney villain type of nonsense that makes them look like...well a joke and that they have nothing of substance move wise.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "sleepy-shark", "url": "https://www.reddit.com/r/ThePPShow/comments/15wi2y3/how_many_are_left_now/", "time": 1692554177.0, "subreddit": "r/ThePPShow", "title": "How many are left now?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was wondering how many of BBBY&#39;s old leases were left on the list? The one for 8/30/23 may get bumped up (per the filing entered 08/18/23 @ 20:00:05), and I see another hearing on 08/29/23... Is there only one more or is that for something else? I&#39;ve been pretty sick and busy so I haven&#39;t been able to track this court case as much as I normally would. Thanks. ✌🏼</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]