[{"username": "Slow-Satisfaction-79", "url": "https://www.reddit.com/r/ThePPShow/comments/15i2fpj/silent_wars_it_applied_to_all_of_us_everything/", "time": 1691161357.0, "subreddit": "r/ThePPShow", "title": "Silent wars, it applied to all of us. Everything manipulated against us to enslave us and dumb us down.", "text": "<!-- SC_OFF --><div class=\"md\"><p>When you really want to understand why the stock market and why this elites market makers etc are they way they are! Its all here. Their is a silent war against all of us.</p>\n\n<p><a href=\"https://youtu.be/TeeNEeb_Clo\">https://youtu.be/TeeNEeb_Clo</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Slow-Satisfaction-79", "url": "https://www.reddit.com/r/ThePPShow/comments/15e3y1p/no_emotions_is_the_key/", "time": 1690771092.0, "subreddit": "r/ThePPShow", "title": "No emotions is the Key", "text": "<!-- SC_OFF --><div class=\"md\"><p>Im blind to all FUD. I just buy and chill. If i truly believe in this then its absolute zero or hero. No in between playing with my own emotions. Buy buy buy as much as i can when i can and see it through... trust in all your d.d, all the signs, all the logic from all intelligent apes out there. I wont be a victim to emotions. Thats literally what ken griffin spent 200 million for! They need our emotions to beat us. Well im a fucking robot to this play. 🤖 they wont get me interacting except to give y&#39;all some of my tactics. I swear if this goes on to sept and i get my settlement in time i will be buying 75k to my 25k and will drs 75k because if this is the teddy gmerica competition to Amazon.... sweet tears of joy. Imagine getting in amazon in the pennies! This possibly is it. And im trying to make this the only play i need to do for rest of my life if that&#39;s the case.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Slow-Satisfaction-79", "url": "https://v.redd.it/1ik0gpy15zdb1", "time": 1690234525.0, "subreddit": "r/ThePPShow", "title": "Robert Downey jr on Wall Street pits circa the 90s", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://external-preview.redd.it/dXhyZGtldDE1emRiMRJBHMqXP4KTLj750b1MV0YJodk-xqy9uKrZXvP4ReQi.png?width=140&amp;height=127&amp;crop=140:127,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=1854cb571bdd6f6942f20c3749f46ea88a4b3463\"/></div>"},
{"username": "Slow-Satisfaction-79", "url": "https://i.redd.it/fu3ccqdjh7bb1.png", "time": 1689024678.0, "subreddit": "r/ThePPShow", "title": "Ryan Cohen the activist of Wall Street.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Iam in my mood to make memes. Like a little hobby to photoshop pictures and occupied my time. But inwas inspired to make this just now because the wolves are always praised even though they are the bad guys and the Activist are look over even though they push fornmy equality for the average person like us.\nI feel that in the near future when more stocks squeeze and abundance is flowing and us apes feel better with more money that we start to wash away the separation of plays and support one another. \nWe don&#39;t have to agree on all plays and have different view points on what we think will squeeze and won&#39;t. But never should we attack each other. We may not agree on one play but might agree on a different one and do the push one it together. \nThe goal i believe is to change the narrative of naked shorting and illegal aspecsn that&#39;s going on in the market.\nWell i personally want BBBY GME AMC and all other companies thats being victimized to squeeze. America was founded on a multitude of corporations not conglomerate companies thats crushing competition. I say all this with positive energy please save all the negativity for another post. I want all of you rich and live in abundance for your family. All races religions and creed.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/fu3ccqdjh7bb1.png\"/></div>"},
{"username": "Slow-Satisfaction-79", "url": "https://www.reddit.com/r/ThePPShow/comments/14w6mrp/just_in_case_you_didnt_know_about_overstock/", "time": 1689023757.0, "subreddit": "r/ThePPShow", "title": "Just in case you didn't know about Overstock 😉", "text": "<!-- SC_OFF --><div class=\"md\"><p>March of 2020 overstock was at a $3 price and by August of 2020 they jump to $121 because of a short squeeze. \nThey been under fire by shorts. The short sellers was force to cover their position because overstock launched a tZero. That&#39;s a blockchain based coin exchanged. The stock went from $3 dollars to $121 brilliant move.\nAnd i don&#39;t think their connection with bbby is mere coincidence. They definitely having fun with the twitts today with the teddy bear. \nSo my thoughts are &quot;so you saying their a chance&quot; 😉🐻 \nMany maybe knew this but there many who didn&#39;t.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Slow-Satisfaction-79", "url": "https://i.redd.it/1ponjdxgnkab1.png", "time": 1688748213.0, "subreddit": "r/ThePPShow", "title": "Tasty BBBYQ dip today! Eat my friends Eat... feast on the bones of the ignorant S.H.F", "text": "<!-- SC_OFF --><div class=\"md\"><p>I love it when a good plan comes together. 🦧\nCanceled Auction! are y&#39;all gonna feed into another way to spin fud on a stock thats already written and file in the Win column... Holly got this all under control. Reorganization doesn&#39;t mean auctions. That just a possible aspect of the process. The plan is to keep us functioning! And of that&#39;s the case our shares will remain with us until the value raise back pre bankruptcy and pre dept.... and with proper dealings we will exceed the pre dept to numbers worthy of the deal. Plus a side of hedgies blood to sip it down... i just like making memes 😁</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/1ponjdxgnkab1.png\"/></div>"},
{"username": "Slow-Satisfaction-79", "url": "https://www.reddit.com/r/ThePPShow/comments/14t810s/i_can_feel_a_run_soon_brewing_bbbyq/", "time": 1688738176.0, "subreddit": "r/ThePPShow", "title": "I CAN FEEL A RUN SOON BREWING BBBYQ", "text": "<!-- SC_OFF --><div class=\"md\"><p>I see the fud media and shilling going on. What dont make sense is the fear from a auction being canceled 😆. They dropped it this morning BUT! I feel a good run in the air today and we will close in the green! 🟢</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Slow-Satisfaction-79", "url": "https://i.redd.it/k6nbe94umjab1.png", "time": 1688735894.0, "subreddit": "r/ThePPShow", "title": "Bed Bath and Beyond", "text": "<!-- SC_OFF --><div class=\"md\"><p>I know everything is already written in the history books. All i can do it wait until it all manifest..... ✊🏿💥💣⏳️\nThe spoils will be given to those who plant their feet sturdy into the unstable ground and hold their balance until all the rumblings stop. The scenery won&#39;t look familiar in the aftermath! What you once remembered has drastically changed. But you survived! Not only did you survive but all the abundance from those who didn&#39;t survive will be yours. Trust you instincts Trust your D.D.....</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/k6nbe94umjab1.png\"/></div>"},
{"username": "Slow-Satisfaction-79", "url": "https://www.reddit.com/r/ThePPShow/comments/14n12tu/they_attacking_bbbyq_and_guess_what_i_aint_selling/", "time": 1688133265.0, "subreddit": "r/ThePPShow", "title": "They attacking Bbbyq and guess what!!!? I aint selling...", "text": "<!-- SC_OFF --><div class=\"md\"><p>As usual the attack is on.... and not selling not one share but gonna buy on the dip.... as the courtroom judge recently said the Dip remains and we gonna eat it up. Enjoy y&#39;all day and weekend people.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]