[{"username": "Smileinspector", "url": "https://www.reddit.com/r/ThePPShow/comments/17z7q5i/hows_everyone_coping/", "time": 1700429918.0, "subreddit": "r/ThePPShow", "title": "How’s everyone coping??", "text": "<!-- SC_OFF --><div class=\"md\"><p>While it’s nice to think everyone’s feeling zen as fuck these days, the reality is many of us are feeling pretty anxious about what’s been going on with our beloved\nBobby. The best part of this journey is knowing theres tens of thousands just like you out there - so whatever you’re feeling, take comfort that you’re not alone. </p>\n\n<p>Thought it would be nice to share advice and tips on how best to deal with these issues….</p>\n\n<p>I’ve started taking Melatonin to cure my Bobby induced insomnia. I’m sleeping like a baby now and waking fresh every morning. </p>\n\n<p>Please share your own lifestyle tips/advice on how best to overcome any anxiety. </p>\n\n<p>See you all on the moon 🚀🚀🚀🚀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Smileinspector", "url": "https://www.reddit.com/r/ThePPShow/comments/17wg6ms/an_unpopular_opinion_or_is_it/", "time": 1700116262.0, "subreddit": "r/ThePPShow", "title": "An unpopular opinion… Or is it?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’m here for MOASS, plain and simple. I’m just waiting for pay-day so I can ride off into the sunset, and never worry about money again.</p>\n\n<p>I don’t give a fuck about making a change for fairer markets, signing petitions, hedgies getting locked up, etc. Whatever happens after MOASS, the markets will be re-rigged to ensure the crime and corruption can continue - that’s always been the way after every scandal.</p>\n\n<p>Ironically, the best way to effect change is by taking all of Wall Street’s money - and walking away with it. </p>\n\n<p>Never give them the opportunity to take it back. </p>\n\n<p>Most of us have been here for years now on these subs, and the crime and corruption that’s been exposed is depressing as fuck. Everyone in the US chain of financial “policing” is complicit, all the way up to the White House. </p>\n\n<p>So yeah, I’m looking forward to taking my ball off the pitch and going home. </p>\n\n<p>I’m also looking forward to no longer being edged by billionaires and grandsons of billionaires - it’s been the longest mind fuck I’ve ever experienced.</p>\n\n<p>While alot of you are partying away at meet ups post MOASS, I’ll be chilling in the west of Ireland over a pint of Guinness - as I finally delete Reddit from my phone.</p>\n\n<p>That’s when it’s truly over for me.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Smileinspector", "url": "https://www.reddit.com/r/ThePPShow/comments/17h0m89/something_doesnt_add_up_about_phil_the_shorts/", "time": 1698338260.0, "subreddit": "r/ThePPShow", "title": "Something doesn’t add up about Phil The Shorts’ courtesy close.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I member hearing 84 years ago that shorts don’t have to close their position in the event of bankruptcy. If they don’t close it, then their gain is considered unrealised,  and they aren’t liable to pay any taxes on it. This is why  bankruptcy is a short sellers wet dream. They get to utilise all that capital without creating a taxable event. </p>\n\n<p>Now why was Phil The Short so eager to get a courtesy close on BBBY? Is he afraid of this stock resurrecting and wrecking him? Either way, he may be off the hook, but his broker has more than likely assumed the liability. And Phil’s gain is now liable for taxes.</p>\n\n<p>Every short will need to cover their liabilities when this stock/ equity rises from the ashes. 🚀🚀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Smileinspector", "url": "https://www.reddit.com/r/ThePPShow/comments/173i3pe/its_time_to_get_your_game_face_on_forget_about/", "time": 1696822344.0, "subreddit": "r/ThePPShow", "title": "It’s time to get your game face on - forget about meme prices.", "text": "<!-- SC_OFF --><div class=\"md\"><p>You’ve all invested your hard earned cash in this stock, and deserve every fucking penny you get when this finally squeezes. Many will say “you got lucky”, yet they have no idea about the financial ass raping we’ve all received over the last year. This won’t be money won - it’ll be money earned. And hard-earned at that. </p>\n\n<p>This could turn out to be the greatest play ever witnessed in stock market history. Hold for all the fuckery we’ve witnessed for over 12 months now, hold in memory of Gustavo Arnal - our CFO who was driven to suicide last year. </p>\n\n<p>So when the time comes, forget about meme prices and funny numbers like $69 and $420 etc. If you insist, at least add a few zeros. </p>\n\n<p>By holding until after the apex peak of a squeeze, you know you will have contributed to bleeding the hedgies as dry as possible. Selling for meme prices during a squeeze is a hedgie’s wet dream - do not give them what they want. </p>\n\n<p>As a great man once said.. “Show them no quarter ☠️☠️”.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Smileinspector", "url": "https://www.reddit.com/r/ThePPShow/comments/16yyh6n/what_is_the_relevance_of_ice_cream/", "time": 1696355244.0, "subreddit": "r/ThePPShow", "title": "What is the relevance of ice cream?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Can someone ELI5 to the new members of this sub the relevance of ice cream to Bobby? The recent Elon tweets and Pulte eating ice cream when on The PP Show have left me scratching my head.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Smileinspector", "url": "https://i.redd.it/v4uhcrzl5vrb1.jpg", "time": 1696284799.0, "subreddit": "r/ThePPShow", "title": "New notification when logging into IBKR. They state the valuation for BBBYQ may not be accurate, and can change at any time.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/v4uhcrzl5vrb1.jpg\"/></div>"},
{"username": "Smileinspector", "url": "https://www.reddit.com/r/ThePPShow/comments/16y9ka3/thank_god_i_found_this_sub/", "time": 1696283256.0, "subreddit": "r/ThePPShow", "title": "Thank God I found this sub", "text": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been a long time Bobby holder and the last few weeks have been difficult to stomach, watching everything unfold. The main Bobby sub was my only source of info and there has been absolutely no mention of the potential $25+ offering per share, the place seems overrun with shills. </p>\n\n<p>When I decided to hold to 0 or the moon, I meant it and felt like a fool watching the posts and comments over the last week. I have a substantial amount of shares held across a few different brokers, I’ve sold nothing. </p>\n\n<p>Finding this sub this evening and seeing how active it is with true Bobby holders has given me somewhat of an awakening. The fight goes on and if I could keep buying, I would. </p>\n\n<p>And I didn’t go through this absolute mind fuck of an investment to settle for $25 a share. FUCK THAT. I’ll be holding for magnitudes more.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]