[{"username": "somerandomguy_mel", "url": "https://www.reddit.com/r/ThePPShow/comments/17pv4w7/i_love_the_post_dynamic_in_this_sub/", "time": 1699366243.0, "subreddit": "r/ThePPShow", "title": "I love the post dynamic in this sub", "text": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know what it is, mods doing a great job of keeping it clean, sub members being smarter or the sub being less crowded in general. Probably all of it.</p>\n\n<p>But whenever i check this sub (at least most times) I don&#39;t have to search through 500 useless posts clogging up the feed. Posts are generally more informative and less repetitive compared to the likes of sooperstank back when i was active. I appreciate that! </p>\n\n<p>Thanks for everyone doing their part in keeping it this way.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "somerandomguy_mel", "url": "https://i.redd.it/zq15415z0jyb1.jpg", "time": 1699188895.0, "subreddit": "r/ThePPShow", "title": "I present to you, the most bullish indicator we have. Rent free I say, rent fucking free. If it was over she wouldn't care 😂", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/zq15415z0jyb1.jpg\"/></div>"},
{"username": "somerandomguy_mel", "url": "https://www.reddit.com/r/ThePPShow/comments/173z756/im_sorry_if_i_wont_be_around_to_witness_this/", "time": 1696876271.0, "subreddit": "r/ThePPShow", "title": "I'm sorry if I won't be around to witness this revolution", "text": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t want do disclose much detail on what specifically I&#39;m dealing with right now. I just want you guys to keep going, no matter what adversary, no matter what psyops, keep pressing until you get your well deserved financial freedom. I&#39;ve been dealing with a rather complex medical issue for a while now and no matter what I try it keeps blowing up in my face. I&#39;d love the financial reward of this play about right now but I don&#39;t know how much longer it will take. </p>\n\n<p>It could be just a few more days or weeks, but I don&#39;t know how much longer this fucked up body of mine will take it. Just do me a favor and see this through to the end, while my shares be part of the infinity pool to support you guys reach the end of this whole thing. Needless to say i&#39;ve had some kind of a setback this evening and it doesn&#39;t look very good. </p>\n\n<p>I&#39;ll be holding now and post mortem if it comes to that. Change the medical system, if you get the chance.</p>\n\n<p>Peace out, I love you guys.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "somerandomguy_mel", "url": "https://www.reddit.com/r/ThePPShow/comments/16nioho/a_small_post_moass_rulebook_apes_should_prosper/", "time": 1695208766.0, "subreddit": "r/ThePPShow", "title": "A small post moass rulebook - apes should prosper", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>Post-moass Rulebook</strong> </p>\n\n<ol>\n<li><p>Spend-as-needed monthly budget for necessities. This includes: groceries, hygiene products, rent, water, electricity, repairs/replacements, healthcare, phone bill, internet bill and similar “has to be paid” bills or standards of modern households. May be expanded as needed in terms of healthcare or other individual necessities. Pay off ongoing loans in full, don’t lose money on interest. Also, buy high quality groceries. Your nutrition and health are important. </p></li>\n<li><p>Invest in commodities. <strong>Own</strong> a home. Make it a nice one, it will not only improve your quality of life but also be a stable value commodity. Rare metals (in physical form), real estate and partial reinvestment in stocks (good ones, like Teddy, GME, etc.), as well as multiple bank accounts protected by FDIC with compounding interest. Control your spending by an automated money transfer to a “spending account”. This will help you keep track.</p></li>\n<li><p>Fuck luxury cars or yachts. Keep a low profile in day-to-day life. Letting others see your wealth attracts fake friends and grifters while being dangerous at the same time. People will do anything for your money. Keep quiet as much as you can, show as little as possible to the public. </p></li>\n<li><p>You still want luxuries? Fine. Be smart about it. Buying a $500k car means you will need a lot of cash for gas, repairs, insurance etc. Make it a calculated decision, run the numbers for at least 5-10 years to come. Having $500k doesn’t mean you can afford a $500k car long term. And don’t park it in front of your home. Get a garage, you can afford it. Keep it safe and away from too many eyes. And don’t think this is overkill or paranoid, if you were an armed robber which house would you pick? That’s right. </p></li>\n<li><p>Take care of your loved ones. The ones you trust. Make sure they’re healthy. If they can’t afford necessities of life or are struggling with groceries or medical bills, you know what to do. But be careful, limit yourself to your close loved ones. It’s easy to try and fix everything around you, but you can’t and it’s risky. Don’t let people take advantage of you. As always, keep your profile as low as possible. </p></li>\n<li><p>Get a job. Not a “I need money to survive” job. A real job, something that fulfills you. Something that matters to you. You now have the luxury of being independent, so find something to spend your time with. Take the necessary steps (necessary degrees or similar) and do it. You will need a purpose for yourself with all that money, so find one. </p></li>\n<li><p>Lay off bad habits. I know it’s not as easy as it sounds, I’m a smoker myself. Alcohol, cigarettes, drugs, whatever it is. Get rid of it, get clean if that applies to you and work on yourself. Replace bad habits with healthy ones, get to the gym, visit support groups if necessary, make sure you can use what you achieved to the fullest. And I’m not saying you can’t have a beer or a little weed, but everything has its limits and moderation is key. </p></li>\n<li><p>Last rule, this is my individual rule book. Yours might differ, but I strongly suggest you <strong>write</strong> one for yourself. I believe my points are important and I am by no means saying this list is complete. But it’s a start. Happy to hear feedback. Stay healthy, this world needs you. </p></li>\n</ol>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "somerandomguy_mel", "url": "https://v.redd.it/55uu08pfk2db1", "time": 1689836899.0, "subreddit": "r/ThePPShow", "title": "I've been feeling a certain tingle the last few days...SO GET HYPED", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/9VnpkaDbSoIZsPiwOW1-wEkWs8ZkK4vCxba_zgosq-g.jpg\"/></div>"},
{"username": "somerandomguy_mel", "url": "https://www.reddit.com/r/ThePPShow/comments/1536h78/ctb_rocketing_what_does_it_indicate_lets_collect/", "time": 1689705417.0, "subreddit": "r/ThePPShow", "title": "CTB rocketing - what does it indicate? Let's collect some theories and opinions.", "text": "<!-- SC_OFF --><div class=\"md\"><p>So CTB has been a central indicator for squeeze plays like GME and BBBY for 84 years now. There&#39;s always been some kind of correlation with the price but none that was clear enough to pinpoint. </p>\n\n<p>We&#39;ve seen CTB rocketing and subsequent or simultaneous price rocketing in the past but we&#39;ve also seen CTB spikes with sideways or even down movement.</p>\n\n<p>So if we take simple principle of supply and demand, we could theorize the following:</p>\n\n<p>1) Huge share demand to suppress upcoming price surge --&gt; higher CTB --&gt; price will boom soon </p>\n\n<p>2) Sudden decrease in available shares (through DRS surge for example) --&gt; low supply --&gt; high CTB</p>\n\n<p>3) Lenders raise CTB because why not, free money, demand is high anyway. Especially when price will move soon and hedgies know</p>\n\n<p>4) Manipulation of CTB to mislead people into diverting from real play to scam plays (see AMSneed and AA)</p>\n\n<p>5) ????</p>\n\n<p>So, you guys got any more theories? I think the current situation mimics the last august runup, but other explanations seem logical as well. But then again, how come there&#39;s been times where CTB didn&#39;t do shit to the price? </p>\n\n<p>Drop your thoughts peeps and hodl for the ride</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "somerandomguy_mel", "url": "https://www.reddit.com/r/ThePPShow/comments/14zqqb2/oh_surprise_ta_doesnt_work_who_could_have_seen/", "time": 1689365447.0, "subreddit": "r/ThePPShow", "title": "Oh surprise, TA doesn't work, who could have seen that coming?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Can we now finally fuck off about fairy dust colorful lines on graphs and get back to business? Jeez.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "somerandomguy_mel", "url": "https://www.reddit.com/r/ThePPShow/comments/149zg55/anyone_else_getting_an_assload_of_bots_following/", "time": 1686826846.0, "subreddit": "r/ThePPShow", "title": "Anyone else getting an assload of bots following them the last 2 weeks?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve read theories regarding the reddit api change being the reason, bots trying to advertise their websites or &quot;products&quot; before reddit user volume dies down. </p>\n\n<p>But what if this is just bots getting ready to bombard you with FUD during moass or a dip? Tinfoil is strong, i know, but it is well within their playbook ain&#39;t it?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]