[{"username": "SomeDumbApe", "url": "https://www.change.org/p/implement-a-temporary-ban-on-short-selling-in-the-united-states-stock-market", "time": 1700452968.0, "subreddit": "r/ThePPShow", "title": "Implement a temporary ban on short selling - online petition", "text": "<!-- SC_OFF --><div class=\"md\"><p>@HamShortKiller is in talks with the Secret Service and FBI to do what the SEC continues to fail to enforce.  Counterfeiting securities is more of a crime than copied $20 bills and yet no one goes to jail.  Yes, Dougie “Naked Forehead”, this means your time is coming.</p>\n\n<p><a href=\"https://x.com/hamshortkiller/status/1726417879787008202?s=46&amp;t=efQd0KTNiHc611uaAJGLwg\">https://x.com/hamshortkiller/status/1726417879787008202?s=46&amp;t=efQd0KTNiHc611uaAJGLwg</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": ""},
{"username": "SomeDumbApe", "url": "https://twitter.com/i/spaces/1PlKQDWBmbBxE", "time": 1697582532.0, "subreddit": "r/ThePPShow", "title": "The Anatomy of Market Fraud - Dr Rob Shapiro and Atty Wes Christian “in Texas we call that stealing”", "text": "<!-- SC_OFF --><div class=\"md\"><p>Great space call today from the knights of old in the broader fight against counterfeit securities fraud aka naked shorting.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "SomeDumbApe", "url": "https://youtu.be/26_IcexvePA?si=oCQqsQIxtJrSYCXC", "time": 1696712897.0, "subreddit": "r/ThePPShow", "title": "Naked Short Selling is Counterfeit Securities Fraud. Checkout this old documentary if you never saw it and also @HamShortKiller on Twitter 23 year fight", "text": "<!-- SC_OFF --><div class=\"md\"><p>Saw this in the spring of 2021 in the mass migration from wsb to GME to SS after taking the red pill and seeing how deep this rabbit hole goes.  It all relates to GME, BBBY and many others massively naked shorted.</p>\n\n<p>If you never saw this documentary make sure to check it out.  Dr T (Queen Kong) and Atty Wes Christian (“in Texas we call that stealing”) are legends in this fight.   </p>\n\n<p>Also check out @HamShortKiller on Twitter fighting the good fight for 23 years.  He put a large LED truck in front of the SEC and DOJ 14 times all day.   Walks the halls of congress and whistleblows to the regulators deaf ears which are finally starting to listen after MMTLP.  He deserves a Medal of Unwavering Conviction.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.ytimg.com/vi/26_IcexvePA/maxresdefault.jpg\"/></div>"},
{"username": "SomeDumbApe", "url": "https://www.youtube.com/live/1vdcp0JVptc?si=BvExK-wfroAsP-QU", "time": 1695023235.0, "subreddit": "r/ThePPShow", "title": "Naked Short fight with @HamShortKiller - 23 years", "text": "<!-- SC_OFF --><div class=\"md\"><p>The fight relates to bbbyq and all stocks.   Give @HamShortKiller a listen on the fraud.  23 years fighting the fight.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"},
{"username": "SomeDumbApe", "url": "https://www.reddit.com/r/ThePPShow/comments/16jxav1/naked_short_fights_for_baby_and_others/", "time": 1694835498.0, "subreddit": "r/ThePPShow", "title": "Naked Short fights for Baby and others", "text": "<!-- SC_OFF --><div class=\"md\"><p>The sad truth is the equity markets are fraud due to naked shorting continuing to be allowed for Goldman Sacs and others profitable stock lending programs.   sEc has always been complicit in the fraud.</p>\n\n<p>We are in parallel fights like GME, MMTLP, FNGR and GTII.   @HamShortKiller deserves enormous respect for fighting the naked short war for 23 years.  He walks the congress, whistle blows to the SEC, FBI, DOJ and anyone who will listen.  He called out GME pre-squeeze like DFV.  He has had a banner truck right in front of the SEC 12 times including today with criminal naked short sellers all over it.</p>\n\n<p>He has no interest in other plays like baby, but he is dead right on FNGR and GTII.   They are one of a handful of companies like GME that are truly fighting the shorts.   Most companies like AA popcorn and Tritton JPM before RC enter into death spiral financing and give in to the shorts with reverse splits.</p>\n\n<p>Check out Ham if you care to continue this fight along with this Baby.   If you are or not an MMTLP diamond holder like me, check out Hams latest call today at 59:00. (Give him a break, he’s a boomer with his friend William).  Encouraging news in the Senate due to 65k tenacious share holders giving their congress folks hell.</p>\n\n<p><a href=\"https://www.youtube.com/live/-R_nPiiApeo?si=2S2xFQlK9A0_LVY8\">https://www.youtube.com/live/-R_nPiiApeo?si=2S2xFQlK9A0_LVY8</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "SomeDumbApe", "url": "https://www.reddit.com/r/ThePPShow/comments/16g7ewg/ma_idea_for_william_shatner_andor_keanu_reeves_to/", "time": 1694466480.0, "subreddit": "r/ThePPShow", "title": "M&amp;A idea for William Shatner and/or Keanu Reeves to become spokesperson for Teddy in exchange for equity — RC capital formation", "text": "<!-- SC_OFF --><div class=\"md\"><p>Checkout the old school cool video of young Keanu Reeves promoting teddy bears and William Shatner toying with the cyber crew NFT Loopring gaming potential with Fortnite this past may.</p>\n\n<p>A character like Shatner on Priceline is priceless.   Warp speed Scotty!</p>\n\n<p><a href=\"https://reddit.com/r/OldSchoolCool/s/m2P6ztv9p6\">https://reddit.com/r/OldSchoolCool/s/m2P6ztv9p6</a></p>\n\n<p><a href=\"https://x.com/cybercrewnft/status/1653952785552121856?s=46&amp;t=efQd0KTNiHc611uaAJGLw\">https://x.com/cybercrewnft/status/1653952785552121856?s=46&amp;t=efQd0KTNiHc611uaAJGLw</a></p>\n\n<p><a href=\"/u/RealPulte\">u/RealPulte</a> thoughts?</p>\n</div><!-- SC_ON -->", "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "SomeDumbApe", "url": "https://i.redd.it/9nxligmpppgb1.jpg", "time": 1691424589.0, "subreddit": "r/ThePPShow", "title": "Baby has something cool soon", "text": null, "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/9nxligmpppgb1.jpg\"/></div>"},
{"username": "SomeDumbApe", "url": "https://www.reddit.com/r/ThePPShow/comments/14xagfa/mmtlp_resources/", "time": 1689126657.0, "subreddit": "r/ThePPShow", "title": "MMTLP resources", "text": "<!-- SC_OFF --><div class=\"md\"><p>From the show tonight, better answers on MMTLP U3 halt for those that want to know:</p>\n\n<p><a href=\"https://twitter.com/krucialmix/status/1651227127671586816/photo/1\">https://twitter.com/krucialmix/status/1651227127671586816/photo/1</a></p>\n\n<p><a href=\"https://mmtlpresources.com/\">https://mmtlpresources.com/</a></p>\n\n<p><a href=\"https://youtu.be/B73ZHdfHWMI\">https://youtu.be/B73ZHdfHWMI</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "SomeDumbApe", "url": "https://www.youtube.com/live/rlgZEeap8Y0?feature=share", "time": 1688786171.0, "subreddit": "r/ThePPShow", "title": "Salute to dildo slaps everywhere against Naked Shorting Counterfeit Securities fraud - Baby and all", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just wanted to express some opinion and a whole lot of hopium towards everyone’s goals of investing in a company and vision of likely acquisition partners that should yield great returns short and long term.</p>\n\n<p>Disclosure: not financial advise, just the opinion of a fully regarded household investor.   Have made great returns over the years up until I dug into gamestop February 2001.  Following the who what when where on what triggered the sneeze, led me to all the GME DD exposing the shocking fraud and corruption of our markets that we were raised to believe was a reasonable free market system,   It was shocking to find so much daily naked shorting, dark pools, marking shorts long, married puts and calls, total return swaps, spoof orders, offshore Brazilian puts and endless crime that appears to allow Wall Street to make more money destroying companies with naked shorts like cancer cure startups, Sears, ToysRUs, blockbuster and many others rather than investing to build good companies in capital formation.</p>\n\n<p>My positions in GME and BBBY started in Feb 2001 and buys continued through today.   I DRSd the majority of my positions since August 2001 after the original discovery of DRS thanks to Queen Kong Dr Trimbath and many brilliant minds of the early days in Superstonk.  RC hinted at this early with the Dr Ruth Sex book tweet and the computer chair tweets.   I followed RC into bbby with his first investment and letter to the board.  never really believed he fully left with MSM fud.</p>\n\n<p><a href=\"https://fliphtml5.com/bookcase/kosyg\">https://fliphtml5.com/bookcase/kosyg</a></p>\n\n<p>Now that bbby was taken down to OTC Ch 11, I only built more heavy positions and lowered cost average to .20.   XXXX holder of each play.  Building positions in IEP now as well.</p>\n\n<p>Truly believe the going theories that Carl Icahn and RC are reverse merging this into Teddy as the new Amazon competitor.  Court dockets show this connection more and more every day.  Maybe Overstock, Blockbuster, Sears and others could possibly be in this master game plan.</p>\n\n<p>All the while I feel I learned even more from Atty Wes Christian, William P Farrand and @HamShortKiller who have been in this fight for twenty plus years.  Parallel fights in MMTLP with #FinraFraud exposed even more systemic risk and failure of our regulators to combat naked shorting.</p>\n\n<p>Anyhow, just wanted to share William and Ham for anyone not aware of parallel fights in GTII and FNGR</p>\n\n<p>Love the PP show and dildo slaps to all the shills.</p>\n\n<p>No Cell, No Sell for this regard.   Best of luck to all household investors.</p>\n</div><!-- SC_ON -->", "flair": {"text": "🧠 Great Mind 🧠", "text_color": "dark", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"}]