[{"username": "SpecialistNeat9882", "url": "https://www.reddit.com/r/ThePPShow/comments/17yb0cr/pulte_x_tswift_tinfoil_2nd_attempt_at_posting/", "time": 1700327518.0, "subreddit": "r/ThePPShow", "title": "Pulte x TSwift tinfoil (2nd attempt at posting)", "text": "<!-- SC_OFF --><div class=\"md\"><p>I wear lace less shoes because I don&#39;t know how to tie regular shoes so take that information into consideration prior to reading the following: </p>\n\n<p>I was having a think when something hit me. I dont know all the details, but the misses was telling me about Taylor Swift re-recording her albums because of some ownership beef something or other. Evidently she reclaimed ownership of the master versions of her early work. </p>\n\n<p>They were in jeopardy of being taken from her because of a change in ownership and whatever record label drama ensued. </p>\n\n<p>What the fuck if: Pulte referencing TSwift is a nod to the notion of taking back ownership of what is yours (i.e., stocks that you purchase)? Couple of things here. Take ownership of what&#39;s yours (stocks as pieces of ownership in a company) and change in ownership. </p>\n\n<p>All right. I&#39;m going to go watch a YouTube video to learn how to tie me shoes now.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "SpecialistNeat9882", "url": "https://www.reddit.com/r/ThePPShow/comments/155p6u3/another_perspective_on_the_drop/", "time": 1689948733.0, "subreddit": "r/ThePPShow", "title": "Another perspective on the drop.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Didn&#39;t U say Bobby has a gap at about .34?</p>\n\n<p>Looks like now Bobby HAD a gap at about .34. </p>\n\n<p>Maybe we&#39;re now clear for take off. Buckle up, mother lovers.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "SpecialistNeat9882", "url": "https://www.reddit.com/r/ThePPShow/comments/14587mv/a_thought_based_on_hopium/", "time": 1686324350.0, "subreddit": "r/ThePPShow", "title": "A thought based on hopium", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was having a think this morning about the timeline of our dear baby BoBBY at the neighborhood summer BBBYQ. </p>\n\n<p>Reflecting on the sequence of events, this is something that makes some sense to me and, if true, would be great news for shareholders, such as meself. </p>\n\n<p>So there was the vote about the RS. Then followed by the interview Gove did. Immediately followed by the Chapter 11 proceedings.  </p>\n\n<p>This may be hopium wrapped in tinfoil, but what about this: </p>\n\n<p>The votes which were submitted to BBBY showed voting in excess of the actual shares available, which, at the time was perhaps only truly known by BBBY. The shares outstanding information was a fugazi, the actual shares available to be traded was far lower than what folks believed it to be. In my theory, the RS vote confirmed this to BBBY. </p>\n\n<p>Where this gets interesting is that the short interest is calculated as a percentage of the shares outstanding, and that percentage is only as reliable as: a) parity between the actual shares outstanding and the reported shares outstanding and b) accurate reporting of short positions, which we know isn&#39;t happening. </p>\n\n<p>So, combining these two, what if part of the bankruptcy proceedings includes something which locks the short positions in a corner to close their shorts, but the information collected leading up to BK (RS vote) provided information to BBBY that could be revealed to a friendly acquirer who would then have incentive to keep the ticker viable due to the probability of rapid price appreciation (volatility) based on this information?</p>\n\n<p>Basically, part of the value proposition to an acquirer would be to strangle the shorts due to the aggressive shorting done to get the price from $30 to down lower than .25 in a very accelerated time frame? </p>\n\n<p>Just a thought. What do you think?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]