[{"username": "stakeandshake", "url": "https://www.reddit.com/r/ThePPShow/comments/17z2sfd/clue_in_the_teddy_abacus/", "time": 1700416699.0, "subreddit": "r/ThePPShow", "title": "Clue in the Teddy abacus....", "text": "<!-- SC_OFF --><div class=\"md\"><p>Long time listener, first time caller!</p>\n\n<p>After reading  slimbillfold&#39;s comment last night: <a href=\"https://www.reddit.com/r/ThePPShow/comments/17yw895/comment/k9w04ta/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/ThePPShow/comments/17yw895/comment/k9w04ta/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a> </p>\n\n<p>It got my creative juices going. It wouldn&#39;t be the first time that this crew has been responsible for easter eggs hidden in puzzles, why would they suddenly stop? They would have to be cryptic enough to not let the cat out of the bag early, but aloof enough to have plausible deniability. Touche!</p>\n\n<p>First, the key to understanding this puzzle is knowing how an abacus works. </p>\n\n<p><a href=\"https://preview.redd.it/sss2wier5c1c1.png?width=320&amp;format=png&amp;auto=webp&amp;s=51f671192642c653e43c896cae4335206ed77520\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/sss2wier5c1c1.png?width=320&amp;format=png&amp;auto=webp&amp;s=51f671192642c653e43c896cae4335206ed77520\" alt=\"Abacus in starting configuration (the number 0)\"></a></p>\n\n<p>As you count, you push the lower beads upwards (representing 1 of that power of 10) until you run out of beads, then you move one of the upper beads downwards (representing 5 of that power of 10). Then you push the lower beads up again until they are exhausted, then you move the other upper bead down. On the first column, when both upper beads are down, that is equivalent to 1 lower bead in the next left-most column, meaning you raised 1 lower bead in column 2 and raised the 2 upper beads in column 1 to the starting configuration. <strong>For you smoothbrains, essentially, every time there are 2 upper beads down, you add 1 lower bead to the next left-most column.</strong></p>\n\n<p><a href=\"https://imgur.com/aO41rT3\"><strong>https://imgur.com/aO41rT3</strong></a></p>\n\n<p>This struck me as very odd, since there are beads all over the place. I tried connecting the dots, looking at the filled and blank spaces, superimposing alphabets, etc.  Nothing seemed to work, so I went back to the math. I just assumed someone was not skilled with the abacus, and did not move the beads to the next column when there were two on the top. This yield the following:</p>\n\n<p><a href=\"https://imgur.com/EZuOjq1\">https://imgur.com/EZuOjq1</a></p>\n\n<p>Now, there&#39;s definitely an issue, and it&#39;s with the 2nd column from the left. Mathematically, there should not be a gap between the lower beads like that, so I went ahead and filled it in for reasons I will elaborate on momentarily.  I can start to make out what number this is supposed to be:</p>\n\n<p><a href=\"https://imgur.com/13ExXdh\">https://imgur.com/13ExXdh</a></p>\n\n<h1>108(?)260311</h1>\n\n<p>I had no idea what this meant, so I begged Google for help. Low and behold, it provided a JUICY hit for the 260311 part. That link was: </p>\n\n<p><a href=\"https://www.govinfo.gov/app/details/USCODE-2022-title26/USCODE-2022-title26-subtitleA-chap1-subchapC-partI-subpartB-sec311\">https://www.govinfo.gov/app/details/USCODE-2022-title26/USCODE-2022-title26-subtitleA-chap1-subchapC-partI-subpartB-sec311</a></p>\n\n<p>More specifically, in plain text:</p>\n\n<p><a href=\"https://www.govinfo.gov/content/pkg/USCODE-2022-title26/html/USCODE-2022-title26-subtitleA-chap1-subchapC-partI-subpartB-sec311.htm\">https://www.govinfo.gov/content/pkg/USCODE-2022-title26/html/USCODE-2022-title26-subtitleA-chap1-subchapC-partI-subpartB-sec311.htm</a></p>\n\n<p>After reading through this, I got back to the numbers (<a href=\"https://youtu.be/vy9KolzN7uU?si=5W0bZ5iG7B7aOPQ4&amp;t=20\">&quot;The numbers mason, what do they mean!&quot;</a>).  Realized that the zeros are definitely gaps, but what is the 108 part? There was no zero gap after it, so I was stumped, as every possible combination I tried with 26 U.S.C. § 311 didn&#39;t work. I then tried dates (effective or distributions on 1/8 and 10/8 both sounded nice) but it felt weak. So I went simple, what if it was something directly in the document? </p>\n\n<p>Tinfoil-ish: In the 2nd to last column of the abacus, it&#39;s not quite mathematically an 8, but it&#39;s *almost* an 8. Maybe an &quot;A&quot;??? </p>\n\n<p>To quote the page above:</p>\n\n<blockquote>\n<p>§311. Taxability of corporation on distribution  </p>\n\n<p>(a) General rule  </p>\n\n<p>Except as provided in subsection (b), no gain or loss shall be recognized to a corporation on the distribution (not in complete liquidation) with respect to its stock of—  </p>\n\n<p>(1) its stock (or rights to acquire its stock), or  </p>\n\n<p>(2) property.  </p>\n\n<p>(b) Distributions of appreciated property  </p>\n\n<p><strong>(1) In general</strong>  </p>\n\n<p><strong>If—</strong>  </p>\n\n<p><strong>(A) a corporation distributes property (other than an obligation of such corporation) to a shareholder in a distribution to which subpart A applies, and</strong>  </p>\n\n<p><strong>(B) the fair market value of such property exceeds its adjusted basis (in the hands of the distributing corporation),</strong>  </p>\n\n<p><strong>then gain shall be recognized to the distributing corporation as if such property were sold to the distributee at its fair market value.</strong></p>\n</blockquote>\n\n<p>I can&#39;t really say where we go from here, but I am extremely bullish for the future of this/these company/ies. Can&#39;t wait to see it all play out!</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/RCt0s2y23Uj8734iMvqGemt0dY1OXPmS9FZbN3FlX0g.jpg\"/></div>"}]