[{"username": "Strategery_22", "url": "https://www.reddit.com/r/ThePPShow/comments/13g6vcj/can_we_trust_the_board_yes_heres_why/", "time": 1683951286.0, "subreddit": "r/ThePPShow", "title": "Can we trust the board? YES, here's why...", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR: Walking through many events over the past year shows us a pattern that is NOT consistent with a corrupt board. IMO we can reasonably deduce that the board is good and in cooperation with RC and the 69D chess is playing out.</strong> </p>\n\n<p>So there&#39;s two main bear theses that I&#39;ll work through. The first is the idea that the board has been bad/corrupt the whole time (i.e., before RC bought in), and the second is the idea that the board might have been receptive to RC at first, but then the board was bought out or threatened and then they turned against RC.</p>\n\n<p>Was the board corrupt the whole time? Well, let&#39;s do a little role playing to find out. If you and your friends are corrupt members of the board and management, let us see if your greasy mayo moves make sense.</p>\n\n<p><strong>3/6/22 - RC Ventures</strong> <a href=\"https://www.sec.gov/Archives/edgar/data/886158/000119380522000426/ex991to13d13351002_03072022.htm\"><strong>letter to the board</strong></a></p>\n\n<p>RC announces his stake in BBBY and sends a letter to your corrupt board saying that you guys are doing a terrible job (why thank you, that&#39;s kind of the plan amirite!). Unfortunately, he&#39;s making some good points. But the truly bad news is that he definitely knows that Baby is super valuable and if he got his way, we (and our mayo overlords) might actually be screwed.</p>\n\n<p><strong>3/24/22 -</strong> <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000886158/000114036122011120/brhc10035704_8k.htm\"><strong>Cooperation Agreement</strong></a> <strong>and 3 board appointments</strong></p>\n\n<p>Thankfully we have you guys, my beautifully evil board members. Wait a second, why didn&#39;t you guys contest RC in his bid for board seats? You should have brought it to a proxy vote! Don&#39;t let him in so easily, we could have at least made him fight for the seats, costing him expensive lawyer and advisor fees and delaying him as much as possible.</p>\n\n<p>Oh c&#39;mon now, you even gave him 3 board seats? Why not give him 1 seat or 2 max? <a href=\"https://corpgov.law.harvard.edu/2023/01/05/2022-u-s-shareholder-activism-and-activist-settlement-agreements/\">Data shows</a> that it&#39;s far more common to only get 1 or 2 board seats in 2022. </p>\n\n<p><a href=\"https://preview.redd.it/0rqmkwd7viza1.png?width=855&amp;format=png&amp;auto=webp&amp;s=56b4c80f6cd646a78be0022e01608cc05e4a4aa5\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/0rqmkwd7viza1.png?width=855&amp;format=png&amp;auto=webp&amp;s=56b4c80f6cd646a78be0022e01608cc05e4a4aa5\" alt=\"https://preview.redd.it/0rqmkwd7viza1.png?width=855&amp;format=png&amp;auto=webp&amp;s=56b4c80f6cd646a78be0022e01608cc05e4a4aa5\"></a></p>\n\n<p>Sigh, data also shows that in 2022 only 8% of cases took less than 1 month from publicly announcing the campaign to signing a cooperation agreement (same source as the other one). </p>\n\n<p><a href=\"https://preview.redd.it/3vie21i0wiza1.png?width=833&amp;format=png&amp;auto=webp&amp;s=a7728398a6e2ae5a9cc969a7de5cf97d9c7c8d75\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/3vie21i0wiza1.png?width=833&amp;format=png&amp;auto=webp&amp;s=a7728398a6e2ae5a9cc969a7de5cf97d9c7c8d75\" alt=\"https://preview.redd.it/3vie21i0wiza1.png?width=833&amp;format=png&amp;auto=webp&amp;s=a7728398a6e2ae5a9cc969a7de5cf97d9c7c8d75\"></a></p>\n\n<p>You guys signed a cooperation agreement with RC in only 18 days?! It would have been so easy to be, dare I say, <em>uncooperative</em> and keep delaying him and costing him more money. I mean look at some of those companies pushing it beyond half a year, you could learn from them.</p>\n\n<p><strong>6/9/22 - Mark Tritton ousted</strong></p>\n\n<p>Whoa whoa whoa, are you really going to do our boy Tritton dirty like that? You&#39;re going to oust a valuable CEO plant? Oh, I get it, you&#39;re not sweating it because you&#39;ll just ensure that one of the other corrupt board members will take his place and that naïve meme lord RC will think he&#39;s gotten rid of the bad actor, hah! It&#39;s a great plan. Mayo man must have hand selected you.</p>\n\n<p><strong>7/21/22 - Jake &quot;the Snake&quot; Freeman enters</strong></p>\n\n<p>Wait, maybe I spoke too soon. Our boy (literally this time) Jake Freeman is trying to help us by securing Baby for his mayoness, you might want to take his offer more seriously. For real, Freeman is looking to steal Baby from our mortal enemy RC, you should probably let him do it. Even though it&#39;s a shitty deal for shareholders, you might as well try to put it to a vote because there&#39;s always a chance that you could pull the wool over the eyes of dumb retail and convince enough of them to vote for it. Fine, don&#39;t take my advice, you&#39;ve been doing a terrible job anyway (oh no, I&#39;m starting to sound like RC)!</p>\n\n<p>&#x200B;</p>\n\n<p><em>--Okay, so up until now a neutral or good board could explain the actions/inactions above, but a corrupt board cannot. So I&#39;m going to rule out the board being corrupt from the start.--</em></p>\n\n<p>&#x200B;</p>\n\n<p>Congratulations, you were a good board member all this time up until now. But what&#39;s that? Kenny and co. got so desperate that they are now offering you and the other board members life-changing money and/or are threatening your loved ones. Either way, you&#39;ve now turned to the dark side, so we can get back to screwing over shareholders and foiling RC (or at least trying our best to).</p>\n\n<p>Now that you&#39;re finally a corrupt piece of trash, you and your now corrupt friends on the board tell RC and his board placements to eff off. You tell him that he&#39;s never getting his Baby because you will never sell it to him or anyone else (unless they are mayo approved).</p>\n\n<p>RC&#39;s heart is crushed upon this news, because things were going so swimmingly before and now you&#39;ve just rugpulled him. You lick the salty tears from his face like the sick psychopath that you&#39;ve become, and the worst part is that it delights you.</p>\n\n<p><strong>8/16/22 - RC sells his entire stake</strong></p>\n\n<p>But before you get too proud of your progress as a villain, how do you handle RC giving up and selling his entire stake? This is a big win for you, heck you might even get some kind of prestigious Mayo of the Month award. The bag holders are panicking, it&#39;s absolute chaos and it&#39;s glorious. You want them to sell and some of them are doing that! Of course, the lower-level mayo scum have been helping to sow the seeds of doubt this whole time and they really ramp things up into a FUD frenzy during opportune times like this.</p>\n\n<p><strong>8/17/22 -</strong> <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000886158/000138713122008865/bbby-8k_081722.htm\"><strong>BBBY makes statement about RC Ventures</strong></a></p>\n\n<p><a href=\"https://preview.redd.it/8absvx1awiza1.png?width=1883&amp;format=png&amp;auto=webp&amp;s=8ae68757308de733f713a66b04a8c2b3fb502e13\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/8absvx1awiza1.png?width=1883&amp;format=png&amp;auto=webp&amp;s=8ae68757308de733f713a66b04a8c2b3fb502e13\" alt=\"https://preview.redd.it/8absvx1awiza1.png?width=1883&amp;format=png&amp;auto=webp&amp;s=8ae68757308de733f713a66b04a8c2b3fb502e13\"></a></p>\n\n<p>But wait... oh no. You didn&#39;t just reassure the shareholders did you? Why would you put out a public response the very next day saying that you &quot;were pleased to have reached a constructive agreement with RC Ventures&quot;, which puts a positive spin on things and can be interpreted in an optimistic way? You don&#39;t want to fuel any hopium, you&#39;re corrupt, remember? You want shareholders to panic and feel defeated, so if you can&#39;t craft a letter that spins his departure in a negative light (due to the cooperation agreement funnily enough), then at the very least don&#39;t say anything and let shareholders feel the gut punch to its fullest effect.</p>\n\n<p><a href=\"https://preview.redd.it/aiz7fx9gwiza1.png?width=1908&amp;format=png&amp;auto=webp&amp;s=0ee8ee90b2ec21aebe43a37dc35bc8129ef8f95f\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/aiz7fx9gwiza1.png?width=1908&amp;format=png&amp;auto=webp&amp;s=0ee8ee90b2ec21aebe43a37dc35bc8129ef8f95f\" alt=\"non-disparagement clause from the cooperation agreement\"></a></p>\n\n<p>Hold on, the mutual non-disparagement clause in the cooperation agreement only prevents you from talking mad smack about RC, but you can easily crush the spirit of the apes without crossing those lines. For example, you can simply say something like, &quot;While we were pleased to reach a constructive agreement with RC Ventures in March, we no longer share the same vision. We wish RC Ventures the best of luck in his future endeavors…&quot;. See, a simple, factual, and neutrally stated sentence like that is permitted and best of all it makes it clear to those delusional apes that RC is no longer in this. Here are some other alternatives so you can see how easy it would be:</p>\n\n<p><em>…we see different paths forward and decided not to go with RC Ventures&#39; plans.</em></p>\n\n<p><em>…while RC Ventures has contributed some great ideas, there are multiple viable paths forward and the board decided to go a different route.</em></p>\n\n<p><em>…RC Ventures has decided to part ways.</em> </p>\n\n<p>Again, you want to make it clear that RC is no longer in this, why would you put out that ambiguous garbage that offers some hope?</p>\n\n<p><strong>12/20/22 Benjamin Rosenzweig resigns</strong></p>\n\n<p>Okay, an RC appointee resigns and the <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000886158/000088615822000179/bbby-20221220.htm\">8K</a> is telling me it was NOT the result of any disagreement? What did we just say about maximizing pain and tears from the apes? We want to crush their souls and to do that we need them to know that RC is out completely (that reminds me, why didn&#39;t you make the lives of RC appointees hell so that they would resign shortly after RC left?). In any case, you finally got Ben to call it quits, but how and why would you agree to a mutual decision? I gotta tell you, this doesn&#39;t make sense to me. </p>\n\n<p>Alright, let me try to understand this. Ben sees RC get cockblocked by a corrupt board and RC gives up and leaves. Well, that sucks, but being the noble and honest person Ben is, he sticks it out as long as he can against this corrupt board. Though noble, he and the other RC appointees are useless because they are a minority against the majority of bad board actors. He finally has enough, but even I have a hard time believing that he would lie and say his resignation wasn&#39;t due to disagreement with a corrupt board. Why would he lie and give potential false hope to any poor apes still hanging on when he knows RC is out and it&#39;s a lost cause? That doesn&#39;t sound very coherent. I&#39;m pretty sure that goody two-shoes would follow the law and cite a disagreement as the reason for his resignation, which must be disclosed in the 8K as per item 5.02(a) (see pic below). </p>\n\n<p>And if Ben turned to the dark side, then you would both want to state that his resignation was due to disagreement to again make it clear to those damn, resilient apes that RC AND his board members are leaving because it&#39;s a lost cause and the board is corrupt. So tell me, why do I see &quot;was not the result of any disagreement&quot; on this 8K?</p>\n\n<p><a href=\"https://preview.redd.it/qntkhexwwiza1.png?width=1042&amp;format=png&amp;auto=webp&amp;s=1cca3d232fb772b8641a468e3fbede0e01fd11a7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/qntkhexwwiza1.png?width=1042&amp;format=png&amp;auto=webp&amp;s=1cca3d232fb772b8641a468e3fbede0e01fd11a7\" alt=\"https://preview.redd.it/qntkhexwwiza1.png?width=1042&amp;format=png&amp;auto=webp&amp;s=1cca3d232fb772b8641a468e3fbede0e01fd11a7\"></a></p>\n\n<p><strong>Dec 2022 through mid-Jan 2023 - Lazard solicits interest from potential buyers and 1/13/23 LBO rumor on Pitchbook</strong></p>\n\n<p>Why am I hearing rumors of a potential buyout? We already established that you shouldn&#39;t even consider a potential buyer unless it&#39;s to a member of the mayo crew. So why are these Burger King docs telling me that you went out and solicited 60 or so potential buyers and financiers? I can guarantee you they aren&#39;t all mayo approved. In particular, why in the eff is RC on this list? I thought we rugged him and then kicked him in the balls when he was down? We made it clear that we weren&#39;t going to sell to him, so why is he back? For crying out loud, I even saw you lick his tears! What sane person is going to come back from that?</p>\n\n<p><strong>1/20/23 through 1/27/23 - RSA wackiness and appointment of Carol Flaton</strong></p>\n\n<p>--<em>Please check out</em> <a href=\"https://www.reddit.com/r/BBBY/comments/114fgy5/rc_ventures_was_holding_3900000_shares_of_bbby\"><em>this post</em></a> <em>and</em> <a href=\"https://www.reddit.com/r/BBBY/comments/1157jed/flaton_and_the_rsa_dilemma\"><em>this post</em></a> <em>for a much more detailed explanation. Credit to</em> <a href=\"/u/Checkmateth\">u/Checkmateth</a><em>,</em> <a href=\"/u/Life_Relationship_77\">u/Life_Relationship_77</a><em>, and</em> <a href=\"/u/lowblowguy\">u/lowblowguy</a> <em>(and anyone else who brought this to light).</em></p>\n\n<p><em>The TLDR: RC&#39;s cooperation agreement states that any replacement director that he recommends must receive the same compensation as other non-management directors. Flaton was appointed 1/24/23 with an all cash compensation, which would have been different from all the others who receive RSA&#39;s. Except, just before her hire date the RSA&#39;s for the other non-management directors was exchanged for cash. So her cash compensation was the same as the others, therefore abiding by the cooperation agreement. Then right after her hire date they reverse-uno&#39;d that and gave them back their RSA&#39;s (with Harriet being an interesting exception)</em>.--</p>\n\n<p>Okay you&#39;re starting to confuse me now. Why on earth would you cash out all the non-management director&#39;s RSA&#39;s for cash right before appointing Carol Flaton? But more pressing, why would you cancel/revert that right after Flaton&#39;s appointment?! What possible reason could you have for that? These wacky moves are starting to give the apes some hope because it&#39;s suspiciously aligned with the cooperation agreement with RC. In fact, IF these RSA shenanigans were specifically done to comply with the cooperation agreement, that would suggest to me that the majority of the board is NOT corrupt. Even more, that would imply the majority of the board isn&#39;t even neutral with respect to RC. You clowns would have to be supportive of RC to actively cash out the RSA&#39;s and then cancel it, because even a neutral board who was contractually obligated to follow the cooperation agreement could just tell RC that he can recommend Flaton, but she will just receive the same RSA compensation as the others.</p>\n\n<p>Furthermore, if Flaton <em>was</em> recommended by RC (which it very much looks like she was), then that means RC held at least 3,900,000 shares as of her appointment (1/24/23). If that&#39;s true, then it would seem that RC was still interested in obtaining his Baby this whole time. That&#39;s very concerning to me given the fact that RC was listed as an interested buyer (with a date of 1/19/23) in court docket 181!</p>\n\n<p>*glares suspiciously at you*</p>\n\n<p><strong>4/23/23 - BBBY files for Chapter 11</strong></p>\n\n<p>You what?! You can&#39;t be serious. Not all Burger Kings are equal! Chapter ELEVEN? Are you such an incompetent bad actor that you mistook it for SEVEN? Chapter 7 was the game plan. Chapter 7 is when the shares get wiped out and the gargantuan pile of naked shorts is all clear.</p>\n\n<p>Oh, you wouldn&#39;t have qualified for the means test for Ch7? Well, who&#39;s fault is that? Since taking over (after getting our exemplary baddie Tritton fired), why would you trim the fat of the company and get rid of the underperforming stores with such haste? Don&#39;t fix the inventory issues and do your best to keep the poor financials going (ramp them up if you can), or at the very least take your sweet time and drag things out as long as you can. Basically, don&#39;t do what RC was telling you to do! Why did you essentially follow his plan? RC is supposed to be the enemy, remember? What are we paying you for? </p>\n\n<p>Oh, you&#39;re scared that such horrible management might get us into legal trouble like a lawsuit? First, do you see that mfer Tritton facing legal action right now? No, I didn’t think so. Secondly, in the event that it does come to litigation, who cares? Lawsuits take a lot of time and that&#39;s good for us because in the meantime you can just keep driving the company into the ground and by the time any lawsuits get settled, the company will already be in Ch7 and we will win. Or at least, we could have won. Why didn&#39;t you do any of that!?</p>\n\n<p>Let me get this straight. You voluntarily filed for Ch11 instead of waiting (probably not too much longer if you had followed my advice) until the financial situation worsened and could file for Ch7, guaranteeing a win for our massively mayo-stained shorts? In Ch11 a corrupt board would run the phenomenally stupid risk of an open auction. More specifically, after preventing RC from buying Baby this whole time (if you even did that!), you now put the company in the situation where RC can legally and without any undue interference, save his Baby. You&#39;ve now opened it up to the one buyer who not only has the means, but also the motivation to absolutely destroy us! </p>\n\n<p>You played us this whole time! You probably don&#39;t even love mayo!!! We&#39;re F****D!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/jR-QhXM5NlgSvFQwZVgVAFJcIyAFOYw5JNjnyroGqqo.jpg\"/></div>"},
{"username": "Strategery_22", "url": "https://www.reddit.com/r/ThePPShow/comments/13ebqtt/some_light_pulte_tinfoil/", "time": 1683775430.0, "subreddit": "r/ThePPShow", "title": "Some light Pulte Tinfoil", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR: Pulte and RC share the same activist advisor</strong></p>\n\n<p><a href=\"https://preview.redd.it/t9lc1gxvc4za1.png?width=941&amp;format=png&amp;auto=webp&amp;s=a2d17aa2f18bb26cffa8e5e6d61221c862958e89\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/t9lc1gxvc4za1.png?width=941&amp;format=png&amp;auto=webp&amp;s=a2d17aa2f18bb26cffa8e5e6d61221c862958e89\" alt=\"https://preview.redd.it/t9lc1gxvc4za1.png?width=941&amp;format=png&amp;auto=webp&amp;s=a2d17aa2f18bb26cffa8e5e6d61221c862958e89\"></a></p>\n\n<p>Ryan P. Nebel (of Olshan Frome Wolosky LLP) advises and represents RC in his activism (you can see Nebel on RC Venture’s <a href=\"https://www.sec.gov/Archives/edgar/data/886158/000114036122011120/brhc10035704_ex10-1.htm\">full cooperation agreement</a> with BBBY and on the 13Ds for confirmation).</p>\n\n<p><a href=\"https://preview.redd.it/by0gxox7d4za1.png?width=795&amp;format=png&amp;auto=webp&amp;s=b9915b6823c0fa2f55cde7cf6d65118983b494bc\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/by0gxox7d4za1.png?width=795&amp;format=png&amp;auto=webp&amp;s=b9915b6823c0fa2f55cde7cf6d65118983b494bc\" alt=\"https://preview.redd.it/by0gxox7d4za1.png?width=795&amp;format=png&amp;auto=webp&amp;s=b9915b6823c0fa2f55cde7cf6d65118983b494bc\"></a></p>\n\n<p>On <a href=\"https://www.olshanlaw.com/attorneys-Ryan-Nebel.html\">Nebel’s profile on the Olshan site</a>, if you click on the ‘Representative Matters’ section and scroll down to the last section, you will see one Willam J. Pulte as a past client. Nebel represented Bill Pulte in his past proxy contest to get a board seat on PulteGroup (sometime in 2016 I believe).</p>\n\n<p><a href=\"https://preview.redd.it/0hkeob2gd4za1.png?width=772&amp;format=png&amp;auto=webp&amp;s=729d0db8a03edc56930db58a883de3fa372b04d2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/0hkeob2gd4za1.png?width=772&amp;format=png&amp;auto=webp&amp;s=729d0db8a03edc56930db58a883de3fa372b04d2\" alt=\"https://preview.redd.it/0hkeob2gd4za1.png?width=772&amp;format=png&amp;auto=webp&amp;s=729d0db8a03edc56930db58a883de3fa372b04d2\"></a></p>\n\n<p>This doesn’t necessarily mean anything, but given Pulte’s recent appearances in the BBBY subs, I thought some of you might enjoy this small connection. Another potential rabbit trail that I haven’t gone down yet is that Ancora Advisors has also been represented by Nebel a couple of times (you can see it in the pic above), and that could be the same Ancora Advisors that was part of the activist group (Legion Partners, Macellum Advisors, and Ancora Advisors) that got some board appointments with BBBY in 2019. Again, this could all be coincidental, Nebel is clearly a highly skilled activist advisor so he would be highly sought by many people. But I did enjoy the Pulte connection.</p>\n\n<p>But I’ll end with a little happy tinfoil:</p>\n\n<p><a href=\"https://preview.redd.it/8pvpr8y7e4za1.png?width=1132&amp;format=png&amp;auto=webp&amp;s=f55cde8f295145947bce6a32a0176364a080623e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/8pvpr8y7e4za1.png?width=1132&amp;format=png&amp;auto=webp&amp;s=f55cde8f295145947bce6a32a0176364a080623e\" alt=\"from Pulte&#39;s LinkedIn\"></a></p>\n\n<p>Does a focus on delighting customers sound familiar? I like Bill Pulte and I think his track-record speaks for itself. Philanthropy is at the heart of this man (seriously, check out some of his interviews), so if he&#39;s on board I&#39;m all for it.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: shout out to <a href=\"/u/Movingday1\">u/Movingday1</a> who also found the connection between Pulte and RC through Ryan Nebel and mentioned it on <a href=\"/u/Real_Eyezz\">u/Real_Eyezz</a> stream on 5/10 (although I hadn&#39;t seen it until just now)</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/Xwj5DRkkFUKOHtVU8S8tKD__6-Klj61xf_M_1PNj9lY.jpg\"/></div>"},
{"username": "Strategery_22", "url": "https://www.reddit.com/r/ThePPShow/comments/13buyd5/contradictory_info_regarding_voting_tso_in/", "time": 1683558703.0, "subreddit": "r/ThePPShow", "title": "Contradictory info regarding VOTING TSO in dockets 10 and 25", "text": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s been a lot of confusion about the TSO and I&#39;m only going to make it more confusing.</p>\n\n<p>Most of us are familiar with the 428,120,100 of VOTING common shares outstanding as of the petition date (4/23/23) - as seen in docket 25.</p>\n\n<p><a href=\"https://preview.redd.it/c18zs1jzgmya1.png?width=839&amp;format=png&amp;auto=webp&amp;s=4bd8a5a5213be8944e8496e6128c4ff249fabfb2\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/c18zs1jzgmya1.png?width=839&amp;format=png&amp;auto=webp&amp;s=4bd8a5a5213be8944e8496e6128c4ff249fabfb2\" alt=\"from docket 25\"></a></p>\n\n<p>Most of the posts I have seen compare the 428 mil of VOTING shares to the 739,056,836 of common shares outstanding (NOT specified as eligible for voting) in other places. However, I just noticed that in docket 10 it uses the exact same language as seen in docket 25, but saying that there were 739,056,836 of VOTING common shares outstanding as of the petition date (see picture below).</p>\n\n<p><a href=\"https://preview.redd.it/adw71bp5imya1.png?width=1181&amp;format=png&amp;auto=webp&amp;s=d9c93427a8db9a2416bf17eb281fcf69857244e9\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/adw71bp5imya1.png?width=1181&amp;format=png&amp;auto=webp&amp;s=d9c93427a8db9a2416bf17eb281fcf69857244e9\" alt=\"from docket 10\"></a></p>\n\n<p>These dockets were both filed the same day and are referencing being up to date as of the same petition date, so why are they saying vastly different VOTING shares outstanding?!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/C6aqFsSpg1IW_a13tQ0RGb3nz-MfZyMfpRB6YO6odUU.jpg\"/></div>"},
{"username": "Strategery_22", "url": "https://www.reddit.com/r/ThePPShow/comments/137t2xe/question_about_hudson_bay_capital_as_an/", "time": 1683219331.0, "subreddit": "r/ThePPShow", "title": "Question about Hudson Bay Capital as an interested party", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8o31ak9lfuxa1.png?width=1761&amp;format=png&amp;auto=webp&amp;s=a9c6931c93e3e1deb8c5ba098a198b0f30408782\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/8o31ak9lfuxa1.png?width=1761&amp;format=png&amp;auto=webp&amp;s=a9c6931c93e3e1deb8c5ba098a198b0f30408782\" alt=\"https://preview.redd.it/8o31ak9lfuxa1.png?width=1761&amp;format=png&amp;auto=webp&amp;s=a9c6931c93e3e1deb8c5ba098a198b0f30408782\"></a></p>\n\n<p>I haven&#39;t seen this mentioned yet, but in docket 181 (the same one that lists RC as an interested party), all the way toward the end on line 2482 it lists Hudson Bay Capital as an interested party with the date 3/5/2023.</p>\n\n<p>Anyone know if it&#39;s possible that this could be on behalf of whoever may be holding a stake in BBBY through the Hudson Bay deal (assuming HBC is holding on behalf of another party)? Or might this just imply that HBC itself is an interested party?</p>\n\n<p>Also, I wonder what to make of the timing. Why is HBC and Angelo Gordon (another investment firm) listed with a 3/5/2023 date while all the others have the 1/19/2023 date?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/GvKLeeYO65nB3qj4_vBE1Ist9AnzaL-dy4pIvsF1urg.jpg\"/></div>"},
{"username": "Strategery_22", "url": "https://www.reddit.com/r/ThePPShow/comments/137awal/is_there_something_to_this_ad_hocspecial/", "time": 1683177569.0, "subreddit": "r/ThePPShow", "title": "Is there something to this ad hoc/special committee? Expanding on previous post", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR: Could the ad hoc committee referenced in the 8K dated 4/23/23 be a special committee for advising a conflict of interest M&amp;A? The committee includes Carol Flaton, Pamela Corrie, Jonathan Foster, and Joshua Schechter. There are some unanswered questions regarding these independent directors.</strong></p>\n\n<p>Potentially interesting follow-up to <a href=\"https://www.reddit.com/r/ThePPShow/comments/134dijs/another_ma_person_jonathan_f_foster/\">my previous post</a> about Jonathan Foster, specifically about special committees.</p>\n\n<p><a href=\"https://preview.redd.it/tjnw2nv0wqxa1.png?width=623&amp;format=png&amp;auto=webp&amp;s=e539dbfbc2d8e0326d800a476a8efff0301a3b68\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/tjnw2nv0wqxa1.png?width=623&amp;format=png&amp;auto=webp&amp;s=e539dbfbc2d8e0326d800a476a8efff0301a3b68\" alt=\" \"></a></p>\n\n<p>The special committees that Foster talked about are committees of <strong>independent directors</strong> who advise a potential M&amp;A that has significant conflict of interest (<a href=\"https://www.linkedin.com/pulse/use-function-special-committee-board-jonathan-f-foster/\">here is his short article on LinkedIn</a>). There are different ways that a conflict of interest can arise, but the one that fits here IMO is if the potential buyer/acquirer has a large stake (via shares or debt/bonds) in the company being sold.</p>\n\n<p>It should be mentioned that special committees can extend to any major conflict transaction/decision (not just M&amp;A’s), but this post is going to focus on the M&amp;A potential given Foster’s heavy M&amp;A advisory expertise (and many others within BBBY and players like Kirkland &amp; Ellis with M&amp;A expertise).</p>\n\n<p>&#x200B;</p>\n\n<p>I found it interesting that Carol Flaton, Jonathan Foster, and Pamela Corrie are all <strong>independent</strong> <strong>directors</strong>. In Flaton’s case, the <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000886158/000088615823000028/bbby-20230124.htm\">1/24/23 8K</a> specifically points out that she qualifies as an independent director under Rule 5605(a)(2) of the Nasdaq Listing Rules (see picture below). I looked up the 8Ks in which some other board members were appointed (e.g., Edelman, Weiss, Yerger, et al., and RC’s appointments of Bowen, Rosenzweig, and Lombard) and even though they were all initially appointed as independent directors of the board, none of them have any reference to that Rule 5605.</p>\n\n<p><a href=\"https://preview.redd.it/qnlfg75dwqxa1.png?width=1889&amp;format=png&amp;auto=webp&amp;s=496d80fd4190da8d5eea84c13b9ec24d06e3b75a\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/qnlfg75dwqxa1.png?width=1889&amp;format=png&amp;auto=webp&amp;s=496d80fd4190da8d5eea84c13b9ec24d06e3b75a\" alt=\" \"></a></p>\n\n<p>Recall the <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000886158/000119312523111754/d465247d8k.htm\">8K that was filed 4/23/23</a>, this is the first time Jonathan Foster and Pamela Corrie appear in SEC files with BBBY as far as I can find (I’ll come back to this later). They, along with Carol Flaton and Joshua Schechter are said to comprise an <strong>ad hoc committee</strong>. First, let’s see if it’s possible that an ad hoc committee could be the same thing as a <strong>special committee</strong>.</p>\n\n<p><a href=\"https://preview.redd.it/uj4h8pw5xqxa1.png?width=992&amp;format=png&amp;auto=webp&amp;s=26b144c27090d53c95cbdf9326a42acde5b3c043\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/uj4h8pw5xqxa1.png?width=992&amp;format=png&amp;auto=webp&amp;s=26b144c27090d53c95cbdf9326a42acde5b3c043\" alt=\"https://preview.redd.it/uj4h8pw5xqxa1.png?width=992&amp;format=png&amp;auto=webp&amp;s=26b144c27090d53c95cbdf9326a42acde5b3c043\"></a></p>\n\n<p><a href=\"https://preview.redd.it/vx851os6xqxa1.png?width=926&amp;format=png&amp;auto=webp&amp;s=1692bfd2bb8e4812748fd03943f0f009933f4a75\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/vx851os6xqxa1.png?width=926&amp;format=png&amp;auto=webp&amp;s=1692bfd2bb8e4812748fd03943f0f009933f4a75\" alt=\"https://preview.redd.it/vx851os6xqxa1.png?width=926&amp;format=png&amp;auto=webp&amp;s=1692bfd2bb8e4812748fd03943f0f009933f4a75\"></a></p>\n\n<p><a href=\"https://preview.redd.it/uvll0cagxqxa1.png?width=1649&amp;format=png&amp;auto=webp&amp;s=c960423f06c295a8a583ec0dcfb474b3b1d8569c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/uvll0cagxqxa1.png?width=1649&amp;format=png&amp;auto=webp&amp;s=c960423f06c295a8a583ec0dcfb474b3b1d8569c\" alt=\" \"></a></p>\n\n<p>Multiple sources suggest that ad hoc committees and special committees are often seen as interchangeable terms, so we can move ahead.</p>\n\n<p>With that said, there <em>is</em> something called an ad hoc committee that is formed, typically during an ongoing bankruptcy case. That seems to fit much better, right? But wait a second. After further reading, these ad hoc committees are typically formed on behalf of/representing certain groups or classes of stakeholders and/or creditors.</p>\n\n<p><a href=\"https://preview.redd.it/m9obak3pxqxa1.png?width=1037&amp;format=png&amp;auto=webp&amp;s=a16a3839a94ecab0e3e5475d188c25074440c1b3\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/m9obak3pxqxa1.png?width=1037&amp;format=png&amp;auto=webp&amp;s=a16a3839a94ecab0e3e5475d188c25074440c1b3\" alt=\"(https://globalrestructuringreview.com/guide/the-art-of-the-ad-hoc/edition-3)\"></a></p>\n\n<p>Given this in combination with the fact that the committee members above are specifically independent and have not been identified as representing or serving the interest of any particular creditor or stakeholder groups, I was hopeful that this ad hoc committee wasn’t the typical kind of ad hoc restructuring committee. This was further cemented by the recent release of docket <a href=\"https://restructuring.ra.kroll.com/bbby/Home-DocketInfo\">166 and 167</a>, where a typical ad hoc committee comprised of Daniel Stolz and Gregory Kinoian (via Genova Burns, LLC) was identified to represent a group of bondholders.</p>\n\n<p><a href=\"https://preview.redd.it/hjph9nnyyqxa1.png?width=1268&amp;format=png&amp;auto=webp&amp;s=9cea7be2455531717139d3e28d4ce6c440de6a4c\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/hjph9nnyyqxa1.png?width=1268&amp;format=png&amp;auto=webp&amp;s=9cea7be2455531717139d3e28d4ce6c440de6a4c\" alt=\" \"></a></p>\n\n<p>Okay, so the committee with Flaton et al. is almost certainly not the typical ad hoc restructuring committee, but before we celebrate a special committee for advising a conflict M&amp;A, I would be remiss if I didn’t consider the possibility of the ad hoc committee being a sort of general restructuring committee that doesn&#39;t represent any particular stakeholder group. Perhaps someone else could speak to that possibility, but I will say that I’ve tried looking and I haven’t yet found anything of substance. If it is a thing, it&#39;s extremely rare. All the information that comes up is either about the typical ad hoc committees that represent certain groups of creditors and stakeholders, or about special committees that advise conflict M&amp;A’s.</p>\n\n<p>&#x200B;</p>\n\n<p>Now to some oddities that others can hopefully help shed some light on:</p>\n\n<ol>\n<li>Carol Flaton, Pamela Corrie, Jonathan Foster, and Joshua Schechter are all on that ad hoc committee, but aside from Schechter (who has been on the BBBY board since May 2019), only Flaton required an 8K upon appointment. Why would Flaton warrant an 8K, but not Corrie and Foster? In fact, as I mentioned in my previous post, it’s actually hard to find any information about Corrie and Foster with respect to their BBBY involvement. There’s no SEC filings (aside from that semi-recent 8K) and no info on the BBBY investor relations site about them. Foster doesn’t even have any mention of BBBY on his LinkedIn page.</li>\n<li>What do we make of the timing? Flaton&#39;s hire date was 1/24/23, which lines up with Corrie listing her start date as January 2023 on her LinkedIn. However, the recent docket 181 (the one that lists RC as an interested party) also lists what I’m assuming is all the directors/officers (from line 2408-2485 - see picture below). Foster is on line 2485 and the date on the right says 4/19/23. I don’t know exactly what the date means, but it possibly means that he wasn’t a director until then. The rest of the directors/officers have a date of 1/27/23 and the weird thing is that Flaton isn’t on this list when her appointment date was prior to 1/27/23. Corrie and Etlin are also missing, but Etlin wasn’t appointed until 2/2/23 and Corrie could have been appointed after 1/27/23, so their absence <em>might</em> make sense, however it’s still confusing since Flaton is on there with a much later date (confused Pikachu face)!</li>\n</ol>\n\n<p><a href=\"https://preview.redd.it/3cchp0v80rxa1.png?width=1249&amp;format=png&amp;auto=webp&amp;s=55f29fc3824760fc5c0768b07a6186e544fdb05e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/3cchp0v80rxa1.png?width=1249&amp;format=png&amp;auto=webp&amp;s=55f29fc3824760fc5c0768b07a6186e544fdb05e\" alt=\" side note, all the screenshots of interested parties that I’ve seen so far have missed that Hudson Bay Capital is listed on line 2482 as an interested party with a date of 3/5/23 \"></a></p>\n\n<p>&#x200B;</p>\n\n<p>3) This is more of a potential counterpoint to myself, but does Joshua Schechter (who has been on the BoD for BBBY for a while now and I’m assuming is no longer considered independent with respect to BBBY) rule out this being a special committee for conflict M&amp;A advising? My current understanding is that the primary concern for a special committee would be that it&#39;s impartial with respect to the buying/acquiring party. The purpose of the committee is to act as a 3rd party to ensure that the buying party doesn’t screw over (i.e., severely undervalue) the selling party through its influential stake in the selling company.</p>\n\n<p>Furthermore, I think there is some precedence for an individual member of a special committee being considered interested (vs. disinterested) and still being acceptable, if the majority of the committee is disinterested (see picture below).</p>\n\n<p><a href=\"https://preview.redd.it/r1y9bw0j0rxa1.png?width=535&amp;format=png&amp;auto=webp&amp;s=3c76ba59a6deb5caac719754a8dd0f550762d4ed\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/r1y9bw0j0rxa1.png?width=535&amp;format=png&amp;auto=webp&amp;s=3c76ba59a6deb5caac719754a8dd0f550762d4ed\" alt=\" the above is in reference to a committee member having an interest in the buying party, but the same principle should apply all the more \"></a></p>\n\n<p>Lastly, I think the very recent and blatant short attack on Newell’s and IEP’s stock and the FUD piece about Carl Icahn lend more credence to the Icahn family being involved in the potential M&amp;A (along with RC).</p>\n\n<p>Hopefully this makes some sense, but I’ll be the first to admit that this isn’t my field of expertise.</p>\n\n<p>And yet again, it&#39;s past my bedtime. See you all tomorrow for some fun OTC action!  </p>\n\n<p><em>Edited for grammar and phrasing and added TLDR</em></p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/SB5oVbSR7Lr9lXLgOvMtA9HtUW_Ms_PE3gZABU-zszw.jpg\"/></div>"},
{"username": "Strategery_22", "url": "https://www.reddit.com/r/ThePPShow/comments/134dijs/another_ma_person_jonathan_f_foster/", "time": 1682918590.0, "subreddit": "r/ThePPShow", "title": "Another M&amp;A person: Jonathan F. Foster", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was originally trying to look more into Pamela Corrie because I found it weird that she lists on her Linkedin that she started working for BBBY in January 2023, but I can’t seem to find any mention of her in the SEC filings until the <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000886158/000119312523111754/d465247d8k.htm\">8K filed on 4/24/23</a>. That’s when I saw a new name that I wasn’t aware of, Jonathan Foster.</p>\n\n<p><a href=\"https://preview.redd.it/b3y80gyyk5xa1.png?width=1187&amp;format=png&amp;auto=webp&amp;s=0f4e3907f492f227957c75cacd9b31727434a06e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/b3y80gyyk5xa1.png?width=1187&amp;format=png&amp;auto=webp&amp;s=0f4e3907f492f227957c75cacd9b31727434a06e\" alt=\"https://preview.redd.it/b3y80gyyk5xa1.png?width=1187&amp;format=png&amp;auto=webp&amp;s=0f4e3907f492f227957c75cacd9b31727434a06e\"></a></p>\n\n<p>Looking through his Linkedin page, it’s clear that he has a ton of M&amp;A experience. To be fair, he does also have experience with restructuring and capital raising. He is the founder and managing director of Current Capital Partners LLC, and looking at their website, they offer 3 main services and M&amp;A advisory is listed first. So it seems that M&amp;A advising is Foster’s specialty.</p>\n\n<p><a href=\"https://preview.redd.it/dy98qk0cl5xa1.png?width=1110&amp;format=png&amp;auto=webp&amp;s=c3ce1a452bb5817a6e198982d1c53c97af9ea1b7\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/dy98qk0cl5xa1.png?width=1110&amp;format=png&amp;auto=webp&amp;s=c3ce1a452bb5817a6e198982d1c53c97af9ea1b7\" alt=\"https://preview.redd.it/dy98qk0cl5xa1.png?width=1110&amp;format=png&amp;auto=webp&amp;s=c3ce1a452bb5817a6e198982d1c53c97af9ea1b7\"></a></p>\n\n<p><a href=\"https://preview.redd.it/grpcxlrll5xa1.png?width=1559&amp;format=png&amp;auto=webp&amp;s=c576fed939a0fe6f488002f381ffe882f10c73a1\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/grpcxlrll5xa1.png?width=1559&amp;format=png&amp;auto=webp&amp;s=c576fed939a0fe6f488002f381ffe882f10c73a1\" alt=\"https://preview.redd.it/grpcxlrll5xa1.png?width=1559&amp;format=png&amp;auto=webp&amp;s=c576fed939a0fe6f488002f381ffe882f10c73a1\"></a></p>\n\n<p>Also, on the Current Capital Partners’ site, they have a ‘Latest News’ section where it says that Foster was named as an <em>independent director</em> for BBBY. Interestingly, as I was browsing his Linkedin, I saw that <a href=\"https://www.linkedin.com/pulse/use-function-special-committee-board-jonathan-f-foster/\">he wrote an article</a> titled, “The Use and Function of a Special Committee of a Board”. In the article he talked about how companies should appoint a special committee of <em>independent directors</em> for M&amp;As where there are significant potential conflicts of interest.</p>\n\n<p><a href=\"https://preview.redd.it/e70p5a8om5xa1.png?width=1201&amp;format=png&amp;auto=webp&amp;s=8605742e330a461177834dd8a5a944c5ced90d4e\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/e70p5a8om5xa1.png?width=1201&amp;format=png&amp;auto=webp&amp;s=8605742e330a461177834dd8a5a944c5ced90d4e\" alt=\"You can ignore the arrow in the above pic\"></a></p>\n\n<p><a href=\"https://preview.redd.it/mudv2ftqm5xa1.png?width=931&amp;format=png&amp;auto=webp&amp;s=e32a2540ee30254c99ad60c4a1688ffee35043d8\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/mudv2ftqm5xa1.png?width=931&amp;format=png&amp;auto=webp&amp;s=e32a2540ee30254c99ad60c4a1688ffee35043d8\" alt=\"https://preview.redd.it/mudv2ftqm5xa1.png?width=931&amp;format=png&amp;auto=webp&amp;s=e32a2540ee30254c99ad60c4a1688ffee35043d8\"></a></p>\n\n<p>Going back to the 8K, it says that, “Ms. Etlin shall serve at the direction of an <strong>ad hoc committee</strong> of the Board of Directors of the Company and its subsidiaries comprised of <strong>Carol Flaton, Pamela Corrie, Jonathan Foster, and Joshua Schechter</strong>, in accordance with the terms and conditions of the AP Engagement Letter”</p>\n\n<p>So, perhaps the ad hoc committee is the special committee that Foster talked about in his article and that they will advise the M&amp;A? The possible counter to this idea would be that in his article he mentions that the members of a special committee should be free of conflicts of interest, including board or management positions, and business/personal relationships with the interested party. Carol Flaton was a managing director at AlixPartners from 2014-2019, so depending on how much you think AlixPartners is connected to IEP, that could complicate things. Anyway, just some thoughts to chew on.</p>\n\n<p>Past my bedtime here, I&#39;ll catch you all later!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/uK6pTD-aInIaCbBzMFZrB1idrtBw_roUNfWjOQQO2z4.jpg\"/></div>"}]