[{"username": "StudyTheirComms", "url": "https://www.reddit.com/gallery/179e4hz", "time": 1697483855.0, "subreddit": "r/ThePPShow", "title": "6 pics-Chivas reply by Ryan, ROSE bowl, Titanic, banks/Fed", "text": "<!-- SC_OFF --><div class=\"md\"><p>Short and simple post.\nRyan replied to a Chivas Kimber this morning at 7:41 eastern</p>\n\n<p>-Chivas soccer (Mexico) just played to record crowd at \nROSE Bowl \n-Rose lead female from Titanic (\n blue butterfly and jewel)</p>\n\n<p>Main point of this post out of the way.</p>\n\n<p>-extra side foil for fun: To me, Titanic seems to symbolise JPMorgan and the creation of the Fed. That last name Kimber rhymes with timber, like the main scene of Titanic when the ship is tilted over as it &quot;falls&quot; into the ocean. Meaning, I think this play can ultimately be the death blow to big banks and the Fed.</p>\n\n<p>The original tweet by Chivas was from 10/10, which theoretically is part of the Teddy clock, but I don&#39;t know if there is anything to it. The delayed reply by Ryan is weird for someone who barely tweets.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/v6rpeI4-0z7BHzi9KBGmXfsuslGTwnB1HKdaaeijwRk.jpg\"/></div>"},
{"username": "StudyTheirComms", "url": "https://www.reddit.com/gallery/16g0eoc", "time": 1694451001.0, "subreddit": "r/ThePPShow", "title": "Super League Gaming did a reverse split and name change today. 1 hour 11 minutes before market open, the stock ran from $2.09 to $12.56 in 2 minutes. Reminded me of some tinfoil from 84 years ago", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/dXXrL6EWNsjeK0s8NXxtMP5XbAFUgFMzBrjXY2Npaus.jpg\"/></div>"},
{"username": "StudyTheirComms", "url": "https://www.reddit.com/r/ThePPShow/comments/16cfpv5/theoretical_acquisition_hypothesis/", "time": 1694092883.0, "subreddit": "r/ThePPShow", "title": "Theoretical acquisition hypothesis", "text": "<!-- SC_OFF --><div class=\"md\"><p>Listening to Bill Pulte on the X space call from yesterday, he mentioned brainstorming on what 5 to 10 companies would make for a great acquisition for GameStop.</p>\n\n<p>This post comes from the belief GameStop will ultimately become multiple companies in one over time, hence why I&#39;m posting it here.</p>\n\n<p>I think the biggest thing that&#39;ll be important as time goes on is being able to use the theoretical metaverse to shop from home, and more importantly, be able to deliver those products within the same day to compete with, and ultimately decimate, the competition.</p>\n\n<p>Looking up companies that provide same day delivery, I found ReliableCouriers.com (just noticed it is RC as I typed it out lol).</p>\n\n<p>Never knew of the company till now, but looking them up, they provide 1/3/5 hour, and same day delivery in 22 of the 32 most populated states. Their service is operational 24/7, and provides real time GPS tracking of your order.</p>\n\n<p>Being able to not only provide the best, newest online shopping experience, but then being able to deliver those products you order as fast, if not faster, than the competitors, is going to be a big key for success long-term.</p>\n\n<p>Reliable Couriers isn&#39;t listed on the stock exchange as far as I can tell, so it leads me to think they are small/&quot;cheap&quot; enough to purchase as the company isn&#39;t widely known.</p>\n\n<p>It doesn&#39;t have to be this specific company, but more so for the thought exercise as what can put GameStop, and a lot of our beliefs of multiple companies joining hands down the road, into Amazon competitor/decimating status.</p>\n\n<p>I hope this helps keep the ball rolling for future posts discussing hypotheticals to push Ryan&#39;s long-term vision to fruition.</p>\n\n<p>Have a wonderful day</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]