[{"username": "such_karma", "url": "https://i.redd.it/3yj80447xszb1.jpg", "time": 1699744541.0, "subreddit": "r/ThePPShow", "title": "You came to the wrong hood, mothafuhkuh", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/3yj80447xszb1.jpg\"/></div>"},
{"username": "such_karma", "url": "https://www.reddit.com/gallery/17oo3cz", "time": 1699224655.0, "subreddit": "r/ThePPShow", "title": "Congratulations to the one and only PPseeds for reaching 17474 members. Simulation confirmed", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/uC7QE4eGfMR3Qa4oDMEC5quk5PLe7nCHtDiCSxd_eDY.jpg\"/></div>"},
{"username": "such_karma", "url": "https://i.redd.it/cuzv5lzyl0rb1.jpg", "time": 1695914988.0, "subreddit": "r/ThePPShow", "title": "It’s all coming together… tits. Jacked and loaded", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/cuzv5lzyl0rb1.jpg\"/></div>"},
{"username": "such_karma", "url": "https://www.reddit.com/r/ThePPShow/comments/1577eml/_/", "time": 1690094781.0, "subreddit": "r/ThePPShow", "title": "🩳🏴‍☠️💀", "text": "<!-- SC_OFF --><div class=\"md\"><p>As an ape that’s been around since close to the beginning when we all became in that moment, a ticket to escaping the pains of poverty, rising inflation, hospital bills and unexpected expenses. That day, we won- they lost. But they’ve cheated you and your brothers and sisters a shot at changing things around for their lives. Paying off debt for our family and friends, buying our loved ones a place to live. I thank God every day for GME, BBBY, Loopring, IEP, BRK, XRP, Overstock, TSLA, and other what I consider righteous fighters against a very present and real evil. A lot of us are barely hanging on, and I’ve spoken with many of you- it truly is food stamps or lambos. But for what I’ve learned, it’s no longer about lambos to me. Lambos are just possessions that will only temporarily bandaid a deeper need for connection with others. To know that we all went through the same hellfire brought by the snakes and vipers and survived, I applaud you and commend you all. You all are warriors, and I thank the PP community for what you do- SS is compromised and I thought the Banks won the fight in killing community engagement: but though PP is small, I sense a great explosion once MOASS is said and done. I pray for all of us holders that we would continue to let truth guide our visions and to be worthy of this blessing that I know I don’t deserve. Hang on, we’re almost there, Rocky. We’re all going to make it. May God bless you all 🩳🏴‍☠️💀</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "such_karma", "url": "https://i.redd.it/dv1vl3o0rgbb1.jpg", "time": 1689136827.0, "subreddit": "r/ThePPShow", "title": "Yo wtf is going on?", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dv1vl3o0rgbb1.jpg\"/></div>"}]