[{"username": "tbergers12", "url": "https://www.reddit.com/r/ThePPShow/comments/15p18pv/10_q_is_stating_the_value_of_the_stock_as_of_june/", "time": 1691836675.0, "subreddit": "r/ThePPShow", "title": "10 Q is stating the value of the stock as of June 14, 2023, What value are they telling us?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Fair Value of common stock </p>\n\n<p>“During the year ended February 25, 2023, 109.0 million Common Stock Warrants were exercised and shares were reissued out of treasury stock at a weighted-average cost of $44.27 per share, for a total cost of $3.1 billion. The difference between the cost of the treasury stock and the fair value of common stock issued upon exercise is recorded as a reduction to retained earnings on the consolidated balance sheet and is included within the equity roll forward.” </p>\n\n<p>Page 57; section 6 Common Stock Warrant  </p>\n\n<p>&#x200B;</p>\n\n<p>Form 10-K for BED Bath Beyond INC filed 06/14/2023</p>\n\n<p><a href=\"https://preview.redd.it/4yxdxw8tqnhb1.png?width=917&amp;format=png&amp;auto=webp&amp;s=3182a2ad13a6a869c253cec80737bf5d5659f45f\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/4yxdxw8tqnhb1.png?width=917&amp;format=png&amp;auto=webp&amp;s=3182a2ad13a6a869c253cec80737bf5d5659f45f\"></a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/7678AcZ1cRIVsBf0urVT9883J8Uqpk8B-vw3mx0rt7c.jpg\"/></div>"},
{"username": "tbergers12", "url": "https://www.reddit.com/r/ThePPShow/comments/15mzbsr/retained_earning_part_deux/", "time": 1691634098.0, "subreddit": "r/ThePPShow", "title": "Retained Earning part Deux", "text": "<!-- SC_OFF --><div class=\"md\"><p>When a company lists the preferred shares or stock warrants in the retained earnings section of the balance sheet even though they haven&#39;t been exercised, it&#39;s a way to reflect the potential impact on the company&#39;s financial position and shareholder equity. Here are a few reasons why a company might do this:</p>\n\n<ol>\n<li><p><strong>Transparency:</strong> By disclosing the presence of preferred shares and stock warrants in the retained earnings section, the company is being transparent with its shareholders and other stakeholders about the potential dilution or impact on future earnings.</p></li>\n<li><p><strong>Accounting Treatment:</strong> Accounting standards require companies to account for potential dilutive securities, like preferred shares and stock warrants, that could lead to the issuance of additional shares. This is done by reducing retained earnings or recording a liability in some cases, even if the shares or warrants haven&#39;t been exercised yet.</p></li>\n<li><p><strong>Potential Impact:</strong> The company wants to convey the potential impact on earnings and shareholder equity in case these preferred shares or warrants are exercised in the future. This helps investors understand how these instruments could affect the company&#39;s financials.</p></li>\n<li><p><strong>Legal and Regulatory Compliance:</strong> Companies must accurately represent their financial position, and that includes accounting for the potential impact of securities that might be exercised or converted in the future.</p></li>\n<li><p><strong>Disclosure Requirements:</strong> Depending on regulatory requirements, companies might need to provide detailed information about their capital structure, including potential dilutive securities, in their financial statements and related disclosures.</p></li>\n</ol>\n\n<p>Ultimately, listing these securities in the retained earnings section is a way for the company to provide a comprehensive picture of its financial position and potential impacts on equity. It&#39;s also important for investors and analysts who evaluate the company&#39;s financial health and prospects.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "tbergers12", "url": "https://www.reddit.com/r/ThePPShow/comments/15llyk9/retained_earnings_stock_dividend_theory/", "time": 1691509793.0, "subreddit": "r/ThePPShow", "title": "Retained Earnings / Stock Dividend Theory", "text": "<!-- SC_OFF --><div class=\"md\"><p>Stock Dividend Theory</p>\n\n<p>In the  Retained earning section of 10-K filed on Jun 14, 2023, (page 43) bbby has issued treasury stock to be be delivered to shareholders.  Retained earning can only be distributed to shareholders via a cash or stock dividend.  As you can see Convertible Preferred shares and exercised common stock warrants of 70 million shares each have been taken out of the positive retained earnings.  Each transaction is roughly $3 billion dollars for 70 million shares each.  This is at a value of roughly $40 per share!  My theory is a reverse merger with BBBY maintaining greater then 50% will retain control with one entity to maintain the NOL loss of $3.5 billion (preferred shares transaction).  A second transaction (dividend) a spin off of buy buy baby.</p>\n\n<p>These dividends are then placed in the liabilities sections on the balance sheet until they are distributed to shareholders. Page 40 in 10-k</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]