[{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/17toxyy/war_cry/", "time": 1699809875.0, "subreddit": "r/ThePPShow", "title": "War Cry.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Wall street is full of psycopaths. They&#39;re easy to troll and lack emotional intelligence. Apes need to poke the hornets nest. We will un-employ them. We will own them. We will deny them power. They&#39;re extreme deviance from decency, ethics and civility will not be rewarded any longer even in the schizophrenic spectacle that is late capitalism. Apes must be more civil in order to overcome them. </p>\n\n<p>Rules will be re-writtten. Old boys clubs will be buried in the ashes of BBBYQ. Troll away, live rent free, become the ultimate energy vampire until the fire is lit under our rocket. Soon we will rise from the grave cocoon and devour them whole.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/17cntgs/never_forget_a_few_basic_tings_a_great_trust_me/", "time": 1697842193.0, "subreddit": "r/ThePPShow", "title": "Never forget a few basic tings + a great trust me bro", "text": "<!-- SC_OFF --><div class=\"md\"><p>Why did the company DK-Butterfly suddenly change transfer agents?</p>\n\n<p>Why did the transfer agent recall shares recently? (add any number of broker lingo cover ups here, mine was &quot;liquidated&quot;)</p>\n\n<p>I talked to a co worker who used to work higher up portfolio management at some very large firms (they&#39;re no longer in financials but was for 20 years). As we are, they&#39;re confused by the forced liquidation and said that they typically and yearly would contact clients to see if they wanted to trim dead tickers/companies from their portfolios. Had never seen, in 20 years, a forced erasure of a position for a dead company.</p>\n\n<p>I just found out that my co worker used to do this work previously because they couldn&#39;t keep quiet when I spoke of my liquidation situation, too much intrigue I guess. They said they typically don&#39;t engage with because of fiduciary risks. </p>\n\n<p>I gladly took on my own fiduciary risk when I said, trust me bro, reverse triangle merger, NOLs, share recall, as was written  .  ..  ...  BOOM!  (nfa)</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/177cady/pulte_book_recommendations/", "time": 1697240995.0, "subreddit": "r/ThePPShow", "title": "Pulte book recommendations", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/u/RealPulte\">u/RealPulte</a>  Thanks again for the book recommendations from when you first came on the ppshow. It is slow at work right now for me, so I took the opportunity to read God&#39;s Debris by Scott Adams the last two days. I enjoyed it quite a bit. Some nice thoughts in the book. If I were to go all ppshow on this, I&#39;d pack it in my pipe and smoke it, then I&#39;d start speculating heavily on all stuff BBBY related of course. A major theme of the book is delusional belief and understanding in and of things as a necessary practicality in order to navigate the vastness of reality as an individual. Thats great, we&#39;re all delusional and I&#39;m down with it, for better or for worse. Here we are all here striping down our beliefs for a better practical understanding so we can help change the system in a bigger then this play Borg think tank ... or ... that the collective MSM/ Hedgie delusion is incorrect and that our BUTTFQ Baby is gonna be driven into outer space by RC/Icahn. </p>\n\n<p>I&#39;d like to think that I&#39;m speaking for more then myself in this sub when I say I&#39;m benefiting, growing and will continue with the later, but that as an Absolute Necessity, since I bet the farm on this conviction cause I&#39;m regard like that,  I Need This to be the later FIRST to enable myself to really follow through with a bigger societal engagement with these things. Hope for the better and this community alone has kept me in this play to this point from Jan. 2023 buy in to now. Godspeed into the end. All victories end victorious.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/177cae3/pulte_book_recommendations/", "time": 1697240995.0, "subreddit": "r/ThePPShow", "title": "Pulte book recommendations", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/u/RealPulte\">u/RealPulte</a>  Thanks again for the book recommendations from when you first came on the ppshow. It is slow at work right now for me, so I took the opportunity to read God&#39;s Debris by Scott Adams the last two days. I enjoyed it quite a bit. Some nice thoughts in the book. If I were to go all ppshow on this, I&#39;d pack it in my pipe and smoke it, then I&#39;d start speculating heavily on all stuff BBBY related of course. A major theme of the book is delusional belief and understanding in and of things as a necessary practicality in order to navigate the vastness of reality as an individual. Thats great, we&#39;re all delusional and I&#39;m down with it, for better or for worse. Here we are all here striping down our beliefs for a better practical understanding so we can help change the system in a bigger then this play Borg think tank ... or ... that the collective MSM/ Hedgie delusion is incorrect and that our BUTTFQ Baby is gonna be driven into outer space by RC/Icahn. </p>\n\n<p>I&#39;d like to think that I&#39;m speaking for more then myself in this sub when I say I&#39;m benefiting, growing and will continue with the later, but that as an Absolute Necessity, since I bet the farm on this conviction cause I&#39;m regard like that,  I Need This to be the later FIRST to enable myself to really follow through with a bigger societal engagement with these things. Hope for the better and this community alone has kept me in this play to this point from Jan. 2023 buy in to now. Godspeed into the end. All victories end victorious.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://i.redd.it/afrm0cw91urb1.jpg", "time": 1696271302.0, "subreddit": "r/ThePPShow", "title": "Hard mineral 94 is not allowed in the gates, he is Cifu.", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/afrm0cw91urb1.jpg\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/15ik245/algos_need_to_know_how_much_im_worthright_now/", "time": 1691204255.0, "subreddit": "r/ThePPShow", "title": "Algos need to know how much I'm worth...right.... NOW!", "text": "<!-- SC_OFF --><div class=\"md\"><p>SHF have been putting up buy and sell walls, we&#39;ve all seen it, I&#39;ve seen it especially before we entered Ch 11. Algos see this and say, hey this is the market, this is what this equity is worth. This is not the free market, this is wall streets market. And, frankly, I&#39;m fkn over it. The SHF have been manipulating the market by trading shares back and forth and putting in false buy and sell walls. As soon as they&#39;re not needed they move em to the next valuation. They drilled us down into bankruptcy, and I&#39;m fkn over it. Now they&#39;re all dried up and wiping their tears with sandpaper CTB. Tough titty. What the market don&#39;t see is what I know my equity is worth so its time for me to let them know. I, personally, will be putting in a sell order at GME peak levels (in that vicinity) so that its in the system, its recorded and active. The Algos see this everyday now and know what my equity is worth, they gonna have to deal with that shit. SHF are not the Algos. They are no longer the feeders of the Algos, I am. One brick at a time. The algos need to know what my Tendies are worth. Cause they don&#39;t know yet, cause I didn&#39;t tell em, thats on me. Free markets means that real people with real shares put in real buy and sell orders and a trade occurs when both parties agree. So lets FKN Go! No dark pools, algos gonna have to deal with it. No married calls and puts, algos gonna have to deal with it.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/15ik243/algos_need_to_know_how_much_im_worthright_now/", "time": 1691204254.0, "subreddit": "r/ThePPShow", "title": "Algos need to know how much I'm worth...right.... NOW!", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/15ik243/algos_need_to_know_how_much_im_worthright_now/", "time": 1691204254, "subreddit": "r/ThePPShow", "title": "Algos need to know how much I'm worth...right.... NOW!", "text": "SHF have been putting up buy and sell walls, we've all seen it, I've seen it especially before we entered Ch 11. Algos see this and say, hey this is the market, this is what this equity is worth. This is not the free market, this is wall streets market. And, frankly, I'm fkn over it. The SHF have been manipulating the market by trading shares back and forth and putting in false buy and sell walls. As soon as they're not needed they move em to the next valuation. They drilled us down into bankruptcy, and I'm fkn over it. Now they're all dried up and wiping their tears with sandpaper CTB. Tough titty. What the market don't see is what I know my equity is worth so its time for me to let them know. I, personally, will be putting in a sell order at GME peak levels (in that vicinity) so that its in the system, its recorded and active. The Algos see this everyday now and know what my equity is worth, they gonna have to deal with that shit. SHF are not the Algos. They are no longer the feeders of the Algos, I am. One brick at a time. The algos need to know what my Tendies are worth. Cause they don't know yet, cause I didn't tell em, thats on me. Free markets means that real people with real shares put in real buy and sell orders and a trade occurs when both parties agree. So lets FKN Go!", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/15fu1ap/that_tasty_dip_illiquidity_and_our_lovely_options/", "time": 1690936951.0, "subreddit": "r/ThePPShow", "title": "That tasty DIP, illiquidity and our lovely options chain.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Before the court hearing today I was thinking that we were becoming even more illiquid because of what seems to me as ever decrease in daily volume,. Match this with CTB and not much pressure either way can move this thing lots. Magically, looks like the liquidity fairy dropped by just in time to make that tasty dip after the hearing today. </p>\n\n<p>I&#39;ve been watching TUP (tupperware) as of last Wednesday as well. Looks like it had two good days that took it from low 60s into 90s and then something broke it out to the upside. I also noticed that the options chain seems very negligible compared to what we have. </p>\n\n<p>BBBYQ is heavily weighted towards the calls across the board, price and time. What we have here that TUP does not have is gamma and mostly in one direction so no worries of it playing to the downside on us as it blasts past any strike prices. I think I saw a post referencing a docket that shows us at actually 432 ? for tradable float, that makes our short interest + all the nakeds quite high, probly Uranus. Another fire? RC and Co dropping by to say hello? Algo system update that takes too long? More drying up of the lendable stock and tradable stock? (one reason I was originally bullish on OTC). Litterally any number of things can send this thing flying for days/ weeks on end. I&#39;m pretty sure algos do the delta hedging, algos do the forced short covering etc. There are many ways to dig an algo out of the dirt and ride it to Valhalla. </p>\n\n<p>I&#39;m pumped, you&#39;re pumped, we are all pumped. In this together till the very last $30 holder gets flung into 42069% return. In it to win it as one. </p>\n\n<p>Member to exercise those calls to the best of your ability when the time comes, this was the #1 mistake of OG apes during the Deepfknvalue sneeze, member? We win, we invade, we build. We are the captains now. SSSTTTTOOOKKKEEEEDDDD!</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/14zwb6n/shill_clowns_give_you_lemons_thought_experiment/", "time": 1689379063, "subreddit": "r/ThePPShow", "title": "Shill clowns give you lemons _ thought experiment DD with Mr. Arnal", "text": "I just read bernard The Clown's \"the street\" article. Its shilly. When shills show up I make lemonade. As per title, my mind wandered and came up with this.\n\nGoing concern: Stick with me here. Let me assume that the former BBBY CFO Gustavo Arnal was in cahoots with RC in a pump and dump scheme, and this is why he jumped to his death. Lets assume that RC is mentioned as a co-debtor because of the above mentioned scheme. Now I don't care if RC is greasy or a white knight, but let me tell a tale where RC is a possibly a wolf in knights clothing for us. Most importantly and either way hedgies can be fkd. And for the thought experiment that sprang up while chillin' after work today...\n\nGoing Concern:  RC\\_ writes letter to BBBY, he wants his baby.  RC\\_ fully sees Triton's shit pile and wants out but gets greasy with Arnal because he sees that hedgies and their plants might succeed in driving BBBY into a chapter 7 bankruptcy and he also wants to turn a bad thing into a good thing, profit. RC \\_ leaves a few goods, boards members (member) in there to try and turn the ship around, avoid litigation and leave getting his baby as a possibility. Litigation arrives as bankruptcy unfolds and RC with BoD gets away with a chapter 11. RC is on the line for 1.2 bill, but their are 2 bill in NOLS, a baby and a possible integration with his existing business ventures. What does he do? He erases litigation debt while gaining some of the the assets he originally wanted anyways, or at least that is what I'd do if I found myself in this pickle. Bernard get fkd. Hedgies get fkd. Dear RC, so I don't care why or how you are involved exactly but this needs doing and I'm still certain on so many fronts that you will be the doer here.\n\nFull disclosure, I have 0% as to whether any of this could actually line up temporally properly, so do with it what you will.", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/14zwb6n/shill_clowns_give_you_lemons_thought_experiment/", "time": 1689379063.0, "subreddit": "r/ThePPShow", "title": "Shill clowns give you lemons _ thought experiment DD with Mr. Arnal", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/14w9az3/docket_1275_baby_ip_is_officially_sold_sixth/", "time": 1689029892.0, "subreddit": "r/ThePPShow", "title": "Docket 1275. Baby IP is officially sold. Sixth street consented. Wut mean?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Back in the downers sub this was posted not too long ago( as in last two hours), comments basically say we&#39;re over, but they lack tinfoil that&#39;s why they&#39;re there and we are here. I believe but I need some more smooths positive vibes here. I need this thing to fkn fly.</p>\n\n<p>Jist of this docket from what I can tell is that Tomorrow happened Today. Baby IP is a sealed deal.</p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTU2NjUzNA==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTU2NjUzNA==&amp;id2=-1</a></p>\n\n<p>So DIP debt bid gave sixth a privileged position. If Dream paid so little for the IP, why didn&#39;t Sixth just go going concern on this shit and be done with it? As far I can tell the bad baggage was dropped off already no?</p>\n\n<p>So what has happened so far is that BBBY going concern wasn&#39;t bought, so they split it into BBBY and Baby. Only IP of each has been scooped up which leaves us with..... no brand? We&#39;ve leases, old stock, new stock obligations and a supply chain. Anything else?</p>\n\n<p>What is the going good vibes/ hedgeez r fukt thesis. I know there was talk of Teddy not needing the brand, but capitalizing on the leases/buildings and supply chain. Ones to assume that the IP isn&#39;t that important to Teddy cause they&#39;ve got their own as well as an amazon competitors data base will have  wildly different architecture then what BBBY/Baby had for sale in their IP deals. So basically trapped in a glass case of emotion here and Icahn&#39;s got to rub me the right way cause I gotta come on out.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/13gt3my/love_for_roach_ucopy_pete_the_pilot_bulls_bears/", "time": 1684012871.0, "subreddit": "r/ThePPShow", "title": "Love for Roach, U-copy, Pete the pilot, bulls, bears and everyone in between.", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/13fyda4/tinfoil_is_a_new_food_group_highly_nutritious/", "time": 1683928594.0, "subreddit": "r/ThePPShow", "title": "Tinfoil is a new food group, highly nutritious, government approved. Holy Fk.", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/u/real\">u/real</a> Pulte is actually Pulte. No way to doubt that now, now you know. The Deathstar explosion will extinguish all the dumb stormtroopers and the force of the explosion will light our rocket into the sun. I have to work today, heavy industry, shouldn&#39;t go, too hyped, will have to go on workers comp. after a lack of situational awareness due to tit jacking. Will not include tit jacking on my task safety review paperwork today. Their loss, my gain.</p>\n\n<p>After we wen moon tmrrw I&#39;m a goin be on a %100 hardcore diet of   PP&amp;Co.   approved tinfoil. Someone get me some sunglasses cause the future is too bright.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/13fvklj/debunking_of_uucopy_nomurarakuten_forced/", "time": 1683922033.0, "subreddit": "r/ThePPShow", "title": "Debunking of u/U-copy Nomura/Rakuten forced liquidation post by u/Region-Format", "text": "<!-- SC_OFF --><div class=\"md\"><p>Looks like something was lost in translation here. <a href=\"https://www.reddit.com/r/BBBY/comments/13fj37p/comment/jjvhwft/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/BBBY/comments/13fj37p/comment/jjvhwft/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/13ezz31/next_week_is_it_for_me_that_is_when_i_see_rockets/", "time": 1683839080.0, "subreddit": "r/ThePPShow", "title": "Next week is it for me, that is when I see rockets. Gamma goes CRAZY in OTC.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Look at the number of calls vs the puts. If we come close to 50 cents, then we can easily go straight up to $5 - $8. Shorts have borrowed literally everything today and hopefully have deployed most of it already (they dumb like that). Options are close only so no possible short fuckery in the chain with married calls/puts.  *--&gt; Member to exercise those calls to add pressure and keep stonks out of evil hands :)</p>\n\n<p><a href=\"https://preview.redd.it/ovfaab7fo9za1.png?width=593&amp;format=png&amp;auto=webp&amp;s=44cc122387a0189968e50d815328246a3117eb55\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/ovfaab7fo9za1.png?width=593&amp;format=png&amp;auto=webp&amp;s=44cc122387a0189968e50d815328246a3117eb55\" alt=\"https://preview.redd.it/ovfaab7fo9za1.png?width=593&amp;format=png&amp;auto=webp&amp;s=44cc122387a0189968e50d815328246a3117eb55\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/KAWuRyT--OMiXYkutXAQMP0QH-30FEGxD5gzTlZKloQ.jpg\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/13d4nui/018_023_candles_two_different_times_today_wtf/", "time": 1683663319.0, "subreddit": "r/ThePPShow", "title": "0.18 - 0.23 candles @ two different times today WTF.", "text": "<!-- SC_OFF --><div class=\"md\"><p>After first major drop, and then again in the last few minutes of the day before close.</p>\n\n<p><a href=\"https://preview.redd.it/cnawyamd6vya1.png?width=1293&amp;format=png&amp;auto=webp&amp;s=a49c8c0aeb13aa3a3335c41c28dd7b1281360349\"><img style=\"max-width: 100%\" src=\"https://preview.redd.it/cnawyamd6vya1.png?width=1293&amp;format=png&amp;auto=webp&amp;s=a49c8c0aeb13aa3a3335c41c28dd7b1281360349\" alt=\"https://preview.redd.it/cnawyamd6vya1.png?width=1293&amp;format=png&amp;auto=webp&amp;s=a49c8c0aeb13aa3a3335c41c28dd7b1281360349\"></a></p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/R0d9DPUiL3rMfAe4T_gW0LMBo504vny2GTtV3ieZ4Wc.jpg\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/137z82v/transfer_tfsarrsp_stock_to_nonreg_account_canada/", "time": 1683232730.0, "subreddit": "r/ThePPShow", "title": "Transfer TFSA/RRSP stock to non-reg. account (Canada)", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just got off the phone with CIBC, got them to transfer stock in kind from both registered accounts to my non- registered account. It was very easy and I&#39;ll avoid the tax headache of holding these ineligible OTC securities in registered accounts.</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/137xifc/my_hodl_commitment_to_the_international_xhood_of/", "time": 1683229002.0, "subreddit": "r/ThePPShow", "title": "My HODL commitment to the International Xhood of Regards.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I want everyone to know that I will be holding my initial prediction X10. 68000 stonks strong.</p>\n\n<p>Simple maths &gt; No one sells, everyone wins.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Technical ANALysis", "text_color": "dark", "back_color": "#9e8d49"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/136z1r1/calculator_time_bitches/", "time": 1683146887.0, "subreddit": "r/ThePPShow", "title": "calculator time bitches", "text": "<!-- SC_OFF --><div class=\"md\"><p>8 more days like this of 100%  = $25.60  This is hilariously easy to imagine and this is nothing.</p>\n\n<p>4 more days like this on top of the above  = $410  ... aka 420 time.</p>\n\n<p>This is the riskiest, stress free retirement plan ever. </p>\n\n<p>Close only options. Difficult and expensive to short. No nakeds. Float was a lie. Nuff said. Kenny will be servicing us behind the Wendy&#39;s dumpster very shortly.</p>\n\n<p>Mandatory LFG. LFG! LLLFFFGGG!!!</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/132aeha/s1_bk_match_made_in_heaven/", "time": 1682717454.0, "subreddit": "r/ThePPShow", "title": "S-1 + BK. Match made in heaven.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Be smooth enough for tinfoil, but keep a few wrincels. The company can&#39;t actively be diluting while working on BK filings. That would be 100% lawsuit guaranteed and that is why the S-1 is absolutely necessary.</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/12yxqoc/please_delist_me_sue_nasdaq_isnt_that_great/", "time": 1682460459.0, "subreddit": "r/ThePPShow", "title": "Please de-list me Sue. nasdaq isn't that great anyways. Gamma lets go.", "text": "<!-- SC_OFF --><div class=\"md\"><p>De-listing from NASDAQ means new CUSIP #, new ticker BBBYQ, OTC trading, no new stock (share sales stop, no possible further dilution). Stock options will move to close only, this means they can&#39;t short via options chain. This is the worse outcome for shorts, why they shorted more is beyond me. If shorts lose their borrow, now they can&#39;t use options to get it back. Gamma squeeze, a baby one we saw last week when it hit 0.50, can get really spicy when options move to close only. I vote for gamma squeeze and loss of back door for borrow for shorts. Please de-list me Sue. nasdaq is that great anyways.</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": null, "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/12yusa8/sixth_street_dip_and_credit_bids_calling_all/", "time": 1682454028.0, "subreddit": "r/ThePPShow", "title": "Sixth Street DIP and credit bids. Calling all wrinkles. Credit default swaps?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Vampirism. Where is the garlic?</p>\n\n<p>Sixth street was involved before, but only now are willing to do the bank loan (DIP)  now that ch #11 has happened.</p>\n\n<p>1) They own a metric shit ton of credit default swaps that they want to collect on. (opinion)</p>\n\n<p>2) DIP financing gets top priority in bankruptcy. (fact) Also in 363 sale?</p>\n\n<p>3) Bankruptcy was necessary to get the DIP (Sixth street). (fact)</p>\n\n<p>4) The credit bids will be used to parcel out BBBY. (opinion) Buy its operational value and sell its asset value. Often a large discrepancy between these two values and only one of them will be used in the monetization of the business and its parts for the purpose of auction. Comes down to who owns the judge for which value is used. Is this judge BBBY friendly?</p>\n\n<p>Wrinkles. </p>\n\n<p>What other factors besides a higher bidder would help to undermine Sixth Streets interests? </p>\n\n<p>Is there any money to pay the DIP? </p>\n\n<p>Are the credit bids inevitable or is there a situation where they are not involved? A quickly paid DIP means no credit bids?</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/12ayq4s/wen_s1_cue_for_moon_waiting_for_the_green_dildo/", "time": 1680557737.0, "subreddit": "r/ThePPShow", "title": "Wen S-1? Cue for moon, waiting for the green dildo tentacles to start.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Only thing I&#39;m waiting on is this S-1, for me it will be a milestone here and give us some more concrete affirmations. Have been updating the SEC filing page every 30 minutes.</p>\n\n<p>HODLin&#39; 67500 @ $3. Not leaving. Rent is overdue Hedgies, pay up on your way out, do not pass go, go straight to jail, here is your eviction notice. (Kenny, you&#39;re not welcome in the jails in Florida)</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/126wq1q/dumb_stormtroopers_caused_the_warrant_deal_to/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "Dumb Stormtroopers \"caused\" the warrant deal to switch to equity funding. Get fukt.", "text": "Smooth post here, I might be waaaaaay off. Please confirm or deny. This is Ramen or Lambo.\n\nHeavy short selling activity has made it such that the original warrants/preferred stock deal is no longer as feasible.\n\nHBC, I believe, was not a bad actor for longs. It was an intermediary for another undisclosed interest.\n\nThe undisclosed interest, RC/Icahn for the tinfoil loves, did not intend to dilute heavily through the warrants deal. But, the short sellers have been so successful so far that the deal must be changed to an equity raise to follow through with the Master Plan. The side effect of this is unwanted dilution, but the board has no choice but to switch the deal from warrants to equity raise in-order to move forward. Again, this is with the same undisclosed interest. Basically nothing has changed that much except even more shorts are getting trapped.\n\nIf this was the plan all along, then they might let shorts get all horny for two days, then drop the equity raise deal news first thing Monday, or better yet mid day Monday. Oh! (you might say) Fuk! (you might say) what is Monday? FooooooK... its April 3rd, we ride at dawn bitches. 69/420D Matryoshka trap / aka nesting russian doll bear trap. LFG.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/11wc68m/ubs_to_mitigate_cs_legacy_issues_risk_by/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "UBS to mitigate CS legacy issues risk by unwinding Archegos swaps. These swaps expire next week.", "text": "Paraphrasing UBS/CS conference. UBS just bought out CS for 2 Billion this Sunday, March 19th, 2023. Laws were hastily changed so shareholder voting rights could be bypassed. This is .50 cents, a little ways down from the 1.86 CS was just at that the shareholders are getting. Again on Saturday this was illegal, after Sunday it became legal without due process. The wonders a massive weekend meeting can produce away from market hours and prying eyes.\n\nHuge news! Here's highlights from the conference:\n\nFederal council guarantees CHF 9 Bill. to help reduce risks UBS may face (Archegos swaps?) The help comes into effect if losses for UBS pass a certain threshold (as if they won't? LMAO)\n\nUBS to downsize CS's inherited investment banking business and make it more conservative. Unwind shit deals. (Swaps?)\n\nCS quote \" We have been caught up in a legacy issue\" Archegos bag and Greensill scandal.\n\nDownsize what specific portfolios from CS? Level 3 assets long dates swaps etc... SWAPS!\n\nHow much BBBY is in these shit swaps they need to clear out with the help from Swiss taxpayers? Weren't all OG meme stocks born from Archegos? If anyone can chime in about BBBY's exposure to the swaps, please do!", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/11vz0ro/play_summary_and_a_rsplit_comparative_yea_but_not/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "Play summary and a r-split comparative, yea but not really.", "text": "Just want to think through writing about some basics of this play as I see it, this is just a rehash of stuff already discussed, nothing really new but I thought I'd share anyways.\n\nI'm in this play for the M/A and squeeze. I get the bullish logic behind a pro reverse stock split, at the very best it's a forced locate on naked shorts whose numbers I believe are directly related to the FTD amounts we are currently seeing on BBBY, which leads me to think that there are a lot of naked shorts. Someone earlier posted about COSM and their run up related to forced closure of positions. I need some nipple cream now. As has been pointed out by others, a basic ten point hit list of things to do to in order to line up a M/A has been checked, now including the r-split which sometimes makes the list.\n\nI was involved in a reverse stock split two-ish years ago in a biophara and got burned hard, so am a bit gun shy right now. Typically naked shorts cellarbox stocks and companies either 1- declare bankruptcy, 2- do reverse stock splits to try and shake the naked shorts and/or 3- fall prey to death spiral warrant deals. These scenarios are far to common but usually more on pink slip stocks that have actually been cellarboxed, and they have not yet been successful in boxing in BBBY yet. That being said, I also can see the specifics of the BBBY play, a thing is the thing itself, and and am holding. F round, f out. \n\nIf this is 69/420D chess its going to be bragging rights after it plays out for everyone holding well timed calls and stock. The biggest bear trap in history? Icahn plays poker. He withholds information from other players and draws them into false narratives then reveals his hand. So, with people even like M. Burry convinced that the death spiral is in play, the general public believes the company is bankrupt and the reverse stock split has recently been put out there. The stereotypical death trio that tell shorts something is going to be free money for them, draws them in and makes them bold. The trap has been FULLY set and I don't think BBBY has anymore short traps to set, all traps in existence are in play here and are set. The endgame is near. This is the high risk -> this is either what it seems to be on the surface or this is what a lot of us believe which is not the surface story. \n\nmuln, I heard that they're possibly going to do a reverse stock split very soon. Am watching this even though it is its own play with its own details. Am curious how naked shorts will actually play out before and after the r-split. Seems to be a not so perfect practice run for BBBY but will help me think about all of this a bit more. Not holding muln, don't really know anything about it, its just on my radar to watch out of curiosity.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/11t6abv/william_index_proposal_warrants_converted_tracker/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "WilliaM Index proposal (warrants converted tracker)", "text": "Am listening to 3/16/23 PPShow, am listeing to William Moffatt, am getting stoked. Love his contribution. He suggests that ideally stock does not truly run until, all Class A Convertible Warrants valued at $800 million are converted to Class A Preferred.  I like this idea, it makes sense to me. I propose making a tracker called the \"WilliaM Index\" that tracks Warrant Conversion so we can keep track of this stuff. Will try and find some time to make this, should be very basic. The more info. the better. Obligatory LFG!", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/11rqe47/shares_available_are_climbing_but_ssr_is_on/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "Shares available are climbing , but SSR is on. Tomorrow we moon?", "text": "I know SSR can sometimes stay on for the following day. Maybe that is why we are seeing shares available right now with the Short Sale Restriction (formerly the uptick rule) on?\n\n\"How Long Does SSR Last? The short-sale rule lasts **from the moment it was triggered by a price drop of more than 10% from the previous day until the closing of the next market day**.\" - [https://tokenist.com/investing/what-is-ssr-in-stocks/](https://tokenist.com/investing/what-is-ssr-in-stocks/)\n\nI pray that we get to $3, cause 40% of the float is under control of calls at that price. :)", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "/r/bbby_remastered/comments/11p5cwc/game_theory_rational_trading_strategies_maximize/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "Game Theory -&gt; rational trading strategies. Maximize gains / force max losses.", "text": "", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": ""},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/11jkegj/280_days_is_the_cycle_is_what_it_is_im_too_smooth/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "280 days is the cycle. Is what it is, I'm too smooth to know why.", "text": "280 days is the magic number. Don't fight the cycle.\n\nOpEx quarterlies? CBOE? Swap contracts? Triple witching OpEx week? \n\nDropping of the latest smaller ETF seems like less vehicles to mark FTDs as long through. \n\nTwo things will break this stock for moon time. High liquidity or illiquidity.  I'm seeming algo.s whale teething this and I'm looking at NVI at *never before seen lows*. So maybe illiquidity?\n\nPoint of this post is this. I'm smooth but I can count nearly up to 300. \n\nJan 25 2021 -> Nov 1st 2021  = 280 days. Nov. 1st 2021 -> Aug 8th 2022 =  280 days.\n\nSo Aug 8th 2022 + 280 days = **May 15th 2023.**\n\nDon't know why and I don't need to, but if someone does ...", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/11hbvpp/march_madness_event_no_rsvp_required_lots_of/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "March Madness Event. No rsvp required. Lots of space left.", "text": "Everything  will print next month during our March Madness Event. Please make sure  you attend. No RSVP required. Regards the enjoyment of the event, please  feel free to bring as many tag alongs in full regards as possible. The  more Regards taken, the more Regards given for an afternoon and evening  of pleasure. Its a themed costume party so bring your spacesuit. If you  plan on riding our gamma ramp roller coaster during the event, please  take note that it does not have seat belts so make sure you strengthen  your wrists and forearms ahead of the event in consideration of personal  safety. There are a few thick glass panels that the ride will be  directly traversing through, be sure to jack those Ts and As to ensure  your ability to cut a clean cut in the glass. Truly yours, in full  Regards.... See you all at The Event.", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TendieSupasta", "url": "https://www.reddit.com/r/ThePPShow/comments/11ehqp3/ftds_dtcc_regsho_wtf/", "time": 1611775107, "subreddit": "r/ThePPShow", "title": "FTDs DTCC Regsho, wTF.", "text": "I've been a lurker for quite awhile now, but feel the need to engage on something here. Been lurking since the original sneeze with GME. I need some eyes, some wrinkles and a giant green [D.do](https://D.do) to F'k the System with. (looking at u/ppseeds for the D'does here)\n\nJust watched a documentary from a few years ago concerning the SEC, Congress, Naked short selling, DTCC etc.... basically the system we are in here and what affects us in this market. For reference: [https://www.youtube.com/watch?v=26\\_IcexvePA](https://www.youtube.com/watch?v=26_IcexvePA)\n\nI found it to really sum up quite a few things for me. I want to understand what is in my power, what is in our power to do with this shit storm.\n\nSo, things I think I know about what is and what isn't...\n\nRegSho was created in 2000s to help track FTDs and therefore also Naked short selling in a way since a naked short can not be delivered.. they doesn't exist!. It was created by the SEC with the intention of making the market more fair and equitable for all participants but was compromised when rolled out. Metaphor here: The RegSho keeps track of the banks that get robbed from but not the robbers. Keep up the good work Gary, and keep smiling, your looking great :)\n\nDTCC is the electronic brains of settlement in the system, keeping track of who owns what. \\* They are also known to be complacent with FTDs, allowing Market Makers to push a deal when no stock can be located on the assumption that its complicated, you can't keep track of everything. (This is actually a paraphrase of a respose the DTCC gave when asked about naked short selling!)  This is the very loophole that allows Naked Short selling to occur. No locates needed, no shares needed. The issue with this is that a naked short turned FTD with no real obligation to locate effectually dilutes the float and creates a synthetic share.\n\nOffshoring of swaps ( those nice little things that crashed the economy in 2008 along with naked shorting ).  Post 2008 and RegSho 2.0 made the domestic practice of swaps difficult, so as all great open market Globalists do, swaps were off shored. Swaps are used to hide bad debt, roll FTDs all the good stuff that we love here. This is where roll dates could be hype dates, that is when contracts are renewed on these swaps and they have been shown to affect market price. A week or two ago the guys at the PPSHow were taking about these roll dates, usually every 5-6 months. Hype \\* we are in that timeframe now :)\n\n&#x200B;\n\nLong winded I know. So here is my understandings, assumptions and question(s) :\n\nIf RegSho doesn't add transparency to who has the FTD's, which would also show who may be naked shorting.....\n\nIf SEC has lost control of enforcement on swaps due to Offshoring ...\n\nIf DTCC is systemically enabling and complacent with Naked Short Selling....\n\nThen it seems to me that the astronomical amount of FTD's since January coupled with the whale teeth algo. traded decline everyday and the crazy amount of volume might point to dilution (not through exercising and conversion of warrants or preferred shares) through naked short selling ie: synthetic shares hitting the market. Does DRS force eyes on this? Will institutions do something once extremely highlighted?\n\nIf the float can not be borrowed (prohibitively high CTB) or straight up is not available to borrow at all. If APEs have DRS'd a large amount of the tradable float. But, DTCC allows non locate-able shares (FTDs) to be traded for the sake of maintaining liquidity (naked shorts)....\n\nYet, volume and liquidity remains. Then, when I buy stock and it is routed to the dark pools am I buying and holding synthetic shares that were created by naked short selling? If so, is my buying helping to dilute the float? And, are the SHFs hoping to continue this game until the stock is worthless and it gets de-listed, which is an equivalent of a bankruptcy for the SHFs and they get off with free money, and are free from all they're obligations?  Is this the endgame of SHFs? What is in our power to undermine the f'kery?\n\nINSERT WRINKLES HERE :\n\n\\* PS \\* I need a lambo, a new GF to compliment my wifes boyfriend and a way out of the labour pool cause its not my central bank. LFG!\n\nIf we get to a 100% DRS but volume and liquidity remain, which I suspect  will be the case. Then if I buy shares they're more then likely  synthetic shares and I'm acting against my own best interest in this  case, aiding in dilution of the float through naked shorts. I'm long and  here for the squeeze. Seems like it would be useful to get to 100% DRS  then stop all buying and chill/ HODL. That being said I don't DRS my  stuff because I want to capitalize on the squeeze but also think that  there is enough people that do that we might get to the 100% point. It  would be something quantitative to work with at least. Otherwise there  is no way of knowing how much retail buying is actually supporting naked  short selling. In addition there is no way to quantify how many naked  shorts /synthetic shares are being put out there. FTDs and RegSho is  only qualitative verification.", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]