[{"username": "The-BlackLotus", "url": "https://i.redd.it/pjj1z6qbqbdb1.jpg", "time": 1689947802.0, "subreddit": "r/ThePPShow", "title": "WHERE ARE YOU SHILLS?? HAHAHAHAAHHA. ITS OVER FOR YOU COCKSUCKERS", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/pjj1z6qbqbdb1.jpg\"/></div>"},
{"username": "The-BlackLotus", "url": "https://www.reddit.com/r/ThePPShow/comments/14t83vt/these_cockersuckers_dont_know_what_thet_are/", "time": 1688738371.0, "subreddit": "r/ThePPShow", "title": "These cockersuckers dont know what thet are dealing", "text": "<!-- SC_OFF --><div class=\"md\"><p>As a passionate investor in AMC, GME, and BBBY, I have actively participated in this play since 2020. The devastating impact of the 2008 financial crisis, where my parents lost everything, fueled my determination to navigate the stock market with vigilance and resilience.</p>\n\n<p>The pervasive corruption and deceit that permeate the stock market have left me sick and tired. It is disheartening to witness how some short hedge funds fail to comprehend that they are dealing with investors who are battle-hardened, experienced, and driven by a deep sense of purpose. We have weathered storms and emerged stronger, united in our pursuit of justice and fair play.</p>\n\n<p>This is not merely a squeeze play; it is a movement fueled by righteous indignation. I hold not only for my parents, who suffered immense losses, but also for our collective future and the next generation. Our resolve is unyielding, and we are determined to expose and dismantle the corrupt practices that undermine the integrity of the market.</p>\n\n<p>We seek accountability and demand that those responsible for manipulating the system be held responsible. We will not rest until those cocksuckers who perpetuate lies and deceit are brought down, their deceitful empire reduced to ashes. We stand together, united by our unwavering commitment and the fire in our hearts.</p>\n\n<p>TLDR: YOU SHILLS, SHF, BANKS, HEDGE FUNDS, MSM,  IT&#39;S OVER FOR YOU COCKSUCKERS.</p>\n\n<p>PS. Huge shout out to AJ last night, keep spitting fucking truth. WE WILL NOT LEAVE UNTIL WE TAKE THEIR FUCKING BEDS!!  </p>\n\n<p>PS2. I was so jacked i fucked up the title, either way, they are FUCKED</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]