[{"username": "thearabiannightmare", "url": "https://www.reddit.com/r/ThePPShow/comments/17d7bc9/schwab_account_agreement_worthless_and/", "time": 1697908164.0, "subreddit": "r/ThePPShow", "title": "Schwab Account Agreement - Worthless and Non-Transferable Securities", "text": "<!-- SC_OFF --><div class=\"md\"><p>First-time poster - so please reach out if there&#39;s anything I need to edit here. I was reading through the Schwab Account Agreement and found a juicy section that I think we need to get more eyes on to make sure that brokers don&#39;t screw shareholders so they can save their own ass.</p>\n\n<p><a href=\"https://www.schwab.com/legal/schwab-brokerage-account-agreement\">https://www.schwab.com/legal/schwab-brokerage-account-agreement</a></p>\n\n<h3>25. Non-Publicly Traded Securities and Worthless or Non-Transferable Securities</h3>\n\n<p><strong>Worthless and Non-Transferable Securities.</strong> Schwab reserves the right to remove from your Account any security that is deemed to have been cancelled or otherwise invalidated. In determining that a security has been cancelled or invalidated, you agree that we have derived information on such assets from you or from third parties and we are not responsible for the accuracy or reliability of any information regarding these assets. Cancelled or invalid securities may include, but are not limited to, bankruptcy or charter or registration revocation. <em>Schwab will notify you if it has removed a cancelled or otherwise invalid security from your Account. Unless you provide Schwab with evidence of the validity of the security within sixty (60) days of the notice of removal, you agree to waive any claim to any future distribution from the security and agree to indemnify and hold Schwab harmless from any claims, liability, or damages resulting from the removal of such security. If you provide Schwab with evidence of the validity of the security from an independent third party within 60 days of receiving the notice of removal, Schwab will reinstate your position.</em></p>\n\n<p>In addition, Schwab reserves the right to charge an additional servicing fee for securities for which Schwab cannot identify a transfer agent (a &quot;Non-Transferable Security&quot;). The existence of a Non-Transferable Security in your Account may be noted with a notation of &quot;N/A&quot; for the value of that position on your account statements.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]