[{"username": "Then_Contribution506", "url": "https://www.facebook.com/reel/5414566071980456?fs=e&amp;s=TIeQ9V&amp;mibextid=0NULKw", "time": 1691690140.0, "subreddit": "r/ThePPShow", "title": "Class warfare.", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://a.thumbs.redditmedia.com/lIRTEtQ7PpSvWNwzpDdwBZWyfm7lTN2BCOKV6uE-Cy0.jpg\"/></div>"},
{"username": "Then_Contribution506", "url": "https://i.redd.it/rabuclwru1gb1.jpg", "time": 1691135728.0, "subreddit": "r/ThePPShow", "title": "Some will say this is true. Some will say it is a lie.", "text": null, "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rabuclwru1gb1.jpg\"/></div>"},
{"username": "Then_Contribution506", "url": "https://i.redd.it/gii4t5o3p8fb1.jpg", "time": 1690782721.0, "subreddit": "r/ThePPShow", "title": "Everything ships free????", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/gii4t5o3p8fb1.jpg\"/></div>"},
{"username": "Then_Contribution506", "url": "https://www.reddit.com/r/ThePPShow/comments/15e0jck/bond_owners_the_identity_of_some_of_all_has_been/", "time": 1690761349.0, "subreddit": "r/ThePPShow", "title": "Bond Owners. The identity of some of all has been in front of us the entire time.", "text": "<!-- SC_OFF --><div class=\"md\"><p>While I was researching the claims filed on the Kroll website I noticed that if you open the claim there is a link I the top right of the window that says &quot;proof of claim PDF&quot;. If you click on it and download the link it will show what was submitted with the proof of claim. Some links contain the entire claim and some contain only the first page of the form. I believe the rest is redacted or is no longer an applicable claim. I have found some of the companies holding some of the bonds. </p>\n\n<p>The Sixth Street proof of claim is for a majority of the BBBY bonds that they hold as trustee. That particular form does not list the individual(s) owner(s) but it does state that all bonds held by them must be moved (bought/sold) together. </p>\n\n<p>TRANSFERS OF THIS GLOBAL SECURITY SHALL BE LIMITED TO TRANSFERS  IN WHOLE, BUT NOT IN PART, BY THE DEPOSITARY TO A NOMINEE OF THE  DEPOSITARY, OR BY A NOMINEE OF THE DEPOSITARY TO THE  DEPOSITARY OR ANOTHER NOMINEE OF THE DEPOSITARY, OR BY THE  DEPOSITARY OR ANY SUCH NOMINEE TO A SUCCESSOR DEPOSITARY OR A  NOMINEE OF SUCH SUCCESSOR DEPOSITARY.”  </p>\n\n<ol>\n<li><p>The Bank of New York Mellon is trustee (the “Trustee”) under the Indenture dated  as of July 17, 2014 as supplemented by the First Supplemental Indenture dated as of July 17, 2014  (collectively, the “Indenture”), between Bed Bath &amp; Beyond Inc. (the “Company”) and The Bank  of New York Mellon, as Trustee, pursuant to which (i) 3.749% Senior Notes due 2024 (the “2024  Notes”) in the aggregate principal amount of $300,000,000 were issued, of which $215,406,000  remain outstanding, (ii) 4.915% Senior Notes due 2034 (the “2034 Notes”) in the aggregate  principal amount of $300,000,000 were issued, of which $209,712,000 remain outstanding, and  (iii) 5.165% Senior Notes due 2044 (the “2044 Notes,” and collectively with the 2024 Notes and  2034 Notes, the ”Notes”) in the aggregate principal amount of $900,000,000 were issued, of which  $604,820,000 remain outstanding. Capitalized terms not defined herein shall have the meaning  ascribed to them in the Indenture.  2. The Trustee submits this proof of claim on behalf of all holders of Notes pursuant to  the Order (I) Setting Bar Dates for Submitting Proofs of Claim, Including Requests for Payment  under Section 503(b)(9), (II) Establishing Amended Schedules Bar Date, Rejection Damages Bar  Date, and Administrative Claims Bar Date, (III) Approving the Form, Manner and Procedures for  Filing Proofs of Claim, (IV) Approving Notice Thereof, and (V) Granting Related Relief, dated  May 31, 2023 [Dkt. No. 584]. </p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-ClaimInfo\">Kroll Restructuring Administration</a> </p></li>\n</ol>\n\n<p>If anyone is interested I encourage them to go take a look and to see what they can find. I don&#39;t understand why this information is displayed in a format that requires long winded navigation to find it. </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Then_Contribution506", "url": "https://www.reddit.com/r/ThePPShow/comments/15dyy9o/who_originally_ownedowns_the_trademarks_etc_for/", "time": 1690757170.0, "subreddit": "r/ThePPShow", "title": "Who originally owned/owns the trademarks etc for BBBY?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was looking through trademarks and IP that was sold and came across this website with 7 pages of trademarks. I noticed that Liberty Procurement Co owns the trademarks and that there are way more than I ever thought. Take a look. What was actually sold in the APA?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://opencorporates.com/companies/us_ny/2578137\">LIBERTY PROCUREMENT CO. INC. :: New York (US) :: OpenCorporates</a> </p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Then_Contribution506", "url": "https://www.reddit.com/r/ThePPShow/comments/15dwlnn/why_are_the_landlords_paying_the_debtors_in_most/", "time": 1690751423.0, "subreddit": "r/ThePPShow", "title": "Why are the Landlords paying the Debtors in most of the filings today?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Why are the Landlords paying the Debtors in cancelled leases filed today? Some are 6 figure amount along with waiving all prepetition fees/amounts due. </p>\n\n<p>Here is a copy/paste from one filing today. Docket #1631 states :</p>\n\n<ol>\n<li>Consideration. Landlord shall (i) pay the sum of $100,000 in cash, (ii) credit for all prepetition and post-petition claims of Landlord under the Lease due from Debtors (the “Cure Costs”), and  (iii) waive any claim for damages arising from the rejection of the Lease under 11 U.S.C. § 502(b)(6) as  consideration for this Agreement (the “Consideration”) </li>\n</ol>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjQ1MDAzMg==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MjQ1MDAzMg==&amp;id2=-1</a></p>\n\n<p>If anyone can offer some insight on this please do so below. Also check out the other filings from today.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Then_Contribution506", "url": "https://www.reddit.com/gallery/15bj2ba", "time": 1690506056.0, "subreddit": "r/ThePPShow", "title": "Bed Bath and Buy Buy Baby App", "text": "<!-- SC_OFF --><div class=\"md\"><p>Bed Bath and Beyond app shows developer as Overstock. </p>\n\n<p>Buy Buy Baby shows developer as Bed Bath and Beyond. </p>\n\n<p>Just something I saw while browsing.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/zpzA8K0PdPMLnNJOr7IEtdBtTSgMWEqQUDwwALTybWc.jpg\"/></div>"},
{"username": "Then_Contribution506", "url": "https://www.reddit.com/r/ThePPShow/comments/158edmj/docket_1470/", "time": 1690213696, "subreddit": "r/ThePPShow", "title": "Docket 1470", "text": "Authorizing certain claims under a certain amount to be paid by BBBY insurance. Getting rid of debt. \n\nhttps://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTg2NzI3NQ==&id2=-1", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Then_Contribution506", "url": "https://www.reddit.com/r/ThePPShow/comments/14jog3x/anyone_have_the_andrew_k_glenn_declaration_that/", "time": 1687802571.0, "subreddit": "r/ThePPShow", "title": "Anyone have the Andrew K Glenn declaration that was sealed?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I would like to read the declaration that was sealed today. Does anyone have a copy of it? Thanks.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Then_Contribution506", "url": "https://www.reddit.com/r/ThePPShow/comments/1325oe0/why_i_believe_you_shouldnt_be_worried_about/", "time": 1682706318.0, "subreddit": "r/ThePPShow", "title": "Why I Believe You Shouldn't Be Worried About Losing Your Shares in BBBY", "text": "<!-- SC_OFF --><div class=\"md\"><p>A bankrupt company&#39;s net operating loss carryovers (NOLs) often are one of its most valuable assets. </p>\n\n<p>If the asset is wanting to be retained following a sale or all or part of the company due to restructuring, then there are certain requirements that must be met. I believe that BBBY is following these requirements based on their filings. One of which is preventing the transfer of ownership by acquiring more than 50 percent of shares. I will show how this is beneficial for current shareholders.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>According to the filing submitted by BBBY :</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NDA0OQ==&amp;id2=-1\">https://restructuring.ra.kroll.com/bbby/Home-DownloadPDF?id1=MTQ5NDA0OQ==&amp;id2=-1</a></p>\n\n<p>&#x200B;</p>\n\n<p>DEBTORS’ MOTION FOR ENTRY OF INTERIM AND FINAL ORDERS(I) APPROVING NOTIFICATION AND HEARING PROCEDURES FOR CERTAIN TRANSFERS OF COMMON STOCK AND PREFERRED STOCK AND (II) GRANTING RELATED RELIEF : </p>\n\n<p>&#x200B;</p>\n\n<p>BBBY is seeking relief related to certain transfers of Debtor Bed  Bath &amp; Beyond Inc.’s (“BBBY”) common stock and Series A convertible preferred stock, or any  Beneficial Ownership2 therein (any such record or Beneficial Ownership of common stock,  collectively, the “Common Stock,” and any such record or Beneficial Ownership of Series A  convertible preferred stock, the “Preferred Stock”); (b) directing that any purchase, sale, or other  transfer of Common Stock or Preferred Stock in violation of the Procedures shall be null and void  ab initio; and (c) granting related relief. </p>\n\n<p>&#x200B;</p>\n\n<p>Page 5 of the filing</p>\n\n<p>An “Ownership Change” May Negatively Affect the Debtors’ Utilization of the Tax Attributes.</p>\n\n<ol>\n<li>Sections 382 and 383 of the IRC limit the amount of federal taxable income and federal tax liability, respectively, that can be offset by a corporation’s tax attributes in taxable years (or portions thereof) following an “ownership change.” Generally, an “ownership change” occurs if the percentage (by value) of the stock of a corporation owned by one or more “5 percent” shareholders has increased by more than 50 percentage points over the lowest percentage of stock owned by such shareholders at any time during the 3-year testing period ending on the date of the ownership change. </li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>They are asking for relief to prevent the transfer of ownership without the permission of BBBY in order to protect the following Tax Attributes.</p>\n\n<p>&#x200B;</p>\n\n<p>The Tax Attributes </p>\n\n<p>Page 4</p>\n\n<ol>\n<li>Companies generally have a variety of tax attributes. A company generates net  operating losses (“NOLs”) if the operating expenses it has incurred exceed the revenues it has  earned during a single tax year. A company may apply or “carry forward” NOLs to reduce future  tax payments (subject to certain conditions discussed below).4  See IRC § 172. 9. As discussed below, a company’s tax attributes can become subject to significant  limitation under IRC §§ 382 and 383 if an “ownership change” occurs. The purpose of the relief  requested herein is to minimize the risk that an “ownership change” occurs before the conclusion  of these restructuring cases. In doing so, the Debtors intend to maximize the value of their estates  by limiting tax liabilities generated during or as a result of the actions taken during the cases.  10. The Debtors currently estimate that, as of February 25, 2023, they had  approximately $1.6 billion of federal NOLs and $5 million of federal tax credits </li>\n</ol>\n\n<p>The Tax Attributes are  potentially of significant value to the Debtors and their estates because the Debtors may be able to utilize the Tax Attributes to offset any taxable income generated by transactions consummated  during these Chapter 11 Cases (including with respect to any taxable disposition of some or all of  the Debtors’ assets). Additionally, depending on the structure utilized in a chapter 11 plan, in the  event any of the Debtors’ Tax Attributes were to survive, the Debtors may be able to carry forward  certain of those Tax Attributes to offset federal taxable income or federal tax liability in future  years. Accordingly, the relief requested herein will preserve the value of the Tax Attributes to the  benefit of all of the Debtors’ stakeholders. </p>\n\n<p>&#x200B;</p>\n\n<p>***Now there are other requirements that need to be followed in order to ensure the use of the full amount. My assumption is that if they are filing the above to prevent a loss to the tax credit then they are planning on following the other requirements (below) in order to be able to use the full value.***</p>\n\n<p>&#x200B;</p>\n\n<p>Section 382 typically limits the use of NOLs by the acquiring corporation where there is a 50% ownership change. However, this is not necessarily the case in bankruptcy situations. </p>\n\n<p>As long as the corporation was under jurisdiction in a title 11 or similar case and the former shareholders and creditors remain in “control” after the bankruptcy, then the limitations of Sec. 382 do not apply. </p>\n\n<p>Special rules apply in bankruptcy and similar cases limiting the use of these assets but <strong>IRC Section 382(l)(5) provides an exception to the general rule if the following conditions are met:</strong></p>\n\n<ul>\n<li>Immediately before the ownership change, the loss corporation is under the jurisdiction of the court in a title 11 or similar case; and</li>\n<li>The corporation’s shareholders and “qualified creditors” (determined immediately before the ownership change) own at least 50% of the stock’s value and voting power immediately following the ownership change.</li>\n</ul>\n\n<p>The second bullet point is my focus in this post. If they want to use the full amount they have to ensure that previous shareholders and qualified creditors own at least 50 percent of the stocks value  following the ownership change. </p>\n\n<p>TL/DR:</p>\n\n<p>I believe, based on the filings, that stock holders shouldn&#39;t be worrying about being wiped out because it looks like BBBY wants to keep and use this valuable asset therefor current shareholders are required to be represented and made whole.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Then_Contribution506", "url": "https://i.redd.it/xr6oixm67jwa1.jpg", "time": 1682628760.0, "subreddit": "r/ThePPShow", "title": "Cash available for unsecured creditors.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Was looking at the original chapter 11 filing and saw this was checked. </p>\n\n<p>It asks “ Debtors estimation of available funds” </p>\n\n<p>They checked “ Funds will be available for distribution to unsecured creditors “</p>\n\n<p>Does this mean they already had these funds before filing?</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/xr6oixm67jwa1.jpg\"/></div>"},
{"username": "Then_Contribution506", "url": "https://www.reddit.com/r/ThePPShow/comments/12zruyr/rsu_exchanged_then_amended/", "time": 1682531736.0, "subreddit": "r/ThePPShow", "title": "RSU Exchanged then Amended", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I was just looking around the insider transaction filings for BBBY in EDGAR and noticed that there were several amended statements regarding RSU. (Restricted stock unit). \nLooks like on Jan. 24th of this year several of the board members reported receiving cash in exchange for cancellation of their RSU. Then on Jan 27th they seemed to all be amended to state that they retained their RSU instead of receiving cash. Why would they have exchanged them for cash then reversed the transaction a couple days later? Maybe it’s something simple or has been discussed. I just found it odd.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]