[{"username": "Thin_Hunter_2315", "url": "https://www.reddit.com/r/ThePPShow/comments/16waw10/we_did_it_guys_we_won/", "time": 1696090505.0, "subreddit": "r/ThePPShow", "title": "We did it guys. We won.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I might be running on minimal sleep, but this is like the grand reveal in &#39;The Sixth Sense,&#39; where everything suddenly clicks and you realize Bruce Willis was a ghost the whole time. All those butterfly hints that seemed inconsequential? They were laying the groundwork for this moment. In hindsight, its so fucking obvious it’s funny. According to the date in the filing, this operation has been in motion since the &#39;70s, adding another layer to its brilliance. After pulling an all-nighter reading about Icahn, it&#39;s clear this is a play straight from his book.</p>\n\n<p>I’m absolutely buzzing with excitement. It’s as if we’ve all been engrossed in this complex movie, and we’ve just reached that jaw-dropping twist. We were right all along, and the energy is electrifying. Now the credits are running and we&#39;re finding out who were behind this glorious piece of art. All that&#39;s left is that post-credits scene where we’re all billionaires, lounging by the pool in the Maldives, sipping piña coladas - all while the hedgies are rotting away in their cells and the shills are crying because they missed the opportunity to buy before it was too late.</p>\n\n<p>We did it, guys. This is our blockbuster ending, and we’ve emerged victorious. People will talk about this in years to come.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Thin_Hunter_2315", "url": "https://www.reddit.com/r/ThePPShow/comments/14ihxqq/this_is_what_i_think_will_happen/", "time": 1687685371.0, "subreddit": "r/ThePPShow", "title": "This is what I think will happen", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just needed to jolt my thoughts down, since I&#39;ve been out of the BBBY-carousel for a while and trying to follow the latest developments. Perhaps this will be of interest to someone else. Let me know if something is &quot;wrong&quot; i.e. can&#39;t be supported by any sources. Based on filings, and other sources, I&#39;m pretty sure this will happen during the next month:</p>\n\n<p>Carl Icahn, famed for his audacious business strategies, gains control of Bed Bath &amp; Beyond (BBBY) and spearheads a merger with West Point Home brands. Breaking the norms, Icahn spins off Buy Buy Baby and sells it to Ryan Cohen. He then hands over the management of the rebranded Beyond (BYND) to Brett, while maintaining his advisory role. Bill Pulte also invests in BBBY, seeing synergy potential with his stake in Pulte Homes.</p>\n\n<p>In parallel, GameStop introduces Playr, its magnum opus, which is anticipated to challenge industry heavyweights such as Steam, Twitch, and even Twitter. Playr, a platform that allows users to freely resell and rent games and in-game items, revolutionizes the gaming industry. It integrates blockchain technology to provide an uncensored environment and a dynamic marketplace.</p>\n\n<p>Following the acquisition of Buy Buy Baby, Ryan Cohen revitalizes the brand into Teddy, under the leadership of Matt Furlong. Teddy becomes a part of the vibrant Gmerica ecosystem, creating a synergy between the physical and digital worlds. Teddy products, along with Beyond&#39;s offerings, get integrated into GameStop&#39;s warehouses and find their place in the GameStop Marketplace.</p>\n\n<p>The Gmerica ecosystem takes a significant leap by partnering with Pulte Homes, offering exclusive home packages featuring high-quality products from Beyond&#39;s range. This collaboration also introduces unique NFTs that allow homeowners to represent their physical homes in the GameStop metaverse.</p>\n\n<p>However, the strategic alliance of Ryan Cohen, Brett Icahn, Matt Furlong, and Bill Pulte doesn&#39;t stop here. They envision Gmerica becoming a bank and trading platform within the Playr metaverse. They aim to transfer all GameStop shares from the New York Stock Exchange to the Gmerica Exchange, promising a new era of financial trading, free from corruption and malpractices that have plagued Wall Street. This transition will involve an IPO of Teddy and Beyond, exclusively available through the Gmerica Exchange. This transition not only authenticates each share through blockchain verification as real stocks, but it also eliminates the potential for naked shorting, and crucially, forces shorts to locate real shares.</p>\n\n<p>As predicted by the basket theory, the fates of these stocks are intertwined, each fuelling the upward surge of the other. The intersection of these developments with burgeoning retail sentiment entraps hedge funds, igniting a short squeeze of unprecedented magnitude that overshadows any prior financial phenomenon. The ensuing colossal shift will launch these stocks beyond the distant reaches of Uranus, forever imprinting their legacy in financial history&#39;s annals.</p>\n\n<p>Hedge fund managers will be seen weeping on live broadcasts, doubters will retreat from their public personas, and critics will seek our forgiveness, possibly even a piece of our newfound wealth. Success will be chalked up to &#39;luck,&#39; overlooking our prescient prediction of this outcome. However, the strategic ingenuity of Cohen, Icahn, and Furlong will be recognized as the force behind this change, leading the financial world into a new era.</p>\n\n<p>This prediction is not purely imaginative, but rather built on factual evidence from filings and company registrations. Given the unforeseeable twists and turns we&#39;ve seen, reality could once again outshine fiction.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]