[{"username": "ThisWillBeFunNA", "url": "https://www.reddit.com/r/ThePPShow/comments/17bpn4f/fuck_your_tinfoil/", "time": 1697739305.0, "subreddit": "r/ThePPShow", "title": "Fuck your tinfoil", "text": "<!-- SC_OFF --><div class=\"md\"><p>Last week one guy from this sub said we&#39;d have an announcement at the latest on Tuesday because of some options tinfoil and everyone upvoted lmao. He was wrong.</p>\n\n<p>Fast forward to this week, every broker is saying the same thing but we find one random broker (QTrade) that says something different (push out) and its suddenly our life line? So one broker got it right and all the others are wrong, is that it? </p>\n\n<p>So far the only thing that is official is that my shares are considered worthless and no longer display in my broker&#39;s account. I held my shares past the 29th and I&#39;m currently down over 76k CAD on BBBY. Like everyone here I hope this is not actually the end, but until something is actually announced by the company or disclosed in the dockets, I&#39;m gonna consider this a loss and move on. Call me a shill if you want, I can&#39;t buy more shares or sell the ones I had so none of this matter anyways.</p>\n\n<p>Jon Snow knows nothing, I know nothing, the PP team and the Twitter gang have no idea either. Hell, even brokers employees have to Google shit up to reply to their customers.</p>\n\n<p><strong>If we end up being right, I&#39;ll be the first one to share my gains on Reddit/Twitter and tell everyone to shove watermelons up their asses, but for now I&#39;m gonna stfu because nothing indicates in the slightest that we&#39;ve won. You all can keep posting tinfoil if you want, but I&#39;ve been around long enough to know when its better to just stfu and go dark.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ThisWillBeFunNA", "url": "https://www.reddit.com/r/ThePPShow/comments/174ukbh/can_you_feel_it/", "time": 1696968023.0, "subreddit": "r/ThePPShow", "title": "Can you feel it?", "text": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Meow</th>\n<th align=\"left\">Meow</th>\n<th align=\"left\">Meow</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Meow</td>\n<td align=\"left\">Meow?</td>\n<td align=\"left\">Meow</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ThisWillBeFunNA", "url": "https://www.reddit.com/r/ThePPShow/comments/16z3aju/this_is_getting_old/", "time": 1696366733.0, "subreddit": "r/ThePPShow", "title": "This is getting old", "text": "<!-- SC_OFF --><div class=\"md\"><p><strong>***Please read my whole post before throwing tomatoes at me...**\\</strong>*</p>\n\n<p>Until there is an official announcement from the company confirming it, we haven&#39;t won and our share won&#39;t be bought at xx$ or traded for another equity. I&#39;ve been around long enough to know people on Twitter and Reddit don&#39;t know shit about fuck. </p>\n\n<p>We keep putting people on a pedestal (cough, cough... <sup>Superstonk era</sup>) and they end up being wrong or pushing dates further. We hyped the 29th of September, the PPShow with Pulte was full of cryptic stuff (the teddy bear costume, the ice cream, &quot;only the young&quot;, &quot;only the hung&quot;, etc.) and then nothing official was announced that week. Fast forward to this week, our shares are currently worthless and the stock is halted. Yet the sub is full of &quot;We&#39;ve won&quot; and &quot;25$/share&quot; posts. Can we just all shut the fuck up with the tinfoil for a while? We held our shares past the 29th, we can&#39;t buy or sell, all we have to do is wait and see what happens.</p>\n\n<p>Although I have trust issues and learned to not get my hopes up, I do believe Pulte is on our side and knows what he&#39;s doing, but again, until something official is announced he has not gained my trust.</p>\n\n<p>The only person I trust in all of this is Ryan Cohen, because he shuts the fuck up and we can only judge him by his actions : GME&#39;s CEO with no compensation.</p>\n\n<p>To anyone who thinks I&#39;m a bad actor, I&#39;m still holding over 34k BBBY shares and can provide proof to whoever wants it. I&#39;ve shared my position on Twitter before :  <a href=\"https://x.com/CantStopWtStp/status/1702771599277961418?s=20\">https://x.com/CantStopWtStp/status/1702771599277961418?s=20</a>  </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "ThisWillBeFunNA", "url": "https://i.redd.it/g5tovuc15hob1.jpg", "time": 1694807566.0, "subreddit": "r/ThePPShow", "title": "Hero or zero, LFG!", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/g5tovuc15hob1.jpg\"/></div>"}]