[{"username": "TieRevolutionary5625", "url": "https://www.reddit.com/r/ThePPShow/comments/17nihue/discussionquestion_do_we_need_a_registrar_before/", "time": 1699092397.0, "subreddit": "r/ThePPShow", "title": "Discussion/Question: Do We Need a Registrar Before The Stock Goes Back Into The Market?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just a thought boys and girls, that I am hoping will encourage some discussion. </p>\n\n<p>Presently, we have no idea where our registered shares are nor our brokerage shares for that matter lol. There has been speculation that the shares are still with AST/EQ, there has also been theories that the shares are now with Computershare and 117 million NFT&#39;s have been produced to attach to said shares rendering them un-shortable (which would be reassuring). There is also speculation that 3M Partners may be involved with this process. </p>\n\n<p>The reason for my question I believe to be simple. If the same stock (BuyBuyBabY) goes live again with the same CUSIP, then both brokerage and registered shares must be in our accounts. DRS&#39;ed shareholders will need to have a log-in and be able to trade the shares and we all know how long the snail mail takes, especially for us Eurapes. If the stock goes live before this happens then quite honesty I forsee the SHF&#39;s crying foul because shares are still effectively locked away that they cannot purchase. </p>\n\n<p>There will be shouts of market manipulation aimed at the new company, lawsuits, stock halted. I hope an announcement or docket in our favour comes very soon, which I believe it will, but I cannot see the original ticker going back live for the reasons above, certainly not yet. </p>\n\n<p>Cash + New Equity I think would be the way forward, but again, shares would need to available through the DRS and Brokerage platforms to trade. I think the process will take a good while longer to come into fruition. Thoughts from this great community will be much appreciated, thank you!!!</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]