[{"username": "tomgame519", "url": "https://www.reddit.com/r/ThePPShow/comments/17knzms/deelay_das/", "time": 1698766947.0, "subreddit": "r/ThePPShow", "title": "Deelay Das", "text": "<!-- SC_OFF --><div class=\"md\"><p>Get the fuck outtttta here with your deelay tactics!!!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "tomgame519", "url": "https://i.redd.it/08hrbqa16kxb1.gif", "time": 1698766855.0, "subreddit": "r/ThePPShow", "title": "Deelay Das", "text": "<!-- SC_OFF --><div class=\"md\"><p>GET THE FUCK OUTTTTTA HEREEEEEE!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/08hrbqa16kxb1.gif\"/></div>"},
{"username": "tomgame519", "url": "https://i.redd.it/c4qcjb39gnlb1.jpg", "time": 1693576435.0, "subreddit": "r/ThePPShow", "title": "MOASS n Back", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/c4qcjb39gnlb1.jpg\"/></div>"},
{"username": "tomgame519", "url": "https://www.reddit.com/r/ThePPShow/comments/14wueee/hargreaves_lansdown_reinstating_shares/", "time": 1689089221.0, "subreddit": "r/ThePPShow", "title": "Hargreaves Lansdown Reinstating Shares!", "text": "<!-- SC_OFF --><div class=\"md\"><p>I complained to HL when it was realised they gave out false information that caused many including myself to sell their entire portfolio of BBBY on HL. I of course rebought in IBKR but this was a big hit for us Brits having to sell our shares from the security and 100% tax-free benefits of holding them in an ISA.</p>\n\n<p>&#x200B;</p>\n\n<p>Well, I got a response today to my complaint and my tits are super jacked.</p>\n\n<p>- HL have agreed to reinstate all my 30k shares into the ISA</p>\n\n<p>- Further replies to the one posted below confirm this will be a reverse sale meaning I will get 30k shares at 10 cent (the price I sold at) not the current price of 30 cent!</p>\n\n<p>- Offered £100 compensation for the hassle</p>\n\n<p>&#x200B;</p>\n\n<p>I got around $2.9k for my shares back in May the day before we went OTC. HL will be buying these back and putting them into my account at a value of around $9.5k. This a great win, and I imagine there are 1000&#39;s of people who did the same based on HL&#39;s email. I urge everyone who did this to get in touch ASAP and demand their shares be reinstated (this could be a lot of shares they have to find!).</p>\n\n<p>Complaint response below:</p>\n\n<p>--------------------</p>\n\n<p>Dear Mr ****  </p>\n\n<p>I am writing further to the concerns you raised regarding your holding in Bed Bath and Beyond. My understanding is you are unhappy with the information provided to you regarding the recent delisting from the NASDAQ and feel you have been mis-informed.  </p>\n\n<p>At the outset, I am very sorry you have felt the need to raise this with us. I have conducted an in-depth investigation into this matter, and it is clear you have not experienced the level of service our clients rightfully expect from HL.  </p>\n\n<p>To briefly summarise what has happened, on 28 April 2023, we wrote to you and informed you that Bed Bath and Beyond (BBYQ) had filed for bankruptcy and planned to delist its shares from the NASDAQ stock exchange. In this message, we stated that as they were delisting, under HMRC rules, they would no longer be eligible to be held within a Stocks &amp; Shares ISA. As a result of this, we would be transferring them from the ISA to a Fund &amp; Share Account on 30 May.  </p>\n\n<p>As you may be aware, this information is now inaccurate. Following further investigation, an alternative trading facility was found via the Frankfurt Stock Exchange and due to this, the stock could then remain within the ISA wrapper.  </p>\n\n<p>I do feel it important to clarify that at the time we wrote to you on 29 April, our understanding was that as the stock was delisting from the NASDAQ, it would no longer be ISA eligible. Despite this, I feel HL should have investigated an alternative trading facility prior to writing out to clients and informing them their stock would be removed from the ISA wrapper. Clients would rightfully rely on this information and potentially take action following it.  </p>\n\n<p>Taking the above into consideration, I would like to offer to reverse the sale you made of your Bed Bath and Beyond share and reinstate your position within the Stocks &amp; Shares ISA if you would like me to. In addition, I would like to offer a compensation payment of £100 in recognition of the poor service you have experienced which I hope will work towards restoring your faith in our service. I will arrange for this £100 to be paid to your nominated bank account and please let me know by 11 August 2023 if you would like your holding reinstated.  </p>\n\n<p>I hope the above clarifies our position. If you think that I have misunderstood anything, or you would just find it helpful to go through my findings, please do not hesitate to contact me. I have attached a copy of our complaints procedures for your reference. This can be accessed via the link below.  </p>\n\n<p><a href=\"https://www.hl.co.uk/__data/assets/pdf_file/0006/16316187/Complaints-Handling-Procedure.pdf\">Complaints Handling Procedure</a>  </p>\n\n<p>However, if you are not satisfied with the outcome of your complaint and do not think that contacting me will help, you have the right to refer your complaint to the Financial Ombudsman Service, free of charge – but you must do so within six months of the date of this email. If you do not refer your complaint in time, the Ombudsman will not have our permission to consider your complaint and so will only be able to do so in very limited circumstances. For example, if the Ombudsman believes that the delay was as a result of exceptional circumstances. The following link gives you further information.  </p>\n\n<p><a href=\"http://www.financial-ombudsman.org.uk/publications/consumer-leaflet.htm\">http://www.financial-ombudsman.org.uk/publications/consumer-leaflet.htm</a>  </p>\n\n<p>Full details about the Financial Ombudsman Service are available at <a href=\"https://www.financial-ombudsman.org.uk/\">www.financial-ombudsman.org.uk</a>  </p>\n\n<p>Kind regards  </p>\n\n<p>**********<br/>\nClient Services Manager</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]