[{"username": "TribalOrgy", "url": "https://www.reddit.com/r/ThePPShow/comments/16lifyi/rant_thoughts_on_how_this_play_and_where_things/", "time": 1695001402.0, "subreddit": "r/ThePPShow", "title": "Rant: Thoughts on how this play and where things stand.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer:\nThis post will mainly be my opinion/rant and a huge ass TL;DR. </p>\n\n<p>Rant:\nI&#39;m going to level with all of you, and this will sound extremely shillish, but I feel it should be said. Especially since Merger Monday approaches us.</p>\n\n<p>When this stock hit almost 0.40 and was on its way to having 0.50 calls exercised, it was aggressively shot down. Some will say, &quot;Oh, that&#39;s because people sold off.&quot; While of course there were people who sold, the majority who entered the play before that happened didn&#39;t buy in to just sell off massively at just below 0.40. Someone panicked and artificially shot the price down to where it is now.</p>\n\n<p>Buying is turned off, and unless you are willing to try MooMoo, Ally, or some other shoddy broker to get a hold of more shares, there is no way to buy atm. All we can do as of right now is HODL what we have and pray we aren&#39;t getting fucked.</p>\n\n<p>The dockets have words like &quot;successful entity&quot; and acquisition talk, so it&#39;s in my opinion that there&#39;ll be a merger/acquisition. That is the new play.</p>\n\n<p>As for the squeeze play. I just don&#39;t see a squeeze like GME&#39;s magnitude or higher happening on a stock that no one can buy through conventional means. A squeeze isn&#39;t happening for a stock that isn&#39;t tradable. They&#39;ve since learned from GME. They are going to now try their hardest to get this thing to 0 (forcibly) and have people panic sell because everything they tried before failed. We&#39;ve seen the worst of it when it hit 0.04, and this plan to go get it to 0 will likely fail, but nothing is certain.</p>\n\n<p>Our only real hope for this play (think what you will) is a merger/acquisition. Do what you will with your investments, but please consider DRS&#39;ING the majority of your shares.</p>\n\n<p>I know the current DRS talk feels like pressure to get people to do something they don&#39;t want to do, but not doing anything right now to protect your investment in the best way possible is like sitting in a burning building hoping someone will save you. You all need to act now if you haven&#39;t. Start getting DRS shares going. This week will feel like hell, especially after seeing how the brokers deleted the buy button and are force selling people&#39;s positions. Hell, I wouldn&#39;t doubt that DRS requests will be denied in the future, too.</p>\n\n<p>TL;DR/Conclusion:</p>\n\n<p>I still believe in this play, and if you think holding in a broker will work out for you, then best of luck to you. We&#39;re here to support each other in this play, but we also need to have strong discussions surrounding the current state of things.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TribalOrgy", "url": "https://www.reddit.com/r/ThePPShow/comments/16kij6m/for_my_us_bobbies_how_are_we_buying_more_shares/", "time": 1694899537.0, "subreddit": "r/ThePPShow", "title": "For my US Bobbies, How are we buying more shares?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Would like to know if any US apes are doing any of the following because I would like some thoughts on this.</p>\n\n<p>I would like to buy more, but I feel Moo Moo will take a couple of days to receive my funds. It also seems like we&#39;re at the finish line.</p>\n\n<p><a href=\"https://www.reddit.com/poll/16kij6m\">View Poll</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]