[{"username": "TRYLX", "url": "https://i.redd.it/6b54sqq7oftb1.jpg", "time": 1696969042.0, "subreddit": "r/ThePPShow", "title": "Rip Dumbass", "text": "<!-- SC_OFF --><div class=\"md\"><p>Yes</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/6b54sqq7oftb1.jpg\"/></div>"},
{"username": "TRYLX", "url": "https://www.reddit.com/r/ThePPShow/comments/14abwb5/no_paywalltext_in_post_bed_bath_beyonds_top/", "time": 1686859555, "subreddit": "r/ThePPShow", "title": "No paywall/text in post - Bed Bath &amp; Beyond’s Top Lender Weighs Bidding for Assets in Bankruptey", "text": "Bed Bath & Beyond's top lender is preparing for a possible bid for at least some of the bankrupt home-goods retailer's assets.\n\nSixth Street Partners is planning to use more than $500 million of its debt in the company to bid, the lender's lawyer David Hillman said in a bankruptcy-court hearing Wednesday. Sixth Street plans to bid in the form of debt forgiveness in the event that other offers for Bed Bath & Bevond's assets come up less than what it considers satisfactory, according to people with knowledge of the matter.\n\nSixth Street, the retailer's biggest lender, could seek to acquire the Buybuy Baby chain or all of the retailer's assets out of\nbankruptcy, the people said.\n\nBed Bath & Beyond has been in talks with Go Global Retail, the owner of children's apparel retailer Janie and Jack, to acquire Buybuy Baby and keep the chain operating, The Wall Street Journal reported earlier this month.\n\nSixth Street replaced JPMorgan Chase, Bed Bath's former senior lender, and secured the rights as lead creditor to bid using its debt holdings, Hillman said at Wednesday's hearing. Top lenders have the right to take over the assets of a bankrupt borrower as a way to satisfy their claims. JPMorgan has been paid out in full and is expected to resign as the agent on a prebankruptcy loan by the end of the week, a lawyer representing the lender said in court.\n\nBinding bids for the company's assets are due Friday, and bidders will have another opportunity to compete in an auction scheduled for Wednesday. Bed Bath & Beyond embarked on a court-supervised sale process after filing for bankruptcy in April.\n\nEarlier this week, the company chose a $21.5 million offer from Overstock.com as the leading bid for Bed Bath & Beyond's intellectual property and other assets. The company can still entertain higher offers.\n\nSource: TBL", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "TRYLX", "url": "https://i.redd.it/dnikwk7xxg3b1.jpg", "time": 1685652516, "subreddit": "r/ThePPShow", "title": "Such a tease", "text": "", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dnikwk7xxg3b1.jpg\"/></div>"}]