[{"username": "ultimelon", "url": "https://www.reddit.com/r/ThePPShow/comments/171hvey/calm_your_tits_on_ast_positions_for_real/", "time": 1696612106.0, "subreddit": "r/ThePPShow", "title": "Calm your Tits on AST positions for real", "text": "<!-- SC_OFF --><div class=\"md\"><p>This is NOT a financial advise.</p>\n\n<p>I&#39;ve been seeing so many of you hand wringing and going ape shit about your DRS&#39;d positions at AST and your brokers. </p>\n\n<p>CALM your titties!!  For real.</p>\n\n<p>I don&#39;t post much but I will give you some advise, as a person who worked in Wall St.</p>\n\n<p>If you DRS&#39;d shares at AST and they were settled before their termination of service on 9/30 for BBBYQ, your shares at AST is NOT going anywhere until they get further instructions. </p>\n\n<p>They cannot just delete or move them. They don&#39;t just disappear (even if you don&#39;t see it on screen)</p>\n\n<p>You don&#39;t understand, to the transfer agents, the custody and registration of your shares are the upmost importance. This is not some cavalier matter. Why do you think they make it so hard to even register and verify?</p>\n\n<p>We are not just talking about a few hundred &quot;Investors.&quot; The numbers go into tens of thousands. </p>\n\n<p>Let me tell you guys a little story. </p>\n\n<p>My sibling (yes, for real) worked at BNY Transfer Agent Department before it got bought by ComputerShare. That&#39;s Bank of New York for you.  Bank of New York is one of the first banks created when the U.S. was created. It was created by Alexander Hamilton (yes, that Hamilton). BNY is one of the oldest and biggest custody banks in the U.S together with State Street. It&#39;s their bread and butter. They also have one of the biggest private banks in the country together with JPMorgan and Northern Trust. BNY merged with Mellon and now they bought another transfer agent - go figure. </p>\n\n<p>When my sibling was working there they had actual vault with real paper shares that were there for decades. And their computer system was very archaic, using system programs like COBOL and shit. Ergo why ComputerShare system is still so archaic.</p>\n\n<p>What I am trying to convey is that transfer and custody agent business is vastly different from your cowboys at brokerages. They are very stodgy for a reason. </p>\n\n<p>These custody and transfer agents DO NOT FUCK Around. The trust for the custody and registered  shares is MOST PARAMOUNT thing. Without it they are done as a business. My sibling saw some famous celebrity names for account holders with decades old positions. </p>\n\n<p>So, CALM down and wait for more news to come out.  Your shares are safe. They are all linked to your SS#. </p>\n\n<p>Lastly, you have to remember, the people you talk on the phone - ARE NOT THE ONES WHO KNOW ANYTHING - they are just front end people - this encompasses transfer agents and brokerage house. </p>\n\n<p>They are usually least trained and do not know the ins-and-outs of the intricacies of the share movements. They are just customer service people - unless you are talking to a higher manager or a licensed broker at brokerages who may know a little bit more than them. Even then, they do many not know anything.</p>\n\n<p>The people who know where you shares are at any one time and what is going to happen to them according to all the rules on the books (the whole situation) are the people in Operations. And you ain&#39;t going to talk to them because they cannot talk to you directly. That ain&#39;t going to happen. So, shit out of luck on that. </p>\n\n<p>Yes, I have an old friend at GS Prime brokerage who actually services those evil hedge funds but he ain&#39;t going to tell me jack even if I ask him about anything. I do believe GS will blow up with many of them when MOASS.</p>\n\n<p>Again, this is not financial advise.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]