[{"username": "Ultrabarrel", "url": "https://www.reddit.com/r/ThePPShow/comments/17bnoqd/melties_and_shills_are_basically_saying_sixth/", "time": 1697734185.0, "subreddit": "r/ThePPShow", "title": "Melties and shills are basically saying Sixth Street willingly decided to be bagholders for JPM🤣", "text": "<!-- SC_OFF --><div class=\"md\"><p>If you ever need any confirmation on how fucking dumb  shills are (and melties by association),  </p>\n\n<p>They are basically saying that Sixth Street wanted to own and control what was formally known as BBBYQ out of the kindness of their hearts. That for what ever reason, they were like:  </p>\n\n<p>&quot;Hey JP Morgan, we feel like being bag holders, were gonna take responsibility for all this debt, and just buy you guys straight out, and when this plan goes through, we are just going to keep BBBYQ, let it die, and not do anything with it. We are so dumb, here are all these tax deductions via net operating losses, the only thing left after selling IP and the literal nails in the walls, and just turn around and do nothing. we arent going to sell this to a spac, or another private entity, who would love to take this as a tax break and avoid the costs of an IPO, and were just going to be good little bag holders.&quot;  </p>\n\n<p>**This is basically what they are saying Sixth Street elected to do.**  </p>\n\n<p>Use your brains everyone. the shills are so fucking dumb, the only options they have is to basically push this scenario as the truth and try and sneakingly convince you that calling up your broker and relinquishing your shares for a tax write off is the best idea and the only thing you can do now.   </p>\n\n<p>Common shills, say it. **Iif we are out of the game, why would it be in sixth streets best interest to cancel shares, and not do anything with the literal remains of a husk of a company with no IP, leases, buildings, warehouses. zilch, nada, except net operating losses in its books with the IRS.**  </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Ultrabarrel", "url": "https://www.reddit.com/r/ThePPShow/comments/17axj5e/warning_under_no_circumstances_should_you_ask/", "time": 1697653287.0, "subreddit": "r/ThePPShow", "title": "⚠️ Warning ⚠️ under no circumstances should you ask your broker to remove the shares.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I mean I thought it was fucking obvious as fuck but I guess I’ll need to remind people because our pet shill that roams the Savanah’s has said this I think at least twice in the comments before. </p>\n\n<p>If your shares are canceled (or as the shill says “deleted and extinguished” notice their choice of words here) Why the fuck would I have to remove them from my brokerage account if they are gone? If my position is deleted(very well could be) then that means they are to be removed from my view, right?? If they are still there, there’s an obvious reason. It means there’s some form of value. Even if it’s 0, I still own a slice of what ever the fuck the company’s even being called now. </p>\n\n<p>And if they are snapped out of existence from my account, why is it that certain brokers are still saying they can see it from the backend even if they no longer exist? If they are in that state, why in the fuck would I ask them to remove it from my account? If they are gone and we lost I’d rather them be in their hidden state were I can’t see them normally but they still are somewhere and still mine, at the off hand chance they do something for us on a later date, like </p>\n\n<p><strong>take advantage of the fucking NOLs</strong> because it’s the only reasonable explanation to want to take over this entity after selling everything down to the fucking shelves and leases.</p>\n\n<p>We still have ndas that hide a lot of important tidbits to all of this, like who’s using sixth street as a proxy, why the dip lender would save the day from jpm only to end up here. No one does shit for free. </p>\n\n<p>And remember, glen the bitch yelled “this is a liquidation” when we know it’s a chapter 11 not 7. If this was a liquidation, we would be done by now and it woulda turned to a chapter 7 event. </p>\n\n<p><strong>Under no fucking circumstances do any of yall fucking call them to remove your shares from your accounts, you hear me you fucking regards?!?!?!?</strong></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Ultrabarrel", "url": "https://www.reddit.com/r/ThePPShow/comments/170kfnc/why_i_think_no_notice_from_ast_is_probably_a_good/", "time": 1696518635.0, "subreddit": "r/ThePPShow", "title": "Why I think no notice from AST is probably a good thing.", "text": "<!-- SC_OFF --><div class=\"md\"><p>We already heard from computershare before that broker dealers have made things all little annoying for them in the past and Pultes pointed out that these whack job ceos and bad guys are basically willing to commit atrocities if given the opportunity. </p>\n\n<p>But who’s the one entity that wouldn’t fuck you?</p>\n\n<p>The transfer agent. </p>\n\n<p>I’m pretty sure if we were getting actually wiped out that the transfer agent would have to effectively give us notice the same way the brokers have been. It wouldn’t be that out of the ordinary to “accidentally receive the wrong information” due to “uncertainty” and or “mistakes”. </p>\n\n<p>But if we truly lost our shares and it’s not being transferred to someone else, I’m sure <em>someone</em> has to eventually say something about what happens to our rightfully owned shares. </p>\n\n<p>**Think ape, think!</p>\n\n<p>Nothings left of this entity. The entity changed names. Stock is cancelled. But the position still exist even if deemed worthless. </p>\n\n<p>Worthless does not mean non existent. My property is somewhere in this machine we call the equities/securities market.**</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]