[{"username": "unrulyme", "url": "https://www.reddit.com/r/ThePPShow/comments/16x9lwn/where_now/", "time": 1696186902.0, "subreddit": "r/ThePPShow", "title": "Where now?", "text": "<!-- SC_OFF --><div class=\"md\"><p>We won. We don’t know how much, but we know this battle has been won. We were focused, disciplined and most important we had each other backs as the shills ruthlessly tried every psych-op tricks in the booms.</p>\n\n<p>We are in the larger war for a variety of reasons. We all have different interests. From “show me the money” to “no cell, no sell.” We are all independent investors. And our collective interests and skills are advancing a revolution that will be felt for generations.</p>\n\n<p>I invest in GME routinely, and I’m waiting for the greater unfolding that we are witnessing. I will continue to deploy my capital to advance my purposes and aims, as all independent investors do. I will continue to study and follow where I see fit. What social organism we might perceive as an “organized movement” is better described as emergent behavior.</p>\n\n<p>I love the “what color lambo” posts because it’s fun. And there’s more to life than material wealth. My wealth, even if we hadn’t won, will be deployed in ways that I believe will benefit the next generations. I know that some others are aligned in a similar way.</p>\n\n<p>I joined the GME battle because I thought it was  a quick buck. It wasn’t a quick buck for me. It has however paid off beyond my wildest expectations, and I haven’t made any money yet. As I held, I studied and I learned to tell the difference between a Shill and an Ape. I learned to appreciate and think with evidence. So far I’ve been 100% right as I haven’t sold and only have accumulated and DRS’d the stocks I like. However, what came into view was a larger War, and a larger Revolution. It has not been televised. And I no longer expect it to be. I expect the psych-ops to continue. I do not expect the government to show up until the war turns. </p>\n\n<p>I have learned to identify my battle mates by the quality of their thinking. And I know which flags I follow, which ones I avoid and which ones are untrustworthy or the Enemy itself. I also have navigated echo-chambers. Those I find the hardest to identify and dissolve. </p>\n\n<p>I have more arrows in my quiver, more energy to fight, more and growing capital to deploy. I see a narrow slice of the battle field. I have only begun to awaken to the larger reality. Here is my question: where should I look next? What should I pay attention to next? </p>\n\n<p>I am not seeking financial advice, so please do not give it. I do not trust you all with my financial future; I am trusting you with my life, my wealth and the well-being of future generations. These are different goals.</p>\n\n<p>With gratitude to the Generals in this battle, and in this war.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]