[{"username": "Usual_Cat_5563", "url": "/r/BedBathandBeyond/comments/13r38zk/dc_shutdown_dates/", "time": 1685183245.0, "subreddit": "r/ThePPShow", "title": "DC Shutdown Dates?", "text": null, "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": ""},
{"username": "Usual_Cat_5563", "url": "https://i.redd.it/kgjku55x1xya1.jpg", "time": 1683668180.0, "subreddit": "r/ThePPShow", "title": "Highest value lending stock apparently!", "text": "<!-- SC_OFF --><div class=\"md\"><p>HODL and DRS! Thanks for the notice but no thanks! </p>\n\n<p>The shorts need our shares! We’ve have something they want!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/kgjku55x1xya1.jpg\"/></div>"},
{"username": "Usual_Cat_5563", "url": "https://i.redd.it/m443tlf9itxa1.jpg", "time": 1683189400.0, "subreddit": "r/ThePPShow", "title": "Degiro asking to cover the deficit on Bbby shares before transfering to IBKR…..", "text": "<!-- SC_OFF --><div class=\"md\"><p>Any of you other apes had this?</p>\n\n<p>Related to Bobby (Bbby) position; \nWondering if it’s because Degiro doesn’t have and can’t locate the shares. I’m waiting Degiros reply… will post an update when they respond.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/m443tlf9itxa1.jpg\"/></div>"},
{"username": "Usual_Cat_5563", "url": "https://www.reddit.com/r/ThePPShow/comments/133mky0/wes_christian_v_naked_short_selling_this_wont_get/", "time": 1682853543.0, "subreddit": "r/ThePPShow", "title": "Wes Christian v Naked Short Selling - This won’t get old!", "text": "<!-- SC_OFF --><div class=\"md\"><p>These videos hit the nail on the head, naked short selling is theft. Are BBBY also employing some of these strategy’s??</p>\n\n<p>At first I thought the first video was inferring BBBY but think it’s MMTLP. </p>\n\n<p>The second video is a great “round table” meeting between CEOs.</p>\n\n<p>Great discussion around short selling and what companies can do towards defending against it, note that warrants and selling shares to a private company all feature;</p>\n\n<p><a href=\"https://youtu.be/9vp2ZhAVi-A\">https://youtu.be/9vp2ZhAVi-A</a></p>\n\n<p><a href=\"https://www.youtube.com/live/Ndi7-DydLcc?feature=share\">https://www.youtube.com/live/Ndi7-DydLcc?feature=share</a></p>\n\n<p>After you watch them, I’m sure there will be a few people wanting to get their hands on the analytic software and starting a class action!</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"nsfw\"/></div>"},
{"username": "Usual_Cat_5563", "url": "https://www.reddit.com/r/ThePPShow/comments/12vinue/forecasting_q4_earnings_im_not_buying_bankruptcy/", "time": 1682196275.0, "subreddit": "r/ThePPShow", "title": "Forecasting Q4 Earnings… I’m not Buying Bankruptcy!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Logically forecasting the Q4 earnings report by looking at Q3 results and a number of business markers points me to near break even for Q4 with positive Q1 results. If correct the share price must jump on the Q4 earnings release. 🤞🚀 Do your own DD and comment if you think below is right or wrong!</p>\n\n<p>Starting with the Q3 actuals..</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/news-releases/news-release-details/bed-bath-beyond-inc-reports-fiscal-2022-third-quarter-results\">https://bedbathandbeyond.gcs-web.com/news-releases/news-release-details/bed-bath-beyond-inc-reports-fiscal-2022-third-quarter-results</a></p>\n\n<p>Q3 adjusted EBITDA was minus $225m which included $100.7m for store write offs, something we shouldn’t see in Q4 (although there could be some adjustments in the P&amp;L for sale of fixed assets related to the store closures). Assuming the $100.7m is excluded reducing the loss to -$114m.\nFurther more, the Q3 report states that Bbby is on track to make $250m SGA savings for H2 and we don’t know how its weighted. If, and I really don’t know, it’s weighted $100m saving in Q3 &amp; $150m in Q4 (as it’s linked to store closures) then Bbby can expect to reduce the loss by another $50m bringing it to -$64m (although that could be conservative). Additionally, Bbby recognized further  supply chain savings of $80-$100m (presumably annualized). If realized we can expect to reduce the $64m by $20m ($80/4 quarters) leaving a net loss of $44m for Q4 if sales were the same as Q3.</p>\n\n<p>Sales in Q3 were $1.259BN and it was stated that sales were down due to stock “Sales performance driven by lower in-stock position of approximately 70% and decrease in customer traffic” (Bbby). This creates an expectation that if stock is replenished then growth in sales is likely in Q4. Additionally we should not overlook the winding down of Bbby’s own brands (Bbby recognized that their own brands led to revenue declines and set out a plan to increase national brand stock). We have plenty of releases from Bbby highlighting all the new national brand partnerships indicating they are implementing their business strategy as planned (although this has gone unnoticed by mainstream).</p>\n\n<p>Regarding store closures, the target was 150 by the end of 2022 however I’m not able to grasp how many stores actually closed given the target increased throughout the period. More closures would further increase the  SG&amp;A savings above.</p>\n\n<p>The preliminary Q4 results;</p>\n\n<p><a href=\"https://bedbathandbeyond.gcs-web.com/news-releases/news-release-details/bed-bath-beyond-inc-enters-committed-equity-facility-additional\">https://bedbathandbeyond.gcs-web.com/news-releases/news-release-details/bed-bath-beyond-inc-enters-committed-equity-facility-additional</a></p>\n\n<p>Bbby states revenue is $1.2 BN which is very close to Q3. (Q3 = $1.265BN) but is not final and we don’t know if it includes newly opened stores or part period results from closed stores given the nature of it being a like for like in the preliminary announcement. \nWe also don’t have costs and this is creating ambiguity (especially given the suggested QoQ savings above).</p>\n\n<p>Some business indicators highlight sales could drive up in Q4 or Q1. These include the rewards scheme &amp; size of acquisition offers, lifetime customer value and more stores of Bbby. \n20m of loyalty programs sold is an increase of 4m (sales of $120m Q4 reduction from $180m Q3) and the customer offers appear aggressive however I expect the lifetime value of each customer to be high and the company is looking to entice back old customers (previous earnings reports boasted over 12BN of sales and most certainly a significantly higher customer base).\nTin foil as Ryan Cohen talks about lifetime customer value around 9mins into the following video. Not saying he is buying Bbby but the acquisition strategy is consistent with his approach to this type of business.</p>\n\n<p><a href=\"https://youtu.be/uN2Dw8AOdMk\">https://youtu.be/uN2Dw8AOdMk</a></p>\n\n<p>Working Capital has been a hot topic leading to a lot of bankruptcy noise. Based on previous filings we know an additional chunk of the loan was paid off and additional working capital was created with the additional stock consignment agreement over $100m. This is positive but I expect additional working capital has been created with the supplier savings, SG&amp;A savings and potential sales increases in Q1. The biggest problem here is that the earnings report is concerned with the Q4 period end dates whereas working capital is concerned with the most recent management accounts (March 2023). This makes it difficult to know if cash is a problem given the time delays in reporting.\nThe regular postings on Reddit of new stores which are “coming soon” will probably be financed from working capital unless additional equity has been provided. This is also another tell tale sign that working capital is good and bankruptcy is off the table.</p>\n\n<p>When it comes to adding 1BN equity into Bbby my gut feel is this is just to get cheap, interest free capital into the business to help with gearing and scale up Buy Buy Baby as returns on this division are like double digit.</p>\n\n<p>Bonus material and something to add about the closing stores; The book “Good strategy, bad strategy” highlights the positive effect of closing stores. The Dentons example is on page 145 and talks about how 13 stores wipe out the gains of 15 stores;</p>\n\n<p><a href=\"http://dspace.vnbrims.org:13000/jspui/bitstream/123456789/4584/1/Good%20Strategy_Bad%20Strategy.pdf\">http://dspace.vnbrims.org:13000/jspui/bitstream/123456789/4584/1/Good%20Strategy_Bad%20Strategy.pdf</a></p>\n\n<p>Bbby, are performing the same exercise on a larger scale although we don’t know what the cost savings are as they’ve not been highlighted</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": null, "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Usual_Cat_5563", "url": "https://i.redd.it/vov93365kbva1.jpg", "time": 1682100413.0, "subreddit": "r/ThePPShow", "title": "Fractional share sold by IBKR.. Does it mean anything?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Strange.. IBKR closed out my one and only fractional share leaving only whole shares in the account earlier today. Anyone else had this?</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/vov93365kbva1.jpg\"/></div>"}]