[{"username": "valrian1895", "url": "https://www.reddit.com/r/ThePPShow/comments/17erncs/you_jack_my_tits_i_jack_yours/", "time": 1698086446.0, "subreddit": "r/ThePPShow", "title": "You jack my tits, I jack yours", "text": "<!-- SC_OFF --><div class=\"md\"><p>…at least a little. </p>\n\n<p>This is one of those “shower thoughts” folx post- which by the way, when we say shower do we actually definitely mean 🚽? Because that’s my main reading time. When I peepee is when I pp. </p>\n\n<p>Whatever your fancy is- I really appreciate that so many of y’all take the time to write the revelations you have about this play, whether big or small, especially now. Shills, haters, and impatient pps might say, “Enough with the shit posts and black tar pre smoked tin foil!” But I say, “Nay! Bring it on Brethren Apes!” We (or at least I) still need the encouragement, the hype, the hopium and copium, and most of all, to know that there is still a real community around this insane play, people just like me who aren’t crazy, who are intelligent <em>meh</em> (I might eat crayons but at least I go for that good good Crayola), who have the cojones to take a risk to change our lives, and the hearts to genuinely want the system of financial injustice to change. Whether hero or zero, we did it, something that most people never do in their lives- take an actual risk to bring about actual change. My proverbial hat is off to you, mighty people, dreamers of dreams, music makers, world shakers. Don’t let them get you down! Damn the Man, and Eat the Rich! </p>\n\n<p>I just want to say thank you. Thanks for keeping the posts coming, and keeping my spirits up. </p>\n\n<p>Now onto the little nip stroke I promised: As I was having my pp time 🚽 , I thought to myself, that if this play is truly over, liability is essentially gone right? I think one reason we see our bud Pulte getting more brazen recently is because of this. Go ahead and try to take the man to court for influencing a stock that is worthless, cannot be traded, has disappeared into thin air. Right? I mean if it’s done, it’s done. \nIn this past year many an ape has come on the sub to say, “If RC isn’t in this play, he could just say so. He could just put out a little tweet tweet, like the noble Larry Cheng did (and others) to clearly state they have nothing to do with BBBY,” citing this as hardcore proof the guy was still with us. I always saw this particular argument as a pacifier for struggling apes, understanding that hey- we all need something to suck on from time to time to help us feel better; hell that’s why we have PP! But in reality, if I was in the middle of a super expensive lawsuit for pumping and dumping I would err on the side of just not saying anything at all. To me it always made most sense for RC to not say anything either way. </p>\n\n<p>…until now…</p>\n\n<p>What about now huh? It’s over now, right? Shills please step up to the mic to give us your full list of all the evidence that this play has been over for weeks! So if it’s over, I believe that gives more leeway for RC to speak up and signal that he wasn’t a part of it. I believe in RC. Yeah he’s a businessman who does what he does for the money. No shit. That’s what makes him great- no pretense that he’s not about the paper. But for me there is a mountain of evidence that he’s also a person of character and value, someone who sees the value of the customer. And because of that, I’m happy waiting to hear from the man one way or another. If the play is truly over, there should be less and less liability to talk about Bobby. And if that’s the case, it makes sense that at some point RC would likely let his followers know that he was out last fall and was never back in. When I hear it from the horse’s mouth, I’ll think about cashing in my invisible chips for a tax loss. Until then, the space suit stays on. </p>\n\n<p>Peace, provision, and much love to all of you today, fellow degens. </p>\n\n<p>TLDR: Thanks for being apeshit apes. Never change and keep it coming. You light up my life. You give me hope to carry on. \nBut also- RC might not have been able to deny involvement before, but if shares are truly worthless, if it’s all over as the little shilly-beans like to say, he most certainly could now. And yet….he doesn’t. Maybe something, maybe nothing, but it keeps my tits on point.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "valrian1895", "url": "https://www.reddit.com/r/ThePPShow/comments/14vdw68/wen_moon/", "time": 1688946766.0, "subreddit": "r/ThePPShow", "title": "Wen moon?", "text": "<!-- SC_OFF --><div class=\"md\"><p>So, am I right in my reading of court schedules? There are no more dates listed at all except regarding the sale and auction of leases. Right?</p>\n\n<p>So if that’s the case, are there any leads or ideas at all about a round a bout date of when shareholders will know what’s happening with our beloved Bobby? </p>\n\n<p>Like we know that the Bed Bath IP was sold to Overstock. We know that, as of now, the Baby IP is being sold to Dream On. And there are dates for the leases getting sold. </p>\n\n<p>But what about everything else? When is it supposed to be “sold”(spun off, carved out, merged, acquired, reversed reversed, horizontal tangoed)?</p>\n\n<p>Are there any dates or time periods that are mandatory for this bankruptcy case to be closed? It can’t go on forever right? </p>\n\n<p>I know we say “no dates, no hype dates.” I’m just wondering if there are any rules, laws, precedent, requirements, etc for how long a company can be in Ch. 11. Or anything BBBY specific where maybe some docket somewhere has said that they will be finished with everything by a certain time?</p>\n\n<p>And don’t send me over to the daily! Nobody ever actually answers any damn questions on the daily. </p>\n\n<p>I’m looking for the wrinkled apes to give us smooth apes an idea of how long we’ve got to go. We get rowdy when we’re made to wait!</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "valrian1895", "url": "https://www.reddit.com/r/ThePPShow/comments/14taxdd/hodl/", "time": 1688744815.0, "subreddit": "r/ThePPShow", "title": "HODL", "text": "<!-- SC_OFF --><div class=\"md\"><p>We’ve essentially got two interpretations of the docket released last night: </p>\n\n<ol>\n<li><p>There were no going concern bids for all of Baby over $15 million (really? 🤔) so Dream On wins the Baby IP and the auction is canceled. </p></li>\n<li><p>There was a going concern bid so high and so good, or at least so satisfactory to the consultation committee, that they don’t even need to have an auction to see if there will be one better but the buyer doesn’t need or want the IP, so it goes to Dream On. </p></li>\n</ol>\n\n<p>To be honest, I obviously believe and hope for the second because that’s what makes most sense to me, but I am not naive enough to insist that the first isn’t a possibility. It absolutely is. </p>\n\n<p>So what?</p>\n\n<p>The bottom line is this: Until an official announcement is made, we just don’t know for sure. Just like no one can say beyond a shadow of a doubt that this entire time they have known FOR SURE what was going to happen. Nobody has and nobody does except the parties actually involved (shout out to my girls Sue and Holly!). Most of us have been hodling out of sheer confusion, great hope, and a diligent following of the brilliant DD put out by people on here who really know their stuff. </p>\n\n<p>So why would I give up now that I’m in the exact same position I have been this whole time? I didn’t know what would happen then, and I don’t know what will happen now. That’s the truth of it. But I keep following the logic, the research, the hope, and this community, because without great risk there is no reward. </p>\n\n<p>All this to say, Fellow Apes and Apettes, now is the time to KEEP HODLING because it ain’t over til it’s over. </p>\n\n<p>Don’t let the fud deceive you, pressure you, manipulate you, or terrorize you into thinking it’s the end before it’s the end. When the announcement comes, we will know. </p>\n\n<p>Until then, we are Apes Together Strong, and a little music can help you get through the passing moments of doubt:</p>\n\n<p><a href=\"https://open.spotify.com/playlist/3mqnVIgj7brC8nMulAzmt8?si=grw9EsZoRUyLaU8unbUqjw\">https://open.spotify.com/playlist/3mqnVIgj7brC8nMulAzmt8?si=grw9EsZoRUyLaU8unbUqjw</a></p>\n\n<p>HODL.</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "valrian1895", "url": "https://i.redd.it/ornfuhy0k66b1.jpg", "time": 1686901454, "subreddit": "r/ThePPShow", "title": "Finally got some FANTASTIC insight about timing from two masters u/Real_Eyezz and u/Whoopass2rb. Check out all the comments below if you too have been wondering about how long this all might take.", "text": "", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/ornfuhy0k66b1.jpg\"/></div>"},
{"username": "valrian1895", "url": "https://www.reddit.com/r/ThePPShow/comments/149sa4g/timing_question/", "time": 1686802127.0, "subreddit": "r/ThePPShow", "title": "Timing Question", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I’m loving all the DD and wrinkle apes on the show. It reinforces to me over and over that this play is a good play and well worth the risk. </p>\n\n<p>Of course the thing people rarely address that we all often think about is the timing, or in smooth ape talk:</p>\n\n<p>wen moon?</p>\n\n<p>I know we try not to anchor dates just like we don’t anchor price, but I had a thought and a question:</p>\n\n<p>Theoretically (and IF there were magically no more deadlines moving forward), the final bids are supposed to be in by this Friday June 16th. And the auction is supposed to take place Wednesday June 21st IF NEEDED. So, doesn’t that mean we would need to know at least that there is a deal and a buyer and that it’s all been decided and agreed upon before June 21st in order to decide whether an auction is even needed?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "valrian1895", "url": "https://i.redd.it/gd4lf3kzj06b1.jpg", "time": 1686761513.0, "subreddit": "r/ThePPShow", "title": "Court Update", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello Fellow Apes!</p>\n\n<p>I was hoping to do a very smooth live update of the hearing today like the last one but sadly I’ve been on the road this morning and apparently there’s something about not texting and driving? 🤔 </p>\n\n<p>But I’ve been on the call for the last hour and a half, and my biggest take away so far is that indeed the bond holders big mad! Here is my smooth ape summary so far of this major point:</p>\n\n<p>Mr. Glenn represents the bond holders. Mr. Glenn grumpy!!! BBBY didn’t share all their secrets with Mr. Glenn and he feels left out even though they told him everything they were supposed to and could. BBBY says- we made a deal with you bond holders- you can have ten days to challenge the deal which is a fair and square deal. Mr. Glenn say TEN DAYS NO FAIR! TEN DAYS TOO HARD! I A SLOW READER AND CAN’T READ THAT MUCH IN TEN DAYS! I NEED 30 DAYS!\nBBBY says- dude stop crying. You should have done your job! Do your job. \nBest we can do- we’ll tell you some of our secrets as long as you promise to not tell anyone else, but you still can’t have more than ten days to get it together because we’ve got shit to do. \nJudge: Yeah. Sounds about right bro. \nMr. Glenn: 😫 😭 </p>\n\n<p>Here is my sketch of Mr. Glenn’s appearance in court today:</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/gd4lf3kzj06b1.jpg\"/></div>"},
{"username": "valrian1895", "url": "https://www.reddit.com/r/ThePPShow/comments/13wuuof/live_updates_from_todays_court_session/", "time": 1685559745.0, "subreddit": "r/ThePPShow", "title": "Live updates from today’s court session", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hey Apes!</p>\n\n<p>I’m on the call. </p>\n\n<p>So far:</p>\n\n<p>Judge has hilariously struggled with zoom</p>\n\n<p>BBBY rep and debtors have made appearances</p>\n\n<p>Judge has asked for an update from BBBY rep</p>\n\n<p>She said they are working with many interested parties (buyers?) in preparation for stalking horse tomorrow, but might want to ask for an extension</p>\n\n<p>Judge straight up asks- Does that mean you do NOT have a stalking horse bidder?</p>\n\n<p>BBBY rep (Guyer) repeats her same vague BS answer- many interested parties but they want to “get the most value” so “might” ask more time</p>\n\n<p>Will keep updating in the comments- </p>\n\n<p>Just be aware- these are VERY smooth brained writings so I don’t know what I’m talking about. I’m trying to translate legalese to ape 🦧</p>\n\n<p>Edited to add: If you want to read through the (no longer) live ape updates (apedates?) I recommend sorting the comments from old to new. </p>\n\n<p>LFG!</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "valrian1895", "url": "https://www.reddit.com/r/ThePPShow/comments/13l7xuy/silky_smooth_brain_seeking_sexy_wrinkles/", "time": 1684437142.0, "subreddit": "r/ThePPShow", "title": "Silky Smooth Brain Seeking Sexy Wrinkles", "text": "<!-- SC_OFF --><div class=\"md\"><p>Okay, so I&#39;m confused. What are we waiting for again? How is this going to make money?</p>\n\n<p>Based on what I&#39;ve read on the subs, BBBY will never exist again, right? Like, if Bed Bath is bought out, that ticker won&#39;t come back, but instead a new one will be issued for whatever the new company is, right? And if Bed Bath does a turn around, again, BBBY will cease to exist, BBBYQ shares will be worthless and a new ticker will be issued. Is all of that right so far?</p>\n\n<p>If so, then, just to be clear, is what we are all waiting on that hopefully a magnanimous buyer will buy the company and give us OG shareholders a piece of the pie based on what they can afford? And that&#39;s how we&#39;ll make money?</p>\n\n<p>And/or we are waiting for a squeeze because we&#39;ve been so severely shorted? But, this is where I am really confused: When exactly will shorts have to actually cover their positions? Obviously if there was really a bk or we went to zero, they never have to cover/close, but holding the belief that that will not happen- when? When will they have to cover? And why would this create a squeeze? Why would there be FOMO that would make our stock increase? Like if Monday comes and RC or China or Pulte or whoever makes a bid, and it&#39;s amazing, and people lose their minds and want in- well, why would they buy BBBYQ if that ticker is just going to be obsolete? Wouldn&#39;t they just wait to buy whatever the new ticker will be? And if they don&#39;t buy BBBYQ- how will there be a pump that would force shorts to close or gamma ramps or any of those potential squeezes?</p>\n\n<p>I really want shorts to be fucked, but maybe I&#39;ve just consumed too much info and got it all mixed up, but I am officially not understand how exactly they will be fucked if our ticker will be discontinued and obsolete even if they best news we&#39;re all hoping for comes to fruition.</p>\n\n<p>Wrinkles- PLEASE HELP!</p>\n\n<p>p.s. The info I&#39;m getting about the BBBYQ ticker being discontinued is from this thread: <a href=\"https://www.reddit.com/r/BBBY/comments/13byeu6/will%5C_bbby%5C_get%5C_relisted%5C_when%5C_we%5C_climb%5C_back%5C_over%5C_1/?utm%5C_source=share&amp;utm%5C_medium=web2x&amp;context=3\">https://www.reddit.com/r/BBBY/comments/13byeu6/will\\_bbby\\_get\\_relisted\\_when\\_we\\_climb\\_back\\_over\\_1/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3</a></p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]