[{"username": "Vavrakadabra", "url": "https://i.redd.it/i6u25bk2sszb1.jpeg", "time": 1699742816.0, "subreddit": "r/ThePPShow", "title": "Here's an example of a bankrupt company that is still in my account.", "text": "<!-- SC_OFF --><div class=\"md\"><p>As you can see they haven&#39;t removed VGFCQ from my account. My BBBYQ shares were there two days ago and are now nowhere to be seen. Having seen this, I know something is up, I didn&#39;t force close my position, so if it was actually bankrupt and not in reorganization, the shares would still be there. </p>\n\n<p>We are close, very very close.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/i6u25bk2sszb1.jpeg\"/></div>"},
{"username": "Vavrakadabra", "url": "https://www.reddit.com/r/ThePPShow/comments/14rw6q6/741_backwards_147_july_14th_bastille_day/", "time": 1688613105.0, "subreddit": "r/ThePPShow", "title": "741 backwards 147 (July 14th) Bastille Day.", "text": "<!-- SC_OFF --><div class=\"md\"><p>The French National Day is the anniversary of the Storming of the Bastille on 14 July 1789, a major event of the French Revolution, as well as the Fête de la Fédération that celebrated the unity of the French people on 14 July 1790. Celebrations are held throughout France. One that has been reported as &quot;the oldest and largest military parade in Europe is held on 14 July on the Champs-Élysées in Paris in front of the President of the Republic, along with other French officials and foreign guests.</p>\n\n<p>History</p>\n\n<p>In 1789, tensions rose in France between reformist and conservative factions as the country struggled to resolve an economic crisis. In May, the Estates General legislative assembly was revived, but members of the Third Estate broke ranks, declaring themselves to be the National Assembly of the country, and on 20 June, vowed to write a constitution for the kingdom.</p>\n\n<p>On 11 July Jacques Necker, the finance minister of Louis XVI, who was sympathetic to the Third Estate, was dismissed by the King, provoking an angry reaction among Parisians. Crowds formed, fearful of an attack by the royal army or by foreign regiments of mercenaries in the King&#39;s service, and seeking to arm the general populace. Early on 14 July one crowd besieged the Hôtel des Invalides for firearms, muskets, and cannons, stored in its cellars. That same day, another crowd stormed the Bastille, a fortress-prison in Paris that had historically held people jailed on the basis of lettres de cachet (literally &quot;signet letters), arbitrary royal indictments that could not be appealed and did not indicate the reason for the imprisonment, and was believed to hold a cache of ammunition and gunpowder. As it happened, at the time of the attack, the Bastille held only seven inmates, none of great political significance.</p>\n\n<p>The crowd was eventually reinforced by mutinous Régiment des Gardes Françaises (&quot;French Guards&quot;), whose usual role was to protect public buildings. They proved a fair match for the fort&#39;s defenders, and Governor de Launay, the commander of the Bastille, capitulated and opened the gates to avoid a mutual massacre. According to the official documents, about 200 attackers and just one defender died before the capitulation. However, possibly because of a misunderstanding, fighting resumed. In this second round of fighting, de Launay and seven other defenders were killed, as was Jacques de Flesselles, the prévôt des marchands (&quot;provost of the merchants&quot;), the elected head of the city&#39;s guilds, who under the feudal monarchy also had the competences of a present-day mayor.</p>\n\n<p>Shortly after the storming of the Bastille, late in the evening of 4 August, after a very stormy session of the Assemblée constituante, feudalism was abolished. On 26 August, the Declaration of the Rights of Man and of the Citizen (Déclaration des Droits de l&#39;Homme et du Citoyen) was proclaimed. </p>\n\n<p>One day the 741 prophecy will come to fruition.</p>\n\n<p>Hype always.</p>\n\n<p>To the moon and beyond Uranus.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Vavrakadabra", "url": "https://twitter.com/pulte/status/1659704073518718977?t=ez8jAdzkRMRAozFcvrvZIg&amp;s=19", "time": 1684539897.0, "subreddit": "r/ThePPShow", "title": "Pulte is on a mission", "text": null, "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/esGlJyRKHcfOk1xqT4ZywDzvyTdfX2ARHGdJ4PUso8Q.jpg\"/></div>"}]