[{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/16dpzgc/docket_2134_objection_by_neelay_das/", "time": 1694216049.0, "subreddit": "r/ThePPShow", "title": "Docket 2134 Objection by NEELAY DAS", "text": "<!-- SC_OFF --><div class=\"md\"><p>It is interesting that under Exhibit A of docket 2134, the objection by NEELAY DAS is not listed at all.  All other objections are shown there.</p>\n\n<p>No judge would accept the plan as is since it&#39;s obviously not fair for all stakeholders (ie: class 9 shareholders get nothing currently).</p>\n\n<p>This strongly suggests that a new docket with ammended plan will be revealed before the confirmation hearing on Sept 12 showing that shareholders will be made whole; thus, invalidating  NEELAY DAS&#39;s objection; so it won&#39;t be relevant in court.</p>\n\n<p>Otherwise, there is no other explanation why  NEELAY DAS&#39;s objection is not listed there with status as Outstanding</p>\n\n<p>Thoughts?</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/15bemkj/forcing_shorts_to_close_via_private_shares/", "time": 1690494594.0, "subreddit": "r/ThePPShow", "title": "Forcing shorts to close via private shares conversion??? (2nd repost)", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/15bemkj/forcing_shorts_to_close_via_private_shares/", "time": 1690494594, "subreddit": "r/ThePPShow", "title": "Forcing shorts to close via private shares conversion??? (2nd repost)", "text": "***Reposting due to post got removed by mods for no reason again!!!*** \n\n***MODS: please point me to a post saying that MOASS will be triggered by private shares conversion and I'll stop reposting!!!***\n\nA reverse merger will convert existing BBBY shares to new shares right away; and the shorts will just get converted along the way; and the can of worms will get kicked down as usual.\n\nWhat if a private company acquiring BBBY through an LBO (to avoid board of directors & share holders vote) and issues private shares conversion? This will force all shorts to close since it's a private company and its shares are not traded publicly.\n\nOf course, a company can only remain private if it has less than 500 shareholders on record and $10mil in assets. The BBBY shares conversion will make the private company to undergo a forced IPO; but that will take some time to happen while all the current (naked) shorts must close.\n\nThe recent dockets showed the winding down of the store leases; they are most likely being transferred to the acquiring company (TEDDY Holdings LLC). It seems like RC & affiliates are forcing all shorts to close.\n\nMOASS is imminent with saying farewell to BBBY and welcoming of TEDDY!", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/15be8e0/forcing_shorts_to_close_repost/", "time": 1690493637, "subreddit": "r/ThePPShow", "title": "Forcing shorts to close??? (repost)", "text": "***Reposting due to post got removed by mods for no reason again!!!***\n\nA reversed merger will convert existing BBBY shares to new shares right away; and the shorts will just get converted along the way; and the can of worms will get kicked down as usual.\n\nWhat if a private company acquiring BBBY through an LBO (to avoid board of directors & share holders vote) and issues private shares conversion? This will force all shorts to close since it's a private company and its shares are not traded publicly.\n\nOf course, a company can only remain private if it has less than 500 shareholders on record and $10mil in assets. The BBBY shares conversion will make the private company to undergo a forced IPO; but that will take some time to happen while all the current (naked) shorts must close.\n\nThe recent dockets showed the winding down of the store leases; they are most likely being transferred to the acquiring company (TEDDY Holdings LLC). It seems like RC & affiliates are forcing all shorts to close.\n\nMOASS is imminent with saying farewell to BBBY and welcoming of TEDDY!\n\n&#x200B;", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/15be8e0/forcing_shorts_to_close_repost/", "time": 1690493637.0, "subreddit": "r/ThePPShow", "title": "Forcing shorts to close??? (repost)", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/15bdd6c/forcing_shorts_to_close/", "time": 1690491625, "subreddit": "r/ThePPShow", "title": "Forcing shorts to close???", "text": "A reversed merger will convert existing BBBY shares to new shares right away; and the shorts will just get converted along the way; and the canned of worms will get kicked down as usual.\n\nWhat if a private company acquiring BBBY through an LBO (to avoid board of directors & share holders vote) and issues private shares conversion?  This will force all shorts to close since it's a private company and its shares are not traded publicly.\n\nOf course, a company can only remain private if it has less than 500 shareholders on record and $10mil in assets.   The BBBY shares conversion will make the private company to undergo a forced IPO; but that will take some time to happen while all the current (naked) shorts must close.\n\nThe recent dockets showed the winding down of the store leases; they are most likely being transferred to the acquiring company (TEDDY Holdings LLC).  It seems like RC & affiliates are forcing all shorts to close.\n\nMOASS is imminent with saying farewell to BBBY and welcoming of TEDDY!\n\n&#x200B;", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/15bdd6c/forcing_shorts_to_close/", "time": 1690491625.0, "subreddit": "r/ThePPShow", "title": "Forcing shorts to close???", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/155vbyf/lbo_confirmed_repost/", "time": 1689962525.0, "subreddit": "r/ThePPShow", "title": "LBO confirmed (repost)", "text": "<!-- SC_OFF --><div class=\"md\"><p>Sit back and relax; leveraged buyout takeover is in progress; fasten your seat belts; it will be a wild ride to the moon.</p>\n\n<p>PS: My previous post was removed for no reason; so I&#39;m posting again and see how many times it will get deleted</p>\n\n<p>EDIT: adding previous explanation</p>\n\n<p>The confirmation is shown in docket 1429 by the dissolution of the BBBY board of directors to be replaced with a plan administrator with sole power of authority.  This is a hostile takeover using a leveraged buyout; this will prevent poison pills and/or shareholders vote manipulation by the brokers/Cede&amp;Co favoring the short sellers.</p>\n\n<p>Note that there is no need to dissolve the board of directors if the company is go to chapter 7 liquidation.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/14zt0d9/too_much_hopium_and_desperation_is_bad/", "time": 1689370749.0, "subreddit": "r/ThePPShow", "title": "Too much hopium and desperation is BAD", "text": "<!-- SC_OFF --><div class=\"md\"><p>Why is everyone in here getting so high and desperate on hopium?  The shorters should be the ones that are desperate.</p>\n\n<p>I see posts about 741 turned into 14/7 and posts about Gematria; it seems like you don&#39;t believe or understand why you are in this play.  This is not some vodoo, higher-power or pre-ordained shiz; there are fundamental reasons for the MOASS.</p>\n\n<p>Shorts will not cover until there is an official announcement of reverse merger or some sort that can take BBBY out of chapter 11 and avoid chapter 7 liquidation.</p>\n\n<p>The next court date July 18 will provide glimps of some information; and the official delisting date of July 20/21 may see some cold feet shorters closing out; but other than that, just chill and relax.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/14y95pr/please_stop_calling_teddy_a_bank/", "time": 1689218125.0, "subreddit": "r/ThePPShow", "title": "Please stop calling TEDDY a bank", "text": "<!-- SC_OFF --><div class=\"md\"><p>I was watching ThePPShow tonight and keep hearing the guests saying and people commenting that TEDDY is a bank.  This is not possible.   It is quite clear that TEDDY Holdings is an LLC; and Limited Liability Companies cannot be banks.</p>\n\n<p>EDIT: WOW so many uninformed people here.</p>\n\n<p>According to Delaware State Code, Title 6 Subtitle II Chapter 18 Section 106:</p>\n\n<p>§ 18-106 Nature of business permitted; powers. (a) A limited liability company may carry on any lawful business, purpose or activity, whether or not for profit, <strong>with the exception of the business of banking</strong> as defined in § 126 of Title 8. (Source: <a href=\"https://delcode.delaware.gov/title6/c018/sc01/index.html\">https://delcode.delaware.gov/title6/c018/sc01/index.html</a>)</p>\n\n<p>Entity Type does not make you a bank; look at these banks below and their Entity Types.</p>\n\n<p>Here&#39;s a proof for you what are banks, the entity type does not make the company a bank.</p>\n\n<p>DIXON Bank: <a href=\"https://opencorporates.com/companies/us_ky/0014250\">https://opencorporates.com/companies/us_ky/0014250</a> but Entity Type is General</p>\n\n<p>Also look up Bank of America :</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lulkm0bvlnbb1.jpg?width=708&amp;format=pjpg&amp;auto=webp&amp;s=bce68cac4d9c8d7b2d86dd56a2d4fce324dccf32\">https://preview.redd.it/lulkm0bvlnbb1.jpg?width=708&amp;format=pjpg&amp;auto=webp&amp;s=bce68cac4d9c8d7b2d86dd56a2d4fce324dccf32</a></p>\n\n<p>Please educate yourself what is required to be a bank; the most basic requirement is that it cannot be an LLC.</p>\n\n<p>Also see: <a href=\"https://www.citizensbank.com/learning/what-does-llc-mean.aspx#:%7E:text=Can%20all%20companies%20be%20LLCs,insurance%20companies%20cannot%20form%20LLCs\">https://www.citizensbank.com/learning/what-does-llc-mean.aspx#:~:text=Can%20all%20companies%20be%20LLCs,insurance%20companies%20cannot%20form%20LLCs</a>.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/kjrVft_Dobjqn5bg8M7d3XTJWwNcKbXgEDABTgSaNqk.jpg\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/14u9clh/the_perfect_bear_trap_for_private_equities/", "time": 1688835436.0, "subreddit": "r/ThePPShow", "title": "The Perfect Bear Trap for Private Equities", "text": "<!-- SC_OFF --><div class=\"md\"><p>So I saw ThePPShow last night when Marantz coming on the show and ranting about how BBBYQ is going to zero; and the vultures of private equities will tear it apart.  <strong>I couldn&#39;t help but giggled to myself - another one falling for the perfectly laid bear trap</strong>.  This is why BBBY is shorted down to 5 cents; so many private equities jumped in and now got stuck; and soon they will lose limbs in order to be able free themselves or turn against each other to survive like rats in a cage.</p>\n\n<p>Marantz is no difference; he has similar mindset like other private equity vultures; therefore, that is all he can see and understand.  I don&#39;t think that he has ill-will or bad agenda to the BBBY community; he seems genuine on the show.</p>\n\n<p>But this illustrates the difference level in 69D chess at play here;  RC, Icahn and affiliates have laid such a perfect bait for these private equities; they cannot see that it&#39;s a trap; they can only see that BBBY is a failed business model and can only go to zero; they are like moths attracted to the flames.</p>\n\n<p>In Icahn&#39;s words, it will be something that <em>they will never forget</em>...</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "vuduy99", "url": "https://www.reddit.com/r/ThePPShow/comments/14sikup/moass_dominos/", "time": 1688670359.0, "subreddit": "r/ThePPShow", "title": "MOASS dominos", "text": "<!-- SC_OFF --><div class=\"md\"><p>Last night I watched PPShow hearing David saying that only BBBY will squeeze and not GME nor AMC nor any other meme stocks.</p>\n\n<p>Keep in mind that the shorting hedgefunds target BBBY, GME, AMC and other companies at same time; if any one of them squeezes, it would set off dominos for other to squeeze also; this is because these hedgefunds will be margin-called and be forced to liquidate all of their short positions.</p>\n\n<p>When BBBY squeezes, no shorting hedgefund will have enough collateral to stay in margin; so they will all be bankrupt and forced to liquidate everything including other shorting positions.</p>\n\n<p>If nothing squeezes then they may be able to continue to kick the can with GME, AMC, etc.  Therefore, BBBY restructuring is actually the only real and imminent MOASS trigger.  This is why it is a systemic risk; many shorting hedgefunds and banks colluding with them will be out of business.  CreditSwiss is only the first to go; many more will join them soon.</p>\n\n<p>EDIT:  I see many comments saying how the US goverment will not let MOASS happen.  Keep in mind that this is not the same as the GME sneeze when they turned off the BUY button.</p>\n\n<p>The BBBY Chapter 11 Restructuring is a transparent legal court case that follows the democratic process.  It is being monitored by millions of people world wide.  There is no simple behind the curtain glitch/fix that they can execute (like removing the BUY button) to get away with.   <strong>The face and reputation of the US goverment is at stake here</strong>.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]