[{"username": "wallowsfan289", "url": "https://www.reddit.com/r/ThePPShow/comments/16y4sba/an_update_on_where_we_stand/", "time": 1696272492.0, "subreddit": "r/ThePPShow", "title": "An update on where we stand 🦋🧸", "text": "<!-- SC_OFF --><div class=\"md\"><p>Those who are bearish and/or shills are doing a victory lap right now. As per the title, as it stands, our shares are cancelled. I even hear some telling us to call brokers and remove our shares to get the tax loss. I still say, why? Maybe it’s a big I told you so, but maybe there’s something else going on. In fidelity I officially have BBBYQ’s CUSIP and I cannot see the chart, let alone buy/sell. I’m in a similar situation with MMTLP here.</p>\n\n<p>So, is it over? Not quite. Anyone bullish is still waiting on a docket or series of them mentioning some sort of credit bid/buyout where shareholders are given new equity. If we do not get one soon, odds are a deal was in the works but fell through. That’s why we would see billable hours, but no sauce. There was also some rumors about a per price share buyout from Schwab’s internal memos, but it’s not confirmed anywhere else as of yet. </p>\n\n<p>It’s been a pleasure holding with you all. I want to end this by saying that regardless of whether this pans out or not, I learned a lot here. If I had a re-do I probably would still see this as an opportunity, but I would’ve gone about it much differently from the start. After a lengthy break from the markets I am going to reorganize my approach and be more conscious of how much risk I take on. If it goes to zero, you’re not stupid or unintelligent. It was just a risk that didn’t pan out. If it moons, you did not get lucky either. Set your price targets accordingly. </p>\n\n<p>All that being said, I’m speaking this into existence until the bitter end! because what do I have to lose? LFG</p>\n\n<p>TLDR:\n🦋 🧸</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "wallowsfan289", "url": "https://www.reddit.com/r/ThePPShow/comments/16jgbzx/can_45_holders_and_over_sell_at_any_point_within/", "time": 1694791442.0, "subreddit": "r/ThePPShow", "title": "Can 4.5% holders and over sell at any point within the next couple weeks?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello. I’m aware that 4.5% and over holders cannot sell shares and need court approval to do so. Is there a date that restriction is lifted? Would they basically ever be able to sell? </p>\n\n<p>As a small fish retail holder, I hope not because that would probably cause a cascading drop in price. Anyone have info on this? Hope not 🤞</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "wallowsfan289", "url": "https://www.reddit.com/r/ThePPShow/comments/16a6son/remember_what_you_hold_and_just_how_overdue_a/", "time": 1693867837.0, "subreddit": "r/ThePPShow", "title": "Remember what you hold and just how overdue a market event is. I’m not leaving.", "text": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: Buy, HOLD, DRS (however much you want/can)</p>\n\n<p>I’ve been invested in shorted stocks since January 2021 like many of you here. It’s been a wild ride of uncovering the depths of market fuckery. How financial entities use their ill gotten gains for political insurance, naked short selling, FTD’s, obfuscated swap data, high frequency trading, internalization, stock manipulation, and more.</p>\n\n<p>The events in the market around 2020-2021 was just the start. Overall collateral was down and through egregiously shorted “meme” stocks, hundreds of millions were being sucked out of people who had over leveraged, exposed, and greedy positions. Remember, they shut down buying on GME, AMC, BBBY, but also stocks like Koss, Nokia, BB. This shit was like a contagion spreading to every shorted stock. Who knows where the contagion will spread next time. </p>\n\n<p>Then they cut off the demand and ran a pervasive psy ops campaign to get everyone to sell. I’ve never seen anything like it. Only thing that came close was the shilling when we were close to declaring bankruptcy. This, alongside the FED bailing out the economy by purchasing several HUNDRED BILLIONS worth of mortgage backed securities. Commercial, residential, you name it. The FED is buying these assets banks don’t want and are the only reason 08 didn’t repeat right then and there. These stocks were a threat to the entire economy.</p>\n\n<p>It was stalled. Everything was. They weren’t ready to consolidate and handle another large scale crisis. Especially with the fact that COVID political tensions were peaking as well. It was too sudden. Of course we <em>could</em> be wrong. It would be a blow if bbby liquidates and disappears into the either with shareholder equity alongside it. However, I want to reiterate, if it’s not this stock, it will be something else. It doesn’t even have to be a shorted stock exploding. The wrong fund losing collateral in unrelated stocks could create a domino effect unlike anything we’ve seen, <em>ahem ARCHEGOS.</em> </p>\n\n<p>no matter what, I trust RC and have conviction in the thesis until it’s confirmed I am wrong. Too many coincidences add up and I just don’t believe the events that transpired in August as MSM details is his MO. That’s not RC. If that narrative is the case, it’s unfortunate, but we move on and learn from it. Maybe I’ll learn to be more vigilant with who I trust, the level of research I need to conduct, and how much I invest in speculative plays in general. That’s all you can do. This has been a wild ride and I learned a lot. Almost a bit sad it is going to conclude soon. But remember, if we turn out to be right, remember the emotional manipulation. Remember the FUD. From all angles. And use it against them.</p>\n\n<p>One thing is for sure, the pressure has been building on this shit for years. We don’t know how much the market can melt up. We’re in an AI speculatory bubble right now. and you know what? It might go higher than we can rationally or logically think is possible. But it WILL come back down to earth. And it will be violent.</p>\n\n<p>The market can lose half its value easy. As OKBet and others have said, there are quadrillions in the derivatives market. It’s notoriously unregulated and if shit hits the fan, stocks prices of hundreds, or thousands, or millions is not out of the realm of possibility. Know what you hold, but assess your risk tolerance. Have an exit plan. A firm one in your head when you start seeing movement like you’ve never seen before. We’ve also seen all the fuckery they can pull out at a whim so be careful. Assess your situation. Make sure you have no regrets is all I’m going to say.</p>\n\n<p>Finally, If this fundamental transaction does occur, it will come with harmful consequences. People will be hurt, jobs will be lost, retirement funds lose millions, and overall economic instability may cause intense deflationary measures by the FED. In short, don’t fucking dance. Don’t rub it in peoples faces, or brag, or show off. It’s a recipe for using the money irresponsibly. It will be tempting, but just don’t. </p>\n\n<p>Now, hopefully harmful effect this is limited. It’s up to those in power and us to make that the case. The worst part about 08 was the lack of accountability and the overall outcome. Consolidation, maintaining the status quo, and running it back made it to where all that harm was for nothing. Nothing really changed. Hopefully, this time around we have a swath of retail investors who will take care of themselves and their loved ones sure, but will also make sure others get through difficult times. As a collective, we can help mitigate harm and push for true reform and accountability at the highest levels. No cell, no sell. </p>\n\n<p>PS: make sure you have a plan for finances after everything goes down. Check out superstonk guides and I like OkBet’s advice as well.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "wallowsfan289", "url": "https://www.reddit.com/r/ThePPShow/comments/15uwagx/optout_thread/", "time": 1692392634.0, "subreddit": "r/ThePPShow", "title": "Opt-Out Thread", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "wallowsfan289", "url": "https://www.reddit.com/r/ThePPShow/comments/15uwagx/optout_thread/", "time": 1692392634, "subreddit": "r/ThePPShow", "title": "Opt-Out Thread", "text": "So, I just got snail mail talking about opting out, but I hear you can do it online as well.\n\nI’m in the boat that the board wasn’t acting in bad faith and we will see a new company emerge.\n\nHowever, if this is  chapter 11 that essentially boils down to liquidation and sold IP, then I believe the board probably played an role in tanking the company in cahoots with short sellers. In that case, I would want to join a lawsuit or go after them in any way possible for compensation. \n\nAlthough, that’s a last resort. How long do we have to opt-out? And is that the only downside? Am I giving up anything else? I don’t care if the board end up being saints, I want my bases covered", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "wallowsfan289", "url": "https://www.reddit.com/r/ThePPShow/comments/14o3xgt/this_sub_needs_to_ban_the_user_myni_notyourni/", "time": 1688241033.0, "subreddit": "r/ThePPShow", "title": "This sub needs to ban the user Myni_notyourNi", "text": "<!-- SC_OFF --><div class=\"md\"><p>We have recently had a new user show up in this sub. Given how small this sub is and how the community still has a say in matters like this, I say we ban this guy, effective immediately.</p>\n\n<p>Those who know what I’m talking about will agree 100%. This guy shills and is a constant bear in every shorted stock. Bbby, Muln, BBIG, GME, etc. The truth is that he pretends he’s just making good faith bear arguments and “protecting retail.” Where have we heard that line of thought before??? Hint: it’s not from good faith actors.</p>\n\n<p>He also is just a condescending as well. He will stir the pot and create FUD by pretending his logic is infallible. The reality is simple, we know the bear argument. Baby gets sold for Pennies on the dollar and not only do bond holders not get made whole, but shareholders get 0. We don’t need his commentary or participation in this subreddit as a counter to our thesis. Most people already know and all this guy will do is instill FUD in people.</p>\n\n<p>If you look at his history right now, he’s trying to blend in and participate in “good faith” but slowly he is seeping negativity into the sub. That’s how this dude works. Mods. Ban him. immediately. please.</p>\n\n<p>Edit: removed some language because I don’t want to make it super personal. I don’t hate this guy. However I’m of the opinion his intentions aren’t as pure as he states, although this track record is pretty good and he does lots of DD. See my response for more info on how I feel about this situation. I just feel like we don’t need him right now, it’s only to our detriment with the play being so close to over. And YES, in the internet age, words matter. A LOT.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]