[{"username": "weedsack", "url": "https://www.reddit.com/r/ThePPShow/comments/17dv1oa/cds_withdrawal_for_bbbyq_confirming_regionformals/", "time": 1697986374.0, "subreddit": "r/ThePPShow", "title": "CDS Withdrawal for $BBBYQ confirming Region-Formal's \"Push Over\" Theory", "text": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://imgur.com/a/6KShlAu\">https://imgur.com/a/6KShlAu</a></p>\n\n<p>&nbsp;</p>\n\n<p>In addition to QTrade (not Questrade), my other Canadian broker, CI Financial, have also performed “Push Out” transaction for my $BBBYQ shares. </p>\n\n<p>The shares were not removed because of the plan taking effect on September 29th like some brokers’ customer representatives have claimed but due to CDS Withdrawal with the description “Push Over”. CDS (Canadian Depository for Securities) is Canada&#39;s central hub for securities depository, clearing, and settlement. </p>\n\n<p>&nbsp;</p>\n\n<p>In the past, I had to call my broker to remove my worthless shares for another bankrupt company like other users. In addition, the worthless bankrupt shares that have been cancelled are still sitting in others account and have not been removed.</p>\n\n<p>That being said, this makes me strongly believe <a href=\"/u/Region-formal\">u/Region-formal</a>’s theory. He stated that a Push Out occurs when a corporate action is executed by a transfer agent that is not approved by the CDS. ComputerShare and AST are approved Depository Trust Company, so Push Over corporate action would not have occurred under them. This is likely why the customer representatives of brokers does not know and have been directing clients to other transfer agent back and forth. <em>Spider-Man Pointing at Spider-Man</em></p>\n\n<p>&nbsp;</p>\n\n<p>Therefore, our shares are likely held by new transfer agents like Teddy Holdings. \nPerhaps this is why AST, $BBBYQ’s original transfer agent, have removed the shares first, long before any other brokerages and told the clients that they are no longer the transfer agent before October 17th, the date we were expecting news because of the accelerated options expiry that occurred on October 20th.</p>\n\n<p>&nbsp;</p>\n\n<p>P.S. Here is the link to Region-formal Push Over post: <a href=\"https://www.reddit.com/r/ThePPShow/comments/17bksel/look_to_my_coming_on_the_first_light_of_the_fifth/\">https://www.reddit.com/r/ThePPShow/comments/17bksel/look_to_my_coming_on_the_first_light_of_the_fifth/</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "weedsack", "url": "https://i.redd.it/dw1fkz8ert7b1.png", "time": 1687550996.0, "subreddit": "r/ThePPShow", "title": "New All-Time High CTB 91.05%, since listing on OTC! No shares available for shorting.", "text": null, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/dw1fkz8ert7b1.png\"/></div>"}]