[{"username": "Wegoreddirt", "url": "https://www.reddit.com/r/ThePPShow/comments/16bln4x/anyone_familiar_with_the_law_conscerning_the_euro/", "time": 1694010223.0, "subreddit": "r/ThePPShow", "title": "Anyone familiar with the law conscerning the Euro trade-suspension and the fuckery thereafter or angry enough to take action - please read.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just got my last transfer of Euro-based bby to ibkr definitely rejected by ibkr. Even if it was already approved. </p>\n\n<p>So, for me and many other Euro-apes there is now no way to act on their shares as they see fit.</p>\n\n<p>Even if a/the squeeze will come tomorrow - no tendies for us.</p>\n\n<p>This is so fucked up, they just \n-stopped traiding without warning.\n-stopped converting to bbbyq without warning\n-stopped allowing transfers of bby without warning\n-more or less robbed us of our shares we paid for</p>\n\n<p>I just can&#39;t believe that this is lawful (awful for sure, but lawful?) and am so angry right now, that I am about to lawyer up and tackle these suckers.</p>\n\n<p>Is there anyone here, who could help or knows German lawyers familiar with such a special type of case?</p>\n\n<p>Might there be anyone similar pissed and interested in joining forces?</p>\n\n<p>If so - feel free to comment or dm.</p>\n\n<p>Thanks a million for your attention. I gotta go break something.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wegoreddirt", "url": "https://www.reddit.com/r/ThePPShow/comments/15y54yr/new_update_second_charge_of_german_bby_arrived_at/", "time": 1692709180.0, "subreddit": "r/ThePPShow", "title": "New Update: Second charge of German bby arrived at ibkr and automatically conversed to bbbyq.", "text": "<!-- SC_OFF --><div class=\"md\"><p>As you might know, transferring then shares from European brokers to ibkr after they suspended trading in Europe was/is a major concerne for Euro-Apes.</p>\n\n<p>Last week I finally had my first charge of bby transferred to ibkr and conversed to bbbyq (see link below). Conversion cost me an E-Mail and 10€. The second charge arrived just now and behold! They were automacally conversed to bbbyq. </p>\n\n<p>One last charge is still on the way, then I will be back  in charge (pun intended) of what happens to my shares (yay).</p>\n\n<p>I am happy.</p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/15tob8g/update_ibkr_sectortransfer_of_german_bby_to_bbbyq/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=2\">https://www.reddit.com/r/ThePPShow/comments/15tob8g/update_ibkr_sectortransfer_of_german_bby_to_bbbyq/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=2</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wegoreddirt", "url": "https://i.redd.it/e9taqbsjeoib1.png", "time": 1692280425.0, "subreddit": "r/ThePPShow", "title": "Update: IBKR sector-transfer of German bby to bbbyq went through without any issue.", "text": "<!-- SC_OFF --><div class=\"md\"><p>I am so sooo happy. It was really quick, too. Gave the order yesterday.\nAlso it seems like there ist no money missing from my account, so...maybe it was even free?\nNow I only have to wait for the rest (8.000 shares) to come and transform!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/e9taqbsjeoib1.png\"/></div>"},
{"username": "Wegoreddirt", "url": "https://www.reddit.com/r/ThePPShow/comments/15quc8v/transfer_germany_ing_to_ibkr_status_update/", "time": 1692018675.0, "subreddit": "r/ThePPShow", "title": "Transfer Germany ING to ibkr - status Update", "text": "<!-- SC_OFF --><div class=\"md\"><p>Update: Got am mail trom ibkr: Gosh, this seems to be complicated!</p>\n\n<p>&quot;Dear Client,</p>\n\n<p>Please review the information below which relates to positions being transferred into your account U*** on 11-AUG-23.</p>\n\n<p>U.S. penny stock trading requires using IBKR Mobile Authentication. For more information, including detailed instructions for installing, activating and operating the app, please see KB 2260.\n   - BBBYQ</p>\n\n<p>Microcap stocks cannot be sold until we have conducted a due-diligence process as required by securities regulations. You can avoid delays by getting familiar with this process at KB 2892 and promptly responding to information requests.\n   - BBBYQ</p>\n\n<p>You are transferring positions denominated in a currency other than your account&#39;s base currency. To learn more about trading in a currency other than your account&#39;s base currency, please watch this short video.\n   - BBBYQ&quot;</p>\n\n<p>Original Post:</p>\n\n<p>After some representatives from lynx (partner-platform to handle ibkr depot from Germany) told me a transfer is not possible and I filed for a transfer anyway, my first order of 3.000 shares is gone from my ING-depot but not (yet) to be seen on ibkr.</p>\n\n<p>I am optimistic, that the transfer will go through. The conversion is another issue.</p>\n\n<p>Is there anyone who has successfully conversed their bby (German ticker of bbbyq) to bbbyq?</p>\n\n<p>I mean the ISIN is the same - it should be the same stock-I just don&#39;t get the issue ibkr seems to be having...</p>\n\n<p>Will keep everyone updated.</p>\n\n<p>Edit: grammar</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wegoreddirt", "url": "https://i.redd.it/z2eohgz1nhhb1.png", "time": 1691762689.0, "subreddit": "r/ThePPShow", "title": "Boerse Frankfurt (XFRA) is really trading!", "text": "<!-- SC_OFF --><div class=\"md\"><p>I really wanna see the explanation for the suspension now!</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/z2eohgz1nhhb1.png\"/></div>"},
{"username": "Wegoreddirt", "url": "https://www.reddit.com/r/ThePPShow/comments/15lcvx2/just_got_a_mail_from_my_broker_regarding_the/", "time": 1691486258.0, "subreddit": "r/ThePPShow", "title": "Just got a mail from my broker regarding the transfer to my ibkr account.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Update: Just got a second mail from lynx (I asked the to call me) stating the same stuff with other words. I&#39;m gonna call them now.</p>\n\n<p>Update 2: Lynx-representative basically said, ibkr declines the transfer. I should ask around and try to find another broker.\nI only can hope, that it will go through anyway.</p>\n\n<p>Update 3: I now have two orders for transfer. One says (in other words) &quot;approved, waiting for sending party&quot; the other says &quot;to be approved&quot;. I just hope, the reps are full of shit and it goes through. Will keep you updated.</p>\n\n<p>Original Post:\nI just got a mail from lynx, a platform to be used for creating and handling your ibkr account from Germany: </p>\n\n<p>They state that a transfer of my shares to ibkr is not possible. What the f?</p>\n\n<p>Help is deeply appreciated.</p>\n\n<p>Here is the mail:</p>\n\n<p>Sehr geehrter wegoreddirt,</p>\n\n<p>vielen Dank für Ihre Nachricht.</p>\n\n<p>Die Aktie der BED BATH &amp; BEYOND INC (US0758961009) ist gegenwärtig nicht in EUR handelbar. Sämtliche angeschlossenen Börsen, über welche das Wertpapier in EUR gelistet war (darunter die Frankfurter Wertpapierbörse, Stuttgarter Wertpapierbörse und Gettex), haben den Handel vor dem Hintergrund der Insolvenz des Unternehmens ausgesetzt.</p>\n\n<p>Der Handel über LYNX ist somit aktuell ausschließlich in USD und MXN möglich.</p>\n\n<p>Ein Transfer der Aktien ist jedoch nicht möglich, da das Wertpapier in den USA als sogenannter Penny Stock am Börsenplatz PINK gelistet ist. Diese Werte, auch als US-Micro Cap Stocks bezeichnet, sind nicht übertragbar.</p>\n\n<p>Sollten Sie weitere Fragen haben, stehen wir Ihnen selbstverständlich gern per Telefon oder per E-Mail zur Verfügung. Weitere hilfreiche Informationen finden Sie außerdem online in unserem Hilfe-Center.</p>\n\n<p>Mit freundlichen Grüßen</p>\n\n<p>Translation:\nDear wegoreddirt \nThank you very much for your message. </p>\n\n<p>The shares of BED BATH &amp; BEYOND INC (US0758961009) are currently not tradable in EUR. All affiliated exchanges through which the security was listed in EUR (including the Frankfurt Stock Exchange, Stuttgart Stock Exchange and Gettex) have suspended trading against the backdrop of the company&#39;s insolvency. </p>\n\n<p>Trading via LYNX is therefore currently only possible in USD and MXN. </p>\n\n<p>However, a transfer of the shares is not possible, as the security is listed in the USA as a so-called penny stock on the PINK stock exchange. These values, also known as U.S. micro cap stocks, are not transferable.</p>\n\n<p>If you have any further questions, please do not hesitate to contact us by phone or e-mail. You can also find more helpful information online in our Help Center.</p>\n\n<p>Yours sincerely,</p>\n\n<p>TLDR: Last resort - transfering my shares to ibkr - is not possible - I am screwed. Also: If proof is needed, I could provide.</p>\n\n<p>Edit: Please, people, be civil. I&#39;m in a bad place anyway, my shares seem to be locked. If you don&#39;t appreciate me asking for help because I fear my shares are locked, downvote this post. But I feel shitty enough without people telling me, what they think what kind of a stupid arse I am.\nThank you.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]