[{"username": "weinerwagner", "url": "https://www.reddit.com/r/ThePPShow/comments/17wuiv8/list_of_inconsistencies_in_liquidation_story/", "time": 1700161111.0, "subreddit": "r/ThePPShow", "title": "List of inconsistencies in liquidation story", "text": "<!-- SC_OFF --><div class=\"md\"><p>Listing reasons to myself of why i should stay hopeful. Any additions welcome.</p>\n\n<ol>\n<li>$10.8 billion claim.</li>\n<li>Trading order instituted to preserve NOLs.</li>\n<li>Section 382 NOL shift analysis in fee dockets.</li>\n<li>Confirmed plan has sections allowing for future mergers. Had a bad projected recovery for shareholders, but that could change if a deal was still being negotiated and was completed after confirmation. Goes back to shills talking about bankruptcy court fraud, it wouldn&#39;t be fraud if the deal wasn&#39;t done yet.</li>\n<li>Baby IP went to second highest bidder. I don&#39;t get how that would be acceptable to the court to not get max recovery from assets if there wasn&#39;t more of a plan to it. </li>\n<li>Recent RF post about butterfly and DoM having same registered agent which would help a merger.</li>\n<li>There was a fee docket entry about a lawyer messaging a divested subsidiary. I think ive also seen divested subsidiary used in reference to bbby acquisition co llc but I&#39;m not sure about that, but it would tie bbbyq to DoM since divested subsidiary was used by a bbbyq lawyer fee indicating it is a divested subsidiary of bbbyq. Otoh bbby acquisition could just be a divested subsidiary of DoM without connection to bbbyq. Otoh i don&#39;t think any divested subsidiary of bbbyq had been elsewhere officially referenced or declared so seems kind of interesting and secretive.</li>\n<li>Rushed bankruptcy proceedings finish just in time for holiday season, for no apparent reason.</li>\n<li>Fucking Cifu is doing public space calls talking shit about bbbyq, rather unhinged behavior from the supposed victor. </li>\n<li>GME 8k(?) Had a ton of acquisition language added to its bank loan agreement contract section.</li>\n<li>Please add more</li>\n</ol>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "weinerwagner", "url": "https://www.reddit.com/r/ThePPShow/comments/17p6wje/wasnt_there_a_hearing_scheduled_for_the_14th_of/", "time": 1699288903.0, "subreddit": "r/ThePPShow", "title": "Wasn't there a hearing scheduled for the 14th of this month? But the legal representation has already delivered their final bills?", "text": "<!-- SC_OFF --><div class=\"md\"><p>The stalking horse auction hearing was rescheduled from oct 24th to nov 14th iirc. Also was reading some posts recently about dockets of final bills from the lawyers. Seems weird that there can still be an upcoming hearing and the lawyers already acting like jobs done.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "weinerwagner", "url": "https://www.reddit.com/r/ThePPShow/comments/162drkv/how_long_is_the_drs_time/", "time": 1693102245.0, "subreddit": "r/ThePPShow", "title": "How long is the drs time?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just bought some for the first time a couple days ago, been in gme since the sneeze and drs&#39;d that. Would like to have this drs&#39;d as well but don&#39;t want my shares stuck halfway with the deadline approaching. How does the process compare? AST as reliable as computershare?</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "weinerwagner", "url": "https://www.reddit.com/r/ThePPShow/comments/159dzk6/friday_court_hearing_subject_matter_leases_vs/", "time": 1690303900.0, "subreddit": "r/ThePPShow", "title": "Friday court hearing subject matter, leases vs something else requested expedited?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I thought the bbby lawyer requested an expedited hearing vaguely&quot;for the benefit of all stakeholders&quot; scheduled for yesterday, but the dockets that rescheduled it to Friday said it was about leases? Does anyone have clarification on fridays hearing, and if it is about leases does that mean the lawyer dude was just super anxious to talk about the leases?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]