[{"username": "whoopsieboi", "url": "https://www.reddit.com/r/ThePPShow/comments/17brncs/some_perspective/", "time": 1697744471.0, "subreddit": "r/ThePPShow", "title": "Some perspective", "text": "<!-- SC_OFF --><div class=\"md\"><p>Perspective</p>\n\n<p>Hey nerds,</p>\n\n<p>I’m a long time lurker. Got interested in all this stuff back in ‘21 and knew literally next to nothing about the stock market. I remember exactly how I heard about it actually. I was very depressed and isolated during the pandemic working as a healthcare provider living at my parents house. My friends and I had a group chat to keep in touch during the shutdown and coordinate games after work, pretty much the only thing that kept me going at that time aside from my beautiful girlfriend (now wife) and new kitty cat. One of my friends was going on about a short squeeze on GME and how all these guys calling themselves “autists” and “retards” were  “yoloing” their 401ks into this stock. I asked him why these people felt so certain about their investments and he said “well the float is shorted over 100%”. I had no fucking clue what that meant. But instead of getting on games that night, I went on and read about how shorting worked and the implications of these positions. I decided that this seemed like an unprecedented time and I had some cash on hand so why not throw in. Bought 5k at like fuckin $349 per share hahahah. </p>\n\n<p>The next day was the sneeze and I remember checking the price like every 4 mins while treating my patients. I watched it go up right up until market open, then drop violently and then go up back to around 347-351 and then oscillate. Over the course of the next several weeks, I saw the stock jump all over the place. As low as 40 bucks, as high as 350, then settling somewhere in the 200 range. It was wild. For about 2 weeks, my depression and anxiety were fully on the back burner and I felt almost euphoric, watching something of which I have very little control or understanding spiral completely out of control. </p>\n\n<p>In the coming months, there would be congressional hearings that, from my perspective, were done to check boxes and appease those in power. This might be speculative and naive, but I am of the opinion that these are people  (politicians and members of government regulatory bodies) who also understand very little about the inner workings of our market and rely on market makers like Virtu and Citadel and big banks to “regulate” themselves. I think the “regulation” that we are seeing currently is euphemistic. It would be more accurate and analogous to fire-starters also being the firefighters. In return, these politicians get tips on what’s about to pop and how to get in. How else can you explain the fines for insider trading, inexplicable gains made by prominent government leaders, and overall opaqueness in regards to regulating the market and banking?</p>\n\n<p>Anyway, following these hearings and many more market fluctuations, scavenger hunts on the GameStop NFT marketplace, cryptic (and sometimes not so cryptic) tweets from billionaires, bets involving the sexualization of fruit, podcasts/livestreams from people in our community, and books of due diligence on anything from market mechanics to chapter 11 bankruptcy, we have found ourselves here at a crossroads. Our shares are somewhere in the ether, and I am confident we will find them someday soon, hopefully having appreciated nicely to make life a little easier. </p>\n\n<p>I reflect on this now so I don’t forget where we came from and where we have to go. I’m using the term “we” generally, as people in a society. We have seen market crashes in the past and how ordinary peoples lives get upended by things far out of their control. Ordinary people who were just doing as everyone else had done before them. Similar to a natural disaster destroying a home, in a minute, everything they thought they had was gone. These tragedies are oftentimes chalked up to general misfortune. Government players, celebrities, and well off socialites offering kind words, thoughts and prayers, and well wishes, as if these could mitigate the loss that had just occurred. People with more than they can ever need, looking down on those in the shit with pity in their eyes, telling themselves that it’s not their job to look out for their communities. It’s sickening and despicable. But more than that, it’s inefficient and wasteful. </p>\n\n<p>I could go on about the problems with our society for hours (my wife and friends will tell you I often do after a drink or 2) but I won’t. I’m just going to leave it at we are all starting in around the same place. You wouldn’t be here betting on bankruptcy turning into billions if you were financially well off. Do not forget what it has been like to live paycheck to paycheck. Do not forget what if feels like to work 12 hour shifts 5-6 days a week. Do not forget what it feels like to get paid barely enough to pay rent and feed your family. Improve your community. </p>\n\n<p>Take it for what it is, but my wife was watching Miss Americana last night, the Taylor swift one that ends with the only the young song. It finally crystallized for me in that moment what the song is truly about. The old make decisions and the young have to live with the repercussions. It is only until the young have the opportunity to make deifications themselves where you will see a world that is more equal and fair. </p>\n\n<p>Anyway, hopefully y’all are doing better than me. Covid is kicking my fucking ass.</p>\n</div><!-- SC_ON -->", "flair": {"text": "💩  Shit Post 💩 Likely to be deleted 💩 ", "text_color": "dark", "back_color": "#dadada"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]