[{"username": "Whoopass2rb", "url": "https://www.reddit.com/r/ThePPShow/comments/17nqjrr/couple_recent_news_articles_showing_more_stuff/", "time": 1699118753.0, "subreddit": "r/ThePPShow", "title": "Couple recent news articles showing more stuff coming out in the open.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Just wanted to post a couple articles I noticed that appear to be showing a lot of the stuff unravelling recently for those who don&#39;t keep up.</p>\n\n<p>There&#39;s not much context I want to give with this post. Just sharing some things going on, read and interpret for yourselves.</p>\n\n<hr/>\n\n<p><a href=\"https://www.bnnbloomberg.ca/osc-tribunal-approves-8m-settlement-over-rbc-accounting-practices-1.1993797\">https://www.bnnbloomberg.ca/osc-tribunal-approves-8m-settlement-over-rbc-accounting-practices-1.1993797</a></p>\n\n<p>RBC is the largest bank in Canada. This is settlements over multiple regulating authorizes on &quot;mismanagement&quot; of account records. </p>\n\n<p><a href=\"https://www.reuters.com/markets/hedge-funds-caught-crowded-trades-suffered-thursdays-stock-rally-goldman-sachs-2023-11-03/\">https://www.reuters.com/markets/hedge-funds-caught-crowded-trades-suffered-thursdays-stock-rally-goldman-sachs-2023-11-03/</a></p>\n\n<p>Goldman Sachs is one of the top 10 banks in the US. This opening line is probably summing the article for you:</p>\n\n<p>&quot;Global hedge funds using algorithms to trade stocks endured one of their worst days of the year on Thursday, a Goldman Sachs note on Friday showed, a sign that a sharp rally in shares on hopes that global rate hikes are over caught some off guard.&quot;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Whoopass2rb", "url": "https://www.reddit.com/r/ThePPShow/comments/17cx74o/wealthsimple_canadian_tfsa_account_cusip_hunt/", "time": 1697873866.0, "subreddit": "r/ThePPShow", "title": "WealthSimple - Canadian TFSA Account - CUSIP hunt", "text": "<!-- SC_OFF --><div class=\"md\"><p>Master Tracking Post: </p>\n\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/17cx6z0/cusip_identification_tracking_post/\">https://www.reddit.com/r/ThePPShow/comments/17cx6z0/cusip_identification_tracking_post/</a></p>\n\n<p>This post is in connection with this: <a href=\"https://www.reddit.com/r/ThePPShow/comments/17cwwh1/the_fraud_is_in_the_cusip_ids/\">https://www.reddit.com/r/ThePPShow/comments/17cwwh1/the_fraud_is_in_the_cusip_ids/</a></p>\n\n<p>I decided to do the DD for my own broker to start. Unfortunately I won&#39;t be able to get a rep until Monday (and you bet your ass I&#39;ll be following up) but here&#39;s what the automated system told me when I probed it with some pretty deep questions. I find it really scary that they had this sort of content already programmed to respond to. It&#39;s probably AI generated but just the generic professionalism of the canned response makes me concerned that they knew to hide the tracks on this.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xxdyp66fdivb1.png?width=346&amp;format=png&amp;auto=webp&amp;s=a88124afc608deba55b8ec261d9e618b32d9336b\">Log 1</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/yzw15ujhdivb1.png?width=347&amp;format=png&amp;auto=webp&amp;s=f8607fb42b10fa898f9ffda91a99578f15c721f3\">Log 2</a></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/sju_nBOStc6mtQvpwZAdbNoNiEJ4w_rrAABVZtVwv7s.jpg\"/></div>"},
{"username": "Whoopass2rb", "url": "https://www.reddit.com/r/ThePPShow/comments/17cx6z0/cusip_identification_tracking_post/", "time": 1697873846.0, "subreddit": "r/ThePPShow", "title": "CUSIP Identification Tracking Post", "text": "<!-- SC_OFF --><div class=\"md\"><p>A master post to track every CUSIP we find and from which broker, country, account type, etc. Time to get to the bottom of this fraud.</p>\n\n<p>Just @ me in the comments with anything you want to update and I&#39;ll update it over time. Hoping the Mods can pin this for me. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Broker / Institution</th>\n<th align=\"left\">Account Type</th>\n<th align=\"left\">Country</th>\n<th align=\"left\">CUSIP</th>\n<th align=\"left\">Tied To</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">WealthSimple</td>\n<td align=\"left\">TFSA</td>\n<td align=\"left\">Canada</td>\n<td align=\"left\">Not Providing</td>\n<td align=\"left\">?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\"></td>\n<td align=\"left\"></td>\n<td align=\"left\"></td>\n<td align=\"left\"></td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>Decided to do the evidence this way so not to make a ton of new posts as some people might just confirm the information and share via comment or dm.</p>\n\n<p>Evidence Posts:</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Whoopass2rb", "url": "https://www.reddit.com/r/ThePPShow/comments/17cwwh1/the_fraud_is_in_the_cusip_ids/", "time": 1697872568.0, "subreddit": "r/ThePPShow", "title": "The fraud is in the CUSIP IDs.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Marked this as &quot;Trust Me Bro&quot; for fun :D because of the fact my source is inside information.</p>\n\n<p>I saw this post tonight:  <a href=\"https://www.reddit.com/r/ThePPShow/comments/17cpkwp/its_worse_than_i_thought/\">https://www.reddit.com/r/ThePPShow/comments/17cpkwp/its_worse_than_i_thought/</a></p>\n\n<p>When I read up on it, I started to think that&#39;s really interesting and that there might be something more to it. So I decided to reach out to one of my EU based inside contacts (given the time), who happened to also work closely with this play many months ago. You can see there reply at the bottom of this post.</p>\n\n<p><em>Turns out</em> where there&#39;s <strong>smoke</strong>, there&#39;s <strong><em>fire</em></strong>. </p>\n\n<p>Stupidly now that I think about it, that finding in the post makes complete sense. I&#39;m disappointed I didn&#39;t think of it myself. In most crimes, hiding in plain sight is actually a very common tactic because people generally never suspect it. And the element of using the CUSIPs here for that purpose is 100% a thing. </p>\n\n<p><strong><em>Why?</em></strong></p>\n\n<p>Well, most of us would never look beyond just the numbers. The numbers mean squat to us and we perceive it to be just a number part of the system. So there&#39;s that ignorance factor.</p>\n\n<p>But then even if we probed for a CUSIP, when we get a CUSIP ID #, we think that&#39;s good enough for us.  So again an element of ignorance, or more aptly put as: blind faith trusting our broker / institution, that what they give us is right and thus gives us a false sense of security. </p>\n\n<p>However, the main reason why this works is because we don&#39;t have access to the backend systems to be able to confirm anyways so we just move on and ignore it altogether. Until there&#39;s some form of corporate action that requires the CUSIP ID #, to the rest of us, we don&#39;t care about the number - we never use it. </p>\n\n<p>To top it off, the only thing we can do is call our brokers and institutions to get the information on the CUSIP for the stock we hold. And we basically have to trust them, which therein lies the problem. </p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>My Spidey sense is tingling...</em></strong></p>\n\n<p>Didn&#39;t the Plan voting element require a reference to the CUSIP for the other class holders? It wasn&#39;t needed for class 9 because they couldn&#39;t but anyone who held common shares, warrants or preferred shares along with being another level of claimant were required to put in their CUSIP. Wonder why this was? </p>\n\n<p>I bet you anymore a lot of middle ground holders were being duped by these nefarious parties working the transactions in the middle, giving fact CUSIPs. Those parties just call up their broker / provider to get the number and bam, get something different but aren&#39;t any of the wiser. Then in the back end, the DTC and authorities can validate where the fraud is actually taking place... damn.</p>\n\n<p>Crazy interesting that the fraud ring here is using private entities for CUSIPs to represent our shares to stocks <strong><em>we think we hold.</em></strong></p>\n\n<p>And <em>fancy that</em>, look who recently got hit from the SEC on the misuse of sensitive customer information? Courtesy of <a href=\"/u/Real_Eyezz\">u/Real_Eyezz</a></p>\n\n<p><a href=\"https://www.sec.gov/news/press-release/2023-176\">https://www.sec.gov/news/press-release/2023-176</a></p>\n\n<p><a href=\"https://preview.redd.it/sibgv04k6ivb1.png?width=693&amp;format=png&amp;auto=webp&amp;s=a050a9c79e09da9cf20c0572828ca6ba4bcffdd8\">Didn&#39;t a certain someone named Ryan call out the owner of Virtu in tweets / X ? :O</a></p>\n\n<p>Like you can&#39;t make this shit up:</p>\n\n<blockquote>\n<p>As alleged in the SEC&#39;s complaint, Virtu Americas and its affiliates operated two businesses that it purported to have walled off from each other: an order execution service for large institutional customers, whereby Virtu Americas executed customer orders, typically for a commission, and a proprietary trading business, through which Virtu Americas bought and sold securities for its own accounts and benefit. From approximately January 2018 through the beginning of April 2019, however, Virtu Americas allegedly failed to safeguard a database that contained all post-trade information generated from customer orders routed to, and executed by, Virtu Americas, including customer identifying information and other material nonpublic information. The SEC’s complaint alleges that this database was accessible to practically anyone at Virtu Americas and its affiliates, including their proprietary traders, through two sets of widely known and frequently shared generic usernames and passwords. </p>\n</blockquote>\n\n<p><strong><em>And that was only up until 2019</em></strong>... could you imagine how much worse this has gotten? The SEC might be acting now, but it&#39;s not good enough, that&#39;s 4-5 years too late. We need to start standing up for our own rights on this. </p>\n\n<p>&#x200B;</p>\n\n<p>Anyways, here&#39;s the response from my contact and I think you&#39;ll like the hint being offered, it&#39;s short and sweet (redacted their name for protection).</p>\n\n<p><a href=\"https://preview.redd.it/8pcb0cjb5ivb1.png?width=1062&amp;format=png&amp;auto=webp&amp;s=ca16ecb977ae7cca8ae15f2c2a1cb9bba6da911c\">God Damn...</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Well Apes</em></strong><strong>,</strong> <strong><em>you know what to do.</em></strong></p>\n\n<p>My suggestion is we get a master thread going for this (maybe mods can help). Have it where people start checking their brokers and see all the CUSIPs we get for each broker - just put it in a table. If my suspicion is correct, there could be multiple CUSIPS tied to the stock that aren&#39;t actually BBBY. Hell that could be true for many of the basket stocks (so don&#39;t feel limited to just BBBY, give your favorite other stocks some love too!). Further, there may even be different ones used by the same broker(s) among different customers (wouldn&#39;t that be something). </p>\n\n<p>Finally, and this is pure speculation of opinion on my part but, I wouldn&#39;t be surprised if these private entities end up being connected to commercial real estate in some capacity. It seems like the perfect front for what looks like a &quot;real business&quot; operating but isn&#39;t one.</p>\n\n<p><em>Let&#39;s see how deep the rabbit hole goes...</em></p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/FKX1KR2fhonc66gveF4x-Zds1hyqVv_CVUqXBUdHgKk.jpg\"/></div>"},
{"username": "Whoopass2rb", "url": "https://www.reddit.com/r/ThePPShow/comments/175jiov/potential_evidence_bbby_is_not_worthless_broker/", "time": 1697044726.0, "subreddit": "r/ThePPShow", "title": "Potential evidence BBBY is not worthless - broker information reference.", "text": "<!-- SC_OFF --><div class=\"md\"><h1>Preface</h1>\n\n<p>Some might call this &quot;DD&quot; given it&#39;s a reported source of information for a broker. But I&#39;m not overly familiar with the flairs here so I just gave it the old &quot;my opinion&quot; vantage. </p>\n\n<p>If any of you are still currently questioning why you are here, given all the recent FUD on shit being &quot;removed&quot; from people&#39;s accounts and all the news around the globe, well sit tight I&#39;m here to help. </p>\n\n<p>Something I always find fascinating is the reference of what &quot;is said&quot; VS what &quot;isn&#39;t&quot;. Using that element of logical reasoning, you can often understand when there&#39;s more to a situation than meets the eye.</p>\n\n<p>I get it, you already know that - you&#39;re the believers here. However, it&#39;s often nice to find hard proof of your convictions. We&#39;re not out of the woods yet, but I&#39;d say this post is solid proof that they are working on something to get us out of it, and have been for a while.</p>\n\n<p>- - - - - - - - - - - -</p>\n\n<h1>Disclaimer</h1>\n\n<p>Not a financial advisor and this post is clearly a representation of my opinion. I&#39;m not advocating for you to do, or not do, anything regarding this stock. You are all individual investors who make your own choices; do whatever you wish with your trading. </p>\n\n<p>This information is from a Canadian broker (WealthSimple), it may not be applicable to all brokers.</p>\n\n<p>- - - - - - - - - - - -</p>\n\n<h1>Background</h1>\n\n<p>Recently for another ticket I own, my broker outlined the actions that were about to take place because it&#39;s getting delisted due to an M&amp;A. For more information they sent me to this page, which I found fascinating.</p>\n\n<p>sauce: <a href=\"https://help.wealthsimple.com/hc/en-ca/articles/4415455710363\">https://help.wealthsimple.com/hc/en-ca/articles/4415455710363</a></p>\n\n<p>You&#39;ll see from looking at the page, there&#39;s a long history of actions various tickers have taken - going as far back as July of 2022; <em>not bad</em>.</p>\n\n<p><strong><em>Naturally,</em></strong> I decided to use this new found information to see what is implied VS what is not for our favorite stock. :)</p>\n\n<p>The following is my little journey and I&#39;m sure you&#39;ll get the implications at the end :)</p>\n\n<p>- - - - - - - - - - - -</p>\n\n<p>&#x200B;</p>\n\n<h1>Looking up &quot;Cancelled&quot;</h1>\n\n<p>On this page, there were only 2 instances of the word &quot;cancelled&quot; that came up. Next to the word ended up being &quot;worthless&quot;. I thought that was some pretty clear language to be associated to tie in together. Here is how they were presented:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jyet24luhltb1.png?width=788&amp;format=png&amp;auto=webp&amp;s=1ab1409587a4ac937ef809080b6b4069adfa1611\">TCDAQ being cancelled / worthless</a></p>\n\n<p>And instance #2:</p>\n\n<p><a href=\"https://preview.redd.it/6ynzh5c3iltb1.png?width=924&amp;format=png&amp;auto=webp&amp;s=12e25dc5c601cc8ae9259a8a0b9ff184229994ee\">ASP being cancelled / worthless</a></p>\n\n<p>&#x200B;</p>\n\n<p>Now there&#39;s a couple of obvious things to note about these:</p>\n\n<ol>\n<li>First is the language. Both clearly state cancelled and worthless, where there is no further payments or any additional consideration for share holders.</li>\n<li>Next is the dates. Both are after our BBBY chapter 11 initiation (Apr 2023), and even after the &quot;failure&quot; of selling off BBBY as a going concern (summer 2023). </li>\n<li>Further to the above, one of these is dated in October, which comes <em>after</em> our own stock&#39;s reference to being &quot;cancelled&quot;. <strong><em>Interesting.</em></strong></li>\n<li>But probably the most obvious thing that stands out to you: <strong>BBBY or BBBYQ is not listed with that language.</strong> </li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Moving on...</p>\n\n<p>- - - - - - - - - - - -</p>\n\n<h1>Looking up &quot;delisted&quot;</h1>\n\n<p>After the findings of &quot;cancelled&quot;, I decided to dig into the word delisted because I thought that might be a &quot;temporary&quot; assignment of the ticker given the uncertainty with it at the moment; because it&#39;s clearly delisted at the moment (in some fashion).</p>\n\n<p><em>Well</em>, <strong><em>funny enough</em></strong>, there were only 2 instances of delisted explicitly stated. Here they are:</p>\n\n<p><a href=\"https://preview.redd.it/oyubsd9jjltb1.png?width=785&amp;format=png&amp;auto=webp&amp;s=7f47cfa91f97b24e13485d8a657d656dd2117c3d\">JE.H delisted</a></p>\n\n<p>And #2:</p>\n\n<p><a href=\"https://preview.redd.it/2dtnjbtqjltb1.png?width=727&amp;format=png&amp;auto=webp&amp;s=bb4625d3908bad33a3b0031a6c1b1ec37c53aa63\">WTT delisted</a></p>\n\n<p>Again, much like the first keyword search, some obvious things pop in my head especially given I know what has transpired with our own stock in BBBY.</p>\n\n<ol>\n<li>The first thing that stands out is that the rational for the delisting is very clear; one is for a merger and the other is due to failure to meet reporting requirements</li>\n<li>The second thing that stands out to me is that there exists many other scenarios, at least in the context of merger, where the language of delisted should have also been used. So I would chalk that up to inconsistent communication language.<br/></li>\n<li>Finally, again, BBBY <strong><em>is not</em></strong> listed under this keyword. <strong><em>I find that strange, don&#39;t you?</em></strong></li>\n</ol>\n\n<p>- - - - - - - - - - - -</p>\n\n<h1>Looking up &quot;merger&quot;</h1>\n\n<p>As a follow up, I decided to look up the word merger. There are 247 hits, so I did a random sampling of a recent one to validate my assumption #2 above in the previous section:</p>\n\n<p><a href=\"https://preview.redd.it/t703z9ankltb1.png?width=735&amp;format=png&amp;auto=webp&amp;s=ab98be4a4445f8eb5dcb52996d9bd0f554a769ea\">CHCK turned into LONE</a></p>\n\n<p>And when I checked out the CHCK ticker on the broker:</p>\n\n<p><a href=\"https://preview.redd.it/t1m6s92skltb1.png?width=1272&amp;format=png&amp;auto=webp&amp;s=bfbf1b92d4b91fa33e9ccd6940cc6cc28e7fa42a\">CHCK Delisted</a></p>\n\n<p>Exactly what you&#39;d expect, and what I had presumed. So the point being, just because merger is used doesn&#39;t mean the stock wasn&#39;t delisted. Inconsistent language reference there. </p>\n\n<p>Okay, but what about the reporting requirements keywords?</p>\n\n<p><strong><em>Well,</em></strong> only 1 hit triggered on the words &quot;maintain&quot;, &quot;requirements&quot; and &quot;failure&quot; - it was JE.H (a couple screens listed above). And the word &quot;reporting&quot; turns up nothing.</p>\n\n<p>So, given we know in theory BBBY technically was delisted due to those challenges, <strong><em>it&#39;s interesting that it&#39;s not listed here for that reason.</em></strong> </p>\n\n<p>- - - - - - - - - - - -</p>\n\n<h1>Looking up &quot;worthless&quot;</h1>\n\n<p>There was one more keyword I thought might be worth looking up prior to closing out the big obvious one. That word was worthless, because if our favorite stock was in fact worthless today, clearly they would want to notify us of such things right? </p>\n\n<p>Similar to what I found on the delisted keyword, there is some inconsistencies of the use of language because while cancelled was only listed 2 times with worthless beside it, the keyword worthless itself turned up 6 times. Here are the other four entries:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9ihpsibkmltb1.png?width=726&amp;format=png&amp;auto=webp&amp;s=515271eefc04ddb227003470fb67854d748fb61d\">TZZ considered worthless</a></p>\n\n<p><a href=\"https://preview.redd.it/rn3n6o2woltb1.png?width=740&amp;format=png&amp;auto=webp&amp;s=1f5aa120126de9786e24ac2348f26138aa25dbaf\">DBDQQ considered worthless - notice the Q at the end ;)</a></p>\n\n<p><a href=\"https://preview.redd.it/9pt111p8nltb1.png?width=741&amp;format=png&amp;auto=webp&amp;s=b8c04099499d1b7e211fcfbe82baffdb8af181d4\">CLVSQ considered worthless - also note the Q here as well.</a></p>\n\n<p><a href=\"https://preview.redd.it/pf5rvx66oltb1.png?width=732&amp;format=png&amp;auto=webp&amp;s=b54ce0b423b4d9f034630f2fa71594172699fe5d\">REVRQ considered worthless - there&#39;s that Q again.</a></p>\n\n<p>And just to show that those Q references were in fact due to a bankruptcy filing and thus placed on otc:</p>\n\n<p><a href=\"https://preview.redd.it/zotsacl1nltb1.png?width=712&amp;format=png&amp;auto=webp&amp;s=9e63d66b73ff7a8706b54b1081cd87a555c0a5df\">DBDQ.Q</a></p>\n\n<p><a href=\"https://preview.redd.it/eui3avoynltb1.png?width=1149&amp;format=png&amp;auto=webp&amp;s=0c168ef87dab8d76cfb658c0d77163c1853e132e\">CLVS.Q</a></p>\n\n<p><a href=\"https://preview.redd.it/cgwjpgbjoltb1.png?width=738&amp;format=png&amp;auto=webp&amp;s=6c5d2e2b1793c36c6f7caf56570a08a3b8ce7953\">REVR.Q</a></p>\n\n<p>&#x200B;</p>\n\n<p>And so we have seen that the word worthless is consider in use for what it means, but is only referenced 6 times total. Beyond this, the obvious point is that, BBBY is not listed with this keyword. That in itself is interesting because 3 of the 4 additional references above were companies that went bankrupt and the language here defines them as &quot;worthless&quot;.</p>\n\n<p>Which leads us to our final search.</p>\n\n<p>- - - - - - - - - - - -</p>\n\n<h1>Looking up &quot;BBBY&quot;</h1>\n\n<p>The keyword BBBY shows up twice on this page, and both in the same line. What I find interesting is the language used here. It&#39;s not saying due to failure of reporting requirements, or a bankruptcy, or anything else like that. And I find that odd, especially because BBBY was in chapter 11 at this point; it filed April 23rd - 24th for it and the date listed here is May 3rd. </p>\n\n<p>So these choice of words stand out to me given we&#39;ve seen other examples above of the same type of challenges other companies went through, and what language they used to describe their situations. For them, it&#39;s the language we&#39;ve been led to &quot;believe&quot; about BBBY, yet almost deliberately, that language <strong><em>isn&#39;t listed for BBBY</em></strong>.</p>\n\n<p>Now I know you don&#39;t believe in that BS, we&#39;re the believers here. But the next time some troll, bear shill or harassing asshole wants to give it to you about your &quot;worthless&quot; shares, feel free to point them here. It&#39;s pretty clear that something other than worthless bankruptcy is going on with BBBY. And while we as a public group don&#39;t know what that specifically is, clearly other instructions have been given in the background and for a long time.</p>\n\n<p>Anyways, enough rant -  here&#39;s the screen shot and the language:</p>\n\n<p><a href=\"https://preview.redd.it/gakcj4ojqltb1.png?width=728&amp;format=png&amp;auto=webp&amp;s=0065a7ccd2187c1834c0dbea3fea656d0081666a\">BBBY - only identified as listed on OTC market</a></p>\n\n<p>And for reference, here&#39;s what BBBYQ looks like on the broker right now:</p>\n\n<p><a href=\"https://preview.redd.it/ogkhp9fcwltb1.png?width=1250&amp;format=png&amp;auto=webp&amp;s=87aba536e9cd123875681f45d5fd7bc48239660d\">BBBYQ is Inactive / Unavailable.</a></p>\n\n<p><strong>Not</strong> inactive and delisted. Rather inactive and <strong><em>unavailable.</em></strong></p>\n\n<p><strong><em>Interesting</em></strong></p>\n\n<p>- - - - - - - - - - - -</p>\n\n<h1>TL;DR: Conclusion</h1>\n\n<p>I don&#39;t know what we&#39;re going to get from holding BBBY at this point. My hope says we will get something and probably feel very happy about the result. However my logical understanding accepts that I don&#39;t know what that may be or when it might come, and even how its possible- <em>nor do I care</em> for all <em>THOSE</em> types out there doom slaying. As long as I get something, to quote someone famous by our standards; <strong><em>who gives a shit?</em></strong>  </p>\n\n<p>But I do know that behind the scenes, instructions have been given. Those instructions seem pretty clear for 4 months now: BBBY is not just disappearing and leaving stakeholders with nothing. And shareholders = stakeholders. </p>\n\n<p>So to the rest of you non-believers: believe what you want, but kindly &quot;<strong><em>who gives a shit&quot;?</em></strong> Your opinion doesn&#39;t matter and in due time, will be proven to be a miss-take on the situation.</p>\n\n<p>Obligatory plug: <a href=\"https://www.reddit.com/r/Superstonk/comments/ogsw9d/up_a_little_bit_nothing_down_a_little_bit_nothing/\">https://www.reddit.com/r/Superstonk/comments/ogsw9d/up_a_little_bit_nothing_down_a_little_bit_nothing/</a></p>\n\n<p>Trade safe everyone.</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/cK04o5qfUJf94eTDU0eUNOwaL9eO8B35ubEEdXl90bs.jpg\"/></div>"},
{"username": "Whoopass2rb", "url": "/r/BBBY/comments/16yyzuf/always_ask_why_a_breakdown_of_why_someone_will/", "time": 1696356532.0, "subreddit": "r/ThePPShow", "title": "Always ask why: a breakdown of why someone will pick up BBBY / Butterfly + data &amp; source code", "text": null, "preview": ""},
{"username": "Whoopass2rb", "url": "https://www.reddit.com/r/ThePPShow/comments/16sr7um/a_comment_conversation_that_turned_into_a_dm/", "time": 1695742435.0, "subreddit": "r/ThePPShow", "title": "A comment conversation that turned into a DM. Sharing because I care, information should be transparent. You are all capable of making your own decisions and taking your own risks - the other side doesn't get that.", "text": "<!-- SC_OFF --><div class=\"md\"><p>A conversation that started in another post on this sub went down a trail to a DM; the person I was engaging was eventually banned. Given most people like to read my comment dialogues because they say that&#39;s where the real information ends up hiding, well, <em>who am I</em> to deprive you of that? :)</p>\n\n<p>The following is purely my response, in entirety, to a comment. Some of it might offend you, some of it might rally you. All of it is meant to respect your free thought and your right to do as you please. Never forget that because too many people are trying to tell you that you can&#39;t think for yourself; <strong><em>and they are wrong.</em></strong></p>\n\n<p>Don&#39;t forget what this is really about. Sure getting rich is a goal, and it&#39;s one that&#39;s going to help a lot of people when the day comes that we&#39;re right. But this isn&#39;t just about getting rich, it&#39;s about change. If you&#39;ve bought into the PPShow at this point, <strong><em>then you likely understand and want that change</em></strong>.</p>\n\n<p>Enjoy :D</p>\n\n<p>PS: I&#39;ve used { } brackets to insert context for people to be able to follow from missing information</p>\n\n<p>- - - </p>\n\n<blockquote>\n<p>This probably would have been more appropriate but all the same <strong><sup>{doing a DM instead of comment in another sub}</sup></strong>. Sorry you got banned, that&#39;s one thing I&#39;m never fully in agreement with all these subs: their approach on how to address differing opinions. But it is what it is. It&#39;s why I try not to disturb the peace of those who have the other view in other places. Everyone deserves a safe space to express their views with like minded people.   </p>\n\n<p>I also get what you&#39;re saying about the company and the situation, how dangerous that can be to people <strong><sup>{they believed people were scammed, led on; as well that RC rug pulled a squeeze}</sup></strong>. Here&#39;s a life lesson I&#39;ve learned over the years and I find specific to this element of reddit + investing. I work cyber security. The amount of &quot;dangerous&quot; things people do and follow every day is crazy. But I don&#39;t spend my time going around to specific subs advising people as much. Yes some get hurt, hurt badly from fraud and identity theft, revenge porn, you name it; but people will live and learn. It&#39;s a fruitless, thankless effort to try and pass on my expertise to people in those moments. The last thing they want is me coming in on my high horse and trying to course correct them - it&#39;s already too late in their eyes; I just become a target for their aggression.    </p>\n\n<p>The biggest take away from my note there is that you can&#39;t save everyone. Those who will listen, work with them. The rest? Allow them to just experience life in their own miserable way. I think that&#39;s the part that many people of the opposite opinion on this play don&#39;t understand. They feel the need to course correct or advise how &quot;wrong&quot; those people are; that&#39;s never going to work and you&#39;re only frustrating yourself and angering all those people by trying the way you do.    </p>\n\n<p>And that&#39;s the major problem, because all the savvy investors don&#39;t see the irony of trying to approach all these less savvy investors that way. The financial industry, particularly the element of wall street and the markets, is a very &quot;controlled&quot; system. Not in the good way either, it is controlled to ensure the people on top continue to stay there. They work on building systems and processes to ensure people below continue to follow what people on top want. It&#39;s no different than politics, dictators, etc.; you get the idea. Based on that, do you really think people who are being cheated by this system will take kindly at being told what to do from you or anyone of your mindset? Probably not but that&#39;s just a guess. ;)   </p>\n\n<p>As for BBBY, there&#39;s a couple things, at least for me personally, that reminds me this hasn&#39;t played out &quot;normally&quot; the way many quantitative analysis folks claim it has. Sure on paper the bankruptcy element has gone &quot;how they all do&quot; type of thing. But it&#39;s the stuff behind the scenes I&#39;m aware about that hasn&#39;t. It&#39;s what led up to and the cause of bankruptcy that wasn&#39;t normal. And for that reason, I still hold on to the risk under my own will. It will be terrible if this truly goes to 0 and I lose out but it&#39;s not the end of the world for me. I also truly believe the intent is for this to go hero, based on what I know. I just know it&#39;s not in the full control of the people trying to make that happen.   </p>\n\n<p>I have less than 20% of my annual take home income (before tax) invested in this play. That&#39;s substantial, but not detriment and certainly not my life savings. I&#39;ve had to pull out money throughout the year from other means of saving and investments to cover unexpected things this year - the economy is rough. But I&#39;ve spent the time to learn more about fiances and be better at it, even as I&#39;m learning about complex elements of the market. Not everyone is going to do that, no matter how much you try to advise of that being the prudent thing to do.   </p>\n\n<p>From my view:    </p>\n\n<p>1) I&#39;ve been invested in this company longer than most, longer than RC even. There was a time that it was supposed to be turning around. Admitely, I was naive to the intentional self-sabotage tactics of the previous management that they were selling as the turn around. The books looked okay at the time, not great but okay, and it was plausible to see the turn around happen. It&#39;s when it became clear this was a stock being manipulated by the basket and specific parties, connections to GME and bad actors, that it now became a bad idea to get into (at least for your money and emotions - high potential for reward, but a very big risk in the process).    </p>\n\n<p>Yes that&#39;s when RC joined the party and things came to light of what&#39;s really going on. No I would never fault him or call him the cause of the problem. He&#39;s trying to induce change in this system and that&#39;s more than any other elite is trying to do. If you want to hold RC to the stakes, you should also be going after Tritton, Jake Freeman, the board, etc.; there&#39;s plenty of fault to go around on this play if that&#39;s how you truly feel. By being selective just means you represent a side: the people or the corrupt system. And if you&#39;re against RC then you&#39;re either for the other side (the corrupt system) or you&#39;re missing the importance of challenging the system (see point 3 below). You don&#39;t have to like or follow RC to understand what he&#39;s trying to do is important.    </p>\n\n<p>2) I have inside contacts and information. I know people don&#39;t believe me but I work in the financial industry. Whether anyone believes me or not doesn&#39;t change that I am connected with people. I know for a fact that RC has put in multiple efforts to make an offer for the company; they have been rejected (not by BBBY but by connected parties). He was trying to give everyone what they wanted but that&#39;s not possible when a particular party wants the company to die. It has led this stock to do some of the most crazy things in the past year. You can&#39;t quantitative analyze that. And having a &quot;read on it&quot; qualitatively is just a gamble as well. I think the bankruptcy process has removed the bad actors from the equation, and the greedy ones (banks, MMs, etc.) but now the question is can a deal be made that addresses the opposition parties (there&#39;s multiple groups competiting for what&#39;s left of BBBY).    </p>\n\n<p>3) I know who some of the players are. I believe the bad parties have been removed from blocking the process here. But it is the opposition parties who still make it difficult to pull the trigger. That doesn&#39;t mean the deal won&#39;t get done, it just might not be exactly what everyone wants or comes later than expected. Remember the system wants people to conform, they don&#39;t want us to be holding out and pushing for this change or this win - squeeze or not. Throwing a wrench in the gear in order to stall it, force the &quot;tinfoil&quot; crowd to have to claim &quot;wait it&#39;s coming&quot; again, well that&#39;s the aim to discredit their theories - it&#39;s a war of attrition. It&#39;s exactly what the opposing parties want, for RC to lose his following, lose his power.    </p>\n\n<p>And there in lies the importance of the PPShow and what Pulte is trying to support and build here. People are only strong when they gather for the common cause. The system is not equal, just or fair to every day people. It&#39;s our money, whether knowingly (active investing) or unknowingly (pensions, mutual funds, etc.), that is getting used to make other, select few people extremely rich. I don&#39;t know about you, but I have a problem with that. I&#39;m tired of busting my ass for someone on top to live off a private yacht and island. I&#39;m tired of being sold the false claims of &quot;the dream&quot; when it&#39;s getting harder and harder for the people after to get something. You know what that sounds like? A ponzi scheme. And that&#39;s exactly what every asset class of investment has been under the rule of those in charge the last 50-60 years.    </p>\n\n<p>Times and systems need to change. This is about a revolution. </p>\n</blockquote>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->", "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]