[{"username": "Wise-Rate-6608", "url": "https://i.redd.it/80m0105hjmsb1.jpg", "time": 1696616348.0, "subreddit": "r/ThePPShow", "title": "Me asking Houston Wade why he lied about the board being BCG plants after August 2022", "text": "<!-- SC_OFF --><div class=\"md\"><p>Wade has been a polarizing person in this community, and for good reason.</p>\n\n<p>I have watching hom since 2021 and have followed him semi-closely. He was one of the few content creators that remained pro-GME after most left or started shilling other shit like AMC.</p>\n\n<p>Before the events in August 2022, he made sound arguments and had good reasoning about what was happening around BBBY. He was well informed.</p>\n\n<p>After the dump, he began spreading lies and FUD to his viewers that the board was BCG plants and that BBBY was dead and going to be cellar boxed.</p>\n\n<p>He ducked my question and answered it as if I was asking about Tritton and his cronies. It is clear that I was not.</p>\n\n<p>This isn&#39;t about him &quot;changing his opinion,&quot; this is about him spreading lies and propaganda that is verifiably false. Shills are not people who are bearish. They are people that spread lies and FUD.</p>\n\n<p>I will be tuning in tonight because honestly, I like Wade&#39;s content aside from his political ramblings and shilling. He is very intelligent guy, and that makes him dangerous because people follow what he says.</p>\n\n<p>Always do your DD. Be careful who you follow. That is all.</p>\n\n<p>I will not be wasting time responding to Houston Wade shills in the comments. Sit back and watch the shill brigade attack this post.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/80m0105hjmsb1.jpg\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://i.redd.it/rxg5tqz2emsb1.jpg", "time": 1696614534.0, "subreddit": "r/ThePPShow", "title": "Me asking Houston Wade why he lied about the board being BCG plants after August 2022", "text": "<!-- SC_OFF --><div class=\"md\"><p>Wade has been a polarizing person in this community, and for good reason.</p>\n\n<p>I have watched him since 2021 and have followed him semi-closely, he was one of the few content creators that stayed pro-GME after most other creators left or started shilling other shit like AMC.</p>\n\n<p>Before the events of August, he made sound arguments and had good reasoning about what was happening around BBBY.</p>\n\n<p>After the dump, he began spreading lies to his viewers and went against the DD he previously stated.</p>\n\n<p>He ducked my question and answered it as if I was asking about Tritton and his cronies. I was clear that I was not.</p>\n\n<p>This is not about him &quot;changing his opinion.&quot; It is about him spreading FUD and propaganda that was verifiably false. Shills are not people who are bearish. They are people who spread lies and FUD.</p>\n\n<p>I will be tuning in tonight because honestly, I like Wade&#39;s content aside from his political ramblings and shilling. He is a super intelligent guy, and that makes him dangerous because people follow what he says.</p>\n\n<p>Always do your DD. Be careful who you follow. That is all.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/rxg5tqz2emsb1.jpg\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/16zxkbh/people_holding_options_is_exercise_an_option/", "time": 1696450993.0, "subreddit": "r/ThePPShow", "title": "People holding options: is exercise an option since we can't buy on the open market?", "text": "<!-- SC_OFF --><div class=\"md\"><p>I dont own options, but am curious if you can still exercise and force share delivery. I haven&#39;t seen any posts about this.</p>\n\n<p>I remember people did this in 2021 to bypass restrictions. Different situation I know, but would be interesting if this is allowed.</p>\n\n<p>If I owned options and exercise was an option, I&#39;d exercise those boys immediately 👀</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://i.redd.it/4rja44syv4qb1.jpg", "time": 1695530941.0, "subreddit": "r/ThePPShow", "title": "Gotta let the boys know they're about to go through something historic 🚀 🚀 🚀", "text": null, "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/4rja44syv4qb1.jpg\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/16olarp/can_we_not_buy_through_ast/", "time": 1695316196.0, "subreddit": "r/ThePPShow", "title": "Can we not buy through AST?", "text": "<!-- SC_OFF --><div class=\"md\"><p>All the moomoo talk, is direct purchase plan not an option for AST? Haven&#39;t seen any discussion on this</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://i.redd.it/05iref28kgpb1.jpg", "time": 1695236414.0, "subreddit": "r/ThePPShow", "title": "Insights Into the \"Meme Basket\"", "text": "<!-- SC_OFF --><div class=\"md\"><p>I wrote a script that measured every stock in the market to see what moved with the sneeze of 2021. I took the close of the 26th and compared it to the high on the 27th to get the results.</p>\n\n<p>I also ranked each stocks rise on particular dates with itself, and captured it if it was in the top 20 highest rising days. </p>\n\n<p>When this blows, it&#39;s gonna be financial armageddon. The basket is bigger than we all know</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/05iref28kgpb1.jpg\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/165ss4o/some_tinfoil_just_hit_me_about_the_rc_burner/", "time": 1693434356.0, "subreddit": "r/ThePPShow", "title": "Some tinfoil just hit me about the RC burner account", "text": "<!-- SC_OFF --><div class=\"md\"><p>His tag is @<em>CO_RY</em></p>\n\n<p>COhen RYan</p>\n\n<p>I&#39;m probably late to the party here but my brain is smooth and my tinfoil is strapped a little too tight sometime</p>\n\n<p>DUDES NAME ISNT CORY ITS THE FIRST TWO LETTERS OF HIS FIRST AND LAST NAME</p>\n\n<p>Comment if you&#39;re regarded like me and didn&#39;t realize this until now</p>\n</div><!-- SC_ON -->", "flair": {"text": "BLACK TAR TINFOIL", "text_color": "dark", "back_color": "#ff66ac"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/1647lvb/argue_with_a_shill_on_remastered_and_they_blow/", "time": 1693280924.0, "subreddit": "r/ThePPShow", "title": "Argue with a shill on Remastered and they blow your shit up for days", "text": "<!-- SC_OFF --><div class=\"md\"><p>Anyone else have this experience?</p>\n</div><!-- SC_ON -->", "flair": {"text": "Memes :d", "text_color": "dark", "back_color": "#7193ff"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/162c4bw/what_was_up_with_travis_on_last_nights_show/", "time": 1693097529.0, "subreddit": "r/ThePPShow", "title": "What was up with Travis on last night's show?", "text": "<!-- SC_OFF --><div class=\"md\"><p>First off, as someone who has attempted and had family members complete I am sensitive to the topic of mental illness. Travis, I hope you make it through whatever it is you&#39;re going through and I mean that sincerely. I also don&#39;t medicate and push through it. I find that vitamin D and fasting helps tremendously and stopping alcohol also helps, but that&#39;s just my experience. Fasting when I feel it coming has worked 100% of the time, actually. It&#39;s been a miracle.</p>\n\n<p>That said, last night&#39;s show sucked. Allowing Travis to take up what seemed like an hour of time rambling about his mental illness sucked the mood out of the air. It&#39;s not the time or place for it and brings down the show to any outsiders who might be curious about BBBY.</p>\n\n<p>I understand my views will be be unpopular because people are sensitive to the topic of mental illness, as they should be and i am as well. However, that does not mean we should allow it to derail the show. A show like this is for friendly banter and to talk shit and talk about the stonk. Giving someone the floor to take over the show to talk about his depression and let him keep it going for over an hour honestly isn&#39;t the best thing for him either. JMO but I believe that giving people special treatment just because they say they&#39;re depressed isn&#39;t the best thing <em>for that person</em> let alone the show.</p>\n\n<p>At the end of the day though it isn&#39;t my show and PP is the one that decides what content is allowed on his show. I just wanted to give some feedback and bring up a hard topic that others might be hesitant to.</p>\n\n<p>Go ahead and let me have it in the comments</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/15yhopp/the_case_for_drs_a_risk_assessment/", "time": 1692736379, "subreddit": "r/ThePPShow", "title": "The Case For DRS: A Risk Assessment", "text": "PREFACE:\n\nI have seen a lot of confusion about DRS, and also get the feeling that people aren't conducting good risk assessments and/or don't understand how the markets work in regards to naked short selling (NSS). I want to bring up some key topics, go through the prod and cons, and explain my thought process behind my own decisions. You can choose whether or not to take my opinion into account when making your own investment decisions.\n\nGoing to try and make this short and sweet for the smooth among us.\n\nCOUNTERPARTY RISK:\n\nMany people are blissfully unaware of the inherent risk of keeping your shares with a brokerage. Brokerage shares introduce \"counterparty risk\" into your position that doesn't exist with DRS. With your brokerage shares, those shares are \"owed\" to you, and your broker can default on that contract. Ideally, your broker will buy those shares and hold them for you- but as we know in the world of NSS this isn't always the case. In a MOASS scenario, any broker with significant short exposure will likely get liquidated, which means YOU get liquidated. This can be mitigated by choosing a broker with a strong balance sheet, but that only reduces the risk, ir does not eliminate it especially considering we cant see their balance sheets.\n\nFurthermore, in the event of a share distribution, there is no guarantee you will receive your owed shares. DRS mitigates this.\n\nWHY KEEP IN A BROKERAGE THEN?:\n\nThere are legitimate reasons to keep your shares in a brokerage. Brokers offer you a lot of convenience and investment tools. In terms of BBBYQ, we are allowed to sell when we want and set a limit order and this functionality is not afforded to those who DRS with AST.\n\nWHAT I AM DOING:\n\nMy risk tolerance is not your risk tolerance. Despite how much money I have invested in this play, I am generally risk averse. I believe this is an asymmetric bet where the potential reward can be 100x or more what I put into it.\n\nThere are two things I want to accomplish with this play: get in at the ground level of whatever RC and co is cooking, and make some $$$ in the process.\n\nI have 2/3 of my shares DRS'd, with plans that these will be my long-term retirement. The other 1/3 of my shares I have with a reputable brokerage that I plan on selling at a moment of my choice.\n\nI want my TEDDY shares and the only way I can ensure I get them is to have shares DRS'd.\n\nDo whatever you want, but understand the inherent counterparty risk and make choices that align with your goals as an individual investor.", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/gallery/15v7c41", "time": 1692423117.0, "subreddit": "r/ThePPShow", "title": "M2 Money Supply, The Great Depreasion, and why Markets Are Fucked", "text": "<!-- SC_OFF --><div class=\"md\"><p>We are repeating history. Without another liquidity injection, our markets are fucked. Liquidity injection via the CARES act saved the markets in 2020 and created an environment where debt was cheap, as a result M2 spiked. M2 is dropping. Snowball has been pushed over the hill</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/E30adfC9AYmGnVjBUP4Nb7qStO54nV-7STdPIxCsuxE.jpg\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/15fv8mi/state_of_the_shills_and_game_theory/", "time": 1690940286.0, "subreddit": "r/ThePPShow", "title": "State Of The Shills and Game Theory", "text": "<!-- SC_OFF --><div class=\"md\"><p>FUD has leveled up! I&#39;m here to help expose it, or at least bring to light some observations- decide for yourself if I&#39;m on to something here.</p>\n\n<p>The new FUD is to downplay anything that comes from BBBY/OSTK social media. And I&#39;ve noticed some interesting patterns when looking at some of the accounts spreading the FUD. Most of the accounts are old accounts, not what we are used to seeing from the shills. I&#39;m going to walk you through my method of vetting these old accounts.</p>\n\n<p>Method: what I look for is evidence that an account has changed ownership. This isn&#39;t always easy, but so far the majority of accounts I&#39;ve looked through trigger one of the following red flags:</p>\n\n<p>1) A gap between posting on meme subs and earlier activity.</p>\n\n<p>2) User stops posting on whatever subs were frequented before.</p>\n\n<p>3) During the meme-posting window, user has a lot of activity on popular reddit subs that wasn&#39;t there before. Read: karma farming and establishing trust/plausible deniability.</p>\n\n<p>4) Activity before the meme-posting is erased completely.</p>\n\n<p>A high percentage of people pushing the &quot;this isn&#39;t BBBY anymore&quot; angle trigger one or more of these red flags.</p>\n\n<p>Decide for yourself whether this has any value to you. For me, seeing so many accounts spread the same message have these similarities is striking. Most normal people don&#39;t buy accounts to use Reddit.</p>\n\n<p>This leads onto the Game Theory portion of this post. Going to break this up using a Q/A format. </p>\n\n<p>Q) &quot;Why would accounts need to be bought when they can be created for free?&quot;</p>\n\n<ul>\n<li>Account age is an important indicator in identifying shills. Buying old accounts establishes trust, as most people likely only look at account age when trying to identify shills.</li>\n</ul>\n\n<p>Q) &quot;Why don&#39;t these accounts spread FUD all the time on the meme subs?&quot;</p>\n\n<ul>\n<li>That would be obvious. The most successful shill campaigns are ones where the people shilling seem like normal investors. Shilling is not successful if you lose credibility.</li>\n</ul>\n\n<p>Q) &quot;Have you seen these similarities at any other time?&quot;</p>\n\n<ul>\n<li>Yes. The most notable time was the DRS debate on Stonk before it grew legs.</li>\n</ul>\n\n<p>Q) &quot;Isn&#39;t it possible that these accounts are legit people?&quot;</p>\n\n<ul>\n<li>Of course. I wouldnt go around calling people shills just because their accounts share some of these qualities. The important part is to recognize the pattern and think critically about why the pattern exists. Most importantly, think of the content and opinions being shared by the user.</li>\n</ul>\n\n<p>Conclusion:</p>\n\n<p>It is important to think critically about the narratives being spread, and idnetify the shift in narrative. Ask important questions. Does it make sense for people to try and push OSTK/BBBY content out of this sub? Why are we being flooded with this narrative all of the sudden? Is this organic behavior, or does it seem orchestrated or forced?</p>\n\n<p>By now, most of us are used to shills being among us, using reverse psychology and other tactics to spread confusion. Ask yourself: why? Why is controlling the narrative on a small sub so important? </p>\n\n<p>TL;DR: The accounts being used to spread the &quot;get OSTK/BBBY content out of this sub&quot; have huge red flags that the account may have been bought. The high percentage of these &quot;bought&quot; accounts that are being used to spread this narrative is alarming. These accounts are also using reverse psychology to flip the script and paint the people on the other side of the narrative as shills. Don&#39;t fall for it.</p>\n</div><!-- SC_ON -->", "flair": {"text": "BIG PP DD", "text_color": "dark", "back_color": "#0dd3bb"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/15fju0b/nfa_disclaimers_are_dumb/", "time": 1690912760.0, "subreddit": "r/ThePPShow", "title": "\"NFA\" disclaimers are dumb", "text": "<!-- SC_OFF --><div class=\"md\"><p>Unless you are licensed, there are no legal requirements to say &quot;NFA&quot; when sharing facts or opinion of an investment.</p>\n\n<p>I&#39;m not saying this to request we stop using this disclaimer, but rather so we understand some of the legal stuff happening around using emojis. RC isn&#39;t getting sued for posting a moon emoji because he &quot;offered finial advice,&quot; it&#39;s because he is an insider.</p>\n\n<p>The suit is frivolous but that&#39;s besides the point.</p>\n\n<p>The MSM has succeeded in creating a culture where people are afraid of being liable for &quot;offering financial advice.&quot; This is only the case if someone is paying you to give it. If you are a fiduciary, there are laws and regulations around how you handle your clients money and inform them.</p>\n\n<p>For most, saying &quot;NFA&quot; is merely a courtesy. It offers you no legal protection because you aren&#39;t breaking any laws.</p>\n\n<p>Don&#39;t believe the misdirection coming from the MSM. They want to silence us with these silly &quot;emoji&quot; rulings. But unless you&#39;re an insider or a licensed financial professional, it means fuck all.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://i.redd.it/tgr5s3wi7ndb1.jpg", "time": 1690086715.0, "subreddit": "r/ThePPShow", "title": "NOL's are the key 🔑", "text": null, "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://i.redd.it/tgr5s3wi7ndb1.jpg\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/153vh8p/be_careful_with_houston_wade/", "time": 1689774285.0, "subreddit": "r/ThePPShow", "title": "Be careful with Houston Wade", "text": "<!-- SC_OFF --><div class=\"md\"><p>[removed]</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"default\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/153vh8p/be_careful_with_houston_wade/", "time": 1689774285, "subreddit": "r/ThePPShow", "title": "Be careful with Houston Wade", "text": "Ive watched Wade since the early GME days. Wade, or as i like to call him \"the metrosexual Marxist,\" has been telling his viewers that BBBY is worthless ever since the August run. It wasn't until very recently that he started speaking positively about it.\n\nThe most striking thing about his \"change of heart\" after the August run is he went against all the DD he talked about previously without providing a reason for it or addressing any reason why he \"changed his mind.\" You don't go from talking about naked shorts and meme stock run cycles to abandoning all that just because the price drops. Dude is bought and paid for.\n\nShills need community engagement in order to spread their propaganda. Be very careful with this guy.", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.reddit.com/r/ThePPShow/comments/14xv09q/we_need_to_understandexpose_naked_short_selling/", "time": 1689182952.0, "subreddit": "r/ThePPShow", "title": "We need to understand/expose naked short selling better, gonna write an in-depth DD later on this. Help me make this a good one by asking me any questions you may have", "text": "<!-- SC_OFF --><div class=\"md\"><p>Im tired of these fuckin shills, so I want to help expose the shills by sharing my wrinkles to the public. You can help me out by asking any questions you have about NSS. I will answer questions in the comments but it will also help me gauge what i need to focus on when I write my DD later.</p>\n\n<p>Having knowledge of what NSS is and it&#39;s ramifications is a very important piece of educational material in this play. The recent shill campaign against Patrick Byrne is motivating me to do this, since Byrne exposed NSS in a 2006 documentary titled &quot;Dark Side of the Looking Glass.&quot; You can find that here: <a href=\"https://youtu.be/gpWzOjB8qtU\">https://youtu.be/gpWzOjB8qtU</a></p>\n\n<p>This isn&#39;t about Byrne however, purely about NSS and its ramifications.</p>\n\n<p>Sunlight is the best disinfectant. Help me expose the truth.</p>\n</div><!-- SC_ON -->", "flair": {"text": "IM IN A GLASS CASE OF EMOTION", "text_color": "dark", "back_color": "#ff4500"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wise-Rate-6608", "url": "https://www.youtube.com/live/9D3HqRz3Cys?feature=share&amp;t=2h15m30s", "time": 1683587152.0, "subreddit": "r/ThePPShow", "title": "love PP after dark! STONKY KONG spitting fire 🔥🔥🔥", "text": "<!-- SC_OFF --><div class=\"md\"><p>Love hearing from the OG&#39;s 🏴‍☠️</p>\n</div><!-- SC_ON -->", "flair": {"text": "Stream Live Chat ", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"//www.gstatic.com/images/icons/material/system/1x/keyboard_arrow_down_gm_grey_18dp.png\"/></div>"}]