[{"username": "Wraith_lurker", "url": "https://www.reddit.com/r/ThePPShow/comments/17u8jaa/question_regarding_jakes_fee_for_the_corporate/", "time": 1699874483.0, "subreddit": "r/ThePPShow", "title": "Question regarding Jakes fee for the corporate action.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello PPs.\nI was wondering about the fee Jake was charged by his bank for the account that was ineligible for what ever they charged him.\nDoes anyone know if that fee was basically a tax deduction from lets say the cash distribution per share? Cause that is a big fee to pay.\nIf so then can one try to count the amount if the % of tax from these type of transactions are known? ( I assume Canada has specific tax brackets for stock related things)</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wraith_lurker", "url": "https://www.reddit.com/r/ThePPShow/comments/17s3ncs/a_questionsubject_for_the_next_pp_show/", "time": 1699621683.0, "subreddit": "r/ThePPShow", "title": "A question/subject for the next PP show", "text": "<!-- SC_OFF --><div class=\"md\"><p>Good day PPs.\nAfter yesterdays POshow with OkBets I would like to pose a question for the greats minds of the show that was somewhat touched on by OKBets.</p>\n\n<p>Namely - if bbby investors get cash + equity (in OkBets opinion of Teddy, gme and other company shares in a bundle - atleast thats what I understood ) then how would a squeeze/ MOASS proceed?\nOkbets mentioned that the cash would be so shares of Teddy were not sold off by retail investors so they could hold on to them. \nBut then what would be sold for the squeeze? What would shorts buy?\n(Yes I get the “sell 1 share for gazillion” argument but lets be real).</p>\n\n<p>Could PP take up this subject during the show and hypothetically explain how this would play out?</p>\n\n<p>Thanks guys.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wraith_lurker", "url": "https://www.reddit.com/r/ThePPShow/comments/17qjvoh/an_activist_investors_dream/", "time": 1699443988.0, "subreddit": "r/ThePPShow", "title": "An activist investors dream", "text": "<!-- SC_OFF --><div class=\"md\"><p>Good morning fellow pps.\nI wanted to point to something I have been thinking about for some time now. </p>\n\n<p>You see, there is all this talk about a valuable asset in having an army of loyal customers post moass or what have you.\nBut is that really the big picture here for an activist investor?</p>\n\n<p>There is a much bigger prize here to be gained (with the condition that investors get handsomely rewarder this time around)\nWhat is that? You might ask.\nWell its a loyal army of rather wealthy investors who trust their activist investor.</p>\n\n<p>Think of it as a school of fish (the retail investor) following one big fish. What it does, the school does after it.</p>\n\n<p>You want to take over a company but the board will take steps from stopping you from owning the majority of voting power? Well now you an army of individual investors who can buy up shares and together have a majority in voting power and will follow what the Leader says.\nAn example - lets say you have 10 000 investors who have 500 k each (post moass) to spare. Thats 5 billion. Not bad right?</p>\n\n<p>I think that is a goal for an activist investor worth fighting for. Especially if that army has also gained a few years worth of experience in the stock market.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "Wraith_lurker", "url": "https://www.reddit.com/r/ThePPShow/comments/17fhl8y/shares_finally_gone_from_polish_broker/", "time": 1698166854.0, "subreddit": "r/ThePPShow", "title": "Shares finally gone from Polish broker.", "text": "<!-- SC_OFF --><div class=\"md\"><p>As the title states. My share which were lingering in my Polish banks broker account have vanished a few hours ago without a trace.\nTbh I was becoming uneasy with them being there still. \nOfc on my brokers app there is no info on why they vanished so tomorrow I will call my broker and see if I can get more info.\nJust thought people might want to know as this would indicate the process is moving along.</p>\n</div><!-- SC_ON -->", "flair": {"text": "TRUST ME BRO", "text_color": "dark", "back_color": "#ea0027"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]