[{"username": "XXXXXhodler", "url": "https://www.reddit.com/r/ThePPShow/comments/156rw6o/if_everything_is_in_the_bag_and_our_hypotheses/", "time": 1690051552.0, "subreddit": "r/ThePPShow", "title": "If everything is in the bag and our hypotheses are correct…", "text": "<!-- SC_OFF --><div class=\"md\"><p>Shouldn’t all the shills be posting takes on how the legal verbiage in all the recent sockets supports class 9 shareholders being made whole by reverse-triangular merger, carve-out, etc.?  Isn’t the purpose of shills to maximize the wealth of the SHF? </p>\n\n<p>If so, then wouldn’t they be pumping buying pressure to short more shares for free money?  </p>\n\n<p>The truth is, nothing has leaked, or else they would most certainly be putting more chips on the table.  So, if nothing else, I’m at least satisfied knowing that SHF view this as a coin flip and probably have a lot of heart burn this weekend knowing they can’t cheat their way to a desired outcome.</p>\n\n<p>Some piece of mind for all of us APEs that are in this play as much for David/Goliath - good/evil - as we are for the tendies.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "XXXXXhodler", "url": "https://www.globenewswire.com/news-release/2023/05/22/2673848/0/en/Gainey-McKenna-Egleston-Announces-A-Class-Action-Lawsuit-Has-Been-Filed-Against-Virtu-Financial-Inc-VIRT.html", "time": 1684856545.0, "subreddit": "r/ThePPShow", "title": "Class Action Lawsuit Against Virtu… Connect the Dots!", "text": "<!-- SC_OFF --><div class=\"md\"><p>Connect the dots, tinfoil edition.</p>\n\n<p>Virtu hires Hindenburg to go after Icahn’s IEP when it’s clear he set the biggest bear trap in history that will blow up Virtu and many others - I see you Mayo boy.</p>\n\n<p>Pulse tweets about the exciting week ahead.</p>\n\n<p>Less than 24 hours a class action suit is filed against Virtu.</p>\n\n<p>RC starts tweeting about hockey teams, one of which just so happens to be owned by Vincent Viola, Founder and Chairman of Virtu.</p>\n\n<p>Guess who is fighting fire with fire?</p>\n\n<p>They go low and I typically like to avoid going lower.  But all is fair in a financial revolutionary war.  I am j to the t to the max.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://ml.globenewswire.com/media/YWZkNmQ3M2EtYTk1MC00OTkyLThiMTAtMzVkY2EyOWIyZjA4LTEwMjkyNzQ=/tiny/Gainey-McKenna-Egleston.png\"/></div>"}]