[{"username": "yallrthick", "url": "https://www.reddit.com/gallery/12mthro", "time": 1681542306.0, "subreddit": "r/ThePPShow", "title": "I’ve brought this up twice on the show, need wrinkles", "text": "<!-- SC_OFF --><div class=\"md\"><p>let me remind you we ARE DOWN 99%. We can’t really go any lower without whoever is burying this company opening such an over exposed position that it would be bankruptcy for anyone involved in shorting this thing. </p>\n\n<p>Cough HBC cough </p>\n\n<p>I know this is a ChatGPT lead inquiry and the info I am presenting here is based on a general idea of our TA, but I would like it to be dissected as if I’m a regarded golden retriever who’s only job is to shit and sleep. That’s me. </p>\n\n<p>Anyways </p>\n\n<p>Let’s us start with the assumption of two things happening here: board good or board bad. </p>\n\n<p>I vote board good but hear me out </p>\n\n<p>What if the board is pretending to be dumb in order to lure in expensive consultants and financiers to hold a bag?</p>\n\n<p>If board bad, then clearly we can see at .20c we are being diluted by nefarious people and we’re shit out of luck </p>\n\n<p>But if board good, I think they just trapped HBC to be the trigger of this whole thing, let me explain. </p>\n\n<p>HBC has been known to death spiral companies (BBIG), so why would the board take this deal if they’re trying to help retail? </p>\n\n<p>*A death spiral is: A warrant death spiral is a type of market manipulation strategy that involves using the exercise of warrants to drive down the stock price of a company. The strategy typically involves a hedge fund or other institutional investor lending money to a company in exchange for warrants, which give them the right to purchase the company&#39;s stock at a certain price.</p>\n\n<p>The investor then shorts the stock, betting\nthat the stock price will fall. When the\nwarrants expire, the investor exercises them,\nforcing the company to issue new shares at\nthe exercise price. This dilutes the value of\nexisting shares and puts downward pressure*</p>\n\n<p>If board = bad they take this deal to kill us to 0 via warrant spiralling. </p>\n\n<p>If board good, they take this deal to trap the financiers to allow them to open a huge position of both shares and shorts (warrant exercise, sell said share, open short. hedging)</p>\n\n<p>Well I was very curious since the board removed the deal from HBC. So I asked AI… I know cringe but I figured if it has happened before maybe it could explain the logistics. I wasn’t asking it to predict anything, just market regulatory expectations. You let me know if this is bs but from what I’ve read it makes sense. </p>\n\n<p>I think HBC thought no way would the board remove the deal from under them, and they’d be allowed to spiral us via hedging to 0, but suddenly their ability to create longs was removed, locking them into whatever they had opened on their books. </p>\n\n<p>Now they need to hit it as low as possible before a proof of borrow, CUSIP change (may 9) so that when they do cover, they survive and pass the buck to the SHFs.</p>\n</div><!-- SC_ON -->", "flair": {"text": "", "text_color": "", "back_color": ""}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"https://b.thumbs.redditmedia.com/B7azC1nyWeFOTnsdDDTgDVUqdNx4K5T3jp6DLBpS7ik.jpg\"/></div>"}]