[{"username": "yeptato", "url": "https://www.reddit.com/r/ThePPShow/comments/160o9d6/why_jake2bs_retraction_post_is_still_wrong/", "time": 1692935919.0, "subreddit": "r/ThePPShow", "title": "Why jake2b's retraction post is still wrong", "text": "<!-- SC_OFF --><div class=\"md\"><p>Recently <a href=\"/u/jake2b\">/u/jake2b</a> conceded that shareholders need not be preserved in order to carry over NOLs and has retracted his &quot;DD&quot; on NOLs in the post below:</p>\n\n<blockquote>\n<p><a href=\"https://www.reddit.com/r/ThePPShow/comments/15zdtlc/retraction_nol_section_382l5_corrections/\">RETRACTION: NOL Section 382(l)(5) corrections, references, clarifications and my thoughts:</a>by      <a href=\"https://www.reddit.com/user/jake2b\">u/jake2b</a> in      <a href=\"https://www.reddit.com/r/ThePPShow/\">ThePPShow</a></p>\n</blockquote>\n\n<p>In this post, I will tell you why his new post is <strong>still</strong> wrong.</p>\n\n<h1>Jake&#39;s take:</h1>\n\n<p>In his new post, he admits that BBBY has removed their entire legacy brick and mortar footprint (which would be BBBY&#39;s historic business):</p>\n\n<blockquote>\n<p><strong>Since that post,</strong> the company has pivoted from keeping some stores — their highest-profit ones — open, <strong>to removing their entire legacy brick-and-mortar footprint.</strong></p>\n</blockquote>\n\n<p>He continues to assert that if the historic business is discontinued, then the only other way to satisfy the continuity test is to maintain a significant portion of the old asset structure.</p>\n\n<blockquote>\n<p><strong>in order to satisfy the requirements for Section 382(l)(5),</strong> if you do not preserve the legacy business (ie. stores, brick-and-mortar presence), <strong>the only other way</strong> to satisfy the continuity test is through <strong>maintaining a significant portion</strong> of the old asset structure of the old business.</p>\n</blockquote>\n\n<p>From these two facts, he posits that if a buyer wanted to guarantee the carryover of the NOLs, then they would ensure shareholders remained intact to retain the old asset structure.</p>\n\n<blockquote>\n<p><strong>Ask yourself,</strong> if you were a buyer and wanted the <strong>entire</strong> <strong>NOL</strong> (1.6B historical, <em>plus</em> any losses after February 26, 2023, <em>plus</em> any losses documented in dockets from the Harmon business, <em>plus</em> anything else) would you take the chance by only offering new equity to creditors, hoping this would satisfy the court for <em>retaining a</em> <strong><em>significant</em></strong> <em>portion</em> of the asset structure, and similarly satisfy the IRS, who can reverse the court decision after the fact, if they disagreed with it?  </p>\n\n<p>..or would you include shareholders to receive a distribution as well, and <strong><em>guarantee</em></strong> <strong>that you fulfilled</strong> the requirements of the continuity test?  </p>\n\n<p>Personally, I do not consider 739M shares of common stock a <strong><em>minor portion of the historic business.</em></strong>  </p>\n\n<p><strong>In an incredible plot twist,</strong> I believe the company pivoting from keeping some locations to rejecting all of them could be what saves shareholders if a Section 382(l)(5) was desired by the buyer.</p>\n</blockquote>\n\n<p>His source for claiming shareholders can be used to satisfy this requirement is on pg 87 of his source <a href=\"https://www.alvarezandmarsal.com/sites/default/files/90507_tax_pli_section_382_white_paper_03.pdf\">here</a>:</p>\n\n<blockquote>\n<p>The asset continuity test is satisfied if the new loss corporation uses a significant portion of the old loss corporation’s historic assets in a business. See Treas. Reg. § 1.368- 1(d)(3)(i). The old loss corporation’s historic business assets are the assets used in its historic business. These assets can include stock and securities and intangible operating assets</p>\n</blockquote>\n\n<p>TLDR: <a href=\"/u/jake2b\">/u/jake2b</a> contends that since BBBY has sold off basically all their assets, any buyer wanting the NOLs would want to ensure shareholders remained intact to satisfy the continuing assets requirement.</p>\n\n<h1>The Problem</h1>\n\n<p><strong>Shareholders are not assets</strong>.</p>\n\n<p>IFRS has a very clear definition of what assets and equity are (see <a href=\"https://www.iasplus.com/en/standards/other/framework\">here</a>)</p>\n\n<blockquote>\n<p>An asset is a resource controlled by the entity as a result of past events and from which future economic benefits are expected to flow to the entity.</p>\n</blockquote>\n\n<p>Generally, economic benefits refer to future cash flow. For example, if you own a farm, you can recognize a tractor as an asset because you will use the tractor to harvest crops which you will then sell to generate future cash flow.</p>\n\n<p>Shareholders are not assets because you do gain any future economic benefits from simply having shareholders. They have <strong>claim</strong> to residual assets (because shareholders are owners) after subtracting liabilities, but they are not assets themselves.</p>\n\n<p>You may say &quot;But wait! Shareholders can infuse cash which is an economic benefit expected to flow to the entity! Or the company can issue shares to raise cash!&quot;</p>\n\n<p>Then the cash itself becomes the asset (because you can use cash to operate a business), and shareholders get to increase their claim over residual assets by an equivalent amount (this is a concept called <a href=\"https://www.investopedia.com/terms/d/double-entry.asp\">double-entry bookkeeping</a>).</p>\n\n<p>Again, the shareholders themselves are not assets. You cannot pay employee salaries in shareholders, you cannot sell shareholder BJs behind Wendy&#39;s, you can&#39;t generate future economic benefit from simply having shareholders.</p>\n\n<p>Furthermore, recognition of an asset has specific criteria to meet:</p>\n\n<blockquote>\n<p>An asset is recognised in the balance sheet when it is <strong>probable</strong> that the future economic benefits will flow to the entity and the asset has a cost or value that can be measured reliably.</p>\n</blockquote>\n\n<p>Even if you contend that shareholders can provide future economic benefit (i.e. future cash flows), there is no way to determine if that is probable or not. IFRS defines &quot;probable&quot; as &quot;more likely than not&quot;. Going back to the tractor, if I buy a tractor for my farm, I&#39;m more likely than not to use it for farming. If I&#39;m BBBY and I buy a bunch of towels, more likely than not, I&#39;m going to sell them for money. There is no way to determine the likelihood that an existing shareholder would provide a future economic benefit.</p>\n\n<p>One of the key tenets of accounting is <strong>conservatism</strong>, which means if you are uncertain about the probability of something, you err on the side of conservatism and do not recognize an asset (or income) until it becomes probable.</p>\n\n<p><strong>Now you may ask, &quot;well why the fuck did jake&#39;s source say stock and securities then!?&quot;</strong></p>\n\n<p>Great question. This is referring to the company&#39;s investments in <strong>other</strong> stocks and securities (i.e. not their own stock). Typically this happens when companies hold a lot of cash and instead of watching it disappear to inflation, they will park it in short-term investments or money market securities.</p>\n\n<p>See examples here:</p>\n\n<ul>\n<li>Apple in their latest <a href=\"https://s2.q4cdn.com/470004039/files/doc_earnings/2023/q3/filing/_10-Q-Q3-2023-As-Filed.pdf\">10-Q</a> (pg 6) had $34B of marketable securities under assets. See Note 3 (pg 10) for a breakdown of what&#39;s included in marketable securities (mostly corporate bonds and non-US gov securities)</li>\n<li>Microsoft had $77B in short-term investments (<a href=\"https://www.sec.gov/Archives/edgar/data/789019/000095017023014423/msft-20230331.htm#balance_sheets\">10Q</a>) under assets. See Note 4 (pg 13) for a breakdown of what&#39;s included in the $77B (mostly US gov securities)</li>\n</ul>\n\n<p>You&#39;ll notice that none of these companies (or any other ones) have classified their shareholders as assets. <strong>That&#39;s because they&#39;re not.</strong></p>\n\n<p>I&#39;m not a tax specialist (those that are, please feel free to correct me), but in general, the reason why the tax code calls this out specifically is because without this clarification, one could argue that a company&#39;s holdings in stocks and securities should not contribute towards business continuity if the historic business was not in the business of buying and selling stocks and securities.</p>\n\n<p>For example, imagine BBBY had $500m of short-term investments in other companies. Without this clarification in the tax code, one could argue a buyer who bought those investments does not meet the continuity test because BBBY was in the business of selling towels, not stocks.</p>\n\n<p><strong>Lastly, one may point out &quot;But yeptato, those are accounting definitions, not legal ones! The Court may define assets differently!&quot;</strong></p>\n\n<p>Lawyers, feel free to correct me if I&#39;m wrong, but as far as I&#39;m aware, in the area of tax law, the definitions are the same. In my country (Canada), tax lawyers actually attend the same post-certification courses as tax specialists.</p>\n\n<p>So there you have it, my take on why <a href=\"/u/jake2b\">/u/jake2b</a> is wrong again.</p>\n\n<p><strong>TLDR:</strong> <a href=\"/u/jake2b\">/u/jake2b</a> <strong>is wrong again, shareholders are not assets.</strong></p>\n\n<p>My credentials in case they matter: CPA for 10 years, ex-PwC audit.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "yeptato", "url": "https://www.reddit.com/r/ThePPShow/comments/15z5q5p/can_someone_explain_to_me_why_bonds_are_not_the/", "time": 1692801436.0, "subreddit": "r/ThePPShow", "title": "Can someone explain to me why bonds are not the play here?", "text": "<!-- SC_OFF --><div class=\"md\"><p>Hello, I have a question for apes.</p>\n\n<p>If the bull thesis is that equity shareholders (somehow) survive, then by extension, that must mean that debt holders are made whole.</p>\n\n<p>In this case, isn&#39;t the better play to buy bonds? The 14/24 notes are trading at $5 which would imply a 200x return if they&#39;re made whole, <strong>and</strong> you&#39;re higher in priority to get paid out than equity holders.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]