[{"username": "yoyoyoitsyaboiii", "url": "https://www.reddit.com/r/ThePPShow/comments/17fhhav/schwab_tc_for_worthless_securities_start_the_60/", "time": 1698166555.0, "subreddit": "r/ThePPShow", "title": "Schwab T&amp;C for \"worthless\" securities. Start the 60 day timer.", "text": "<!-- SC_OFF --><div class=\"md\"><p>Worthless and Non-Transferable Securities. \nSchwab reserves the right to remove from your Account any security that is deemed to have been cancelled or otherwise invalidated. In determining that a security has been cancelled or invalidated, you agree that we have derived information on such assets from you or from third parties and we are not responsible for the accuracy or reliability of any information regarding these assets. Cancelled or invalid securities may include, but are not limited to, bankruptcy or charter or registration revocation. Schwab will notify you if it has removed a cancelled or otherwise invalid security from your Account. Unless you provide Schwab with evidence of the validity of the security within sixty (60) days of the notice of removal, you agree to waive any claim to any future distribution from the security and agree to indemnify and hold Schwab harmless from any claims, liability, or damages resulting from the removal of such security. If you provide Schwab with evidence of the validity of the security from an independent third party within 60 days of receiving the notice of removal, Schwab will reinstate your position.</p>\n\n<p>In addition, Schwab reserves the right to charge an additional servicing fee for securities for which Schwab cannot identify a transfer agent (a &quot;Non-Transferable Security&quot;). The existence of a Non-Transferable Security in your Account may be noted with a notation of &quot;N/A&quot; for the value of that position on your account statements.</p>\n</div><!-- SC_ON -->", "flair": {"text": "Speculation/Opinion", "text_color": "dark", "back_color": "#ffd635"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"},
{"username": "yoyoyoitsyaboiii", "url": "https://www.reddit.com/r/ThePPShow/comments/17eok0b/conversation_with_vanguard/", "time": 1698078526.0, "subreddit": "r/ThePPShow", "title": "Conversation with Vanguard", "text": "<!-- SC_OFF --><div class=\"md\"><p>I just had a long call with Vanguard support who was the liason between me and the &quot;Corporate Actions&quot; group at Vanguard. At first the rep would only say it was a &quot;mandatory liquidation.&quot; After some back and forth with the Corp Actions team the rep relayed it was a &quot;share recall&quot; by the company and Vanguard was notified by the DTC. Vanguard explicitly said they are not allowed to share the details of the DTC notice with customers.  Even the rep wasn&#39;t given the letter - only notified about general points when she asked.</p>\n\n<p>She suggested I contact BBBY Investor Relations to get additional information. Has anyone received a response from BBBY Investor Relations?</p>\n</div><!-- SC_ON -->", "flair": {"text": "SO YOU'RE TELLING ME THERE'S A CHANCE", "text_color": "dark", "back_color": "#94e044"}, "preview": "<div class=\"img_container\"><img class=\"card-image\" src=\"self\"/></div>"}]